// Generated by Voidie

class CAI_BaseNPC {
public:
    uint32_t movecollide; // 0x0000
    uint32_t movetype; // 0x0000
    fVector3 m_localOrigin; // 0x0004
    float m_animStartTime; // 0x0008
    float m_animStartCycle; // 0x000C
    float m_animPlaybackRate; // 0x0010
    uint32_t m_animModelIndex; // 0x0014
    uint32_t m_animSequence; // 0x001C
    uint32_t moveparent; // 0x001C
    uint32_t m_animFrozen; // 0x001E
    uint32_t m_bClientSideRagdoll; // 0x001F
    uint32_t m_parentAttachment; // 0x0020
    fVector3 m_vecForce; // 0x0020
    uint32_t m_numRodeoSlots; // 0x0028
    uint32_t [0003]; // 0x0034
    float m_vecViewOffset.x; // 0x0034
    uint32_t [0004]; // 0x0038
    float m_vecViewOffset.y; // 0x0038
    float m_vecViewOffset.z; // 0x003C
    uint32_t m_fEffects; // 0x0040
    uint32_t m_usableType; // 0x0044
    uint32_t m_cellX; // 0x0048
    uint32_t m_cellY; // 0x004C
    uint32_t m_cellZ; // 0x0050
    uint32_t m_nModelIndex; // 0x0060
    uint32_t m_clrRender; // 0x0080
    float [0010]; // 0x0080
    uint32_t m_clIntensity; // 0x0084
    float [0011]; // 0x0084
    float [0012]; // 0x0088
    float m_flEstIkOffset; // 0x008C
    float [0013]; // 0x008C
    float [0014]; // 0x0090
    float [0015]; // 0x0094
    float [0016]; // 0x0098
    float [0017]; // 0x009C
    float [0018]; // 0x00A0
    float [0019]; // 0x00A4
    float [0020]; // 0x00A8
    float [0021]; // 0x00AC
    float [0022]; // 0x00B0
    float [0023]; // 0x00B4
    uint32_t m_bossPlayer; // 0x0154
    uint32_t m_shieldHealth; // 0x01A0
    uint32_t m_shieldHealthMax; // 0x01A4
    float m_cloakEndTime; // 0x01CC
    float m_cloakFadeInEndTime; // 0x01D0
    float m_cloakFadeOutStartTime; // 0x01D4
    float m_cloakFadeInDuration; // 0x01D8
    float m_cloakFlickerAmount; // 0x01DC
    float m_cloakFlickerEndTime; // 0x01E0
    uint32_t m_highlightFocused; // 0x02A1
    uint32_t m_highlightFadeParity; // 0x02AC
    uint32_t m_wantsScopeHighlight; // 0x02D0
    uint32_t m_networkedFlags; // 0x02D4
    uint32_t m_ignoreParentRotation; // 0x02DC
    uint32_t m_hGroundEntity; // 0x0320
    uint32_t m_iHealth; // 0x0324
    uint32_t m_visibilityFlags; // 0x032C
    uint32_t m_iTeamNum; // 0x0334
    uint32_t m_teamMemberIndex; // 0x033C
    uint32_t m_squadID; // 0x0340
    uint32_t m_grade; // 0x0344
    uint32_t m_ignorePredictedTriggerFlags; // 0x0348
    uint32_t m_passThroughFlags; // 0x0350
    uint32_t m_passThroughThickness; // 0x0354
    float m_passThroughDirection; // 0x0358
    fVector3 m_deathVelocity; // 0x035C
    uint32_t m_bIsSoundCodeControllerValueSet; // 0x0370
    float m_flSoundCodeControllerValue; // 0x0374
    fVector3 m_localAngles; // 0x0384
    uint32_t m_hOwnerEntity; // 0x0398
    uint32_t m_bRenderWithViewModels; // 0x039C
    uint32_t m_nRenderFX; // 0x039D
    uint32_t m_nRenderMode; // 0x03A9
    fVector3 m_vecMins; // 0x03C0
    fVector3 m_vecMaxs; // 0x03CC
    uint32_t m_usSolidFlags; // 0x03D8
    uint32_t m_nSolidType; // 0x03DC
    uint32_t m_triggerBloat; // 0x03DD
    uint32_t m_collisionDetailLevel; // 0x03DE
    uint32_t m_nSurroundType; // 0x03EC
    fVector3 m_vecSpecifiedSurroundingMins; // 0x03F8
    fVector3 m_vecSpecifiedSurroundingMaxs; // 0x0404
    uint32_t m_CollisionGroup; // 0x0430
    uint32_t m_contents; // 0x0434
    uint32_t m_collideWithOwner; // 0x0438
    uint32_t m_iMaxHealth; // 0x0468
    const char* m_iSignifierName; // 0x0470
    const char* m_iName; // 0x0479
    uint32_t m_scriptNameIndex; // 0x0580
    uint32_t m_instanceNameIndex; // 0x0584
    const char* m_holdUsePrompt; // 0x0608
    const char* m_pressUsePrompt; // 0x0610
    uint32_t m_exclusiveUseEnt; // 0x0618
    uint32_t m_lifeState; // 0x0690
    uint32_t m_phaseShiftFlags; // 0x06B0
    uint32_t m_baseTakeDamage; // 0x06B4
    uint32_t m_invulnerableToDamageCount; // 0x06B8
    uint32_t m_passDamageToParent; // 0x06BC
    uint32_t m_PredictableID; // 0x06C4
    float m_attachmentLerpStartTime; // 0x072C
    float m_attachmentLerpEndTime; // 0x0730
    fVector3 m_attachmentLerpStartOrigin; // 0x0734
    fVector3 m_attachmentLerpStartAngles; // 0x0740
    uint32_t m_parentAttachmentModel; // 0x0750
    float m_fadeDist; // 0x075C
    uint32_t m_dissolveEffectEntityHandle; // 0x0804
    uint32_t m_usablePriority; // 0x0818
    float m_usableDistanceOverride; // 0x081C
    float m_usableFOV; // 0x0820
    float m_usePromptSize; // 0x0824
    uint32_t flags; // 0x0878
    uint32_t zOrder; // 0x087C
    uint32_t customState; // 0x0880
    float objectScale; // 0x0884
    uint32_t m_nameVisibilityFlags; // 0x0888
    uint32_t m_firstChildEntityLink; // 0x0910
    uint32_t m_firstParentEntityLink; // 0x0914
    uint64_t m_realmsBitMask; // 0x0918
    uint32_t m_animNetworkFlags; // 0x0978
    uint32_t m_animActive; // 0x097C
    uint32_t m_animCollisionEnabled; // 0x097F
    uint32_t m_animRelativeToGroundEnabled; // 0x0980
    uint32_t m_animPlantingEnabled; // 0x0981
    fVector3 m_animInitialPos; // 0x0984
    fVector3 m_animInitialVel; // 0x0990
    fVector4 m_animInitialRot; // 0x099C
    fVector3 m_animInitialCorrectPos; // 0x09AC
    fVector4 m_animInitialCorrectRot; // 0x09B8
    fVector3 m_animEntityToRefOffset; // 0x09C8
    fVector4 m_animEntityToRefRotation; // 0x09D4
    float m_animBlendBeginTime; // 0x09E4
    float m_animBlendEndTime; // 0x09E8
    uint32_t m_animScriptSequence; // 0x09EC
    uint32_t m_animScriptModel; // 0x09F0
    uint32_t m_animIgnoreParentRot; // 0x09F4
    uint32_t m_animMotionMode; // 0x09F8
    uint32_t m_syncingWithEntity; // 0x0A74
    uint32_t m_predictedAnimEventCount; // 0x0AD0
    uint32_t m_predictedAnimEventTarget; // 0x0AD4
    uint32_t m_predictedAnimEventSequence; // 0x0AD8
    uint32_t m_predictedAnimEventModel; // 0x0ADC
    float m_predictedAnimEventsReadyToFireTime; // 0x0AE0
    uint32_t m_nRagdollImpactFXTableId; // 0x0AFC
    float m_flSkyScaleStartValue; // 0x0B00
    float m_flSkyScaleEndValue; // 0x0B04
    float m_flSkyScaleStartTime; // 0x0B08
    float m_flSkyScaleEndTime; // 0x0B0C
    uint32_t m_sequenceTransitionerLayerActive; // 0x0CA8
    float m_sequenceTransitionerLayerStartCycle; // 0x0CAC
    uint32_t m_sequenceTransitionerLayerSequence; // 0x0CB0
    float m_sequenceTransitionerLayerPlaybackRate; // 0x0CB8
    float m_sequenceTransitionerLayerStartTime; // 0x0CBC
    float m_sequenceTransitionerLayerFadeOutDuration; // 0x0CC0
    uint32_t m_sequenceTransitionerLayerCount; // 0x0CC8
    uint32_t m_itemFlavorGUID; // 0x0D4C
    uint32_t m_nSkin; // 0x0D58
    uint32_t m_skinMod; // 0x0D5C
    uint32_t m_nBody; // 0x0D64
    uint32_t m_camoIndex; // 0x0D68
    float m_nResetEventsStartTime; // 0x0D70
    float m_fireDeferredStopsStartTime; // 0x0D78
    uint32_t m_nForceBone; // 0x0DA8
    uint32_t m_bSequenceFinished; // 0x0E0C
    float m_lockedAnimDeltaYaw; // 0x0E10
    float m_flModelScale; // 0x0E18
    uint32_t m_AnimOverlayCount; // 0x16B0
    uint32_t m_bIsPlayerOverheating; // 0x1910
    float m_playerOverheatValue; // 0x1914
    float m_timeLastGeneratedPlayerOverheat; // 0x1918
    float m_flNextAttack; // 0x191C
    float m_lastFiredTime; // 0x1920
    uint32_t m_lastFiredWeapon; // 0x1924
    float m_raiseFromMeleeEndTime; // 0x1928
    uint32_t m_sharedEnergy; // 0x192C
    uint32_t m_sharedEnergyMax; // 0x1930
    uint32_t m_sharedEnergyLockoutThreshold; // 0x1934
    float m_lastSharedEnergyRegenTime; // 0x1938
    float m_sharedEnergyRegenRate; // 0x193C
    float m_sharedEnergyRegenDelay; // 0x1940
    float m_lastSharedEnergyTakeTime; // 0x1944
    uint32_t m_lastCycleSlot; // 0x19CC
    uint32_t m_weaponPermission; // 0x19D4
    float m_weaponDelayEnableTime; // 0x19D8
    uint32_t m_weaponDisabledInScript; // 0x19DC
    uint32_t [0000]; // 0x1A10
    uint32_t [0001]; // 0x1A14
    uint32_t [0002]; // 0x1A18
    uint32_t m_weaponDisabledFlags; // 0x1A39
    uint32_t m_weaponInventorySlotLockedFlags; // 0x1A3A
    uint32_t m_weaponTypeDisabledFlags; // 0x1A3C
    uint32_t [0005]; // 0x1A45
    uint32_t [0006]; // 0x1A46
    uint32_t [0007]; // 0x1A47
    uint32_t [0008]; // 0x1A48
    uint32_t [0009]; // 0x1A49
    uint32_t m_allowHudSelectionWhileWeaponsDisabled; // 0x1A4A
    uint32_t m_weaponAmmoRegenDisabled; // 0x1A4B
    uint32_t m_weaponAmmoRegenDisabledRefCount; // 0x1A4C
    uint32_t m_akimboState; // 0x1A50
    uint32_t m_akimboShouldAltFire; // 0x1A51
    uint32_t m_hudInfo_visibilityTestAlwaysPasses; // 0x1A52
    uint32_t m_contextAction; // 0x1A64
    uint32_t m_phaseShiftType; // 0x1A90
    float m_phaseShiftTimeStart; // 0x1A94
    float m_phaseShiftTimeEnd; // 0x1A98
    uint32_t m_targetInfoPingValue; // 0x1C30
    uint32_t m_fireteamSlotIndex; // 0x1CA0
    float seTimeEnd; // 0x1CE4
    float seEaseOut; // 0x1CE8
    float sePausedTimeRemaining; // 0x1CEC
    uint32_t seComboVars; // 0x1D48
    uint32_t m_aiSprinting; // 0x1E1A
    uint32_t m_aiNetworkFlags; // 0x1E3C
    uint32_t m_isHologram; // 0x1E40
    const char* m_title; // 0x1E41
    uint32_t m_aiSettingsIndex; // 0x1E64
    uint32_t m_subclass; // 0x1E68
};

class CTitanSoul {
public:
    uint32_t m_bossPlayer; // 0x0154
    uint32_t m_shieldHealth; // 0x01A0
    uint32_t m_shieldHealthMax; // 0x01A4
    uint32_t m_networkedFlags; // 0x02D4
    uint32_t m_titan; // 0x0950
    uint32_t m_titanSoulScriptNetData; // 0x0958
    float m_lastRodeoHitTime; // 0x0AF0
    float m_nextCoreChargeAvailable; // 0x0AF8
    float m_coreChargeExpireTime; // 0x0B00
    float m_coreChargeStartTime; // 0x0B08
    float m_coreUseDuration; // 0x0B0C
    float m_damageComboLatestUpdateTime; // 0x0B10
    uint32_t m_damageComboStartHealth; // 0x0B14
    uint32_t m_poiseAmount; // 0x0B18
    uint32_t m_nextPoiseThreshold; // 0x0B1C
    uint32_t m_poiseState; // 0x0B20
    float seTimeEnd; // 0x0C0C
    float seEaseOut; // 0x0C10
    float sePausedTimeRemaining; // 0x0C14
    uint32_t seComboVars; // 0x0CB0
    uint32_t m_stance; // 0x0CD8
    uint32_t m_doomed; // 0x0CDC
    uint64_t m_playerSettingsNum; // 0x0CE0
    uint32_t m_invalidHealthBarEnt; // 0x0CE8
    uint32_t m_bEjecting; // 0x0CE9
    uint32_t m_isValidRodeoTarget; // 0x0CEA
};

class CAmbientGeneric {
public:
    uint32_t movetype; // 0x0000
    uint32_t movecollide; // 0x0000
    uint32_t moveparent; // 0x001C
    uint32_t m_parentAttachment; // 0x0020
    uint32_t m_fEffects; // 0x0040
    uint32_t m_usableType; // 0x0044
    uint32_t m_cellX; // 0x0048
    uint32_t m_cellY; // 0x004C
    uint32_t m_cellZ; // 0x0050
    fVector3 m_localOrigin; // 0x0054
    uint32_t m_nModelIndex; // 0x0060
    uint32_t m_clrRender; // 0x0080
    uint32_t m_clIntensity; // 0x0084
    uint32_t m_bossPlayer; // 0x0154
    uint32_t [0004]; // 0x0208
    uint32_t [0005]; // 0x020C
    uint32_t [0006]; // 0x0210
    uint32_t [0007]; // 0x0214
    uint32_t [0002]; // 0x029B
    uint32_t [0003]; // 0x029C
    uint32_t m_highlightFocused; // 0x02A1
    float [0000]; // 0x02A4
    float [0001]; // 0x02A8
    uint32_t m_highlightFadeParity; // 0x02AC
    uint32_t m_wantsScopeHighlight; // 0x02D0
    uint32_t m_networkedFlags; // 0x02D4
    uint32_t m_ignoreParentRotation; // 0x02DC
    uint32_t m_visibilityFlags; // 0x032C
    uint32_t m_iTeamNum; // 0x0334
    uint32_t m_grade; // 0x0344
    uint32_t m_ignorePredictedTriggerFlags; // 0x0348
    uint32_t m_passThroughFlags; // 0x0350
    uint32_t m_passThroughThickness; // 0x0354
    float m_passThroughDirection; // 0x0358
    uint32_t m_bIsSoundCodeControllerValueSet; // 0x0370
    float m_flSoundCodeControllerValue; // 0x0374
    fVector3 m_localAngles; // 0x0384
    uint32_t m_hOwnerEntity; // 0x0398
    uint32_t m_bRenderWithViewModels; // 0x039C
    uint32_t m_nRenderFX; // 0x039D
    uint32_t m_nRenderMode; // 0x03A9
    fVector3 m_vecMins; // 0x03C0
    fVector3 m_vecMaxs; // 0x03CC
    uint32_t m_usSolidFlags; // 0x03D8
    uint32_t m_nSolidType; // 0x03DC
    uint32_t m_triggerBloat; // 0x03DD
    uint32_t m_collisionDetailLevel; // 0x03DE
    uint32_t m_nSurroundType; // 0x03EC
    fVector3 m_vecSpecifiedSurroundingMins; // 0x03F8
    fVector3 m_vecSpecifiedSurroundingMaxs; // 0x0404
    uint32_t m_CollisionGroup; // 0x0430
    uint32_t m_contents; // 0x0434
    uint32_t m_collideWithOwner; // 0x0438
    const char* m_iSignifierName; // 0x0470
    const char* m_iName; // 0x0479
    uint32_t m_scriptNameIndex; // 0x0580
    uint32_t m_instanceNameIndex; // 0x0584
    const char* m_holdUsePrompt; // 0x0608
    const char* m_pressUsePrompt; // 0x0610
    uint32_t m_exclusiveUseEnt; // 0x0618
    uint32_t m_phaseShiftFlags; // 0x06B0
    uint32_t m_baseTakeDamage; // 0x06B4
    uint32_t m_invulnerableToDamageCount; // 0x06B8
    uint32_t m_PredictableID; // 0x06C4
    float m_attachmentLerpStartTime; // 0x072C
    float m_attachmentLerpEndTime; // 0x0730
    fVector3 m_attachmentLerpStartOrigin; // 0x0734
    fVector3 m_attachmentLerpStartAngles; // 0x0740
    uint32_t m_parentAttachmentModel; // 0x0750
    float m_fadeDist; // 0x075C
    uint32_t m_dissolveEffectEntityHandle; // 0x0804
    uint32_t m_usablePriority; // 0x0818
    float m_usableDistanceOverride; // 0x081C
    float m_usableFOV; // 0x0820
    float m_usePromptSize; // 0x0824
    uint32_t m_firstChildEntityLink; // 0x0910
    uint32_t m_firstParentEntityLink; // 0x0914
    uint64_t m_realmsBitMask; // 0x0918
    float m_radius; // 0x0958
    uint32_t m_isEnabled; // 0x0970
    uint32_t m_hasPolylineSegments; // 0x0971
    uint32_t m_networkTableSoundID; // 0x0974
    fVector3 m_networkedSegmentEndpointWorldSpace; // 0x097C
};

class CPlayer {
public:
    void* m_classModsActive; // 0x0000
    void* m_passives; // 0x0000
    uint32_t movetype; // 0x0000
    void* m_stickerInventoryItemflaves; // 0x0000
    uint32_t movecollide; // 0x0000
    fVector3 m_vecAbsOrigin; // 0x0004
    float m_animStartTime; // 0x0008
    float m_animStartCycle; // 0x000C
    float m_animPlaybackRate; // 0x0010
    uint32_t isLocalOriginLocal; // 0x0010
    uint32_t m_animModelIndex; // 0x0014
    uint32_t moveparent; // 0x001C
    uint32_t m_animSequence; // 0x001C
    uint32_t m_animFrozen; // 0x001E
    uint32_t m_bClientSideRagdoll; // 0x001F
    uint32_t m_parentAttachment; // 0x0020
    fVector3 m_vecForce; // 0x0020
    uint32_t m_pusher; // 0x0024
    fVector3 m_originRelativeToPusher; // 0x0028
    uint32_t m_numRodeoSlots; // 0x0028
    float m_vecViewOffset.x; // 0x0034
    float m_vecViewOffset.y; // 0x0038
    float m_vecViewOffset.z; // 0x003C
    uint32_t m_fEffects; // 0x0040
    uint32_t m_usableType; // 0x0044
    uint32_t m_cellX; // 0x0048
    uint32_t m_cellY; // 0x004C
    uint32_t m_cellZ; // 0x0050
    fVector2 m_localOrigin; // 0x0054
    float m_localOrigin.z; // 0x005C
    uint32_t m_nModelIndex; // 0x0060
    uint32_t m_clrRender; // 0x0080
    uint32_t m_clIntensity; // 0x0084
    float m_flEstIkOffset; // 0x008C
    uint32_t m_fFlags; // 0x00C8
    uint32_t m_bossPlayer; // 0x0154
    fVector3 m_vecAbsVelocity; // 0x0170
    uint32_t m_shieldHealth; // 0x01A0
    uint32_t m_shieldHealthMax; // 0x01A4
    float m_cloakEndTime; // 0x01CC
    float m_cloakFadeInEndTime; // 0x01D0
    float m_cloakFadeOutStartTime; // 0x01D4
    float m_cloakFadeInDuration; // 0x01D8
    float m_cloakFlickerAmount; // 0x01DC
    float m_cloakFlickerEndTime; // 0x01E0
    uint32_t m_highlightFocused; // 0x02A1
    uint32_t m_highlightFadeParity; // 0x02AC
    uint32_t m_wantsScopeHighlight; // 0x02D0
    uint32_t m_networkedFlags; // 0x02D4
    uint32_t m_ignoreParentRotation; // 0x02DC
    fVector3 m_vecBaseVelocity; // 0x0314
    uint32_t m_hGroundEntity; // 0x0320
    uint32_t m_iHealth; // 0x0324
    float m_flMaxspeed; // 0x0328
    uint32_t m_visibilityFlags; // 0x032C
    uint32_t m_iTeamNum; // 0x0334
    uint32_t m_teamMemberIndex; // 0x033C
    uint32_t m_squadID; // 0x0340
    uint32_t m_grade; // 0x0344
    uint32_t m_ignorePredictedTriggerFlags; // 0x0348
    float m_jumpPadDebounceExpireTime; // 0x034C
    uint32_t m_passThroughFlags; // 0x0350
    uint32_t m_passThroughThickness; // 0x0354
    float m_passThroughDirection; // 0x0358
    fVector3 m_deathVelocity; // 0x035C
    uint32_t m_bIsSoundCodeControllerValueSet; // 0x0370
    float m_flSoundCodeControllerValue; // 0x0374
    float m_vecVelocity.x; // 0x0378
    float m_vecVelocity.y; // 0x037C
    float m_vecVelocity.z; // 0x0380
    fVector3 m_localAngles; // 0x0384
    float m_flFriction; // 0x0390
    uint32_t m_hOwnerEntity; // 0x0398
    uint32_t m_bRenderWithViewModels; // 0x039C
    uint32_t m_nRenderFX; // 0x039D
    uint32_t m_nRenderMode; // 0x03A9
    fVector3 m_vecMins; // 0x03C0
    fVector3 m_vecMaxs; // 0x03CC
    uint32_t m_usSolidFlags; // 0x03D8
    uint32_t m_nSolidType; // 0x03DC
    uint32_t m_triggerBloat; // 0x03DD
    uint32_t m_collisionDetailLevel; // 0x03DE
    uint32_t m_nSurroundType; // 0x03EC
    fVector3 m_vecSpecifiedSurroundingMins; // 0x03F8
    fVector3 m_vecSpecifiedSurroundingMaxs; // 0x0404
    uint32_t m_CollisionGroup; // 0x0430
    uint32_t m_contents; // 0x0434
    uint32_t m_collideWithOwner; // 0x0438
    uint32_t m_iMaxHealth; // 0x0468
    const char* m_iSignifierName; // 0x0470
    const char* m_iName; // 0x0479
    uint32_t m_scriptNameIndex; // 0x0580
    uint32_t m_instanceNameIndex; // 0x0584
    const char* m_holdUsePrompt; // 0x0608
    const char* m_pressUsePrompt; // 0x0610
    uint32_t m_exclusiveUseEnt; // 0x0618
    uint32_t m_lifeState; // 0x0690
    uint32_t m_phaseShiftFlags; // 0x06B0
    uint32_t m_baseTakeDamage; // 0x06B4
    uint32_t m_invulnerableToDamageCount; // 0x06B8
    uint32_t m_passDamageToParent; // 0x06BC
    uint32_t m_PredictableID; // 0x06C4
    float m_attachmentLerpStartTime; // 0x072C
    float m_attachmentLerpEndTime; // 0x0730
    fVector3 m_attachmentLerpStartOrigin; // 0x0734
    fVector3 m_attachmentLerpStartAngles; // 0x0740
    uint32_t m_parentAttachmentModel; // 0x0750
    float m_fadeDist; // 0x075C
    uint32_t m_dissolveEffectEntityHandle; // 0x0804
    uint32_t m_usablePriority; // 0x0818
    float m_usableDistanceOverride; // 0x081C
    float m_usableFOV; // 0x0820
    float m_usePromptSize; // 0x0824
    uint32_t flags; // 0x0878
    uint32_t zOrder; // 0x087C
    uint32_t customState; // 0x0880
    float objectScale; // 0x0884
    uint32_t m_nameVisibilityFlags; // 0x0888
    uint32_t m_firstChildEntityLink; // 0x0910
    uint32_t m_firstParentEntityLink; // 0x0914
    uint64_t m_realmsBitMask; // 0x0918
    uint32_t m_animNetworkFlags; // 0x0978
    uint32_t m_animActive; // 0x097C
    uint32_t m_animCollisionEnabled; // 0x097F
    uint32_t m_animRelativeToGroundEnabled; // 0x0980
    uint32_t m_animPlantingEnabled; // 0x0981
    fVector3 m_animInitialPos; // 0x0984
    fVector3 m_animInitialVel; // 0x0990
    fVector4 m_animInitialRot; // 0x099C
    fVector3 m_animInitialCorrectPos; // 0x09AC
    fVector4 m_animInitialCorrectRot; // 0x09B8
    fVector3 m_animEntityToRefOffset; // 0x09C8
    fVector4 m_animEntityToRefRotation; // 0x09D4
    float m_animBlendBeginTime; // 0x09E4
    float m_animBlendEndTime; // 0x09E8
    uint32_t m_animScriptSequence; // 0x09EC
    uint32_t m_animScriptModel; // 0x09F0
    uint32_t m_animIgnoreParentRot; // 0x09F4
    uint32_t m_animMotionMode; // 0x09F8
    uint32_t m_syncingWithEntity; // 0x0A74
    uint32_t m_predictedAnimEventCount; // 0x0AD0
    uint32_t m_predictedAnimEventTarget; // 0x0AD4
    uint32_t m_predictedAnimEventSequence; // 0x0AD8
    uint32_t m_predictedAnimEventModel; // 0x0ADC
    float m_predictedAnimEventsReadyToFireTime; // 0x0AE0
    uint32_t m_nRagdollImpactFXTableId; // 0x0AFC
    float m_flSkyScaleStartValue; // 0x0B00
    float m_flSkyScaleEndValue; // 0x0B04
    float m_flSkyScaleStartTime; // 0x0B08
    float m_flSkyScaleEndTime; // 0x0B0C
    uint32_t m_sequenceTransitionerLayerActive; // 0x0CA8
    float m_sequenceTransitionerLayerStartCycle; // 0x0CAC
    uint32_t m_sequenceTransitionerLayerSequence; // 0x0CB0
    float m_sequenceTransitionerLayerPlaybackRate; // 0x0CB8
    float m_sequenceTransitionerLayerStartTime; // 0x0CBC
    float m_sequenceTransitionerLayerFadeOutDuration; // 0x0CC0
    uint32_t m_sequenceTransitionerLayerCount; // 0x0CC8
    uint32_t m_itemFlavorGUID; // 0x0D4C
    uint32_t m_nSkin; // 0x0D58
    uint32_t m_skinMod; // 0x0D5C
    uint32_t m_nBody; // 0x0D64
    uint32_t m_camoIndex; // 0x0D68
    float m_nResetEventsStartTime; // 0x0D70
    float m_fireDeferredStopsStartTime; // 0x0D78
    uint32_t m_nForceBone; // 0x0DA8
    uint32_t m_bSequenceFinished; // 0x0E0C
    float m_lockedAnimDeltaYaw; // 0x0E10
    float m_flModelScale; // 0x0E18
    uint32_t m_AnimOverlayCount; // 0x16B0
    uint32_t [0000]; // 0x16E1
    uint32_t [0001]; // 0x16E2
    uint32_t [0002]; // 0x16E3
    uint32_t [0003]; // 0x16E4
    uint32_t [0004]; // 0x16E5
    uint32_t [0005]; // 0x16E6
    uint32_t [0006]; // 0x16E7
    uint32_t [0007]; // 0x16E8
    uint32_t [0008]; // 0x16E9
    uint32_t m_bIsPlayerOverheating; // 0x1910
    float m_playerOverheatValue; // 0x1914
    float m_timeLastGeneratedPlayerOverheat; // 0x1918
    float m_flNextAttack; // 0x191C
    float m_lastFiredTime; // 0x1920
    uint32_t m_lastFiredWeapon; // 0x1924
    float m_raiseFromMeleeEndTime; // 0x1928
    uint32_t m_sharedEnergy; // 0x192C
    uint32_t m_sharedEnergyMax; // 0x1930
    uint32_t m_sharedEnergyLockoutThreshold; // 0x1934
    float m_lastSharedEnergyRegenTime; // 0x1938
    float m_sharedEnergyRegenRate; // 0x193C
    float m_sharedEnergyRegenDelay; // 0x1940
    float m_lastSharedEnergyTakeTime; // 0x1944
    uint32_t [0009]; // 0x1974
    uint32_t [0010]; // 0x1978
    uint32_t [0011]; // 0x197C
    uint32_t m_lastCycleSlot; // 0x19CC
    uint32_t m_weaponPermission; // 0x19D4
    float m_weaponDelayEnableTime; // 0x19D8
    uint32_t m_weaponDisabledInScript; // 0x19DC
    uint32_t m_weaponDisabledFlags; // 0x1A39
    uint32_t m_weaponInventorySlotLockedFlags; // 0x1A3A
    uint32_t m_weaponTypeDisabledFlags; // 0x1A3C
    uint32_t m_allowHudSelectionWhileWeaponsDisabled; // 0x1A4A
    uint32_t m_weaponAmmoRegenDisabled; // 0x1A4B
    uint32_t m_weaponAmmoRegenDisabledRefCount; // 0x1A4C
    uint32_t m_akimboState; // 0x1A50
    uint32_t m_akimboShouldAltFire; // 0x1A51
    uint32_t m_hudInfo_visibilityTestAlwaysPasses; // 0x1A52
    uint32_t m_contextAction; // 0x1A64
    uint32_t m_titanSoul; // 0x1A88
    uint32_t m_phaseShiftType; // 0x1A90
    float m_phaseShiftTimeStart; // 0x1A94
    float m_phaseShiftTimeEnd; // 0x1A98
    uint32_t m_targetInfoPingValue; // 0x1C30
    fVector3 pos; // 0x1C64
    float health; // 0x1C70
    float maxHealth; // 0x1C74
    float strength; // 0x1C78
    float healthDrainDelay; // 0x1C7C
    float healthDrainCutoffPct; // 0x1C80
    float healthDrainPerSec; // 0x1C84
    float healthStretchDamageScale; // 0x1C88
    float healthVelocityDamageScale; // 0x1C8C
    float radius; // 0x1C90
    uint32_t m_bZooming; // 0x1CA1
    float m_zoomToggleOnStartTime; // 0x1CA4
    float m_zoomBaseFrac; // 0x1CA8
    float m_zoomBaseTime; // 0x1CAC
    float m_zoomFullStartTime; // 0x1CB0
    float m_lastUCmdSimulationTicks; // 0x1D24
    float m_lastUCmdSimulationRemainderTime; // 0x1D28
    void* m_airMoveBlockPlanes; // 0x1E70
    uint32_t m_iHideHUD; // 0x1E84
    uint32_t m_superJumpsUsed; // 0x1E88
    uint32_t m_wasClimbingIntoMantle; // 0x1E8C
    uint32_t m_jumpedOffRodeo; // 0x1E8D
    uint32_t m_dodgedInAir; // 0x1E8E
    uint32_t m_fastFalling; // 0x1E8F
    uint32_t m_usedWallHighJump; // 0x1E90
    float m_lastMantleBoostTime; // 0x1E94
    float m_jumpPressTime; // 0x1E98
    float m_prevJumpPressTime; // 0x1E9C
    float m_jetpackActivateTime; // 0x1EA0
    float m_jetpackDeactivateTime; // 0x1EA4
    float m_flSuitPower; // 0x1EA8
    float m_flSuitJumpPower; // 0x1EAC
    float m_flSuitGrapplePower; // 0x1EB0
    float m_flFallVelocity; // 0x1EB4
    float m_flStepSize; // 0x1EB8
    float m_airSlowMoFrac; // 0x1EBC
    uint32_t predictableFlags; // 0x1EC0
    uint32_t m_bitsActiveDevices; // 0x1EC4
    uint32_t m_forceStance; // 0x1EC8
    uint32_t m_forceSlide; // 0x1ECC
    uint32_t m_duckToggleOn; // 0x1ECD
    uint32_t m_resetDuckToggle; // 0x1ECE
    uint32_t m_bDrawViewmodel; // 0x1ECF
    uint32_t m_bAllowAutoMovement; // 0x1ED0
    float m_accelScale; // 0x1ED4
    float m_powerRegenRateScale; // 0x1ED8
    float m_dodgePowerDelayScale; // 0x1EDC
    uint32_t m_hSkyCamera; // 0x1EF4
    uint32_t m_skybox3d.scale; // 0x1EF8
    uint32_t m_skybox3d.useWorldFog; // 0x1EFC
    float m_skybox3d.fog.botAlt; // 0x1F00
    float m_skybox3d.fog.topAlt; // 0x1F04
    float m_skybox3d.fog.halfDistBot; // 0x1F08
    float m_skybox3d.fog.halfDistTop; // 0x1F0C
    float m_skybox3d.fog.distColorStr; // 0x1F10
    float m_skybox3d.fog.dirColorStr; // 0x1F14
    float m_skybox3d.fog.distOffset; // 0x1F18
    float m_skybox3d.fog.densityScale; // 0x1F1C
    float m_skybox3d.fog.halfAngleDeg; // 0x1F20
    float m_skybox3d.fog.HDRColorScale; // 0x1F24
    uint32_t m_skybox3d.fog.distColor; // 0x1F28
    uint32_t m_skybox3d.fog.dirColor; // 0x1F2C
    fVector3 m_skybox3d.fog.direction; // 0x1F30
    uint32_t m_skybox3d.fog.enable; // 0x1F42
    fVector3 m_audio.localSound[0]; // 0x1F48
    fVector3 m_audio.localSound[1]; // 0x1F54
    fVector3 m_audio.localSound[2]; // 0x1F60
    fVector3 m_audio.localSound[3]; // 0x1F6C
    fVector3 m_audio.localSound[4]; // 0x1F78
    fVector3 m_audio.localSound[5]; // 0x1F84
    fVector3 m_audio.localSound[6]; // 0x1F90
    fVector3 m_audio.localSound[7]; // 0x1F9C
    uint32_t m_audio.soundscapeIndex; // 0x1FA8
    uint32_t m_audio.localBits; // 0x1FAC
    uint32_t m_audio.entIndex; // 0x1FB0
    float m_animNearZ; // 0x1FCC
    uint32_t lastAttacker; // 0x1FD0
    uint32_t attackedCount; // 0x1FD4
    float m_airMoveBlockPlaneTime; // 0x2008
    uint32_t m_airMoveBlockPlaneCount; // 0x200C
    float m_queuedMeleePressTime; // 0x2010
    float m_queuedGrappleMeleeTime; // 0x2014
    uint32_t m_disableMeleeUntilRelease; // 0x2020
    float m_meleePressTime; // 0x2024
    uint32_t m_meleeInputIndex; // 0x2028
    uint32_t m_trackedChildProjectileCount; // 0x202C
    uint32_t m_oneHandedWeaponUsage; // 0x2030
    float m_flCockpitEntryTime; // 0x2034
    float m_ejectStartTime; // 0x2038
    float m_disembarkStartTime; // 0x203C
    float m_hotDropImpactTime; // 0x2040
    float m_outOfBoundsDeadTime; // 0x2044
    uint32_t m_objectiveIndex; // 0x2048
    uint32_t m_objectiveEntity; // 0x204C
    float m_objectiveEndTime; // 0x2050
    uint32_t m_cinematicEventFlags; // 0x2054
    uint32_t m_forcedDialogueOnly; // 0x2058
    float m_titanBuildTime; // 0x205C
    float m_titanBubbleShieldTime; // 0x2060
    uint32_t m_titanEmbarkEnabled; // 0x2064
    uint32_t m_titanDisembarkEnabled; // 0x2065
    uint32_t m_voicePackIndex; // 0x2068
    float m_playerAnimStationaryGoalFeetYaw; // 0x206C
    uint32_t m_playerAnimJumping; // 0x2070
    float m_playerAnimJumpStartTime; // 0x2074
    uint32_t m_playerAnimFirstJumpFrame; // 0x2078
    uint32_t m_playerAnimDodging; // 0x2079
    uint32_t m_playerAnimJumpActivity; // 0x207A
    uint32_t m_playerAnimLanding; // 0x207C
    uint32_t m_playerAnimShouldLand; // 0x207D
    float m_playerAnimLandStartTime; // 0x2080
    uint32_t m_playerAnimInAirWalk; // 0x2084
    float m_playerAnimPrevFrameSequenceMotionYaw; // 0x2088
    uint32_t m_playerAnimMeleeParity; // 0x208C
    float m_playerAnimMeleeStartTime; // 0x2090
    fVector4 m_playerLocalGravityBlendStartRotation; // 0x20C4
    fVector4 m_playerLocalGravityBlendEndRotation; // 0x20D4
    fVector3 m_playerLocalGravityBlendEndDirection; // 0x20E4
    float m_playerLocalGravityBlendStartTime; // 0x20F0
    float m_playerLocalGravityBlendEndTime; // 0x20F4
    float m_playerLocalGravityBlendStrength; // 0x20F8
    float m_playerLocalGravityStrength; // 0x20FC
    uint32_t m_playerLocalGravityType; // 0x2100
    fVector3 m_playerLocalGravityPoint; // 0x2104
    fVector3 m_playerLocalGravityLineStart; // 0x2110
    fVector3 m_playerLocalGravityLineEnd; // 0x211C
    uint32_t m_playerLocalGravityEntity; // 0x2128
    uint32_t m_playerLocalGravityLineStartEntity; // 0x212C
    uint32_t m_playerLocalGravityLineEndEntity; // 0x2130
    float m_playerFloatLookStartTime; // 0x2134
    float m_playerFloatLookEndTime; // 0x2138
    float m_wallrunLatestFloorHeight; // 0x213C
    uint32_t m_wallrunFromJetpack; // 0x2140
    fVector3 m_groundNormal; // 0x2144
    uint32_t m_continuousUseBlocked; // 0x2150
    uint32_t m_useEnt; // 0x2154
    float m_flHullHeight; // 0x216C
    float m_angEyeAngles.x; // 0x2170
    float m_angEyeAngles.y; // 0x2174
    float m_traversalAnimProgress; // 0x217C
    float m_sprintTiltFrac; // 0x2180
    float m_ziprailBankTiltFrac; // 0x2184
    fVector3 m_viewConeAngleMin; // 0x2330
    fVector3 m_viewConeAngleMax; // 0x233C
    fVector3 m_stepSmoothingOffset; // 0x2348
    uint32_t m_duckTransitionRemainderMsec; // 0x2354
    fVector3 m_vecPunchBase_Angle; // 0x2358
    fVector3 m_vecPunchBase_AngleVel; // 0x2364
    fVector3 m_vecPunchWeapon_Angle; // 0x2370
    fVector3 m_vecPunchWeapon_AngleVel; // 0x237C
    fVector4 m_localGravityRotation; // 0x23B4
    uint64_t currentClass; // 0x2590
    uint64_t requestedClass; // 0x2598
    uint64_t onDeathClass; // 0x25A0
    uint32_t deadflag; // 0x25EC
    uint32_t stage; // 0x2608
    uint32_t canRodeo; // 0x260C
    uint32_t rodeoCountParity; // 0x2610
    float startTime; // 0x2614
    float endTime; // 0x2618
    uint32_t targetEnt; // 0x261C
    uint32_t prevEnt; // 0x2620
    float prevEntCooldown; // 0x2624
    uint32_t pilot1pSequenceIndex; // 0x2628
    uint32_t pilot3pSequenceIndex; // 0x262A
    uint32_t targetAttachmentId; // 0x262C
    uint32_t m_ammoPoolCapacity; // 0x26F4
    uint32_t m_hasBadReputation; // 0x26F8
    uint32_t m_healResources_healthTarget; // 0x26FC
    uint32_t m_hardware; // 0x2700
    uint32_t m_connectionQualityIndex; // 0x2701
    uint64_t m_platformUserId; // 0x2708
    uint64_t m_nucleusId; // 0x2710
    uint32_t m_crossPlayChat; // 0x2718
    uint32_t m_crossPlayChatFriends; // 0x2719
    uint32_t m_laserSightColorCustomized; // 0x271A
    fVector3 m_laserSightColor; // 0x271C
    uint64_t [0012]; // 0x27BC
    uint64_t [0013]; // 0x27C4
    uint64_t [0014]; // 0x27CC
    uint64_t [0015]; // 0x27D4
    uint64_t [0016]; // 0x27DC
    uint64_t [0017]; // 0x27E4
    uint64_t [0018]; // 0x27EC
    uint64_t [0019]; // 0x27F4
    uint64_t [0020]; // 0x27FC
    uint64_t [0021]; // 0x2804
    uint64_t [0022]; // 0x280C
    uint64_t [0023]; // 0x2814
    uint64_t [0024]; // 0x281C
    uint64_t [0025]; // 0x2824
    uint64_t [0026]; // 0x282C
    uint64_t [0027]; // 0x2834
    uint64_t [0028]; // 0x283C
    uint64_t [0029]; // 0x2844
    uint64_t [0030]; // 0x284C
    uint64_t [0031]; // 0x2854
    uint32_t m_bleedoutState; // 0x28A0
    float m_bleedoutStartTime; // 0x28A4
    float seTimeEnd; // 0x298C
    float seEaseOut; // 0x2990
    float sePausedTimeRemaining; // 0x2994
    uint32_t seComboVars; // 0x2A30
    float m_damageComboLatestUpdateTime; // 0x2A5C
    uint32_t m_damageComboStartHealth; // 0x2A60
    uint32_t m_gestureAutoKillBitfield; // 0x2B14
    float m_fStickySprintMinTime; // 0x2B4C
    uint32_t m_autoSprintForced; // 0x2B54
    uint32_t m_fIsSprinting; // 0x2B58
    uint32_t m_playerSettingForStickySprintForward; // 0x2B5A
    uint32_t m_playerSettingForHoldToSprint; // 0x2B5B
    float m_lastSprintPressTime; // 0x2B5C
    float m_stickySprintForwardEnableTime; // 0x2B60
    float m_stickySprintForwardDisableTime; // 0x2B64
    float m_sprintStartedTime; // 0x2B68
    float m_sprintStartedFrac; // 0x2B6C
    float m_sprintEndedTime; // 0x2B70
    float m_sprintEndedFrac; // 0x2B74
    float m_stickySprintStartTime; // 0x2B78
    float m_damageImpulseNoDecelEndTime; // 0x2B7C
    uint32_t m_playerVehicleCount; // 0x2B90
    uint32_t m_playerVehicleDriven; // 0x2B94
    float m_playerVehicleUseTime; // 0x2B98
    uint32_t m_titanSoulBeingRodeoed; // 0x2B9C
    uint32_t m_duckState; // 0x2BA4
    uint32_t m_leanState; // 0x2BA8
    uint32_t m_canStand; // 0x2BAD
    fVector3 m_StandHullMin; // 0x2BB0
    fVector3 m_StandHullMax; // 0x2BBC
    fVector3 m_DuckHullMin; // 0x2BC8
    fVector3 m_DuckHullMax; // 0x2BD4
    uint32_t m_entitySyncingWithMe; // 0x2BE0
    fVector3 m_upDir; // 0x2BE4
    fVector3 m_upDirPredicted; // 0x2BF0
    fVector3 m_lastWallRunStartPos; // 0x2BFC
    float m_wallrunFrictionScale; // 0x2C2C
    float m_groundFrictionScale; // 0x2C30
    uint32_t m_traversalState; // 0x2C6C
    uint32_t m_traversalType; // 0x2C70
    fVector3 m_traversalBegin; // 0x2C74
    fVector3 m_traversalMid; // 0x2C80
    fVector3 m_traversalEnd; // 0x2C8C
    float m_traversalMidFrac; // 0x2C98
    fVector3 m_traversalForwardDir; // 0x2C9C
    fVector3 m_traversalRefPos; // 0x2CA8
    float m_traversalProgress; // 0x2CB4
    float m_traversalStartProgress; // 0x2CB8
    float m_traversalStartTime; // 0x2CBC
    float m_traversalHandAppearTime; // 0x2CC0
    float m_traversalReleaseTime; // 0x2CC4
    float m_traversalBlendOutStartTime; // 0x2CC8
    fVector3 m_traversalBlendOutStartOffset; // 0x2CCC
    float m_traversalYawDelta; // 0x2CD8
    uint32_t m_traversalYawPoseParameter; // 0x2CDC
    float m_wallDangleJumpOffTime; // 0x2CE4
    uint32_t m_wallDangleMayHangHere; // 0x2CE8
    uint32_t m_wallDangleForceFallOff; // 0x2CE9
    uint32_t m_wallDangleLastPushedForward; // 0x2CEA
    uint32_t m_mantleBoostState; // 0x2CEC
    float m_prevMantleAngleOffset; // 0x2CF0
    uint32_t m_wallDangleDisableWeapon; // 0x2CF4
    uint32_t m_wallClimbSetUp; // 0x2CFC
    uint32_t m_wallHanging; // 0x2CFD
    uint32_t m_gravityLiftActive; // 0x2CFE
    uint32_t m_blackholeActive; // 0x2D20
    uint32_t m_jetDriveWasActive; // 0x2D21
    uint32_t m_jetDriveActive; // 0x2D22
    fVector3 m_jetDriveTargetPos; // 0x2D24
    uint32_t m_jetDriveTargetEnt; // 0x2D30
    float m_jetDriveTargetEntZOffset; // 0x2D34
    fVector3 m_jetDriveStartPos; // 0x2D38
    float m_jetDriveStartTime; // 0x2D44
    float m_jetDriveSpeed; // 0x2D48
    float m_jetDriveAccel; // 0x2D4C
    float m_jetDriveDecelWindowTimeOutTime; // 0x2D50
    uint32_t m_jetDriveInDecelWindow; // 0x2D54
    float m_jetDriveTimeout; // 0x2D58
    fVector3 m_jetDriveDoubleJumpVelocity; // 0x2D5C
    float m_jetDriveDoubleJumpVelBackFrac; // 0x2D68
    uint32_t m_playerLaunchActivate; // 0x2DF0
    uint32_t m_playerLaunchAvoidedMantle; // 0x2DF1
    uint32_t m_playerLaunchLock3pRotation; // 0x2DF2
    fVector3 m_playerLaunchVelocity; // 0x2DF4
    float m_playerLaunchStartTime; // 0x2E00
    void* m_grapplePoints; // 0x2E08
    fVector3 m_grappleVel; // 0x2E10
    uint32_t m_grapplePointCount; // 0x2E4C
    uint32_t m_grappleAttached; // 0x2E50
    uint32_t m_grapplePulling; // 0x2E51
    uint32_t m_grappleSwinging; // 0x2E52
    uint32_t m_grappleRetracting; // 0x2E53
    uint32_t m_grappleForcedRetracting; // 0x2E54
    uint32_t m_grappleGracePeriodFinished; // 0x2E55
    float m_grappleUsedPower; // 0x2E58
    float m_grappleActivateTime; // 0x2E5C
    float m_grapplePullTime; // 0x2E60
    float m_grappleAttachTime; // 0x2E64
    uint32_t m_grappleMeleeTarget; // 0x2E68
    uint32_t m_grappleAutoAimTarget; // 0x2E6C
    uint32_t m_grappleHasGoodVelocity; // 0x2E70
    float m_grappleLastGoodVelocityTime; // 0x2E74
    float m_grappleSwingDetachLowSpeed; // 0x2E78
    float m_grappleSwingHoldTimeOrRemainingEdgeGrappleReelTime; // 0x2E7C
    uint32_t m_grappleActive; // 0x2E90
    float m_grappleDetachTime; // 0x2E94
    uint32_t m_slowMoEnabled; // 0x2EAC
    uint32_t m_sliding; // 0x2EAD
    uint32_t m_slideLongJumpAllowed; // 0x2EAE
    float m_ziprailBankTiltVel; // 0x2EBC
    uint32_t m_ziprailBankTiltPoseParameter; // 0x2EC0
    uint32_t m_bIsStickySprinting; // 0x2EC2
    float m_prevMoveYaw; // 0x2EC4
    float m_sprintTiltVel; // 0x2EC8
    uint32_t m_sprintTiltPoseParameter; // 0x2ECC
    uint32_t m_sprintFracPoseParameter; // 0x2ECE
    uint32_t m_turret; // 0x2EDC
    uint32_t viewOffsetEntityHandle; // 0x2EF8
    float lerpInDuration; // 0x2EFC
    float lerpOutDuration; // 0x2F00
    uint32_t stabilizePlayerEyeAngles; // 0x2F04
    uint32_t animViewEntityHandle; // 0x2F30
    float animViewEntityAngleLerpInDuration; // 0x2F34
    float animViewEntityOriginLerpInDuration; // 0x2F38
    float animViewEntityLerpOutDuration; // 0x2F3C
    uint32_t animViewEntityStabilizePlayerEyeAngles; // 0x2F40
    uint32_t animViewEntityThirdPersonCameraParity; // 0x2F44
    uint32_t animViewEntityNumThirdPersonCameraAttachments; // 0x2F50
    uint32_t animViewEntityThirdPersonCameraVisibilityChecks; // 0x2F54
    uint32_t animViewEntityDrawPlayer; // 0x2F55
    float fovTarget; // 0x2F58
    float fovSmoothTime; // 0x2F5C
    uint32_t animViewEntityParity; // 0x2F68
    uint32_t m_ziplineAllowed; // 0x301C
    uint32_t m_activeZipline; // 0x3020
    uint32_t m_lastZipline; // 0x3024
    float m_lastZiplineDetachTime; // 0x3028
    uint32_t m_ziplineValid3pWeaponLayerAnim; // 0x302C
    uint32_t m_ziplineState; // 0x3030
    uint32_t m_ziplineReenableWeapons; // 0x3040
    float m_mountingZiplineAlpha; // 0x3044
    float m_ziplineStartTime; // 0x3048
    float m_ziplineEndTime; // 0x304C
    fVector3 m_mountingZiplineSourcePosition; // 0x3050
    fVector3 m_mountingZiplineSourceVelocity; // 0x305C
    fVector3 m_mountingZiplineTargetPosition; // 0x3068
    fVector3 m_ziplineUsePosition; // 0x3080
    float m_slidingZiplineAlpha; // 0x308C
    fVector3 m_lastMoveDir2D; // 0x3090
    uint32_t m_ziplineReverse; // 0x309C
    fVector3 m_ziplinePathDirection; // 0x30A0
    fVector3 m_ziplineViewOffsetPosition; // 0x30B0
    fVector3 m_ziplineViewOffsetVelocity; // 0x30BC
    uint32_t m_ziplineGrenadeEntity; // 0x30C8
    uint32_t m_ziplineGrenadeBeginStationEntity; // 0x30CC
    uint32_t m_ziplineGrenadeBeginStationAttachmentId; // 0x30D0
    float m_ziplineReattachCooldownTime; // 0x30D8
    uint32_t m_ziplineCooldownIndex; // 0x30DC
    uint32_t m_highSpeedViewmodelAnims; // 0x30DD
    uint32_t m_playAnimationType; // 0x30E0
    uint32_t m_detachGrappleOnPlayAnimationEnd; // 0x30E4
    uint32_t m_playAnimationEntityBlocker; // 0x30EC
    uint32_t m_playAnimationEntityBlockerDucking; // 0x30F0
    uint32_t m_shadowShieldActive; // 0x30F8
    uint32_t m_tempShieldHealth; // 0x30FC
    uint32_t m_extraShieldHealth; // 0x3100
    uint32_t m_extraShieldTier; // 0x3104
    uint32_t m_boosting; // 0x3108
    uint32_t m_activateBoost; // 0x3109
    uint32_t m_repeatedBoost; // 0x310A
    float m_boostMeter; // 0x310C
    uint32_t m_jetpack; // 0x3110
    uint32_t m_activateJetpack; // 0x3111
    uint32_t m_jetpackAfterburner; // 0x3112
    uint32_t m_gliding; // 0x3113
    float m_glideMeter; // 0x3114
    float m_glideRechargeDelayAccumulator; // 0x3118
    uint32_t m_activateGlide; // 0x311C
    float m_glideUpwardsBoostEndTime; // 0x3120
    float m_fallSpeedGlideMultiplier; // 0x3124
    uint32_t m_pilotModeActive; // 0x3128
    float m_slideGateDebounceExpireTime; // 0x312C
    uint32_t m_hovering; // 0x3130
    uint32_t m_isHoverStrafed; // 0x3131
    float m_hoverMeter; // 0x3134
    float m_hoverRechargeDelayAccumulator; // 0x3138
    uint32_t m_isPerformingBoostAction; // 0x313C
    float m_lastJumpHeight; // 0x3140
    uint32_t m_touchingSlipTriggersCount; // 0x3224
    fVector3 m_slipAirRestrictDirection; // 0x3228
    float m_slipAirRestrictTime; // 0x3234
    float m_lastTimeDamaged; // 0x3238
    float m_lastTimeDamagedByOtherPlayer; // 0x323C
    float m_lastTimeDamagedByNPC; // 0x3240
    float m_lastTimeDidDamageToOtherPlayer; // 0x3244
    float m_lastTimeDidDamageToNPC; // 0x3248
    uint32_t m_lastJumpPadTouched; // 0x3298
    uint32_t m_launchCount; // 0x32A0
    uint32_t m_launcherAirControlActive; // 0x32A4
    uint32_t m_viewConeActive; // 0x33C5
    uint32_t m_viewConeParented; // 0x33C6
    uint32_t m_viewConeParity; // 0x33C8
    uint32_t meleeAttackParity; // 0x33D8
    uint32_t attackActive; // 0x33DC
    uint32_t attackRecoveryShouldBeQuick; // 0x33DD
    uint32_t isSprintAttack; // 0x33DE
    float attackStartTime; // 0x33E0
    uint32_t attackHitEntity; // 0x33E4
    float attackHitEntityTime; // 0x33E8
    float attackLastHitNonWorldEntity; // 0x33EC
    uint32_t scriptedState; // 0x33F0
    uint32_t pendingMeleePress; // 0x33F4
    fVector3 lungeBoost; // 0x33F8
    uint32_t previousMainOffhand; // 0x3404
    uint32_t m_useCredit; // 0x3408
    uint32_t m_playerFlags; // 0x340C
    uint32_t m_hasMic; // 0x3414
    uint32_t m_inPartyChat; // 0x3415
    uint32_t m_communicationsAutoBlocked; // 0x3416
    float m_playerMoveSpeedScale; // 0x3418
    uint32_t m_bShouldDrawPlayerWhileUsingViewEntity; // 0x3660
    uint32_t m_hConstraintEntity; // 0x3664
    fVector3 m_vecConstraintCenter; // 0x3668
    float m_flConstraintRadius; // 0x3674
    float m_flConstraintWidth; // 0x3678
    float m_flConstraintSpeedFactor; // 0x367C
    uint32_t m_bConstraintPastRadius; // 0x3680
    uint32_t m_iSpawnParity; // 0x36CC
    uint32_t m_iObserverMode; // 0x36D4
    uint32_t m_hObserverTarget; // 0x36E0
    fVector3 m_observerModeStaticPosition; // 0x3720
    fVector3 m_observerModeStaticAngles; // 0x372C
    float m_observerModeStaticFOVOverride; // 0x3738
    float m_lastKillTime; // 0x37B4
    float m_flDeathTime; // 0x37B8
    fVector3 m_ragdollCreationOrigin; // 0x37BC
    float m_ragdollCreationYaw; // 0x37C8
    float m_wallRunStartTime; // 0x37EC
    float m_wallRunClearTime; // 0x37F0
    uint32_t m_lastJumpWasWallHighJump; // 0x3804
    uint32_t m_dodging; // 0x3805
    float m_lastDodgeTime; // 0x3808
    float m_timeJetpackHeightActivateCheckPassed; // 0x3830
    uint32_t m_dodgingInAir; // 0x3872
    float m_airSpeed; // 0x3894
    float m_airAcceleration; // 0x3898
    float m_timeShouldTryGivePlayerDoubleJump; // 0x38C0
    uint32_t m_firstPersonProxy; // 0x38D0
    uint32_t m_predictedFirstPersonProxy; // 0x38D4
    uint32_t m_grappleHook; // 0x38D8
    uint32_t m_petTitan; // 0x38DC
    uint32_t m_hardpointEntity; // 0x38E4
    uint32_t m_xp; // 0x3904
    float m_skill_mu; // 0x390C
    uint32_t m_bHasMatchAdminRole; // 0x3910
    float m_nextTitanRespawnAvailable; // 0x3914
    uint32_t m_petTitanMode; // 0x3928
    uint32_t m_hThirdPersonEnt; // 0x3930
    uint32_t m_thirdPersonShoulderView; // 0x3934
    float m_thirdPersonEntViewOffset.x; // 0x3998
    float m_thirdPersonEntViewOffset.y; // 0x399C
    float m_thirdPersonEntViewOffset.z; // 0x39A0
    uint32_t m_thirdPersonEntShouldViewAnglesFollowThirdPersonEnt; // 0x39A4
    uint32_t m_thirdPersonEntPitchIsFreelook; // 0x39A5
    uint32_t m_thirdPersonEntYawIsFreelook; // 0x39A6
    uint32_t m_thirdPersonEntUseFixedDist; // 0x39A7
    uint32_t m_thirdPersonEntFixedClientOnly; // 0x39A8
    uint32_t m_thirdPersonEntPushedInByGeo; // 0x39A9
    uint32_t m_thirdPersonEntDrawViewmodel; // 0x39AA
    uint32_t m_thirdPersonEntEnableCameraLag; // 0x39AB
    uint32_t m_thirdPersonEntFreezeLookControls; // 0x39AC
    uint32_t m_thirdPersonEntShouldUse1pAudio; // 0x39AD
    float m_thirdPersonEntBlendInTotalDuration; // 0x39B0
    float m_thirdPersonEntBlendInEaseInDuration; // 0x39B4
    float m_thirdPersonEntBlendInEaseOutDuration; // 0x39B8
    float m_thirdPersonEntBlendOutDuration; // 0x39BC
    float m_thirdPersonEntFixedPitch; // 0x39C0
    float m_thirdPersonEntFixedYaw; // 0x39C4
    float m_thirdPersonEntFixedDist; // 0x39C8
    float m_thirdPersonEntFixedHeight; // 0x39CC
    float m_thirdPersonEntFixedRight; // 0x39D0
    float m_thirdPersonEntVariableDistStart; // 0x39D4
    float m_thirdPersonEntVariableDistEnd; // 0x39D8
    float m_thirdPersonEntVariableDistStartTime; // 0x39DC
    float m_thirdPersonEntVariableDistEndTime; // 0x39E0
    uint32_t m_thirdPersonEntVariableDistLerpType; // 0x39E4
    uint32_t m_thirdPersonEntVariableDistLerpLogGrowthFactor; // 0x39E8
    float m_thirdPersonEntVariableHeightStart; // 0x39EC
    float m_thirdPersonEntVariableHeightEnd; // 0x39F0
    float m_thirdPersonEntVariableHeightStartTime; // 0x39F4
    float m_thirdPersonEntVariableHeightEndTime; // 0x39F8
    uint32_t m_thirdPersonEntVariableHeightLerpType; // 0x39FC
    uint32_t m_thirdPersonEntVariableHeightLerpLogGrowthFactor; // 0x3A00
    float m_thirdPersonEntVariableRightStart; // 0x3A04
    float m_thirdPersonEntVariableRightEnd; // 0x3A08
    float m_thirdPersonEntVariableRightStartTime; // 0x3A0C
    float m_thirdPersonEntVariableRightEndTime; // 0x3A10
    uint32_t m_thirdPersonEntVariableRightLerpType; // 0x3A14
    uint32_t m_thirdPersonEntVariableRightLerpLogGrowthFactor; // 0x3A18
    float m_thirdPersonEntMinYaw; // 0x3A30
    float m_thirdPersonEntMaxYaw; // 0x3A34
    float m_thirdPersonEntMinPitch; // 0x3A38
    float m_thirdPersonEntMaxPitch; // 0x3A3C
    float m_thirdPersonEntSpringToCenterRate; // 0x3A40
    float m_thirdPersonEntSpringToCenterDelay; // 0x3A44
    float m_thirdPersonEntLookaheadLowerEntSpeed; // 0x3A48
    float m_thirdPersonEntLookaheadUpperEntSpeed; // 0x3A4C
    float m_thirdPersonEntLookaheadMaxAngle; // 0x3A50
    float m_thirdPersonEntLookaheadLerpAheadRate; // 0x3A54
    float m_thirdPersonEntLookaheadLerpToCenterRate; // 0x3A58
    uint32_t m_playerLookTargetEntity; // 0x3AA8
    fVector3 m_playerLookTargetOffset; // 0x3AAC
    float m_viewConeLerpTime; // 0x3B10
    float m_flLaggedMovementValue; // 0x3D6C
    float m_lastMoveInputTime; // 0x3D70
    uint32_t m_ignoreEntityForMovementUntilNotTouching; // 0x3D74
    uint32_t m_ubEFNoInterpParity; // 0x4270
    uint32_t m_hColorCorrectionCtrl; // 0x4274
    const char* m_title; // 0x4298
    uint32_t m_lungeTargetEntity; // 0x42BC
    uint32_t m_isLungingToPosition; // 0x42C0
    fVector3 m_lungeTargetPosition; // 0x42C4
    fVector3 m_lungeStartPositionOffset; // 0x42D0
    fVector3 m_lungeEndPositionOffset; // 0x42DC
    float m_lungeStartTime; // 0x42E8
    float m_lungeEndTime; // 0x42EC
    uint32_t m_lungeCanFly; // 0x42F0
    uint32_t m_lungeLockPitch; // 0x42F1
    float m_lungeStartPitch; // 0x42F4
    float m_lungeSmoothTime; // 0x42F8
    float m_lungeMaxTime; // 0x42FC
    float m_lungeMaxEndSpeed; // 0x4300
    uint32_t m_nPlayerCond; // 0x4610
    uint32_t m_pilotClassIndex; // 0x465C
    uint32_t ent; // 0x48A0
    fVector3 origin; // 0x48A4
    fVector3 angles; // 0x48B0
    uint32_t m_nearbyPusherCount; // 0x48BC
    uint32_t m_prepClimbPusher; // 0x48CC
    fVector3 m_pushAwayFromTopAcceleration; // 0x48D0
    float m_minimapTargetZoomScale; // 0x48E0
    float m_minimapTargetLerpTime; // 0x48E4
    uint32_t m_playerScriptNetDataGlobal; // 0x48E8
    uint32_t m_playerScriptNetDataExclusive; // 0x48EC
    uint32_t m_helmetType; // 0x48F0
    uint32_t m_armorType; // 0x48F4
    float m_pingOffset; // 0x48F8
    uint32_t m_controllerModeActive; // 0x48FC
    float m_skydiveForwardPoseValueVelocity; // 0x491C
    float m_skydiveForwardPoseValueTarget; // 0x4920
    float m_skydiveForwardPoseValueCurrent; // 0x4924
    float m_skydiveSidePoseValueVelocity; // 0x4928
    float m_skydiveSidePoseValueTarget; // 0x492C
    float m_skydiveSidePoseValueCurrent; // 0x4930
    float m_skydiveYawVelocity; // 0x4934
    uint32_t m_skydiveIsNearDisableSkydiveEndEntity; // 0x4938
    uint32_t m_skydiveState; // 0x4954
    float m_skydiveStartTime; // 0x4958
    float m_skydiveEndTime; // 0x495C
    float m_skydiveAnticipateStartTime; // 0x4960
    float m_skydiveAnticipateEndTime; // 0x4964
    float m_skydiveDistanceToLand; // 0x4968
    float m_skydiveDiveAngle; // 0x496C
    uint32_t m_skydiveIsDiving; // 0x4970
    float m_skydiveSpeed; // 0x4974
    float m_skydiveStrafeAngle; // 0x4978
    uint32_t m_skydiveFreelookEnabled; // 0x497C
    fVector3 m_skydiveFreelookLockedAngle; // 0x4980
    float m_skydivePlayerPitch; // 0x498C
    float m_skydivePlayerYaw; // 0x4990
    uint32_t m_skydiveFollowing; // 0x4994
    fVector3 m_skydiveUnfollowVelocity; // 0x4998
    fVector3 m_skydiveDisableSkydiveEndEntityHitPosition; // 0x49A8
    fVector3 m_skydiveDisableSkydiveEndEntityHitNormal; // 0x49B4
    fVector3 m_skydiveSlipVelocity; // 0x49C0
    uint32_t m_skydiveFromUpdraft; // 0x49CC
    uint32_t m_skydiveFromSkywardLaunch; // 0x49CD
    float m_skydiveScriptInputOverride; // 0x49D0
    fVector3 m_skydiveContraintPostion; // 0x49D4
    float m_skydiveContraintRadius; // 0x49E0
    uint32_t m_skywardLaunchState; // 0x49E4
    fVector3 m_skywardDeployStartPos; // 0x49EC
    float m_skywardLaunchSlowStartTime; // 0x49F8
    float m_skywardLaunchSlowEndTime; // 0x49FC
    float m_skywardLaunchFastEndTime; // 0x4A00
    float m_skywardDeployEndTime; // 0x4A04
    float m_skywardLaunchEndTime; // 0x4A08
    float m_skywardDeploySpeed; // 0x4A0C
    float m_skywardLaunchSlowSpeed; // 0x4A10
    float m_skywardLaunchFastSpeed; // 0x4A14
    fVector3 m_skywardOffset; // 0x4A18
    float m_skywardOffsetSpeed; // 0x4A24
    uint32_t m_skywardLaunchInterrupted; // 0x4A28
    uint32_t m_skywardLaunchFollowing; // 0x4A29
    fVector3 m_skywardObstacleAvoidanceEndPos; // 0x4A2C
    uint32_t m_skywardWeaponsEnabled; // 0x4A38
    fVector3 m_armoredLeapAirPos; // 0x4A40
    fVector3 m_armoredLeapEndPos; // 0x4A4C
    uint32_t m_armoredLeapType; // 0x4A58
    uint32_t m_armoredLeapPhase; // 0x4A5C
    float m_armoredLeapStartTime; // 0x4A60
    uint32_t m_dragReviveState; // 0x4AD0
    float m_dragReviveOutroStartTime; // 0x4AD4
    uint32_t m_reviveTarget; // 0x4AD8
    uint32_t m_twitchDropsInitialized; // 0x4AE0
    fVector3 velocity; // 0x4B70
    float beginTime; // 0x4B7C
    uint32_t m_updraftCount; // 0x4B88
    uint32_t m_updraftStage; // 0x4B8C
    float m_updraftEnterTime; // 0x4B90
    float m_updraftLeaveTime; // 0x4B94
    float m_updraftMinShakeActivationHeight; // 0x4B98
    float m_updraftMaxShakeActivationHeight; // 0x4B9C
    float m_updraftLiftActivationHeight; // 0x4BA0
    float m_updraftLiftSpeed; // 0x4BA4
    float m_updraftLiftAcceleration; // 0x4BA8
    float m_updraftLiftExitDuration; // 0x4BAC
    float m_updraftSlowTime; // 0x4BB0
    uint32_t m_armsModelIndex; // 0x4BB4
    uint32_t m_deathFieldIndex; // 0x4BB8
    float m_lastTimeKilledOtherPlayer; // 0x4C10
};

class CSkyCamera {
public:
    uint32_t movecollide; // 0x0000
    uint32_t movetype; // 0x0000
    uint32_t moveparent; // 0x001C
    uint32_t m_parentAttachment; // 0x0020
    uint32_t m_fEffects; // 0x0040
    uint32_t m_usableType; // 0x0044
    uint32_t m_cellX; // 0x0048
    uint32_t m_cellY; // 0x004C
    uint32_t m_cellZ; // 0x0050
    fVector3 m_localOrigin; // 0x0054
    uint32_t m_nModelIndex; // 0x0060
    uint32_t m_clrRender; // 0x0080
    uint32_t m_clIntensity; // 0x0084
    uint32_t m_bossPlayer; // 0x0154
    uint32_t [0004]; // 0x0208
    uint32_t [0005]; // 0x020C
    uint32_t [0006]; // 0x0210
    uint32_t [0007]; // 0x0214
    uint32_t [0002]; // 0x029B
    uint32_t [0003]; // 0x029C
    uint32_t m_highlightFocused; // 0x02A1
    float [0000]; // 0x02A4
    float [0001]; // 0x02A8
    uint32_t m_highlightFadeParity; // 0x02AC
    uint32_t m_wantsScopeHighlight; // 0x02D0
    uint32_t m_networkedFlags; // 0x02D4
    uint32_t m_ignoreParentRotation; // 0x02DC
    uint32_t m_visibilityFlags; // 0x032C
    uint32_t m_iTeamNum; // 0x0334
    uint32_t m_grade; // 0x0344
    uint32_t m_ignorePredictedTriggerFlags; // 0x0348
    uint32_t m_passThroughFlags; // 0x0350
    uint32_t m_passThroughThickness; // 0x0354
    float m_passThroughDirection; // 0x0358
    uint32_t m_bIsSoundCodeControllerValueSet; // 0x0370
    float m_flSoundCodeControllerValue; // 0x0374
    fVector3 m_localAngles; // 0x0384
    uint32_t m_hOwnerEntity; // 0x0398
    uint32_t m_bRenderWithViewModels; // 0x039C
    uint32_t m_nRenderFX; // 0x039D
    uint32_t m_nRenderMode; // 0x03A9
    fVector3 m_vecMins; // 0x03C0
    fVector3 m_vecMaxs; // 0x03CC
    uint32_t m_usSolidFlags; // 0x03D8
    uint32_t m_nSolidType; // 0x03DC
    uint32_t m_triggerBloat; // 0x03DD
    uint32_t m_collisionDetailLevel; // 0x03DE
    uint32_t m_nSurroundType; // 0x03EC
    fVector3 m_vecSpecifiedSurroundingMins; // 0x03F8
    fVector3 m_vecSpecifiedSurroundingMaxs; // 0x0404
    uint32_t m_CollisionGroup; // 0x0430
    uint32_t m_contents; // 0x0434
    uint32_t m_collideWithOwner; // 0x0438
    const char* m_iSignifierName; // 0x0470
    const char* m_iName; // 0x0479
    uint32_t m_scriptNameIndex; // 0x0580
    uint32_t m_instanceNameIndex; // 0x0584
    const char* m_holdUsePrompt; // 0x0608
    const char* m_pressUsePrompt; // 0x0610
    uint32_t m_exclusiveUseEnt; // 0x0618
    uint32_t m_phaseShiftFlags; // 0x06B0
    uint32_t m_baseTakeDamage; // 0x06B4
    uint32_t m_invulnerableToDamageCount; // 0x06B8
    uint32_t m_PredictableID; // 0x06C4
    float m_attachmentLerpStartTime; // 0x072C
    float m_attachmentLerpEndTime; // 0x0730
    fVector3 m_attachmentLerpStartOrigin; // 0x0734
    fVector3 m_attachmentLerpStartAngles; // 0x0740
    uint32_t m_parentAttachmentModel; // 0x0750
    float m_fadeDist; // 0x075C
    uint32_t m_dissolveEffectEntityHandle; // 0x0804
    uint32_t m_usablePriority; // 0x0818
    float m_usableDistanceOverride; // 0x081C
    float m_usableFOV; // 0x0820
    float m_usePromptSize; // 0x0824
    uint32_t m_firstChildEntityLink; // 0x0910
    uint32_t m_firstParentEntityLink; // 0x0914
    uint64_t m_realmsBitMask; // 0x0918
};

class CBaseEntity {
public:
    uint32_t movecollide; // 0x0000
    uint32_t movetype; // 0x0000
    uint32_t moveparent; // 0x001C
    uint32_t m_parentAttachment; // 0x0020
    uint32_t m_fEffects; // 0x0040
    uint32_t m_usableType; // 0x0044
    uint32_t m_cellX; // 0x0048
    uint32_t m_cellY; // 0x004C
    uint32_t m_cellZ; // 0x0050
    fVector3 m_localOrigin; // 0x0054
    uint32_t m_nModelIndex; // 0x0060
    uint32_t m_clrRender; // 0x0080
    uint32_t m_clIntensity; // 0x0084
    uint32_t m_bossPlayer; // 0x0154
    uint32_t [0004]; // 0x0208
    uint32_t [0005]; // 0x020C
    uint32_t [0006]; // 0x0210
    uint32_t [0007]; // 0x0214
    uint32_t [0002]; // 0x029B
    uint32_t [0003]; // 0x029C
    uint32_t m_highlightFocused; // 0x02A1
    float [0000]; // 0x02A4
    float [0001]; // 0x02A8
    uint32_t m_highlightFadeParity; // 0x02AC
    uint32_t m_wantsScopeHighlight; // 0x02D0
    uint32_t m_networkedFlags; // 0x02D4
    uint32_t m_ignoreParentRotation; // 0x02DC
    uint32_t m_visibilityFlags; // 0x032C
    uint32_t m_iTeamNum; // 0x0334
    uint32_t m_grade; // 0x0344
    uint32_t m_ignorePredictedTriggerFlags; // 0x0348
    uint32_t m_passThroughFlags; // 0x0350
    uint32_t m_passThroughThickness; // 0x0354
    float m_passThroughDirection; // 0x0358
    uint32_t m_bIsSoundCodeControllerValueSet; // 0x0370
    float m_flSoundCodeControllerValue; // 0x0374
    fVector3 m_localAngles; // 0x0384
    uint32_t m_hOwnerEntity; // 0x0398
    uint32_t m_bRenderWithViewModels; // 0x039C
    uint32_t m_nRenderFX; // 0x039D
    uint32_t m_nRenderMode; // 0x03A9
    fVector3 m_vecMins; // 0x03C0
    fVector3 m_vecMaxs; // 0x03CC
    uint32_t m_usSolidFlags; // 0x03D8
    uint32_t m_nSolidType; // 0x03DC
    uint32_t m_triggerBloat; // 0x03DD
    uint32_t m_collisionDetailLevel; // 0x03DE
    uint32_t m_nSurroundType; // 0x03EC
    fVector3 m_vecSpecifiedSurroundingMins; // 0x03F8
    fVector3 m_vecSpecifiedSurroundingMaxs; // 0x0404
    uint32_t m_CollisionGroup; // 0x0430
    uint32_t m_contents; // 0x0434
    uint32_t m_collideWithOwner; // 0x0438
    const char* m_iSignifierName; // 0x0470
    const char* m_iName; // 0x0479
    uint32_t m_scriptNameIndex; // 0x0580
    uint32_t m_instanceNameIndex; // 0x0584
    const char* m_holdUsePrompt; // 0x0608
    const char* m_pressUsePrompt; // 0x0610
    uint32_t m_exclusiveUseEnt; // 0x0618
    uint32_t m_phaseShiftFlags; // 0x06B0
    uint32_t m_baseTakeDamage; // 0x06B4
    uint32_t m_invulnerableToDamageCount; // 0x06B8
    uint32_t m_PredictableID; // 0x06C4
    float m_attachmentLerpStartTime; // 0x072C
    float m_attachmentLerpEndTime; // 0x0730
    fVector3 m_attachmentLerpStartOrigin; // 0x0734
    fVector3 m_attachmentLerpStartAngles; // 0x0740
    uint32_t m_parentAttachmentModel; // 0x0750
    float m_fadeDist; // 0x075C
    uint32_t m_dissolveEffectEntityHandle; // 0x0804
    uint32_t m_usablePriority; // 0x0818
    float m_usableDistanceOverride; // 0x081C
    float m_usableFOV; // 0x0820
    float m_usePromptSize; // 0x0824
    uint32_t m_firstChildEntityLink; // 0x0910
    uint32_t m_firstParentEntityLink; // 0x0914
    uint64_t m_realmsBitMask; // 0x0918
};

class CInfoPlacementHelper {
public:
    fVector3 m_localOrigin; // 0x0004
    uint32_t moveparent; // 0x001C
    uint32_t m_parentAttachment; // 0x0020
    fVector3 m_localAngles; // 0x0384
    uint32_t m_parentAttachmentModel; // 0x0750
};

class CBaseAnimating {
public:
    uint32_t movetype; // 0x0000
    uint32_t movecollide; // 0x0000
    float m_animStartTime; // 0x0008
    float m_animStartCycle; // 0x000C
    float m_animPlaybackRate; // 0x0010
    uint32_t m_animModelIndex; // 0x0014
    uint32_t m_animSequence; // 0x001C
    uint32_t moveparent; // 0x001C
    uint32_t m_animFrozen; // 0x001E
    uint32_t m_bClientSideRagdoll; // 0x001F
    uint32_t m_parentAttachment; // 0x0020
    fVector3 m_vecForce; // 0x0020
    uint32_t m_fEffects; // 0x0040
    uint32_t m_usableType; // 0x0044
    uint32_t m_cellX; // 0x0048
    uint32_t m_cellY; // 0x004C
    uint32_t m_cellZ; // 0x0050
    fVector3 m_localOrigin; // 0x0054
    uint32_t m_nModelIndex; // 0x0060
    uint32_t m_clrRender; // 0x0080
    float [0010]; // 0x0080
    uint32_t m_clIntensity; // 0x0084
    float [0011]; // 0x0084
    float [0012]; // 0x0088
    float [0013]; // 0x008C
    float m_flEstIkOffset; // 0x008C
    float [0014]; // 0x0090
    float [0015]; // 0x0094
    float [0016]; // 0x0098
    float [0017]; // 0x009C
    float [0018]; // 0x00A0
    float [0019]; // 0x00A4
    float [0020]; // 0x00A8
    float [0021]; // 0x00AC
    float [0022]; // 0x00B0
    float [0023]; // 0x00B4
    uint32_t m_bossPlayer; // 0x0154
    uint32_t m_highlightFocused; // 0x02A1
    uint32_t m_highlightFadeParity; // 0x02AC
    uint32_t m_wantsScopeHighlight; // 0x02D0
    uint32_t m_networkedFlags; // 0x02D4
    uint32_t m_ignoreParentRotation; // 0x02DC
    uint32_t m_visibilityFlags; // 0x032C
    uint32_t m_iTeamNum; // 0x0334
    uint32_t m_grade; // 0x0344
    uint32_t m_ignorePredictedTriggerFlags; // 0x0348
    uint32_t m_passThroughFlags; // 0x0350
    uint32_t m_passThroughThickness; // 0x0354
    float m_passThroughDirection; // 0x0358
    uint32_t m_bIsSoundCodeControllerValueSet; // 0x0370
    float m_flSoundCodeControllerValue; // 0x0374
    fVector3 m_localAngles; // 0x0384
    uint32_t m_hOwnerEntity; // 0x0398
    uint32_t m_bRenderWithViewModels; // 0x039C
    uint32_t m_nRenderFX; // 0x039D
    uint32_t m_nRenderMode; // 0x03A9
    fVector3 m_vecMins; // 0x03C0
    fVector3 m_vecMaxs; // 0x03CC
    uint32_t m_usSolidFlags; // 0x03D8
    uint32_t m_nSolidType; // 0x03DC
    uint32_t m_triggerBloat; // 0x03DD
    uint32_t m_collisionDetailLevel; // 0x03DE
    uint32_t m_nSurroundType; // 0x03EC
    fVector3 m_vecSpecifiedSurroundingMins; // 0x03F8
    fVector3 m_vecSpecifiedSurroundingMaxs; // 0x0404
    uint32_t m_CollisionGroup; // 0x0430
    uint32_t m_contents; // 0x0434
    uint32_t m_collideWithOwner; // 0x0438
    const char* m_iSignifierName; // 0x0470
    const char* m_iName; // 0x0479
    uint32_t m_scriptNameIndex; // 0x0580
    uint32_t m_instanceNameIndex; // 0x0584
    const char* m_holdUsePrompt; // 0x0608
    const char* m_pressUsePrompt; // 0x0610
    uint32_t m_exclusiveUseEnt; // 0x0618
    uint32_t m_phaseShiftFlags; // 0x06B0
    uint32_t m_baseTakeDamage; // 0x06B4
    uint32_t m_invulnerableToDamageCount; // 0x06B8
    uint32_t m_passDamageToParent; // 0x06BC
    uint32_t m_PredictableID; // 0x06C4
    float m_attachmentLerpStartTime; // 0x072C
    float m_attachmentLerpEndTime; // 0x0730
    fVector3 m_attachmentLerpStartOrigin; // 0x0734
    fVector3 m_attachmentLerpStartAngles; // 0x0740
    uint32_t m_parentAttachmentModel; // 0x0750
    float m_fadeDist; // 0x075C
    uint32_t m_dissolveEffectEntityHandle; // 0x0804
    uint32_t m_usablePriority; // 0x0818
    float m_usableDistanceOverride; // 0x081C
    float m_usableFOV; // 0x0820
    float m_usePromptSize; // 0x0824
    uint32_t m_firstChildEntityLink; // 0x0910
    uint32_t m_firstParentEntityLink; // 0x0914
    uint64_t m_realmsBitMask; // 0x0918
    uint32_t m_animNetworkFlags; // 0x0978
    uint32_t m_animActive; // 0x097C
    uint32_t m_animCollisionEnabled; // 0x097F
    uint32_t m_animRelativeToGroundEnabled; // 0x0980
    uint32_t m_animPlantingEnabled; // 0x0981
    fVector3 m_animInitialPos; // 0x0984
    fVector3 m_animInitialVel; // 0x0990
    fVector4 m_animInitialRot; // 0x099C
    fVector3 m_animInitialCorrectPos; // 0x09AC
    fVector4 m_animInitialCorrectRot; // 0x09B8
    fVector3 m_animEntityToRefOffset; // 0x09C8
    fVector4 m_animEntityToRefRotation; // 0x09D4
    float m_animBlendBeginTime; // 0x09E4
    float m_animBlendEndTime; // 0x09E8
    uint32_t m_animScriptSequence; // 0x09EC
    uint32_t m_animScriptModel; // 0x09F0
    uint32_t m_animIgnoreParentRot; // 0x09F4
    uint32_t m_animMotionMode; // 0x09F8
    uint32_t m_syncingWithEntity; // 0x0A74
    uint32_t [0000]; // 0x0AA8
    uint32_t [0001]; // 0x0AAC
    uint32_t [0002]; // 0x0AB0
    uint32_t [0003]; // 0x0AB4
    uint32_t [0004]; // 0x0AB8
    uint32_t [0005]; // 0x0ABC
    uint32_t [0006]; // 0x0AC0
    uint32_t [0007]; // 0x0AC4
    uint32_t [0008]; // 0x0AC8
    uint32_t [0009]; // 0x0ACC
    uint32_t m_predictedAnimEventCount; // 0x0AD0
    uint32_t m_predictedAnimEventTarget; // 0x0AD4
    uint32_t m_predictedAnimEventSequence; // 0x0AD8
    uint32_t m_predictedAnimEventModel; // 0x0ADC
    float m_predictedAnimEventsReadyToFireTime; // 0x0AE0
    uint32_t m_nRagdollImpactFXTableId; // 0x0AFC
    float m_flSkyScaleStartValue; // 0x0B00
    float m_flSkyScaleEndValue; // 0x0B04
    float m_flSkyScaleStartTime; // 0x0B08
    float m_flSkyScaleEndTime; // 0x0B0C
    uint32_t m_sequenceTransitionerLayerActive; // 0x0CA8
    float m_sequenceTransitionerLayerStartCycle; // 0x0CAC
    uint32_t m_sequenceTransitionerLayerSequence; // 0x0CB0
    float m_sequenceTransitionerLayerPlaybackRate; // 0x0CB8
    float m_sequenceTransitionerLayerStartTime; // 0x0CBC
    float m_sequenceTransitionerLayerFadeOutDuration; // 0x0CC0
    uint32_t m_sequenceTransitionerLayerCount; // 0x0CC8
    uint32_t m_itemFlavorGUID; // 0x0D4C
    uint32_t m_nSkin; // 0x0D58
    uint32_t m_skinMod; // 0x0D5C
    uint32_t m_nBody; // 0x0D64
    uint32_t m_camoIndex; // 0x0D68
    float m_nResetEventsStartTime; // 0x0D70
    float m_fireDeferredStopsStartTime; // 0x0D78
    uint32_t m_nForceBone; // 0x0DA8
    uint32_t m_bSequenceFinished; // 0x0E0C
    float m_lockedAnimDeltaYaw; // 0x0E10
    float m_flModelScale; // 0x0E18
};

class CZiprail {
public:
    uint32_t movetype; // 0x0000
    uint32_t movecollide; // 0x0000
    uint32_t m_numZiplinePoints; // 0x0008
    uint32_t moveparent; // 0x001C
    uint32_t m_parentAttachment; // 0x0020
    uint32_t m_fEffects; // 0x0040
    uint32_t m_usableType; // 0x0044
    uint32_t m_cellX; // 0x0048
    uint32_t m_cellY; // 0x004C
    uint32_t m_cellZ; // 0x0050
    fVector3 m_localOrigin; // 0x0054
    uint32_t m_nModelIndex; // 0x0060
    uint32_t m_clrRender; // 0x0080
    uint32_t m_clIntensity; // 0x0084
    uint32_t m_bossPlayer; // 0x0154
    uint32_t m_highlightFocused; // 0x02A1
    uint32_t m_highlightFadeParity; // 0x02AC
    uint32_t m_wantsScopeHighlight; // 0x02D0
    uint32_t m_networkedFlags; // 0x02D4
    uint32_t m_ignoreParentRotation; // 0x02DC
    uint32_t m_visibilityFlags; // 0x032C
    uint32_t m_iTeamNum; // 0x0334
    uint32_t m_grade; // 0x0344
    uint32_t m_ignorePredictedTriggerFlags; // 0x0348
    uint32_t m_passThroughFlags; // 0x0350
    uint32_t m_passThroughThickness; // 0x0354
    float m_passThroughDirection; // 0x0358
    uint32_t m_bIsSoundCodeControllerValueSet; // 0x0370
    float m_flSoundCodeControllerValue; // 0x0374
    fVector3 m_localAngles; // 0x0384
    uint32_t m_hOwnerEntity; // 0x0398
    uint32_t m_bRenderWithViewModels; // 0x039C
    uint32_t m_nRenderFX; // 0x039D
    uint32_t m_nRenderMode; // 0x03A9
    fVector3 m_vecMins; // 0x03C0
    fVector3 m_vecMaxs; // 0x03CC
    uint32_t m_usSolidFlags; // 0x03D8
    uint32_t m_nSolidType; // 0x03DC
    uint32_t m_triggerBloat; // 0x03DD
    uint32_t m_collisionDetailLevel; // 0x03DE
    uint32_t m_nSurroundType; // 0x03EC
    fVector3 m_vecSpecifiedSurroundingMins; // 0x03F8
    fVector3 m_vecSpecifiedSurroundingMaxs; // 0x0404
    uint32_t m_CollisionGroup; // 0x0430
    uint32_t m_contents; // 0x0434
    uint32_t m_collideWithOwner; // 0x0438
    const char* m_iSignifierName; // 0x0470
    const char* m_iName; // 0x0479
    uint32_t m_scriptNameIndex; // 0x0580
    uint32_t m_instanceNameIndex; // 0x0584
    const char* m_holdUsePrompt; // 0x0608
    const char* m_pressUsePrompt; // 0x0610
    uint32_t m_exclusiveUseEnt; // 0x0618
    uint32_t m_phaseShiftFlags; // 0x06B0
    uint32_t m_baseTakeDamage; // 0x06B4
    uint32_t m_invulnerableToDamageCount; // 0x06B8
    uint32_t m_PredictableID; // 0x06C4
    float m_attachmentLerpStartTime; // 0x072C
    float m_attachmentLerpEndTime; // 0x0730
    fVector3 m_attachmentLerpStartOrigin; // 0x0734
    fVector3 m_attachmentLerpStartAngles; // 0x0740
    uint32_t m_parentAttachmentModel; // 0x0750
    float m_fadeDist; // 0x075C
    uint32_t m_dissolveEffectEntityHandle; // 0x0804
    uint32_t m_usablePriority; // 0x0818
    float m_usableDistanceOverride; // 0x081C
    float m_usableFOV; // 0x0820
    float m_usePromptSize; // 0x0824
    uint32_t m_firstChildEntityLink; // 0x0910
    uint32_t m_firstParentEntityLink; // 0x0914
    uint64_t m_realmsBitMask; // 0x0918
    uint32_t m_detachEndOnUse; // 0x0950
    uint32_t m_dropToBottom; // 0x0951
    float m_ziplineAutoDetachDistance; // 0x0954
    float m_ziplineMountReverseDistance; // 0x0958
    uint32_t m_ziplineVerticalPushOffInDirectionX; // 0x095C
    uint32_t m_ziplineVerticalPreserveVelocity; // 0x095D
    float m_ziplineWidth; // 0x0960
    uint32_t m_ziplineEnabled; // 0x0964
    uint32_t m_ziplinePreventManualDetach; // 0x0965
    float m_ziplineFadeDist; // 0x0968
    float m_ziplineSpeedScale; // 0x096C
    fVector3 m_ropeColorModulation; // 0x0970
    uint32_t m_prevZipline; // 0x0B50
    uint32_t m_nextZipline; // 0x0B54
    uint32_t m_isInit; // 0x0B68
    uint32_t m_ziplineType; // 0x0B6C
    fVector3 m_ziplineStart; // 0x0B70
    fVector3 m_ziplineEnd; // 0x0B7C
    fVector3 position; // 0x0D70
    fVector3 prevPosition; // 0x0D7C
    uint32_t m_numNodes; // 0x0D88
    float m_springDistance; // 0x0D8C
    float m_springDistanceScale; // 0x0D90
    float m_remainingUnsimulatedTime; // 0x0D94
    uint32_t m_outerZiplineEntity; // 0x0D98
    uint32_t entity; // 0x0E88
    fVector3 attachAcceleration; // 0x0E8C
    float attachTime; // 0x0E98
    uint32_t m_numAttachedEntities; // 0x0EA0
    uint32_t m_ziplineOwner; // 0x0EA4
    uint32_t m_ziplineMaterialIndex; // 0x0EA8
    uint32_t m_numZiplineRestPositions; // 0x0F6C
    uint32_t m_numZiprailPathNodes; // 0x0F80
    float [0000]; // 0x1204
    float [0001]; // 0x1208
    float [0002]; // 0x120C
    float [0003]; // 0x1210
    float [0004]; // 0x1214
    float [0005]; // 0x1218
    float [0006]; // 0x121C
    float [0007]; // 0x1220
    float [0008]; // 0x1224
    float [0009]; // 0x1228
    float [0010]; // 0x122C
    float [0011]; // 0x1230
    float [0012]; // 0x1234
    float [0013]; // 0x1238
    float [0014]; // 0x123C
    float [0015]; // 0x1240
    float [0016]; // 0x1244
    float [0017]; // 0x1248
    float [0018]; // 0x124C
    float [0019]; // 0x1250
    float [0020]; // 0x1254
    float [0021]; // 0x1258
    float [0022]; // 0x125C
    float [0023]; // 0x1260
    float [0024]; // 0x1264
    float [0025]; // 0x1268
    float [0026]; // 0x126C
    float [0027]; // 0x1270
    float [0028]; // 0x1274
    float [0029]; // 0x1278
    float [0030]; // 0x127C
    float [0031]; // 0x1280
    float m_ziprailPathLen; // 0x1284
    fVector3 m_pathExtentsMins; // 0x1288
    fVector3 m_pathExtentsMaxs; // 0x1294
    uint32_t m_ziprailUseAutoDetachSpeed; // 0x12A0
};

class CZipline {
public:
    uint32_t movecollide; // 0x0000
    uint32_t movetype; // 0x0000
    uint32_t m_numZiplinePoints; // 0x0008
    fVector3 [0000]; // 0x0018
    uint32_t moveparent; // 0x001C
    uint32_t m_parentAttachment; // 0x0020
    fVector3 [0001]; // 0x0024
    fVector3 [0002]; // 0x0030
    fVector3 [0003]; // 0x003C
    uint32_t m_fEffects; // 0x0040
    uint32_t m_usableType; // 0x0044
    uint32_t m_cellX; // 0x0048
    fVector3 [0004]; // 0x0048
    uint32_t m_cellY; // 0x004C
    uint32_t m_cellZ; // 0x0050
    fVector3 m_localOrigin; // 0x0054
    fVector3 [0005]; // 0x0054
    uint32_t m_nModelIndex; // 0x0060
    fVector3 [0006]; // 0x0060
    fVector3 [0007]; // 0x006C
    fVector3 [0008]; // 0x0078
    uint32_t m_clrRender; // 0x0080
    uint32_t m_clIntensity; // 0x0084
    fVector3 [0009]; // 0x0084
    fVector3 [0010]; // 0x0090
    fVector3 [0011]; // 0x009C
    fVector3 [0012]; // 0x00A8
    fVector3 [0013]; // 0x00B4
    fVector3 [0014]; // 0x00C0
    fVector3 [0015]; // 0x00CC
    uint32_t m_bossPlayer; // 0x0154
    uint32_t m_highlightFocused; // 0x02A1
    uint32_t m_highlightFadeParity; // 0x02AC
    uint32_t m_wantsScopeHighlight; // 0x02D0
    uint32_t m_networkedFlags; // 0x02D4
    uint32_t m_ignoreParentRotation; // 0x02DC
    uint32_t m_visibilityFlags; // 0x032C
    uint32_t m_iTeamNum; // 0x0334
    uint32_t m_grade; // 0x0344
    uint32_t m_ignorePredictedTriggerFlags; // 0x0348
    uint32_t m_passThroughFlags; // 0x0350
    uint32_t m_passThroughThickness; // 0x0354
    float m_passThroughDirection; // 0x0358
    uint32_t m_bIsSoundCodeControllerValueSet; // 0x0370
    float m_flSoundCodeControllerValue; // 0x0374
    fVector3 m_localAngles; // 0x0384
    uint32_t m_hOwnerEntity; // 0x0398
    uint32_t m_bRenderWithViewModels; // 0x039C
    uint32_t m_nRenderFX; // 0x039D
    uint32_t m_nRenderMode; // 0x03A9
    fVector3 m_vecMins; // 0x03C0
    fVector3 m_vecMaxs; // 0x03CC
    uint32_t m_usSolidFlags; // 0x03D8
    uint32_t m_nSolidType; // 0x03DC
    uint32_t m_triggerBloat; // 0x03DD
    uint32_t m_collisionDetailLevel; // 0x03DE
    uint32_t m_nSurroundType; // 0x03EC
    fVector3 m_vecSpecifiedSurroundingMins; // 0x03F8
    fVector3 m_vecSpecifiedSurroundingMaxs; // 0x0404
    uint32_t m_CollisionGroup; // 0x0430
    uint32_t m_contents; // 0x0434
    uint32_t m_collideWithOwner; // 0x0438
    const char* m_iSignifierName; // 0x0470
    const char* m_iName; // 0x0479
    uint32_t m_scriptNameIndex; // 0x0580
    uint32_t m_instanceNameIndex; // 0x0584
    const char* m_holdUsePrompt; // 0x0608
    const char* m_pressUsePrompt; // 0x0610
    uint32_t m_exclusiveUseEnt; // 0x0618
    uint32_t m_phaseShiftFlags; // 0x06B0
    uint32_t m_baseTakeDamage; // 0x06B4
    uint32_t m_invulnerableToDamageCount; // 0x06B8
    uint32_t m_PredictableID; // 0x06C4
    float m_attachmentLerpStartTime; // 0x072C
    float m_attachmentLerpEndTime; // 0x0730
    fVector3 m_attachmentLerpStartOrigin; // 0x0734
    fVector3 m_attachmentLerpStartAngles; // 0x0740
    uint32_t m_parentAttachmentModel; // 0x0750
    float m_fadeDist; // 0x075C
    uint32_t m_dissolveEffectEntityHandle; // 0x0804
    uint32_t m_usablePriority; // 0x0818
    float m_usableDistanceOverride; // 0x081C
    float m_usableFOV; // 0x0820
    float m_usePromptSize; // 0x0824
    uint32_t m_firstChildEntityLink; // 0x0910
    uint32_t m_firstParentEntityLink; // 0x0914
    uint64_t m_realmsBitMask; // 0x0918
    uint32_t m_detachEndOnUse; // 0x0950
    uint32_t m_dropToBottom; // 0x0951
    float m_ziplineAutoDetachDistance; // 0x0954
    float m_ziplineMountReverseDistance; // 0x0958
    uint32_t m_ziplineVerticalPushOffInDirectionX; // 0x095C
    uint32_t m_ziplineVerticalPreserveVelocity; // 0x095D
    float m_ziplineWidth; // 0x0960
    uint32_t m_ziplineEnabled; // 0x0964
    uint32_t m_ziplinePreventManualDetach; // 0x0965
    float m_ziplineFadeDist; // 0x0968
    float m_ziplineSpeedScale; // 0x096C
    fVector3 m_ropeColorModulation; // 0x0970
    uint32_t m_prevZipline; // 0x0B50
    uint32_t m_nextZipline; // 0x0B54
    uint32_t m_isInit; // 0x0B68
    uint32_t m_ziplineType; // 0x0B6C
    fVector3 m_ziplineStart; // 0x0B70
    fVector3 m_ziplineEnd; // 0x0B7C
    fVector3 position; // 0x0D70
    fVector3 prevPosition; // 0x0D7C
    uint32_t m_numNodes; // 0x0D88
    float m_springDistance; // 0x0D8C
    float m_springDistanceScale; // 0x0D90
    float m_remainingUnsimulatedTime; // 0x0D94
    uint32_t m_outerZiplineEntity; // 0x0D98
    uint32_t entity; // 0x0E88
    fVector3 attachAcceleration; // 0x0E8C
    float attachTime; // 0x0E98
    uint32_t m_numAttachedEntities; // 0x0EA0
    uint32_t m_ziplineOwner; // 0x0EA4
    uint32_t m_ziplineMaterialIndex; // 0x0EA8
    uint32_t m_numZiplineRestPositions; // 0x0F6C
};

class CZiplineEnd {
public:
    uint32_t movetype; // 0x0000
    uint32_t movecollide; // 0x0000
    uint32_t moveparent; // 0x001C
    uint32_t m_parentAttachment; // 0x0020
    uint32_t m_fEffects; // 0x0040
    uint32_t m_usableType; // 0x0044
    uint32_t m_cellX; // 0x0048
    uint32_t m_cellY; // 0x004C
    uint32_t m_cellZ; // 0x0050
    fVector3 m_localOrigin; // 0x0054
    uint32_t m_nModelIndex; // 0x0060
    uint32_t m_clrRender; // 0x0080
    uint32_t m_clIntensity; // 0x0084
    uint32_t m_bossPlayer; // 0x0154
    uint32_t [0004]; // 0x0208
    uint32_t [0005]; // 0x020C
    uint32_t [0006]; // 0x0210
    uint32_t [0007]; // 0x0214
    uint32_t [0002]; // 0x029B
    uint32_t [0003]; // 0x029C
    uint32_t m_highlightFocused; // 0x02A1
    float [0000]; // 0x02A4
    float [0001]; // 0x02A8
    uint32_t m_highlightFadeParity; // 0x02AC
    uint32_t m_wantsScopeHighlight; // 0x02D0
    uint32_t m_networkedFlags; // 0x02D4
    uint32_t m_ignoreParentRotation; // 0x02DC
    uint32_t m_visibilityFlags; // 0x032C
    uint32_t m_iTeamNum; // 0x0334
    uint32_t m_grade; // 0x0344
    uint32_t m_ignorePredictedTriggerFlags; // 0x0348
    uint32_t m_passThroughFlags; // 0x0350
    uint32_t m_passThroughThickness; // 0x0354
    float m_passThroughDirection; // 0x0358
    uint32_t m_bIsSoundCodeControllerValueSet; // 0x0370
    float m_flSoundCodeControllerValue; // 0x0374
    fVector3 m_localAngles; // 0x0384
    uint32_t m_hOwnerEntity; // 0x0398
    uint32_t m_bRenderWithViewModels; // 0x039C
    uint32_t m_nRenderFX; // 0x039D
    uint32_t m_nRenderMode; // 0x03A9
    fVector3 m_vecMins; // 0x03C0
    fVector3 m_vecMaxs; // 0x03CC
    uint32_t m_usSolidFlags; // 0x03D8
    uint32_t m_nSolidType; // 0x03DC
    uint32_t m_triggerBloat; // 0x03DD
    uint32_t m_collisionDetailLevel; // 0x03DE
    uint32_t m_nSurroundType; // 0x03EC
    fVector3 m_vecSpecifiedSurroundingMins; // 0x03F8
    fVector3 m_vecSpecifiedSurroundingMaxs; // 0x0404
    uint32_t m_CollisionGroup; // 0x0430
    uint32_t m_contents; // 0x0434
    uint32_t m_collideWithOwner; // 0x0438
    const char* m_iSignifierName; // 0x0470
    const char* m_iName; // 0x0479
    uint32_t m_scriptNameIndex; // 0x0580
    uint32_t m_instanceNameIndex; // 0x0584
    const char* m_holdUsePrompt; // 0x0608
    const char* m_pressUsePrompt; // 0x0610
    uint32_t m_exclusiveUseEnt; // 0x0618
    uint32_t m_phaseShiftFlags; // 0x06B0
    uint32_t m_baseTakeDamage; // 0x06B4
    uint32_t m_invulnerableToDamageCount; // 0x06B8
    uint32_t m_PredictableID; // 0x06C4
    float m_attachmentLerpStartTime; // 0x072C
    float m_attachmentLerpEndTime; // 0x0730
    fVector3 m_attachmentLerpStartOrigin; // 0x0734
    fVector3 m_attachmentLerpStartAngles; // 0x0740
    uint32_t m_parentAttachmentModel; // 0x0750
    float m_fadeDist; // 0x075C
    uint32_t m_dissolveEffectEntityHandle; // 0x0804
    uint32_t m_usablePriority; // 0x0818
    float m_usableDistanceOverride; // 0x081C
    float m_usableFOV; // 0x0820
    float m_usePromptSize; // 0x0824
    uint32_t m_firstChildEntityLink; // 0x0910
    uint32_t m_firstParentEntityLink; // 0x0914
    uint64_t m_realmsBitMask; // 0x0918
    float m_autoDetachDistance; // 0x0950
    uint32_t m_verticalPushOffInDirectionX; // 0x0954
    uint32_t m_prevZipline; // 0x0958
};

class CWeaponX {
public:
    uint32_t movecollide; // 0x0000
    uint32_t movetype; // 0x0000
    float m_animStartTime; // 0x0008
    float m_animStartCycle; // 0x000C
    float m_animPlaybackRate; // 0x0010
    uint32_t m_animModelIndex; // 0x0014
    uint32_t m_animSequence; // 0x001C
    uint32_t moveparent; // 0x001C
    uint32_t m_animFrozen; // 0x001E
    uint32_t m_bClientSideRagdoll; // 0x001F
    fVector3 m_vecForce; // 0x0020
    uint32_t m_parentAttachment; // 0x0020
    uint32_t m_fEffects; // 0x0040
    uint32_t m_usableType; // 0x0044
    uint32_t m_cellX; // 0x0048
    uint32_t m_cellY; // 0x004C
    uint32_t m_cellZ; // 0x0050
    fVector3 m_localOrigin; // 0x0054
    uint32_t m_nModelIndex; // 0x0060
    float [0010]; // 0x0080
    uint32_t m_clrRender; // 0x0080
    float [0011]; // 0x0084
    uint32_t m_clIntensity; // 0x0084
    float [0012]; // 0x0088
    float [0013]; // 0x008C
    float m_flEstIkOffset; // 0x008C
    float [0014]; // 0x0090
    float [0015]; // 0x0094
    float [0016]; // 0x0098
    float [0017]; // 0x009C
    float [0018]; // 0x00A0
    float [0019]; // 0x00A4
    float [0020]; // 0x00A8
    float [0021]; // 0x00AC
    float [0022]; // 0x00B0
    float [0023]; // 0x00B4
    uint32_t m_bossPlayer; // 0x0154
    uint32_t m_highlightFocused; // 0x02A1
    uint32_t m_highlightFadeParity; // 0x02AC
    uint32_t m_wantsScopeHighlight; // 0x02D0
    uint32_t m_networkedFlags; // 0x02D4
    uint32_t m_ignoreParentRotation; // 0x02DC
    uint32_t m_visibilityFlags; // 0x032C
    uint32_t m_iTeamNum; // 0x0334
    uint32_t m_grade; // 0x0344
    uint32_t m_ignorePredictedTriggerFlags; // 0x0348
    uint32_t m_passThroughFlags; // 0x0350
    uint32_t m_passThroughThickness; // 0x0354
    float m_passThroughDirection; // 0x0358
    uint32_t m_bIsSoundCodeControllerValueSet; // 0x0370
    float m_flSoundCodeControllerValue; // 0x0374
    fVector3 m_localAngles; // 0x0384
    uint32_t m_hOwnerEntity; // 0x0398
    uint32_t m_bRenderWithViewModels; // 0x039C
    uint32_t m_nRenderFX; // 0x039D
    uint32_t m_nRenderMode; // 0x03A9
    fVector3 m_vecMins; // 0x03C0
    fVector3 m_vecMaxs; // 0x03CC
    uint32_t m_usSolidFlags; // 0x03D8
    uint32_t m_nSolidType; // 0x03DC
    uint32_t m_triggerBloat; // 0x03DD
    uint32_t m_collisionDetailLevel; // 0x03DE
    uint32_t m_nSurroundType; // 0x03EC
    fVector3 m_vecSpecifiedSurroundingMins; // 0x03F8
    fVector3 m_vecSpecifiedSurroundingMaxs; // 0x0404
    uint32_t m_CollisionGroup; // 0x0430
    uint32_t m_contents; // 0x0434
    uint32_t m_collideWithOwner; // 0x0438
    uint32_t m_nNextThinkTick; // 0x0464
    const char* m_iSignifierName; // 0x0470
    const char* m_iName; // 0x0479
    uint32_t m_scriptNameIndex; // 0x0580
    uint32_t m_instanceNameIndex; // 0x0584
    const char* m_holdUsePrompt; // 0x0608
    const char* m_pressUsePrompt; // 0x0610
    uint32_t m_exclusiveUseEnt; // 0x0618
    uint32_t m_phaseShiftFlags; // 0x06B0
    uint32_t m_baseTakeDamage; // 0x06B4
    uint32_t m_invulnerableToDamageCount; // 0x06B8
    uint32_t m_passDamageToParent; // 0x06BC
    uint32_t m_PredictableID; // 0x06C4
    float m_attachmentLerpStartTime; // 0x072C
    float m_attachmentLerpEndTime; // 0x0730
    fVector3 m_attachmentLerpStartOrigin; // 0x0734
    fVector3 m_attachmentLerpStartAngles; // 0x0740
    uint32_t m_parentAttachmentModel; // 0x0750
    float m_fadeDist; // 0x075C
    uint32_t m_dissolveEffectEntityHandle; // 0x0804
    uint32_t m_usablePriority; // 0x0818
    float m_usableDistanceOverride; // 0x081C
    float m_usableFOV; // 0x0820
    float m_usePromptSize; // 0x0824
    uint32_t m_firstChildEntityLink; // 0x0910
    uint32_t m_firstParentEntityLink; // 0x0914
    uint64_t m_realmsBitMask; // 0x0918
    uint32_t m_animNetworkFlags; // 0x0978
    uint32_t m_animActive; // 0x097C
    uint32_t m_animCollisionEnabled; // 0x097F
    uint32_t m_animRelativeToGroundEnabled; // 0x0980
    uint32_t m_animPlantingEnabled; // 0x0981
    fVector3 m_animInitialPos; // 0x0984
    fVector3 m_animInitialVel; // 0x0990
    fVector4 m_animInitialRot; // 0x099C
    fVector3 m_animInitialCorrectPos; // 0x09AC
    fVector4 m_animInitialCorrectRot; // 0x09B8
    fVector3 m_animEntityToRefOffset; // 0x09C8
    fVector4 m_animEntityToRefRotation; // 0x09D4
    float m_animBlendBeginTime; // 0x09E4
    float m_animBlendEndTime; // 0x09E8
    uint32_t m_animScriptSequence; // 0x09EC
    uint32_t m_animScriptModel; // 0x09F0
    uint32_t m_animIgnoreParentRot; // 0x09F4
    uint32_t m_animMotionMode; // 0x09F8
    uint32_t m_syncingWithEntity; // 0x0A74
    uint32_t [0008]; // 0x0AC8
    uint32_t [0009]; // 0x0ACC
    uint32_t m_predictedAnimEventCount; // 0x0AD0
    uint32_t m_predictedAnimEventTarget; // 0x0AD4
    uint32_t m_predictedAnimEventSequence; // 0x0AD8
    uint32_t m_predictedAnimEventModel; // 0x0ADC
    float m_predictedAnimEventsReadyToFireTime; // 0x0AE0
    uint32_t m_nRagdollImpactFXTableId; // 0x0AFC
    float m_flSkyScaleStartValue; // 0x0B00
    float m_flSkyScaleEndValue; // 0x0B04
    float m_flSkyScaleStartTime; // 0x0B08
    float m_flSkyScaleEndTime; // 0x0B0C
    uint32_t m_sequenceTransitionerLayerActive; // 0x0CA8
    float m_sequenceTransitionerLayerStartCycle; // 0x0CAC
    uint32_t m_sequenceTransitionerLayerSequence; // 0x0CB0
    float m_sequenceTransitionerLayerPlaybackRate; // 0x0CB8
    float m_sequenceTransitionerLayerStartTime; // 0x0CBC
    float m_sequenceTransitionerLayerFadeOutDuration; // 0x0CC0
    uint32_t m_sequenceTransitionerLayerCount; // 0x0CC8
    uint32_t m_itemFlavorGUID; // 0x0D4C
    uint32_t m_nSkin; // 0x0D58
    uint32_t m_skinMod; // 0x0D5C
    uint32_t m_nBody; // 0x0D64
    uint32_t m_camoIndex; // 0x0D68
    float m_nResetEventsStartTime; // 0x0D70
    float m_fireDeferredStopsStartTime; // 0x0D78
    uint32_t m_nForceBone; // 0x0DA8
    uint32_t m_bSequenceFinished; // 0x0E0C
    float m_lockedAnimDeltaYaw; // 0x0E10
    float m_flModelScale; // 0x0E18
    uint32_t m_bClientSideAnimation; // 0x0F0E
    uint32_t m_weaponOwner; // 0x15D0
    float m_lastPrimaryAttackTime; // 0x15D4
    float m_nextReadyTime; // 0x15D8
    float m_nextPrimaryAttackTime; // 0x15DC
    float m_attackTimeThisFrame; // 0x15E0
    uint32_t m_worldModelIndexOverride; // 0x15E4
    uint32_t m_iWorldModelIndex; // 0x15E8
    uint32_t m_holsterModelIndex; // 0x15EC
    uint32_t m_droppedModelIndex; // 0x15F0
    uint32_t m_idealSequence; // 0x15F4
    uint32_t m_idealActivity; // 0x15F6
    uint32_t m_weaponActivity; // 0x15F8
    uint32_t m_ActiveState; // 0x15FC
    uint32_t m_ammoInClip; // 0x1600
    uint32_t m_ammoInStockpile; // 0x1604
    uint32_t m_infiniteAmmoState; // 0x1608
    uint32_t m_lifetimeShots; // 0x160C
    float m_flTimeWeaponIdle; // 0x1610
    uint32_t m_weapState; // 0x1614
    uint32_t m_allowedToUse; // 0x1618
    uint32_t m_discarded; // 0x1619
    uint32_t m_bInReload; // 0x161A
    uint32_t m_forcedADS; // 0x161C
    uint32_t m_tossRelease; // 0x1620
    uint32_t m_offhandSwitchSlot; // 0x1624
    uint32_t m_energizeState; // 0x1628
    uint32_t m_lastEnergizeState; // 0x1629
    float m_startEnergizingTime; // 0x162C
    float m_energizedEndTime; // 0x1630
    float m_heatValue; // 0x1634
    float m_heatValueOnLastFire; // 0x1638
    uint32_t m_fullyHeated; // 0x163C
    uint32_t m_customActivity; // 0x163E
    uint32_t m_customActivitySequence; // 0x1640
    uint32_t m_customActivityOwner; // 0x1644
    float m_customActivityEndTime; // 0x1648
    uint32_t m_customActivityFlags; // 0x164C
    float m_moveSpread; // 0x1658
    float m_spreadStartTime; // 0x165C
    float m_spreadStartFracHip; // 0x1660
    float m_spreadStartFracADS; // 0x1664
    float m_kickSpreadHipfire; // 0x1668
    float m_kickSpreadADS; // 0x166C
    float m_kickTime; // 0x1670
    float m_kickScaleBasePitch; // 0x1674
    float m_kickScaleBaseYaw; // 0x1678
    float m_kickPatternScaleBase; // 0x167C
    float m_kickSpringHeatBaseTime; // 0x1680
    float m_kickSpringHeatBaseValue; // 0x1684
    float m_semiAutoTriggerHoldTime; // 0x1688
    float m_fastHolsterScale; // 0x168C
    uint32_t m_semiAutoTriggerDown; // 0x1690
    uint32_t m_pendingTriggerPull; // 0x1691
    uint32_t m_secondaryAttackRequested; // 0x1692
    uint32_t m_chargeDebounce; // 0x1693
    uint32_t m_semiAutoNeedsRechamber; // 0x1694
    uint32_t m_pendingReloadAttempt; // 0x1695
    uint32_t m_offhandHybridNormalMode; // 0x1696
    uint32_t m_pendingoffhandHybridToss; // 0x1697
    uint32_t m_fastHolster; // 0x1698
    uint32_t m_didFirstDeploy; // 0x1699
    uint32_t m_shouldCatch; // 0x169A
    uint32_t m_clipModelIsHidden; // 0x169B
    uint32_t m_segmentedReloadEndSeqRequired; // 0x169C
    uint32_t m_reloadStartedEmpty; // 0x169D
    uint32_t m_segmentedAnimStartedOneHanded; // 0x169E
    uint32_t m_segmentedAnimStartedAkimbo; // 0x169F
    uint32_t m_segmentedReloadCanRestartLoop; // 0x16A0
    uint32_t m_segmentedReloadLoopFireLocked; // 0x16A1
    uint32_t [0002]; // 0x16A4
    uint32_t [0003]; // 0x16A5
    uint32_t [0004]; // 0x16A6
    uint32_t [0005]; // 0x16A7
    uint32_t [0006]; // 0x16A8
    uint32_t [0007]; // 0x16A9
    uint32_t m_realtimeModCmdHead; // 0x16AA
    uint32_t m_realtimeModCmdCount; // 0x16AB
    uint32_t m_realtimeModCanADS; // 0x16AC
    uint32_t m_customActivityAttachedModelIndex; // 0x16B0
    uint32_t m_customActivityAttachedModelAttachmentId; // 0x16B4
    float m_fireRateLerp_startTime; // 0x16B8
    float m_fireRateLerp_startFraction; // 0x16BC
    float m_fireRateLerp_stopTime; // 0x16C0
    float m_fireRateLerp_stopFraction; // 0x16C4
    uint32_t m_chargeAnimIndex; // 0x16C8
    uint32_t m_chargeAnimIndexOld; // 0x16CC
    uint32_t m_proScreen_owner; // 0x16D0
    uint32_t m_proScreen_int0; // 0x16D4
    uint32_t m_proScreen_int1; // 0x16D8
    uint32_t m_proScreen_int2; // 0x16DC
    float m_proScreen_float0; // 0x16E0
    float m_proScreen_float1; // 0x16E4
    float m_proScreen_float2; // 0x16E8
    uint32_t m_reloadMilestone; // 0x16EC
    uint32_t m_rechamberMilestone; // 0x16F0
    uint32_t m_cooldownMilestone; // 0x16F4
    uint32_t m_prevSeqWeight; // 0x16F8
    float m_fullReloadStartTime; // 0x16FC
    float m_scriptTime0; // 0x1700
    float m_scriptTime1; // 0x1704
    uint32_t m_scriptFlags0; // 0x1708
    uint32_t m_scriptInt0; // 0x170C
    uint32_t m_scriptInt1; // 0x170E
    float m_curZoomFOV; // 0x1710
    float m_targetZoomFOV; // 0x1714
    float m_zoomFOVLerpTime; // 0x1718
    float m_zoomFOVLerpEndTime; // 0x171C
    float m_latestDryfireTime; // 0x1720
    float m_requestedAttackEndTime; // 0x1724
    uint32_t m_currentAltFireAnimIndex; // 0x1728
    uint32_t m_legendaryModelIndex; // 0x172C
    uint32_t m_charmModelIndex; // 0x1730
    uint32_t m_charmAttachment; // 0x1734
    uint32_t m_charmItemFlavorGUID; // 0x1738
    uint32_t m_akimboDisabled; // 0x173C
    uint32_t m_lastTossedGrenade; // 0x1740
    uint32_t m_targetingLaserEnabledScript; // 0x1744
    uint32_t m_needsReloadCheck; // 0x1745
    uint32_t m_needsEmptyCycleCheck; // 0x1746
    uint32_t m_skinOverride; // 0x1748
    uint32_t m_skinOverrideIsValid; // 0x174C
    float m_chargeStartTime; // 0x1750
    float m_chargeEndTime; // 0x1754
    float m_lastChargeFrac; // 0x1758
    float m_lastEnergizeFrac; // 0x175C
    float m_lastRegenTime; // 0x1760
    float m_cooldownEndTime; // 0x1764
    uint32_t m_stockPileWasDraining; // 0x1768
    uint32_t m_weaponIsCharging; // 0x1769
    uint32_t m_weaponChargeLevelIncreasedAnimPlaying; // 0x176A
    uint32_t m_lastChargeLevel; // 0x176C
    uint32_t m_lastFullyCharged; // 0x1770
    uint32_t m_chargeEnergyDepleteStepCounter; // 0x1774
    uint32_t m_burstFireCount; // 0x1778
    uint32_t m_burstFireIndex; // 0x177C
    uint32_t m_shotIndexForSpread; // 0x1780
    uint32_t m_shotCount; // 0x1784
    float m_sustainedDischargeEndTime; // 0x1788
    float m_sustainedLaserCurrentSpread; // 0x178C
    uint32_t m_sustainedDischargeIsInPrimaryAttack; // 0x1790
    uint32_t m_sustainedLaserNextRandomSeed; // 0x1791
    uint32_t [0000]; // 0x17AC
    uint32_t [0001]; // 0x17B0
    uint32_t m_curSharedEnergyCost; // 0x17B4
    uint32_t m_grappleWeaponNeedsDryfire; // 0x17B8
    float m_scriptFloat0; // 0x17BC
    float m_scriptVectorTransitionDuration; // 0x17C0
    float m_scriptVectorTransitionStartTime; // 0x17C4
    fVector3 m_scriptVectorTransitionStart; // 0x17C8
    fVector3 m_scriptVectorTransitionEnd; // 0x17D4
    fVector3 m_scriptVector; // 0x17E0
    uint32_t m_shouldPlayIdleAnims; // 0x17EC
    uint32_t m_shouldPlaySprintAnims; // 0x17ED
    uint32_t m_scriptActivated; // 0x17EE
    uint32_t m_curReactiveSkinKillCount; // 0x17EF
    uint32_t m_curReactiveSkinKnockdownCount; // 0x17F0
    float startTime; // 0x1800
    float durRampUp; // 0x1804
    float durPlateau; // 0x1808
    float durRampDown; // 0x180C
    uint32_t m_lockedSet; // 0x1810
    uint32_t m_isLoadoutPickup; // 0x1814
    uint32_t m_utilityEnt; // 0x1818
    uint32_t m_weaponNameIndex; // 0x1820
    uint32_t m_animModelIndexPredictingClientOnly; // 0x1824
    uint32_t m_animSequencePredictingClientOnly; // 0x1828
    uint32_t m_oaActiveOverride; // 0x182C
    uint32_t m_parentTurret; // 0x1830
    uint32_t m_sharedWeaponXp; // 0x1834
    uint32_t m_weaponIsActivelyFiring; // 0x3174
};

class CTEProjectileTrail {
public:
    uint32_t m_owner; // 0x0028
    fVector3 m_startPos; // 0x002C
    fVector3 m_endPos; // 0x0038
    uint32_t m_weaponClassIndex; // 0x0044
    uint32_t [0000]; // 0x0048
    uint32_t [0001]; // 0x004C
    uint32_t m_projectileTrailIndex; // 0x0050
    uint32_t m_impactEffectTable; // 0x0054
};

class CProjectile {
public:
    uint32_t m_cellX; // 0x0048
    uint32_t m_cellY; // 0x004C
    uint32_t m_cellZ; // 0x0050
    fVector3 m_localOrigin; // 0x0054
    uint32_t m_nModelIndex; // 0x0060
    uint32_t m_networkedFlags; // 0x02D4
    uint32_t m_iTeamNum; // 0x0334
    fVector3 m_vecVelocity; // 0x0378
    fVector3 m_localAngles; // 0x0384
    uint32_t m_hOwnerEntity; // 0x0398
    uint32_t m_CollisionGroup; // 0x0430
    uint32_t m_PredictableID; // 0x06C4
    uint64_t m_realmsBitMask; // 0x0918
    uint32_t m_weaponDataIsSet; // 0x15D0
    uint32_t m_forceAdjustToGunBarrelDisabled; // 0x15D1
    uint32_t m_weaponClassIndex; // 0x15D4
    float m_destructionDistance; // 0x15D8
    uint32_t m_passThroughDepthTotal; // 0x15DC
    uint32_t [0001]; // 0x15EC
    uint32_t m_projectileTrailIndex; // 0x15F0
    uint32_t m_impactEffectTable; // 0x15F4
    uint32_t m_reducedEffects; // 0x15F8
    float m_projectileCreationTimeServer; // 0x15FC
    uint32_t m_weaponSource; // 0x1600
    uint32_t m_passThroughModCount; // 0x1604
    uint32_t [0000]; // 0x1618
    fVector3 m_launchOrigin; // 0x161C
};

class CMissile {
public:
    uint32_t m_cellX; // 0x0048
    uint32_t m_cellY; // 0x004C
    uint32_t m_cellZ; // 0x0050
    fVector3 m_localOrigin; // 0x0054
    uint32_t m_nModelIndex; // 0x0060
    uint32_t m_networkedFlags; // 0x02D4
    uint32_t m_iTeamNum; // 0x0334
    fVector3 m_vecVelocity; // 0x0378
    fVector3 m_localAngles; // 0x0384
    uint32_t m_hOwnerEntity; // 0x0398
    uint32_t m_CollisionGroup; // 0x0430
    uint32_t m_PredictableID; // 0x06C4
    uint64_t m_realmsBitMask; // 0x0918
    uint32_t m_weaponDataIsSet; // 0x15D0
    uint32_t m_forceAdjustToGunBarrelDisabled; // 0x15D1
    uint32_t m_weaponClassIndex; // 0x15D4
    float m_destructionDistance; // 0x15D8
    uint32_t m_passThroughDepthTotal; // 0x15DC
    uint32_t [0001]; // 0x15EC
    uint32_t m_projectileTrailIndex; // 0x15F0
    uint32_t m_impactEffectTable; // 0x15F4
    uint32_t m_reducedEffects; // 0x15F8
    float m_projectileCreationTimeServer; // 0x15FC
    uint32_t m_weaponSource; // 0x1600
    uint32_t m_passThroughModCount; // 0x1604
    uint32_t [0000]; // 0x1618
    fVector3 m_launchOrigin; // 0x161C
    uint32_t m_hSpecificTarget; // 0x2F64
    fVector3 m_targetPosition; // 0x2F74
    uint32_t m_useTargetPosition; // 0x2F80
};

class CCrossbowBolt {
public:
    uint32_t m_cellX; // 0x0048
    uint32_t m_cellY; // 0x004C
    uint32_t m_cellZ; // 0x0050
    fVector3 m_localOrigin; // 0x0054
    uint32_t m_nModelIndex; // 0x0060
    uint32_t m_networkedFlags; // 0x02D4
    uint32_t m_iTeamNum; // 0x0334
    fVector3 m_vecVelocity; // 0x0378
    fVector3 m_localAngles; // 0x0384
    uint32_t m_hOwnerEntity; // 0x0398
    uint32_t m_CollisionGroup; // 0x0430
    uint32_t m_PredictableID; // 0x06C4
    uint64_t m_realmsBitMask; // 0x0918
    uint32_t m_weaponDataIsSet; // 0x15D0
    uint32_t m_forceAdjustToGunBarrelDisabled; // 0x15D1
    uint32_t m_weaponClassIndex; // 0x15D4
    float m_destructionDistance; // 0x15D8
    uint32_t m_passThroughDepthTotal; // 0x15DC
    uint32_t [0001]; // 0x15EC
    uint32_t m_projectileTrailIndex; // 0x15F0
    uint32_t m_impactEffectTable; // 0x15F4
    uint32_t m_reducedEffects; // 0x15F8
    float m_projectileCreationTimeServer; // 0x15FC
    uint32_t m_weaponSource; // 0x1600
    uint32_t m_passThroughModCount; // 0x1604
    uint32_t [0000]; // 0x1618
    fVector3 m_launchOrigin; // 0x161C
};

class CVortexSphere {
public:
    uint32_t movecollide; // 0x0000
    uint32_t movetype; // 0x0000
    uint32_t moveparent; // 0x001C
    uint32_t m_parentAttachment; // 0x0020
    uint32_t m_fEffects; // 0x0040
    uint32_t m_usableType; // 0x0044
    uint32_t m_cellX; // 0x0048
    uint32_t m_cellY; // 0x004C
    uint32_t m_cellZ; // 0x0050
    fVector3 m_localOrigin; // 0x0054
    uint32_t m_nModelIndex; // 0x0060
    uint32_t m_clrRender; // 0x0080
    uint32_t m_clIntensity; // 0x0084
    uint32_t m_spawnflags; // 0x00C4
    uint32_t m_bossPlayer; // 0x0154
    uint32_t [0004]; // 0x0208
    uint32_t [0005]; // 0x020C
    uint32_t [0006]; // 0x0210
    uint32_t [0007]; // 0x0214
    uint32_t [0002]; // 0x029B
    uint32_t [0003]; // 0x029C
    uint32_t m_highlightFocused; // 0x02A1
    float [0000]; // 0x02A4
    float [0001]; // 0x02A8
    uint32_t m_highlightFadeParity; // 0x02AC
    uint32_t m_wantsScopeHighlight; // 0x02D0
    uint32_t m_networkedFlags; // 0x02D4
    uint32_t m_ignoreParentRotation; // 0x02DC
    uint32_t m_iHealth; // 0x0324
    uint32_t m_visibilityFlags; // 0x032C
    uint32_t m_iTeamNum; // 0x0334
    uint32_t m_grade; // 0x0344
    uint32_t m_ignorePredictedTriggerFlags; // 0x0348
    uint32_t m_passThroughFlags; // 0x0350
    uint32_t m_passThroughThickness; // 0x0354
    float m_passThroughDirection; // 0x0358
    uint32_t m_bIsSoundCodeControllerValueSet; // 0x0370
    float m_flSoundCodeControllerValue; // 0x0374
    fVector3 m_localAngles; // 0x0384
    uint32_t m_hOwnerEntity; // 0x0398
    uint32_t m_bRenderWithViewModels; // 0x039C
    uint32_t m_nRenderFX; // 0x039D
    uint32_t m_nRenderMode; // 0x03A9
    fVector3 m_vecMins; // 0x03C0
    fVector3 m_vecMaxs; // 0x03CC
    uint32_t m_usSolidFlags; // 0x03D8
    uint32_t m_nSolidType; // 0x03DC
    uint32_t m_triggerBloat; // 0x03DD
    uint32_t m_collisionDetailLevel; // 0x03DE
    uint32_t m_nSurroundType; // 0x03EC
    fVector3 m_vecSpecifiedSurroundingMins; // 0x03F8
    fVector3 m_vecSpecifiedSurroundingMaxs; // 0x0404
    uint32_t m_CollisionGroup; // 0x0430
    uint32_t m_contents; // 0x0434
    uint32_t m_collideWithOwner; // 0x0438
    uint32_t m_iMaxHealth; // 0x0468
    const char* m_iSignifierName; // 0x0470
    const char* m_iName; // 0x0479
    uint32_t m_scriptNameIndex; // 0x0580
    uint32_t m_instanceNameIndex; // 0x0584
    const char* m_holdUsePrompt; // 0x0608
    const char* m_pressUsePrompt; // 0x0610
    uint32_t m_exclusiveUseEnt; // 0x0618
    uint32_t m_phaseShiftFlags; // 0x06B0
    uint32_t m_baseTakeDamage; // 0x06B4
    uint32_t m_invulnerableToDamageCount; // 0x06B8
    uint32_t m_PredictableID; // 0x06C4
    float m_attachmentLerpStartTime; // 0x072C
    float m_attachmentLerpEndTime; // 0x0730
    fVector3 m_attachmentLerpStartOrigin; // 0x0734
    fVector3 m_attachmentLerpStartAngles; // 0x0740
    uint32_t m_parentAttachmentModel; // 0x0750
    float m_fadeDist; // 0x075C
    uint32_t m_dissolveEffectEntityHandle; // 0x0804
    uint32_t m_usablePriority; // 0x0818
    float m_usableDistanceOverride; // 0x081C
    float m_usableFOV; // 0x0820
    float m_usePromptSize; // 0x0824
    uint32_t m_firstChildEntityLink; // 0x0910
    uint32_t m_firstParentEntityLink; // 0x0914
    uint64_t m_realmsBitMask; // 0x0918
    uint32_t m_enabled; // 0x0950
    float m_radius; // 0x0954
    float m_height; // 0x0958
    float m_bulletFov; // 0x095C
    uint32_t m_bulletAbsorbedCount; // 0x0960
    uint32_t m_projectileAbsorbedCount; // 0x0964
    uint32_t m_ownerWeapon; // 0x0968
    uint32_t m_vortexEffect; // 0x096C
    fVector3 m_vortexLocalAngles; // 0x0970
    const char* m_gunAttachment; // 0x0980
};

class CHealthKit {
public:
    uint32_t movecollide; // 0x0000
    uint32_t movetype; // 0x0000
    float m_animStartTime; // 0x0008
    float m_animStartCycle; // 0x000C
    float m_animPlaybackRate; // 0x0010
    uint32_t m_animModelIndex; // 0x0014
    uint32_t m_animSequence; // 0x001C
    uint32_t moveparent; // 0x001C
    uint32_t m_animFrozen; // 0x001E
    uint32_t m_bClientSideRagdoll; // 0x001F
    uint32_t m_parentAttachment; // 0x0020
    fVector3 m_vecForce; // 0x0020
    uint32_t m_fEffects; // 0x0040
    uint32_t m_usableType; // 0x0044
    uint32_t m_cellX; // 0x0048
    uint32_t m_cellY; // 0x004C
    uint32_t m_cellZ; // 0x0050
    fVector3 m_localOrigin; // 0x0054
    uint32_t m_nModelIndex; // 0x0060
    uint32_t m_clrRender; // 0x0080
    float [0010]; // 0x0080
    float [0011]; // 0x0084
    uint32_t m_clIntensity; // 0x0084
    float [0012]; // 0x0088
    float m_flEstIkOffset; // 0x008C
    float [0013]; // 0x008C
    float [0014]; // 0x0090
    float [0015]; // 0x0094
    float [0016]; // 0x0098
    float [0017]; // 0x009C
    float [0018]; // 0x00A0
    float [0019]; // 0x00A4
    float [0020]; // 0x00A8
    float [0021]; // 0x00AC
    float [0022]; // 0x00B0
    float [0023]; // 0x00B4
    uint32_t m_bossPlayer; // 0x0154
    uint32_t m_highlightFocused; // 0x02A1
    uint32_t m_highlightFadeParity; // 0x02AC
    uint32_t m_wantsScopeHighlight; // 0x02D0
    uint32_t m_networkedFlags; // 0x02D4
    uint32_t m_ignoreParentRotation; // 0x02DC
    uint32_t m_visibilityFlags; // 0x032C
    uint32_t m_iTeamNum; // 0x0334
    uint32_t m_grade; // 0x0344
    uint32_t m_ignorePredictedTriggerFlags; // 0x0348
    uint32_t m_passThroughFlags; // 0x0350
    uint32_t m_passThroughThickness; // 0x0354
    float m_passThroughDirection; // 0x0358
    uint32_t m_bIsSoundCodeControllerValueSet; // 0x0370
    float m_flSoundCodeControllerValue; // 0x0374
    fVector3 m_localAngles; // 0x0384
    uint32_t m_hOwnerEntity; // 0x0398
    uint32_t m_bRenderWithViewModels; // 0x039C
    uint32_t m_nRenderFX; // 0x039D
    uint32_t m_nRenderMode; // 0x03A9
    fVector3 m_vecMins; // 0x03C0
    fVector3 m_vecMaxs; // 0x03CC
    uint32_t m_usSolidFlags; // 0x03D8
    uint32_t m_nSolidType; // 0x03DC
    uint32_t m_triggerBloat; // 0x03DD
    uint32_t m_collisionDetailLevel; // 0x03DE
    uint32_t m_nSurroundType; // 0x03EC
    fVector3 m_vecSpecifiedSurroundingMins; // 0x03F8
    fVector3 m_vecSpecifiedSurroundingMaxs; // 0x0404
    uint32_t m_CollisionGroup; // 0x0430
    uint32_t m_contents; // 0x0434
    uint32_t m_collideWithOwner; // 0x0438
    const char* m_iSignifierName; // 0x0470
    const char* m_iName; // 0x0479
    uint32_t m_scriptNameIndex; // 0x0580
    uint32_t m_instanceNameIndex; // 0x0584
    const char* m_holdUsePrompt; // 0x0608
    const char* m_pressUsePrompt; // 0x0610
    uint32_t m_exclusiveUseEnt; // 0x0618
    uint32_t m_phaseShiftFlags; // 0x06B0
    uint32_t m_baseTakeDamage; // 0x06B4
    uint32_t m_invulnerableToDamageCount; // 0x06B8
    uint32_t m_passDamageToParent; // 0x06BC
    uint32_t m_PredictableID; // 0x06C4
    float m_attachmentLerpStartTime; // 0x072C
    float m_attachmentLerpEndTime; // 0x0730
    fVector3 m_attachmentLerpStartOrigin; // 0x0734
    fVector3 m_attachmentLerpStartAngles; // 0x0740
    uint32_t m_parentAttachmentModel; // 0x0750
    float m_fadeDist; // 0x075C
    uint32_t m_dissolveEffectEntityHandle; // 0x0804
    uint32_t m_usablePriority; // 0x0818
    float m_usableDistanceOverride; // 0x081C
    float m_usableFOV; // 0x0820
    float m_usePromptSize; // 0x0824
    uint64_t [0000]; // 0x0858
    uint64_t [0001]; // 0x0860
    uint64_t [0002]; // 0x0868
    uint64_t [0003]; // 0x0870
    uint32_t flags; // 0x0878
    uint32_t zOrder; // 0x087C
    uint32_t customState; // 0x0880
    float objectScale; // 0x0884
    uint32_t m_firstChildEntityLink; // 0x0910
    uint32_t m_firstParentEntityLink; // 0x0914
    uint64_t m_realmsBitMask; // 0x0918
    uint32_t m_animNetworkFlags; // 0x0978
    uint32_t m_animActive; // 0x097C
    uint32_t m_animCollisionEnabled; // 0x097F
    uint32_t m_animRelativeToGroundEnabled; // 0x0980
    uint32_t m_animPlantingEnabled; // 0x0981
    fVector3 m_animInitialPos; // 0x0984
    fVector3 m_animInitialVel; // 0x0990
    fVector4 m_animInitialRot; // 0x099C
    fVector3 m_animInitialCorrectPos; // 0x09AC
    fVector4 m_animInitialCorrectRot; // 0x09B8
    fVector3 m_animEntityToRefOffset; // 0x09C8
    fVector4 m_animEntityToRefRotation; // 0x09D4
    float m_animBlendBeginTime; // 0x09E4
    float m_animBlendEndTime; // 0x09E8
    uint32_t m_animScriptSequence; // 0x09EC
    uint32_t m_animScriptModel; // 0x09F0
    uint32_t m_animIgnoreParentRot; // 0x09F4
    uint32_t m_animMotionMode; // 0x09F8
    uint32_t m_syncingWithEntity; // 0x0A74
    uint32_t [0004]; // 0x0AB8
    uint32_t [0005]; // 0x0ABC
    uint32_t [0006]; // 0x0AC0
    uint32_t [0007]; // 0x0AC4
    uint32_t [0008]; // 0x0AC8
    uint32_t [0009]; // 0x0ACC
    uint32_t m_predictedAnimEventCount; // 0x0AD0
    uint32_t m_predictedAnimEventTarget; // 0x0AD4
    uint32_t m_predictedAnimEventSequence; // 0x0AD8
    uint32_t m_predictedAnimEventModel; // 0x0ADC
    float m_predictedAnimEventsReadyToFireTime; // 0x0AE0
    uint32_t m_nRagdollImpactFXTableId; // 0x0AFC
    float m_flSkyScaleStartValue; // 0x0B00
    float m_flSkyScaleEndValue; // 0x0B04
    float m_flSkyScaleStartTime; // 0x0B08
    float m_flSkyScaleEndTime; // 0x0B0C
    uint32_t m_sequenceTransitionerLayerActive; // 0x0CA8
    float m_sequenceTransitionerLayerStartCycle; // 0x0CAC
    uint32_t m_sequenceTransitionerLayerSequence; // 0x0CB0
    float m_sequenceTransitionerLayerPlaybackRate; // 0x0CB8
    float m_sequenceTransitionerLayerStartTime; // 0x0CBC
    float m_sequenceTransitionerLayerFadeOutDuration; // 0x0CC0
    uint32_t m_sequenceTransitionerLayerCount; // 0x0CC8
    uint32_t m_itemFlavorGUID; // 0x0D4C
    uint32_t m_nSkin; // 0x0D58
    uint32_t m_skinMod; // 0x0D5C
    uint32_t m_nBody; // 0x0D64
    uint32_t m_camoIndex; // 0x0D68
    float m_nResetEventsStartTime; // 0x0D70
    float m_fireDeferredStopsStartTime; // 0x0D78
    uint32_t m_nForceBone; // 0x0DA8
    uint32_t m_bSequenceFinished; // 0x0E0C
    float m_lockedAnimDeltaYaw; // 0x0E10
    float m_flModelScale; // 0x0E18
};

class CTurret {
public:
    uint32_t movecollide; // 0x0000
    uint32_t movetype; // 0x0000
    float m_animStartTime; // 0x0008
    float m_animStartCycle; // 0x000C
    float m_animPlaybackRate; // 0x0010
    uint32_t m_animModelIndex; // 0x0014
    uint32_t m_animSequence; // 0x001C
    uint32_t moveparent; // 0x001C
    uint32_t m_animFrozen; // 0x001E
    uint32_t m_bClientSideRagdoll; // 0x001F
    fVector3 m_vecForce; // 0x0020
    uint32_t m_parentAttachment; // 0x0020
    uint32_t m_fEffects; // 0x0040
    uint32_t m_usableType; // 0x0044
    uint32_t m_cellX; // 0x0048
    uint32_t m_cellY; // 0x004C
    uint32_t m_cellZ; // 0x0050
    fVector3 m_localOrigin; // 0x0054
    uint32_t m_nModelIndex; // 0x0060
    float [0010]; // 0x0080
    uint32_t m_clrRender; // 0x0080
    float [0011]; // 0x0084
    uint32_t m_clIntensity; // 0x0084
    float [0012]; // 0x0088
    float m_flEstIkOffset; // 0x008C
    float [0013]; // 0x008C
    float [0014]; // 0x0090
    float [0015]; // 0x0094
    float [0016]; // 0x0098
    float [0017]; // 0x009C
    float [0018]; // 0x00A0
    float [0019]; // 0x00A4
    float [0020]; // 0x00A8
    float [0021]; // 0x00AC
    float [0022]; // 0x00B0
    float [0023]; // 0x00B4
    uint32_t m_bossPlayer; // 0x0154
    uint32_t m_highlightFocused; // 0x02A1
    uint32_t m_highlightFadeParity; // 0x02AC
    uint32_t m_wantsScopeHighlight; // 0x02D0
    uint32_t m_networkedFlags; // 0x02D4
    uint32_t m_ignoreParentRotation; // 0x02DC
    uint32_t m_iHealth; // 0x0324
    uint32_t m_visibilityFlags; // 0x032C
    uint32_t m_iTeamNum; // 0x0334
    uint32_t m_grade; // 0x0344
    uint32_t m_ignorePredictedTriggerFlags; // 0x0348
    uint32_t m_passThroughFlags; // 0x0350
    uint32_t m_passThroughThickness; // 0x0354
    float m_passThroughDirection; // 0x0358
    uint32_t m_bIsSoundCodeControllerValueSet; // 0x0370
    float m_flSoundCodeControllerValue; // 0x0374
    fVector3 m_localAngles; // 0x0384
    uint32_t m_hOwnerEntity; // 0x0398
    uint32_t m_bRenderWithViewModels; // 0x039C
    uint32_t m_nRenderFX; // 0x039D
    uint32_t m_nRenderMode; // 0x03A9
    fVector3 m_vecMins; // 0x03C0
    fVector3 m_vecMaxs; // 0x03CC
    uint32_t m_usSolidFlags; // 0x03D8
    uint32_t m_nSolidType; // 0x03DC
    uint32_t m_triggerBloat; // 0x03DD
    uint32_t m_collisionDetailLevel; // 0x03DE
    uint32_t m_nSurroundType; // 0x03EC
    fVector3 m_vecSpecifiedSurroundingMins; // 0x03F8
    fVector3 m_vecSpecifiedSurroundingMaxs; // 0x0404
    uint32_t m_CollisionGroup; // 0x0430
    uint32_t m_contents; // 0x0434
    uint32_t m_collideWithOwner; // 0x0438
    uint32_t m_iMaxHealth; // 0x0468
    const char* m_iSignifierName; // 0x0470
    const char* m_iName; // 0x0479
    uint32_t m_scriptNameIndex; // 0x0580
    uint32_t m_instanceNameIndex; // 0x0584
    const char* m_holdUsePrompt; // 0x0608
    const char* m_pressUsePrompt; // 0x0610
    uint32_t m_exclusiveUseEnt; // 0x0618
    uint32_t m_phaseShiftFlags; // 0x06B0
    uint32_t m_baseTakeDamage; // 0x06B4
    uint32_t m_invulnerableToDamageCount; // 0x06B8
    uint32_t m_passDamageToParent; // 0x06BC
    uint32_t m_PredictableID; // 0x06C4
    float m_attachmentLerpStartTime; // 0x072C
    float m_attachmentLerpEndTime; // 0x0730
    fVector3 m_attachmentLerpStartOrigin; // 0x0734
    fVector3 m_attachmentLerpStartAngles; // 0x0740
    uint32_t m_parentAttachmentModel; // 0x0750
    float m_fadeDist; // 0x075C
    uint32_t m_dissolveEffectEntityHandle; // 0x0804
    uint32_t m_usablePriority; // 0x0818
    float m_usableDistanceOverride; // 0x081C
    float m_usableFOV; // 0x0820
    float m_usePromptSize; // 0x0824
    uint32_t m_firstChildEntityLink; // 0x0910
    uint32_t m_firstParentEntityLink; // 0x0914
    uint64_t m_realmsBitMask; // 0x0918
    uint32_t m_animNetworkFlags; // 0x0978
    uint32_t m_animActive; // 0x097C
    uint32_t m_animCollisionEnabled; // 0x097F
    uint32_t m_animRelativeToGroundEnabled; // 0x0980
    uint32_t m_animPlantingEnabled; // 0x0981
    fVector3 m_animInitialPos; // 0x0984
    fVector3 m_animInitialVel; // 0x0990
    fVector4 m_animInitialRot; // 0x099C
    fVector3 m_animInitialCorrectPos; // 0x09AC
    fVector4 m_animInitialCorrectRot; // 0x09B8
    fVector3 m_animEntityToRefOffset; // 0x09C8
    fVector4 m_animEntityToRefRotation; // 0x09D4
    float m_animBlendBeginTime; // 0x09E4
    float m_animBlendEndTime; // 0x09E8
    uint32_t m_animScriptSequence; // 0x09EC
    uint32_t m_animScriptModel; // 0x09F0
    uint32_t m_animIgnoreParentRot; // 0x09F4
    uint32_t m_animMotionMode; // 0x09F8
    uint32_t m_syncingWithEntity; // 0x0A74
    uint32_t [0009]; // 0x0ACC
    uint32_t m_predictedAnimEventCount; // 0x0AD0
    uint32_t m_predictedAnimEventTarget; // 0x0AD4
    uint32_t m_predictedAnimEventSequence; // 0x0AD8
    uint32_t m_predictedAnimEventModel; // 0x0ADC
    float m_predictedAnimEventsReadyToFireTime; // 0x0AE0
    uint32_t m_nRagdollImpactFXTableId; // 0x0AFC
    float m_flSkyScaleStartValue; // 0x0B00
    float m_flSkyScaleEndValue; // 0x0B04
    float m_flSkyScaleStartTime; // 0x0B08
    float m_flSkyScaleEndTime; // 0x0B0C
    uint32_t m_sequenceTransitionerLayerActive; // 0x0CA8
    float m_sequenceTransitionerLayerStartCycle; // 0x0CAC
    uint32_t m_sequenceTransitionerLayerSequence; // 0x0CB0
    float m_sequenceTransitionerLayerPlaybackRate; // 0x0CB8
    float m_sequenceTransitionerLayerStartTime; // 0x0CBC
    float m_sequenceTransitionerLayerFadeOutDuration; // 0x0CC0
    uint32_t m_sequenceTransitionerLayerCount; // 0x0CC8
    uint32_t m_itemFlavorGUID; // 0x0D4C
    uint32_t m_nSkin; // 0x0D58
    uint32_t m_skinMod; // 0x0D5C
    uint32_t m_nBody; // 0x0D64
    uint32_t m_camoIndex; // 0x0D68
    float m_nResetEventsStartTime; // 0x0D70
    float m_fireDeferredStopsStartTime; // 0x0D78
    uint32_t m_nForceBone; // 0x0DA8
    uint32_t m_bSequenceFinished; // 0x0E0C
    float m_lockedAnimDeltaYaw; // 0x0E10
    float m_flModelScale; // 0x0E18
    uint32_t m_AnimOverlayCount; // 0x16B0
    uint32_t [0000]; // 0x16E1
    uint32_t [0001]; // 0x16E2
    uint32_t [0002]; // 0x16E3
    uint32_t [0003]; // 0x16E4
    uint32_t [0004]; // 0x16E5
    uint32_t [0005]; // 0x16E6
    uint32_t [0006]; // 0x16E7
    uint32_t [0007]; // 0x16E8
    uint32_t [0008]; // 0x16E9
    uint32_t m_settingsIndex; // 0x1918
    uint32_t m_driver; // 0x192C
    float m_forceAimPitch; // 0x1954
    float m_forceAimYaw; // 0x1958
    float m_driverDetachTime; // 0x195C
    uint32_t m_driverState; // 0x1960
    uint32_t m_turretWeapon; // 0x1964
    const char* m_title; // 0x1970
};

class CScriptTraceVolume {
public:
    uint32_t movetype; // 0x0000
    uint32_t movecollide; // 0x0000
    uint32_t moveparent; // 0x001C
    uint32_t m_parentAttachment; // 0x0020
    uint32_t m_fEffects; // 0x0040
    uint32_t m_usableType; // 0x0044
    uint32_t m_cellX; // 0x0048
    uint32_t m_cellY; // 0x004C
    uint32_t m_cellZ; // 0x0050
    fVector3 m_localOrigin; // 0x0054
    uint32_t m_nModelIndex; // 0x0060
    uint32_t m_clrRender; // 0x0080
    uint32_t m_clIntensity; // 0x0084
    uint32_t m_bossPlayer; // 0x0154
    uint32_t [0004]; // 0x0208
    uint32_t [0005]; // 0x020C
    uint32_t [0006]; // 0x0210
    uint32_t [0007]; // 0x0214
    uint32_t [0002]; // 0x029B
    uint32_t [0003]; // 0x029C
    uint32_t m_highlightFocused; // 0x02A1
    float [0000]; // 0x02A4
    float [0001]; // 0x02A8
    uint32_t m_highlightFadeParity; // 0x02AC
    uint32_t m_wantsScopeHighlight; // 0x02D0
    uint32_t m_networkedFlags; // 0x02D4
    uint32_t m_ignoreParentRotation; // 0x02DC
    uint32_t m_visibilityFlags; // 0x032C
    uint32_t m_iTeamNum; // 0x0334
    uint32_t m_grade; // 0x0344
    uint32_t m_ignorePredictedTriggerFlags; // 0x0348
    uint32_t m_passThroughFlags; // 0x0350
    uint32_t m_passThroughThickness; // 0x0354
    float m_passThroughDirection; // 0x0358
    uint32_t m_bIsSoundCodeControllerValueSet; // 0x0370
    float m_flSoundCodeControllerValue; // 0x0374
    fVector3 m_localAngles; // 0x0384
    uint32_t m_hOwnerEntity; // 0x0398
    uint32_t m_bRenderWithViewModels; // 0x039C
    uint32_t m_nRenderFX; // 0x039D
    uint32_t m_nRenderMode; // 0x03A9
    fVector3 m_vecMins; // 0x03C0
    fVector3 m_vecMaxs; // 0x03CC
    uint32_t m_usSolidFlags; // 0x03D8
    uint32_t m_nSolidType; // 0x03DC
    uint32_t m_triggerBloat; // 0x03DD
    uint32_t m_collisionDetailLevel; // 0x03DE
    uint32_t m_nSurroundType; // 0x03EC
    fVector3 m_vecSpecifiedSurroundingMins; // 0x03F8
    fVector3 m_vecSpecifiedSurroundingMaxs; // 0x0404
    uint32_t m_CollisionGroup; // 0x0430
    uint32_t m_contents; // 0x0434
    uint32_t m_collideWithOwner; // 0x0438
    const char* m_iSignifierName; // 0x0470
    const char* m_iName; // 0x0479
    uint32_t m_scriptNameIndex; // 0x0580
    uint32_t m_instanceNameIndex; // 0x0584
    const char* m_holdUsePrompt; // 0x0608
    const char* m_pressUsePrompt; // 0x0610
    uint32_t m_exclusiveUseEnt; // 0x0618
    uint32_t m_phaseShiftFlags; // 0x06B0
    uint32_t m_baseTakeDamage; // 0x06B4
    uint32_t m_invulnerableToDamageCount; // 0x06B8
    uint32_t m_PredictableID; // 0x06C4
    float m_attachmentLerpStartTime; // 0x072C
    float m_attachmentLerpEndTime; // 0x0730
    fVector3 m_attachmentLerpStartOrigin; // 0x0734
    fVector3 m_attachmentLerpStartAngles; // 0x0740
    uint32_t m_parentAttachmentModel; // 0x0750
    float m_fadeDist; // 0x075C
    uint32_t m_dissolveEffectEntityHandle; // 0x0804
    uint32_t m_usablePriority; // 0x0818
    float m_usableDistanceOverride; // 0x081C
    float m_usableFOV; // 0x0820
    float m_usePromptSize; // 0x0824
    uint32_t m_firstChildEntityLink; // 0x0910
    uint32_t m_firstParentEntityLink; // 0x0914
    uint64_t m_realmsBitMask; // 0x0918
    uint32_t m_shapeType; // 0x0950
    float m_sphereRadius; // 0x0954
    fVector3 m_boxMins; // 0x0958
    fVector3 m_boxMaxs; // 0x0964
    uint32_t m_drawDebug; // 0x0970
};

class CGrappleHook {
public:
    uint32_t moveparent; // 0x001C
    uint32_t m_parentAttachment; // 0x0020
    uint32_t m_cellX; // 0x0048
    uint32_t m_cellY; // 0x004C
    uint32_t m_cellZ; // 0x0050
    fVector3 m_localOrigin; // 0x0054
    uint32_t m_nModelIndex; // 0x0060
    uint32_t m_visibilityFlags; // 0x032C
    fVector3 m_localAngles; // 0x0384
    uint32_t m_hOwnerEntity; // 0x0398
    uint64_t m_realmsBitMask; // 0x0918
    uint32_t m_grappleZipline; // 0x15D0
};

class CPredictedFirstPersonProxy {
public:
    uint32_t movecollide; // 0x0000
    uint32_t movetype; // 0x0000
    float m_animStartTime; // 0x0008
    float m_animStartCycle; // 0x000C
    float m_animPlaybackRate; // 0x0010
    uint32_t m_animModelIndex; // 0x0014
    uint32_t moveparent; // 0x001C
    uint32_t m_animSequence; // 0x001C
    uint32_t m_animFrozen; // 0x001E
    uint32_t m_bClientSideRagdoll; // 0x001F
    uint32_t m_parentAttachment; // 0x0020
    fVector3 m_vecForce; // 0x0020
    uint32_t m_fEffects; // 0x0040
    uint32_t m_usableType; // 0x0044
    uint32_t m_cellX; // 0x0048
    uint32_t m_cellY; // 0x004C
    uint32_t m_cellZ; // 0x0050
    fVector3 m_localOrigin; // 0x0054
    uint32_t m_nModelIndex; // 0x0060
    uint32_t m_clrRender; // 0x0080
    float [0010]; // 0x0080
    uint32_t m_clIntensity; // 0x0084
    float [0011]; // 0x0084
    float [0012]; // 0x0088
    float m_flEstIkOffset; // 0x008C
    float [0013]; // 0x008C
    float [0014]; // 0x0090
    float [0015]; // 0x0094
    float [0016]; // 0x0098
    float [0017]; // 0x009C
    float [0018]; // 0x00A0
    float [0019]; // 0x00A4
    float [0020]; // 0x00A8
    float [0021]; // 0x00AC
    float [0022]; // 0x00B0
    float [0023]; // 0x00B4
    uint32_t m_bossPlayer; // 0x0154
    uint32_t m_highlightFocused; // 0x02A1
    uint32_t m_highlightFadeParity; // 0x02AC
    uint32_t m_wantsScopeHighlight; // 0x02D0
    uint32_t m_networkedFlags; // 0x02D4
    uint32_t m_ignoreParentRotation; // 0x02DC
    uint32_t m_visibilityFlags; // 0x032C
    uint32_t m_iTeamNum; // 0x0334
    uint32_t m_grade; // 0x0344
    uint32_t m_ignorePredictedTriggerFlags; // 0x0348
    uint32_t m_passThroughFlags; // 0x0350
    uint32_t m_passThroughThickness; // 0x0354
    float m_passThroughDirection; // 0x0358
    uint32_t m_bIsSoundCodeControllerValueSet; // 0x0370
    float m_flSoundCodeControllerValue; // 0x0374
    fVector3 m_localAngles; // 0x0384
    uint32_t m_hOwnerEntity; // 0x0398
    uint32_t m_bRenderWithViewModels; // 0x039C
    uint32_t m_nRenderFX; // 0x039D
    uint32_t m_nRenderMode; // 0x03A9
    fVector3 m_vecMins; // 0x03C0
    fVector3 m_vecMaxs; // 0x03CC
    uint32_t m_usSolidFlags; // 0x03D8
    uint32_t m_nSolidType; // 0x03DC
    uint32_t m_triggerBloat; // 0x03DD
    uint32_t m_collisionDetailLevel; // 0x03DE
    uint32_t m_nSurroundType; // 0x03EC
    fVector3 m_vecSpecifiedSurroundingMins; // 0x03F8
    fVector3 m_vecSpecifiedSurroundingMaxs; // 0x0404
    uint32_t m_CollisionGroup; // 0x0430
    uint32_t m_contents; // 0x0434
    uint32_t m_collideWithOwner; // 0x0438
    const char* m_iSignifierName; // 0x0470
    const char* m_iName; // 0x0479
    uint32_t m_scriptNameIndex; // 0x0580
    uint32_t m_instanceNameIndex; // 0x0584
    const char* m_holdUsePrompt; // 0x0608
    const char* m_pressUsePrompt; // 0x0610
    uint32_t m_exclusiveUseEnt; // 0x0618
    uint32_t m_phaseShiftFlags; // 0x06B0
    uint32_t m_baseTakeDamage; // 0x06B4
    uint32_t m_invulnerableToDamageCount; // 0x06B8
    uint32_t m_passDamageToParent; // 0x06BC
    uint32_t m_PredictableID; // 0x06C4
    float m_attachmentLerpStartTime; // 0x072C
    float m_attachmentLerpEndTime; // 0x0730
    fVector3 m_attachmentLerpStartOrigin; // 0x0734
    fVector3 m_attachmentLerpStartAngles; // 0x0740
    uint32_t m_parentAttachmentModel; // 0x0750
    float m_fadeDist; // 0x075C
    uint32_t m_dissolveEffectEntityHandle; // 0x0804
    uint32_t m_usablePriority; // 0x0818
    float m_usableDistanceOverride; // 0x081C
    float m_usableFOV; // 0x0820
    float m_usePromptSize; // 0x0824
    uint32_t m_firstChildEntityLink; // 0x0910
    uint32_t m_firstParentEntityLink; // 0x0914
    uint64_t m_realmsBitMask; // 0x0918
    uint32_t m_animNetworkFlags; // 0x0978
    uint32_t m_animActive; // 0x097C
    uint32_t m_animCollisionEnabled; // 0x097F
    uint32_t m_animRelativeToGroundEnabled; // 0x0980
    uint32_t m_animPlantingEnabled; // 0x0981
    fVector3 m_animInitialPos; // 0x0984
    fVector3 m_animInitialVel; // 0x0990
    fVector4 m_animInitialRot; // 0x099C
    fVector3 m_animInitialCorrectPos; // 0x09AC
    fVector4 m_animInitialCorrectRot; // 0x09B8
    fVector3 m_animEntityToRefOffset; // 0x09C8
    fVector4 m_animEntityToRefRotation; // 0x09D4
    float m_animBlendBeginTime; // 0x09E4
    float m_animBlendEndTime; // 0x09E8
    uint32_t m_animScriptSequence; // 0x09EC
    uint32_t m_animScriptModel; // 0x09F0
    uint32_t m_animIgnoreParentRot; // 0x09F4
    uint32_t m_animMotionMode; // 0x09F8
    uint32_t m_syncingWithEntity; // 0x0A74
    uint32_t [0000]; // 0x0AA8
    uint32_t [0001]; // 0x0AAC
    uint32_t [0002]; // 0x0AB0
    uint32_t [0003]; // 0x0AB4
    uint32_t [0004]; // 0x0AB8
    uint32_t [0005]; // 0x0ABC
    uint32_t [0006]; // 0x0AC0
    uint32_t [0007]; // 0x0AC4
    uint32_t [0008]; // 0x0AC8
    uint32_t [0009]; // 0x0ACC
    uint32_t m_predictedAnimEventCount; // 0x0AD0
    uint32_t m_predictedAnimEventTarget; // 0x0AD4
    uint32_t m_predictedAnimEventSequence; // 0x0AD8
    uint32_t m_predictedAnimEventModel; // 0x0ADC
    float m_predictedAnimEventsReadyToFireTime; // 0x0AE0
    uint32_t m_nRagdollImpactFXTableId; // 0x0AFC
    float m_flSkyScaleStartValue; // 0x0B00
    float m_flSkyScaleEndValue; // 0x0B04
    float m_flSkyScaleStartTime; // 0x0B08
    float m_flSkyScaleEndTime; // 0x0B0C
    uint32_t m_sequenceTransitionerLayerActive; // 0x0CA8
    float m_sequenceTransitionerLayerStartCycle; // 0x0CAC
    uint32_t m_sequenceTransitionerLayerSequence; // 0x0CB0
    float m_sequenceTransitionerLayerPlaybackRate; // 0x0CB8
    float m_sequenceTransitionerLayerStartTime; // 0x0CBC
    float m_sequenceTransitionerLayerFadeOutDuration; // 0x0CC0
    uint32_t m_sequenceTransitionerLayerCount; // 0x0CC8
    uint32_t m_itemFlavorGUID; // 0x0D4C
    uint32_t m_nSkin; // 0x0D58
    uint32_t m_skinMod; // 0x0D5C
    uint32_t m_nBody; // 0x0D64
    uint32_t m_camoIndex; // 0x0D68
    float m_nResetEventsStartTime; // 0x0D70
    float m_fireDeferredStopsStartTime; // 0x0D78
    uint32_t m_nForceBone; // 0x0DA8
    uint32_t m_bSequenceFinished; // 0x0E0C
    float m_lockedAnimDeltaYaw; // 0x0E10
    float m_flModelScale; // 0x0E18
    uint32_t m_viewModelOwner; // 0x1600
};

class CFirstPersonProxy {
public:
    uint32_t movecollide; // 0x0000
    uint32_t movetype; // 0x0000
    float m_animStartTime; // 0x0008
    float m_animStartCycle; // 0x000C
    float m_animPlaybackRate; // 0x0010
    uint32_t m_animModelIndex; // 0x0014
    uint32_t moveparent; // 0x001C
    uint32_t m_animSequence; // 0x001C
    uint32_t m_animFrozen; // 0x001E
    uint32_t m_bClientSideRagdoll; // 0x001F
    uint32_t m_parentAttachment; // 0x0020
    fVector3 m_vecForce; // 0x0020
    uint32_t m_fEffects; // 0x0040
    uint32_t m_usableType; // 0x0044
    uint32_t m_cellX; // 0x0048
    uint32_t m_cellY; // 0x004C
    uint32_t m_cellZ; // 0x0050
    fVector3 m_localOrigin; // 0x0054
    uint32_t m_nModelIndex; // 0x0060
    uint32_t m_clrRender; // 0x0080
    float [0010]; // 0x0080
    uint32_t m_clIntensity; // 0x0084
    float [0011]; // 0x0084
    float [0012]; // 0x0088
    float m_flEstIkOffset; // 0x008C
    float [0013]; // 0x008C
    float [0014]; // 0x0090
    float [0015]; // 0x0094
    float [0016]; // 0x0098
    float [0017]; // 0x009C
    float [0018]; // 0x00A0
    float [0019]; // 0x00A4
    float [0020]; // 0x00A8
    float [0021]; // 0x00AC
    float [0022]; // 0x00B0
    float [0023]; // 0x00B4
    uint32_t m_bossPlayer; // 0x0154
    uint32_t m_highlightFocused; // 0x02A1
    uint32_t m_highlightFadeParity; // 0x02AC
    uint32_t m_wantsScopeHighlight; // 0x02D0
    uint32_t m_networkedFlags; // 0x02D4
    uint32_t m_ignoreParentRotation; // 0x02DC
    uint32_t m_visibilityFlags; // 0x032C
    uint32_t m_iTeamNum; // 0x0334
    uint32_t m_grade; // 0x0344
    uint32_t m_ignorePredictedTriggerFlags; // 0x0348
    uint32_t m_passThroughFlags; // 0x0350
    uint32_t m_passThroughThickness; // 0x0354
    float m_passThroughDirection; // 0x0358
    uint32_t m_bIsSoundCodeControllerValueSet; // 0x0370
    float m_flSoundCodeControllerValue; // 0x0374
    fVector3 m_localAngles; // 0x0384
    uint32_t m_hOwnerEntity; // 0x0398
    uint32_t m_bRenderWithViewModels; // 0x039C
    uint32_t m_nRenderFX; // 0x039D
    uint32_t m_nRenderMode; // 0x03A9
    fVector3 m_vecMins; // 0x03C0
    fVector3 m_vecMaxs; // 0x03CC
    uint32_t m_usSolidFlags; // 0x03D8
    uint32_t m_nSolidType; // 0x03DC
    uint32_t m_triggerBloat; // 0x03DD
    uint32_t m_collisionDetailLevel; // 0x03DE
    uint32_t m_nSurroundType; // 0x03EC
    fVector3 m_vecSpecifiedSurroundingMins; // 0x03F8
    fVector3 m_vecSpecifiedSurroundingMaxs; // 0x0404
    uint32_t m_CollisionGroup; // 0x0430
    uint32_t m_contents; // 0x0434
    uint32_t m_collideWithOwner; // 0x0438
    const char* m_iSignifierName; // 0x0470
    const char* m_iName; // 0x0479
    uint32_t m_scriptNameIndex; // 0x0580
    uint32_t m_instanceNameIndex; // 0x0584
    const char* m_holdUsePrompt; // 0x0608
    const char* m_pressUsePrompt; // 0x0610
    uint32_t m_exclusiveUseEnt; // 0x0618
    uint32_t m_phaseShiftFlags; // 0x06B0
    uint32_t m_baseTakeDamage; // 0x06B4
    uint32_t m_invulnerableToDamageCount; // 0x06B8
    uint32_t m_passDamageToParent; // 0x06BC
    uint32_t m_PredictableID; // 0x06C4
    float m_attachmentLerpStartTime; // 0x072C
    float m_attachmentLerpEndTime; // 0x0730
    fVector3 m_attachmentLerpStartOrigin; // 0x0734
    fVector3 m_attachmentLerpStartAngles; // 0x0740
    uint32_t m_parentAttachmentModel; // 0x0750
    float m_fadeDist; // 0x075C
    uint32_t m_dissolveEffectEntityHandle; // 0x0804
    uint32_t m_usablePriority; // 0x0818
    float m_usableDistanceOverride; // 0x081C
    float m_usableFOV; // 0x0820
    float m_usePromptSize; // 0x0824
    uint32_t m_firstChildEntityLink; // 0x0910
    uint32_t m_firstParentEntityLink; // 0x0914
    uint64_t m_realmsBitMask; // 0x0918
    uint32_t m_animNetworkFlags; // 0x0978
    uint32_t m_animActive; // 0x097C
    uint32_t m_animCollisionEnabled; // 0x097F
    uint32_t m_animRelativeToGroundEnabled; // 0x0980
    uint32_t m_animPlantingEnabled; // 0x0981
    fVector3 m_animInitialPos; // 0x0984
    fVector3 m_animInitialVel; // 0x0990
    fVector4 m_animInitialRot; // 0x099C
    fVector3 m_animInitialCorrectPos; // 0x09AC
    fVector4 m_animInitialCorrectRot; // 0x09B8
    fVector3 m_animEntityToRefOffset; // 0x09C8
    fVector4 m_animEntityToRefRotation; // 0x09D4
    float m_animBlendBeginTime; // 0x09E4
    float m_animBlendEndTime; // 0x09E8
    uint32_t m_animScriptSequence; // 0x09EC
    uint32_t m_animScriptModel; // 0x09F0
    uint32_t m_animIgnoreParentRot; // 0x09F4
    uint32_t m_animMotionMode; // 0x09F8
    uint32_t m_syncingWithEntity; // 0x0A74
    uint32_t [0000]; // 0x0AA8
    uint32_t [0001]; // 0x0AAC
    uint32_t [0002]; // 0x0AB0
    uint32_t [0003]; // 0x0AB4
    uint32_t [0004]; // 0x0AB8
    uint32_t [0005]; // 0x0ABC
    uint32_t [0006]; // 0x0AC0
    uint32_t [0007]; // 0x0AC4
    uint32_t [0008]; // 0x0AC8
    uint32_t [0009]; // 0x0ACC
    uint32_t m_predictedAnimEventCount; // 0x0AD0
    uint32_t m_predictedAnimEventTarget; // 0x0AD4
    uint32_t m_predictedAnimEventSequence; // 0x0AD8
    uint32_t m_predictedAnimEventModel; // 0x0ADC
    float m_predictedAnimEventsReadyToFireTime; // 0x0AE0
    uint32_t m_nRagdollImpactFXTableId; // 0x0AFC
    float m_flSkyScaleStartValue; // 0x0B00
    float m_flSkyScaleEndValue; // 0x0B04
    float m_flSkyScaleStartTime; // 0x0B08
    float m_flSkyScaleEndTime; // 0x0B0C
    uint32_t m_sequenceTransitionerLayerActive; // 0x0CA8
    float m_sequenceTransitionerLayerStartCycle; // 0x0CAC
    uint32_t m_sequenceTransitionerLayerSequence; // 0x0CB0
    float m_sequenceTransitionerLayerPlaybackRate; // 0x0CB8
    float m_sequenceTransitionerLayerStartTime; // 0x0CBC
    float m_sequenceTransitionerLayerFadeOutDuration; // 0x0CC0
    uint32_t m_sequenceTransitionerLayerCount; // 0x0CC8
    uint32_t m_itemFlavorGUID; // 0x0D4C
    uint32_t m_nSkin; // 0x0D58
    uint32_t m_skinMod; // 0x0D5C
    uint32_t m_nBody; // 0x0D64
    uint32_t m_camoIndex; // 0x0D68
    float m_nResetEventsStartTime; // 0x0D70
    float m_fireDeferredStopsStartTime; // 0x0D78
    uint32_t m_nForceBone; // 0x0DA8
    uint32_t m_bSequenceFinished; // 0x0E0C
    float m_lockedAnimDeltaYaw; // 0x0E10
    float m_flModelScale; // 0x0E18
    uint32_t m_viewModelOwner; // 0x1600
};

class CPortal_PointPush {
public:
    uint32_t movetype; // 0x0000
    uint32_t movecollide; // 0x0000
    uint32_t moveparent; // 0x001C
    uint32_t m_parentAttachment; // 0x0020
    uint32_t m_fEffects; // 0x0040
    uint32_t m_usableType; // 0x0044
    uint32_t m_cellX; // 0x0048
    uint32_t m_cellY; // 0x004C
    uint32_t m_cellZ; // 0x0050
    fVector3 m_localOrigin; // 0x0054
    uint32_t m_nModelIndex; // 0x0060
    uint32_t m_clrRender; // 0x0080
    uint32_t m_clIntensity; // 0x0084
    uint32_t m_bossPlayer; // 0x0154
    uint32_t [0004]; // 0x0208
    uint32_t [0005]; // 0x020C
    uint32_t [0006]; // 0x0210
    uint32_t [0007]; // 0x0214
    uint32_t [0002]; // 0x029B
    uint32_t [0003]; // 0x029C
    uint32_t m_highlightFocused; // 0x02A1
    float [0000]; // 0x02A4
    float [0001]; // 0x02A8
    uint32_t m_highlightFadeParity; // 0x02AC
    uint32_t m_wantsScopeHighlight; // 0x02D0
    uint32_t m_networkedFlags; // 0x02D4
    uint32_t m_ignoreParentRotation; // 0x02DC
    uint32_t m_visibilityFlags; // 0x032C
    uint32_t m_iTeamNum; // 0x0334
    uint32_t m_grade; // 0x0344
    uint32_t m_ignorePredictedTriggerFlags; // 0x0348
    uint32_t m_passThroughFlags; // 0x0350
    uint32_t m_passThroughThickness; // 0x0354
    float m_passThroughDirection; // 0x0358
    uint32_t m_bIsSoundCodeControllerValueSet; // 0x0370
    float m_flSoundCodeControllerValue; // 0x0374
    fVector3 m_localAngles; // 0x0384
    uint32_t m_hOwnerEntity; // 0x0398
    uint32_t m_bRenderWithViewModels; // 0x039C
    uint32_t m_nRenderFX; // 0x039D
    uint32_t m_nRenderMode; // 0x03A9
    fVector3 m_vecMins; // 0x03C0
    fVector3 m_vecMaxs; // 0x03CC
    uint32_t m_usSolidFlags; // 0x03D8
    uint32_t m_nSolidType; // 0x03DC
    uint32_t m_triggerBloat; // 0x03DD
    uint32_t m_collisionDetailLevel; // 0x03DE
    uint32_t m_nSurroundType; // 0x03EC
    fVector3 m_vecSpecifiedSurroundingMins; // 0x03F8
    fVector3 m_vecSpecifiedSurroundingMaxs; // 0x0404
    uint32_t m_CollisionGroup; // 0x0430
    uint32_t m_contents; // 0x0434
    uint32_t m_collideWithOwner; // 0x0438
    const char* m_iSignifierName; // 0x0470
    const char* m_iName; // 0x0479
    uint32_t m_scriptNameIndex; // 0x0580
    uint32_t m_instanceNameIndex; // 0x0584
    const char* m_holdUsePrompt; // 0x0608
    const char* m_pressUsePrompt; // 0x0610
    uint32_t m_exclusiveUseEnt; // 0x0618
    uint32_t m_phaseShiftFlags; // 0x06B0
    uint32_t m_baseTakeDamage; // 0x06B4
    uint32_t m_invulnerableToDamageCount; // 0x06B8
    uint32_t m_PredictableID; // 0x06C4
    float m_attachmentLerpStartTime; // 0x072C
    float m_attachmentLerpEndTime; // 0x0730
    fVector3 m_attachmentLerpStartOrigin; // 0x0734
    fVector3 m_attachmentLerpStartAngles; // 0x0740
    uint32_t m_parentAttachmentModel; // 0x0750
    float m_fadeDist; // 0x075C
    uint32_t m_dissolveEffectEntityHandle; // 0x0804
    uint32_t m_usablePriority; // 0x0818
    float m_usableDistanceOverride; // 0x081C
    float m_usableFOV; // 0x0820
    float m_usePromptSize; // 0x0824
    uint32_t m_firstChildEntityLink; // 0x0910
    uint32_t m_firstParentEntityLink; // 0x0914
    uint64_t m_realmsBitMask; // 0x0918
    uint32_t m_bEnabled; // 0x0950
    float m_flMagnitude; // 0x0954
    float m_flRadius; // 0x0958
    float m_flInnerRadius; // 0x095C
    float m_flConeOfInfluence; // 0x0960
};

