// Generated by Voidie

class CTEBubbleTrail // parent CBaseTempEntity {
public:
    fVector3 m_vecMins; // 0x0020
    fVector3 m_vecMaxs; // 0x002C
    float m_flWaterZ; // 0x0038
    uint32_t m_nModelIndex; // 0x003C
    uint32_t m_nCount; // 0x0040
    float m_fSpeed; // 0x0044
};

class CTEClientProjectile // parent CBaseTempEntity {
public:
    fVector3 m_vecOrigin; // 0x0020
    fVector3 m_vecVelocity; // 0x002C
    uint32_t m_nModelIndex; // 0x0038
    uint32_t m_nLifeTime; // 0x003C
    uint32_t m_hOwner; // 0x0040
};

class CTestTraceline {
public:
    uint32_t m_clrRender; // 0x0090
    uint32_t moveparent; // 0x020C
    fVector3 m_vecOrigin; // 0x0428
    float m_angRotation[0]; // 0x0434
    float m_angRotation[1]; // 0x0438
    float m_angRotation[2]; // 0x043C
};

class CTEWorldDecal // parent CBaseTempEntity {
public:
    fVector3 m_vecOrigin; // 0x0020
    uint32_t m_nIndex; // 0x002C
};

class CTESprite // parent CBaseTempEntity {
public:
    fVector3 m_vecOrigin; // 0x0020
    uint32_t m_nModelIndex; // 0x002C
    float m_fScale; // 0x0030
    uint32_t m_nBrightness; // 0x0034
};

class CTESpriteSpray // parent CBaseTempEntity {
public:
    fVector3 m_vecOrigin; // 0x0020
    fVector3 m_vecDirection; // 0x002C
    uint32_t m_nModelIndex; // 0x0038
    uint32_t m_nSpeed; // 0x003C
    float m_fNoise; // 0x0040
    uint32_t m_nCount; // 0x0044
};

class CTESparks // parent CBaseTempEntity {
public:
    float m_vecOrigin[0]; // 0x0020
    float m_vecOrigin[1]; // 0x0024
    float m_vecOrigin[2]; // 0x0028
    uint32_t m_nMagnitude; // 0x0030
    uint32_t m_nTrailLength; // 0x0034
    fVector3 m_vecDir; // 0x0038
};

class CEmbers // parent CBaseEntity {
public:
    uint32_t movecollide; // 0x0000
    uint32_t movetype; // 0x0000
    uint32_t m_nRenderFX; // 0x008C
    uint32_t m_clrRender; // 0x0090
    uint32_t m_flAnimTime; // 0x00A0
    uint32_t m_flSimulationTime; // 0x00A8
    uint32_t m_ubInterpolationFrame; // 0x00B4
    uint32_t m_fEffects; // 0x00B8
    uint32_t m_nRenderMode; // 0x00BC
    uint32_t m_nModelIndex; // 0x00CC
    uint32_t m_iTeamNum; // 0x00D8
    uint32_t m_PredictableID; // 0x00DC
    uint32_t m_iParentAttachment; // 0x01F6
    uint32_t moveparent; // 0x020C
    fVector3 m_vecMinsPreScaled; // 0x0230
    fVector3 m_vecMaxsPreScaled; // 0x023C
    fVector3 m_vecMins; // 0x0248
    fVector3 m_vecMaxs; // 0x0254
    uint32_t m_usSolidFlags; // 0x0264
    uint32_t m_nSurroundType; // 0x0268
    uint32_t m_nSolidType; // 0x0269
    uint32_t m_triggerBloat; // 0x026A
    uint32_t m_bUniformTriggerBloat; // 0x026B
    fVector3 m_vecSpecifiedSurroundingMinsPreScaled; // 0x026C
    fVector3 m_vecSpecifiedSurroundingMaxsPreScaled; // 0x0278
    fVector3 m_vecSpecifiedSurroundingMins; // 0x0284
    fVector3 m_vecSpecifiedSurroundingMaxs; // 0x0290
    float m_flElasticity; // 0x02F0
    float m_flShadowCastDistance; // 0x02F4
    fVector3 m_vecOrigin; // 0x0428
    fVector3 m_angRotation; // 0x0434
    uint32_t m_CollisionGroup; // 0x0444
    uint32_t m_bIsPlayerSimulated; // 0x0724
    uint32_t m_bSimulatedEveryTick; // 0x0725
    uint32_t m_bAnimatedEveryTick; // 0x0726
    uint32_t m_bAlternateSorting; // 0x0727
    uint32_t m_iTextureFrameIndex; // 0x0728
    uint32_t m_hOwnerEntity; // 0x0734
    uint32_t m_hEffectEntity; // 0x0738
    uint32_t m_nDensity; // 0x0788
    uint32_t m_nLifetime; // 0x078C
    uint32_t m_nSpeed; // 0x0790
    uint32_t m_bEmit; // 0x0794
};

class CTEShowLine // parent CBaseTempEntity {
public:
    float m_vecOrigin[0]; // 0x0020
    float m_vecOrigin[1]; // 0x0024
    float m_vecOrigin[2]; // 0x0028
    fVector3 m_vecEnd; // 0x0030
};

class SporeTrail // parent CBaseEntity {
public:
    uint32_t movecollide; // 0x0000
    uint32_t movetype; // 0x0000
    uint32_t m_nRenderFX; // 0x008C
    uint32_t m_clrRender; // 0x0090
    uint32_t m_flAnimTime; // 0x00A0
    uint32_t m_flSimulationTime; // 0x00A8
    uint32_t m_ubInterpolationFrame; // 0x00B4
    uint32_t m_fEffects; // 0x00B8
    uint32_t m_nRenderMode; // 0x00BC
    uint32_t m_nModelIndex; // 0x00CC
    uint32_t m_iTeamNum; // 0x00D8
    uint32_t m_PredictableID; // 0x00DC
    uint32_t m_iParentAttachment; // 0x01F6
    uint32_t moveparent; // 0x020C
    fVector3 m_vecMinsPreScaled; // 0x0230
    fVector3 m_vecMaxsPreScaled; // 0x023C
    fVector3 m_vecMins; // 0x0248
    fVector3 m_vecMaxs; // 0x0254
    uint32_t m_usSolidFlags; // 0x0264
    uint32_t m_nSurroundType; // 0x0268
    uint32_t m_nSolidType; // 0x0269
    uint32_t m_triggerBloat; // 0x026A
    uint32_t m_bUniformTriggerBloat; // 0x026B
    fVector3 m_vecSpecifiedSurroundingMinsPreScaled; // 0x026C
    fVector3 m_vecSpecifiedSurroundingMaxsPreScaled; // 0x0278
    fVector3 m_vecSpecifiedSurroundingMins; // 0x0284
    fVector3 m_vecSpecifiedSurroundingMaxs; // 0x0290
    float m_flElasticity; // 0x02F0
    float m_flShadowCastDistance; // 0x02F4
    fVector3 m_vecOrigin; // 0x0428
    fVector3 m_angRotation; // 0x0434
    uint32_t m_CollisionGroup; // 0x0444
    uint32_t m_bIsPlayerSimulated; // 0x0724
    uint32_t m_bSimulatedEveryTick; // 0x0725
    uint32_t m_bAnimatedEveryTick; // 0x0726
    uint32_t m_bAlternateSorting; // 0x0727
    uint32_t m_iTextureFrameIndex; // 0x0728
    uint32_t m_hOwnerEntity; // 0x0734
    uint32_t m_hEffectEntity; // 0x0738
    fVector3 m_vecEndColor; // 0x08B8
    float m_flSpawnRate; // 0x08C4
    float m_flParticleLifetime; // 0x08C8
    float m_flStartSize; // 0x08CC
    float m_flEndSize; // 0x08D0
    float m_flSpawnRadius; // 0x08D4
    uint32_t m_bEmit; // 0x08E4
};

class ParticleSmokeGrenade // parent CBaseEntity {
public:
    uint32_t movecollide; // 0x0000
    uint32_t movetype; // 0x0000
    uint32_t m_nRenderFX; // 0x008C
    uint32_t m_clrRender; // 0x0090
    uint32_t m_flAnimTime; // 0x00A0
    uint32_t m_flSimulationTime; // 0x00A8
    uint32_t m_ubInterpolationFrame; // 0x00B4
    uint32_t m_fEffects; // 0x00B8
    uint32_t m_nRenderMode; // 0x00BC
    uint32_t m_nModelIndex; // 0x00CC
    uint32_t m_iTeamNum; // 0x00D8
    uint32_t m_PredictableID; // 0x00DC
    uint32_t m_iParentAttachment; // 0x01F6
    uint32_t moveparent; // 0x020C
    fVector3 m_vecMinsPreScaled; // 0x0230
    fVector3 m_vecMaxsPreScaled; // 0x023C
    fVector3 m_vecMins; // 0x0248
    fVector3 m_vecMaxs; // 0x0254
    uint32_t m_usSolidFlags; // 0x0264
    uint32_t m_nSurroundType; // 0x0268
    uint32_t m_nSolidType; // 0x0269
    uint32_t m_triggerBloat; // 0x026A
    uint32_t m_bUniformTriggerBloat; // 0x026B
    fVector3 m_vecSpecifiedSurroundingMinsPreScaled; // 0x026C
    fVector3 m_vecSpecifiedSurroundingMaxsPreScaled; // 0x0278
    fVector3 m_vecSpecifiedSurroundingMins; // 0x0284
    fVector3 m_vecSpecifiedSurroundingMaxs; // 0x0290
    float m_flElasticity; // 0x02F0
    float m_flShadowCastDistance; // 0x02F4
    fVector3 m_vecOrigin; // 0x0428
    fVector3 m_angRotation; // 0x0434
    uint32_t m_CollisionGroup; // 0x0444
    uint32_t m_bIsPlayerSimulated; // 0x0724
    uint32_t m_bSimulatedEveryTick; // 0x0725
    uint32_t m_bAnimatedEveryTick; // 0x0726
    uint32_t m_bAlternateSorting; // 0x0727
    uint32_t m_iTextureFrameIndex; // 0x0728
    uint32_t m_hOwnerEntity; // 0x0734
    uint32_t m_hEffectEntity; // 0x0738
    uint32_t m_CurrentStage; // 0x08C0
    float m_flSpawnTime; // 0x08D0
    float m_FadeStartTime; // 0x08D4
    float m_FadeEndTime; // 0x08D8
};

class CTEParticleSystem // parent CBaseTempEntity {
public:
    float m_vecOrigin[0]; // 0x0020
    float m_vecOrigin[1]; // 0x0024
    float m_vecOrigin[2]; // 0x0028
};

class CTEKillPlayerAttachments // parent CBaseTempEntity {
public:
    uint32_t m_nPlayer; // 0x0020
};

class CTESmoke // parent CBaseTempEntity {
public:
    fVector3 m_vecOrigin; // 0x0020
    uint32_t m_nModelIndex; // 0x002C
    float m_fScale; // 0x0030
    uint32_t m_nFrameRate; // 0x0034
};

class CTEProjectedDecal // parent CBaseTempEntity {
public:
    fVector3 m_vecOrigin; // 0x0020
    fVector3 m_angRotation; // 0x002C
    float m_flDistance; // 0x0038
    uint32_t m_nIndex; // 0x003C
};

class CWaterLODControl // parent CBaseEntity {
public:
    uint32_t movetype; // 0x0000
    uint32_t movecollide; // 0x0000
    uint32_t m_nRenderFX; // 0x008C
    uint32_t m_clrRender; // 0x0090
    uint32_t m_flAnimTime; // 0x00A0
    uint32_t m_flSimulationTime; // 0x00A8
    uint32_t m_ubInterpolationFrame; // 0x00B4
    uint32_t m_fEffects; // 0x00B8
    uint32_t m_nRenderMode; // 0x00BC
    uint32_t m_nModelIndex; // 0x00CC
    uint32_t m_iTeamNum; // 0x00D8
    uint32_t m_PredictableID; // 0x00DC
    uint32_t m_iParentAttachment; // 0x01F6
    uint32_t moveparent; // 0x020C
    fVector3 m_vecMinsPreScaled; // 0x0230
    fVector3 m_vecMaxsPreScaled; // 0x023C
    fVector3 m_vecMins; // 0x0248
    fVector3 m_vecMaxs; // 0x0254
    uint32_t m_usSolidFlags; // 0x0264
    uint32_t m_nSurroundType; // 0x0268
    uint32_t m_nSolidType; // 0x0269
    uint32_t m_triggerBloat; // 0x026A
    uint32_t m_bUniformTriggerBloat; // 0x026B
    fVector3 m_vecSpecifiedSurroundingMinsPreScaled; // 0x026C
    fVector3 m_vecSpecifiedSurroundingMaxsPreScaled; // 0x0278
    fVector3 m_vecSpecifiedSurroundingMins; // 0x0284
    fVector3 m_vecSpecifiedSurroundingMaxs; // 0x0290
    float m_flElasticity; // 0x02F0
    float m_flShadowCastDistance; // 0x02F4
    fVector3 m_vecOrigin; // 0x0428
    fVector3 m_angRotation; // 0x0434
    uint32_t m_CollisionGroup; // 0x0444
    uint32_t m_bIsPlayerSimulated; // 0x0724
    uint32_t m_bSimulatedEveryTick; // 0x0725
    uint32_t m_bAnimatedEveryTick; // 0x0726
    uint32_t m_bAlternateSorting; // 0x0727
    uint32_t m_iTextureFrameIndex; // 0x0728
    uint32_t m_hOwnerEntity; // 0x0734
    uint32_t m_hEffectEntity; // 0x0738
    float m_flCheapWaterStartDistance; // 0x0788
    float m_flCheapWaterEndDistance; // 0x078C
};

class CTEPlayerDecal // parent CBaseTempEntity {
public:
    uint32_t m_nPlayer; // 0x0020
    fVector3 m_vecOrigin; // 0x0024
    uint32_t m_nEntity; // 0x0030
};

class CSmokeGrenade // parent CBaseEntity {
public:
    uint32_t movecollide; // 0x0000
    uint32_t movetype; // 0x0000
    uint32_t m_nRenderFX; // 0x008C
    uint32_t m_clrRender; // 0x0090
    uint32_t m_flAnimTime; // 0x00A0
    uint32_t m_flSimulationTime; // 0x00A8
    uint32_t m_ubInterpolationFrame; // 0x00B4
    uint32_t m_fEffects; // 0x00B8
    uint32_t m_nRenderMode; // 0x00BC
    uint32_t m_nNextThinkTick; // 0x00C4
    uint32_t m_nModelIndex; // 0x00CC
    uint32_t m_iTeamNum; // 0x00D8
    uint32_t m_PredictableID; // 0x00DC
    uint32_t m_iParentAttachment; // 0x01F6
    uint32_t moveparent; // 0x020C
    fVector3 m_vecMinsPreScaled; // 0x0230
    fVector3 m_vecMaxsPreScaled; // 0x023C
    fVector3 m_vecMins; // 0x0248
    fVector3 m_vecMaxs; // 0x0254
    uint32_t m_usSolidFlags; // 0x0264
    uint32_t m_nSurroundType; // 0x0268
    uint32_t m_nSolidType; // 0x0269
    uint32_t m_triggerBloat; // 0x026A
    uint32_t m_bUniformTriggerBloat; // 0x026B
    fVector3 m_vecSpecifiedSurroundingMinsPreScaled; // 0x026C
    fVector3 m_vecSpecifiedSurroundingMaxsPreScaled; // 0x0278
    fVector3 m_vecSpecifiedSurroundingMins; // 0x0284
    fVector3 m_vecSpecifiedSurroundingMaxs; // 0x0290
    float m_flElasticity; // 0x02F0
    float m_flShadowCastDistance; // 0x02F4
    fVector3 m_vecOrigin; // 0x0428
    fVector3 m_angRotation; // 0x0434
    uint32_t m_CollisionGroup; // 0x0444
    uint32_t m_bIsPlayerSimulated; // 0x0724
    uint32_t m_bSimulatedEveryTick; // 0x0725
    uint32_t m_bAnimatedEveryTick; // 0x0726
    uint32_t m_bAlternateSorting; // 0x0727
    uint32_t m_iTextureFrameIndex; // 0x0728
    uint32_t m_hOwnerEntity; // 0x0734
    uint32_t m_hEffectEntity; // 0x0738
    uint32_t m_nSkin; // 0x0798
    uint32_t m_nBody; // 0x079C
    uint32_t m_nHitboxSet; // 0x07A0
    float m_flPlaybackRate; // 0x07D4
    fVector3 m_vecForce; // 0x07E8
    uint32_t m_nForceBone; // 0x07F4
    uint32_t m_bClientSideFrameReset; // 0x0834
    float m_fadeMinDist; // 0x0878
    float m_fadeMaxDist; // 0x087C
    float m_flFadeScale; // 0x0880
    float m_flModelScale; // 0x08E4
    float m_flModelWidthScale; // 0x08E4
    uintptr_t m_flPoseParameter[24]; // 0x08E8
    uintptr_t m_flEncodedController[4]; // 0x0A30
    uint32_t m_bClientSideAnimation; // 0x0AA0
    uint32_t m_nNewSequenceParity; // 0x0AA4
    uint32_t m_nResetEventsParity; // 0x0AA8
    uint32_t m_nSequence; // 0x0AD0
    float m_flCycle; // 0x0AD8
    uint32_t m_hLightingOrigin; // 0x0BA0
    uint32_t m_hLightingOriginRelative; // 0x0BA4
    uint32_t m_nMuzzleFlashParity; // 0x0BA8
    uint32_t m_hOwner; // 0x0BE0
    uint32_t m_nViewModelIndex; // 0x0BE4
    float m_flNextPrimaryAttack; // 0x0BE8
    float m_flNextSecondaryAttack; // 0x0BEC
    float m_flTimeWeaponIdle; // 0x0BF0
    uint32_t m_iViewModelIndex; // 0x0BF8
    uint32_t m_iWorldModelIndex; // 0x0BFC
    uint32_t m_iState; // 0x0C1C
    uint32_t m_iPrimaryAmmoType; // 0x0C28
    uint32_t m_iSecondaryAmmoType; // 0x0C2C
    uint32_t m_iClip1; // 0x0C30
    uint32_t m_iClip2; // 0x0C34
    uint32_t m_bFlipViewModel; // 0x0C60
    uint32_t m_nCustomViewmodelModelIndex; // 0x0C84
    uint32_t m_weaponMode; // 0x0CAC
    float m_fAccuracyPenalty; // 0x0CB0
    uint32_t m_bRedraw; // 0x0CF8
    uint32_t m_bPinPulled; // 0x0CF9
    float m_fThrowTime; // 0x0CFC
};

class CTEPhysicsProp // parent CBaseTempEntity {
public:
    fVector3 m_vecOrigin; // 0x0020
    float m_angRotation[0]; // 0x002C
    float m_angRotation[1]; // 0x0030
    float m_angRotation[2]; // 0x0034
    fVector3 m_vecVelocity; // 0x0038
    uint32_t m_nModelIndex; // 0x0044
    uint32_t m_nSkin; // 0x0048
    uint32_t m_nFlags; // 0x004C
    uint32_t m_nEffects; // 0x0050
};

class CTEMuzzleFlash // parent CBaseTempEntity {
public:
    fVector3 m_vecOrigin; // 0x0020
    fVector3 m_vecAngles; // 0x002C
    float m_flScale; // 0x0038
    uint32_t m_nType; // 0x003C
};

class CTELargeFunnel // parent CBaseTempEntity {
public:
    float m_vecOrigin[0]; // 0x0020
    float m_vecOrigin[1]; // 0x0024
    float m_vecOrigin[2]; // 0x0028
    uint32_t m_nModelIndex; // 0x0030
    uint32_t m_nReversed; // 0x0034
};

class CWeaponTMP // parent CBaseEntity {
public:
    uint32_t movecollide; // 0x0000
    uint32_t movetype; // 0x0000
    uint32_t m_nRenderFX; // 0x008C
    uint32_t m_clrRender; // 0x0090
    uint32_t m_flAnimTime; // 0x00A0
    uint32_t m_flSimulationTime; // 0x00A8
    uint32_t m_ubInterpolationFrame; // 0x00B4
    uint32_t m_fEffects; // 0x00B8
    uint32_t m_nRenderMode; // 0x00BC
    uint32_t m_nNextThinkTick; // 0x00C4
    uint32_t m_nModelIndex; // 0x00CC
    uint32_t m_iTeamNum; // 0x00D8
    uint32_t m_PredictableID; // 0x00DC
    uint32_t m_iParentAttachment; // 0x01F6
    uint32_t moveparent; // 0x020C
    fVector3 m_vecMinsPreScaled; // 0x0230
    fVector3 m_vecMaxsPreScaled; // 0x023C
    fVector3 m_vecMins; // 0x0248
    fVector3 m_vecMaxs; // 0x0254
    uint32_t m_usSolidFlags; // 0x0264
    uint32_t m_nSurroundType; // 0x0268
    uint32_t m_nSolidType; // 0x0269
    uint32_t m_triggerBloat; // 0x026A
    uint32_t m_bUniformTriggerBloat; // 0x026B
    fVector3 m_vecSpecifiedSurroundingMinsPreScaled; // 0x026C
    fVector3 m_vecSpecifiedSurroundingMaxsPreScaled; // 0x0278
    fVector3 m_vecSpecifiedSurroundingMins; // 0x0284
    fVector3 m_vecSpecifiedSurroundingMaxs; // 0x0290
    float m_flElasticity; // 0x02F0
    float m_flShadowCastDistance; // 0x02F4
    fVector3 m_vecOrigin; // 0x0428
    fVector3 m_angRotation; // 0x0434
    uint32_t m_CollisionGroup; // 0x0444
    uint32_t m_bIsPlayerSimulated; // 0x0724
    uint32_t m_bSimulatedEveryTick; // 0x0725
    uint32_t m_bAnimatedEveryTick; // 0x0726
    uint32_t m_bAlternateSorting; // 0x0727
    uint32_t m_iTextureFrameIndex; // 0x0728
    uint32_t m_hOwnerEntity; // 0x0734
    uint32_t m_hEffectEntity; // 0x0738
    uint32_t m_nSkin; // 0x0798
    uint32_t m_nBody; // 0x079C
    uint32_t m_nHitboxSet; // 0x07A0
    float m_flPlaybackRate; // 0x07D4
    fVector3 m_vecForce; // 0x07E8
    uint32_t m_nForceBone; // 0x07F4
    uint32_t m_bClientSideFrameReset; // 0x0834
    float m_fadeMinDist; // 0x0878
    float m_fadeMaxDist; // 0x087C
    float m_flFadeScale; // 0x0880
    float m_flModelWidthScale; // 0x08E4
    float m_flModelScale; // 0x08E4
    uintptr_t m_flPoseParameter[24]; // 0x08E8
    uintptr_t m_flEncodedController[4]; // 0x0A30
    uint32_t m_bClientSideAnimation; // 0x0AA0
    uint32_t m_nNewSequenceParity; // 0x0AA4
    uint32_t m_nResetEventsParity; // 0x0AA8
    uint32_t m_nSequence; // 0x0AD0
    float m_flCycle; // 0x0AD8
    uint32_t m_hLightingOrigin; // 0x0BA0
    uint32_t m_hLightingOriginRelative; // 0x0BA4
    uint32_t m_nMuzzleFlashParity; // 0x0BA8
    uint32_t m_hOwner; // 0x0BE0
    uint32_t m_nViewModelIndex; // 0x0BE4
    float m_flNextPrimaryAttack; // 0x0BE8
    float m_flNextSecondaryAttack; // 0x0BEC
    float m_flTimeWeaponIdle; // 0x0BF0
    uint32_t m_iViewModelIndex; // 0x0BF8
    uint32_t m_iWorldModelIndex; // 0x0BFC
    uint32_t m_iState; // 0x0C1C
    uint32_t m_iPrimaryAmmoType; // 0x0C28
    uint32_t m_iSecondaryAmmoType; // 0x0C2C
    uint32_t m_iClip1; // 0x0C30
    uint32_t m_iClip2; // 0x0C34
    uint32_t m_bFlipViewModel; // 0x0C60
    uint32_t m_nCustomViewmodelModelIndex; // 0x0C84
    uint32_t m_weaponMode; // 0x0CAC
    float m_fAccuracyPenalty; // 0x0CB0
};

class CBaseDoor // parent CBaseEntity {
public:
    uint32_t movecollide; // 0x0000
    uint32_t movetype; // 0x0000
    uint32_t m_nRenderFX; // 0x008C
    uint32_t m_clrRender; // 0x0090
    uint32_t m_flAnimTime; // 0x00A0
    uint32_t m_flSimulationTime; // 0x00A8
    uint32_t m_ubInterpolationFrame; // 0x00B4
    uint32_t m_fEffects; // 0x00B8
    uint32_t m_nRenderMode; // 0x00BC
    uint32_t m_nModelIndex; // 0x00CC
    uint32_t m_iTeamNum; // 0x00D8
    uint32_t m_PredictableID; // 0x00DC
    uint32_t m_iParentAttachment; // 0x01F6
    uint32_t moveparent; // 0x020C
    fVector3 m_vecMinsPreScaled; // 0x0230
    fVector3 m_vecMaxsPreScaled; // 0x023C
    fVector3 m_vecMins; // 0x0248
    fVector3 m_vecMaxs; // 0x0254
    uint32_t m_usSolidFlags; // 0x0264
    uint32_t m_nSurroundType; // 0x0268
    uint32_t m_nSolidType; // 0x0269
    uint32_t m_triggerBloat; // 0x026A
    uint32_t m_bUniformTriggerBloat; // 0x026B
    fVector3 m_vecSpecifiedSurroundingMinsPreScaled; // 0x026C
    fVector3 m_vecSpecifiedSurroundingMaxsPreScaled; // 0x0278
    fVector3 m_vecSpecifiedSurroundingMins; // 0x0284
    fVector3 m_vecSpecifiedSurroundingMaxs; // 0x0290
    float m_flElasticity; // 0x02F0
    float m_flShadowCastDistance; // 0x02F4
    fVector3 m_vecOrigin; // 0x0428
    fVector3 m_angRotation; // 0x0434
    uint32_t m_CollisionGroup; // 0x0444
    uint32_t m_bIsPlayerSimulated; // 0x0724
    uint32_t m_bSimulatedEveryTick; // 0x0725
    uint32_t m_bAnimatedEveryTick; // 0x0726
    uint32_t m_bAlternateSorting; // 0x0727
    uint32_t m_iTextureFrameIndex; // 0x0728
    uint32_t m_hOwnerEntity; // 0x0734
    uint32_t m_hEffectEntity; // 0x0738
    float m_flWaveHeight; // 0x0788
};

class CWeaponP90 // parent CBaseEntity {
public:
    uint32_t movecollide; // 0x0000
    uint32_t movetype; // 0x0000
    uint32_t m_nRenderFX; // 0x008C
    uint32_t m_clrRender; // 0x0090
    uint32_t m_flAnimTime; // 0x00A0
    uint32_t m_flSimulationTime; // 0x00A8
    uint32_t m_ubInterpolationFrame; // 0x00B4
    uint32_t m_fEffects; // 0x00B8
    uint32_t m_nRenderMode; // 0x00BC
    uint32_t m_nNextThinkTick; // 0x00C4
    uint32_t m_nModelIndex; // 0x00CC
    uint32_t m_iTeamNum; // 0x00D8
    uint32_t m_PredictableID; // 0x00DC
    uint32_t m_iParentAttachment; // 0x01F6
    uint32_t moveparent; // 0x020C
    fVector3 m_vecMinsPreScaled; // 0x0230
    fVector3 m_vecMaxsPreScaled; // 0x023C
    fVector3 m_vecMins; // 0x0248
    fVector3 m_vecMaxs; // 0x0254
    uint32_t m_usSolidFlags; // 0x0264
    uint32_t m_nSurroundType; // 0x0268
    uint32_t m_nSolidType; // 0x0269
    uint32_t m_triggerBloat; // 0x026A
    uint32_t m_bUniformTriggerBloat; // 0x026B
    fVector3 m_vecSpecifiedSurroundingMinsPreScaled; // 0x026C
    fVector3 m_vecSpecifiedSurroundingMaxsPreScaled; // 0x0278
    fVector3 m_vecSpecifiedSurroundingMins; // 0x0284
    fVector3 m_vecSpecifiedSurroundingMaxs; // 0x0290
    float m_flElasticity; // 0x02F0
    float m_flShadowCastDistance; // 0x02F4
    fVector3 m_vecOrigin; // 0x0428
    fVector3 m_angRotation; // 0x0434
    uint32_t m_CollisionGroup; // 0x0444
    uint32_t m_bIsPlayerSimulated; // 0x0724
    uint32_t m_bSimulatedEveryTick; // 0x0725
    uint32_t m_bAnimatedEveryTick; // 0x0726
    uint32_t m_bAlternateSorting; // 0x0727
    uint32_t m_iTextureFrameIndex; // 0x0728
    uint32_t m_hOwnerEntity; // 0x0734
    uint32_t m_hEffectEntity; // 0x0738
    uint32_t m_nSkin; // 0x0798
    uint32_t m_nBody; // 0x079C
    uint32_t m_nHitboxSet; // 0x07A0
    float m_flPlaybackRate; // 0x07D4
    fVector3 m_vecForce; // 0x07E8
    uint32_t m_nForceBone; // 0x07F4
    uint32_t m_bClientSideFrameReset; // 0x0834
    float m_fadeMinDist; // 0x0878
    float m_fadeMaxDist; // 0x087C
    float m_flFadeScale; // 0x0880
    float m_flModelWidthScale; // 0x08E4
    float m_flModelScale; // 0x08E4
    uintptr_t m_flPoseParameter[24]; // 0x08E8
    uintptr_t m_flEncodedController[4]; // 0x0A30
    uint32_t m_bClientSideAnimation; // 0x0AA0
    uint32_t m_nNewSequenceParity; // 0x0AA4
    uint32_t m_nResetEventsParity; // 0x0AA8
    uint32_t m_nSequence; // 0x0AD0
    float m_flCycle; // 0x0AD8
    uint32_t m_hLightingOrigin; // 0x0BA0
    uint32_t m_hLightingOriginRelative; // 0x0BA4
    uint32_t m_nMuzzleFlashParity; // 0x0BA8
    uint32_t m_hOwner; // 0x0BE0
    uint32_t m_nViewModelIndex; // 0x0BE4
    float m_flNextPrimaryAttack; // 0x0BE8
    float m_flNextSecondaryAttack; // 0x0BEC
    float m_flTimeWeaponIdle; // 0x0BF0
    uint32_t m_iViewModelIndex; // 0x0BF8
    uint32_t m_iWorldModelIndex; // 0x0BFC
    uint32_t m_iState; // 0x0C1C
    uint32_t m_iPrimaryAmmoType; // 0x0C28
    uint32_t m_iSecondaryAmmoType; // 0x0C2C
    uint32_t m_iClip1; // 0x0C30
    uint32_t m_iClip2; // 0x0C34
    uint32_t m_bFlipViewModel; // 0x0C60
    uint32_t m_nCustomViewmodelModelIndex; // 0x0C84
    uint32_t m_weaponMode; // 0x0CAC
    float m_fAccuracyPenalty; // 0x0CB0
};

class CTEBloodStream // parent CBaseTempEntity {
public:
    float m_vecOrigin[0]; // 0x0020
    float m_vecOrigin[1]; // 0x0024
    float m_vecOrigin[2]; // 0x0028
    fVector3 m_vecDirection; // 0x0030
    uint32_t r; // 0x003C
    uint32_t g; // 0x0040
    uint32_t b; // 0x0044
    uint32_t a; // 0x0048
    uint32_t m_nAmount; // 0x004C
};

class CTEImpact // parent CBaseTempEntity {
public:
    fVector3 m_vecOrigin; // 0x0020
    fVector3 m_vecNormal; // 0x002C
    uint32_t m_iType; // 0x0038
    uint32_t m_ucFlags; // 0x003C
};

class CTEBreakModel // parent CBaseTempEntity {
public:
    fVector3 m_vecOrigin; // 0x0020
    float m_angRotation[0]; // 0x002C
    float m_angRotation[1]; // 0x0030
    float m_angRotation[2]; // 0x0034
    fVector3 m_vecSize; // 0x0038
    fVector3 m_vecVelocity; // 0x0044
    uint32_t m_nRandomization; // 0x0050
    uint32_t m_nModelIndex; // 0x0054
    uint32_t m_nCount; // 0x0058
    float m_fTime; // 0x005C
    uint32_t m_nFlags; // 0x0060
};

class CTeamTrainWatcher // parent CBaseEntity {
public:
    uint32_t movecollide; // 0x0000
    uint32_t movetype; // 0x0000
    uint32_t m_nRenderFX; // 0x008C
    uint32_t m_clrRender; // 0x0090
    uint32_t m_flAnimTime; // 0x00A0
    uint32_t m_flSimulationTime; // 0x00A8
    uint32_t m_ubInterpolationFrame; // 0x00B4
    uint32_t m_fEffects; // 0x00B8
    uint32_t m_nRenderMode; // 0x00BC
    uint32_t m_nModelIndex; // 0x00CC
    uint32_t m_iTeamNum; // 0x00D8
    uint32_t m_PredictableID; // 0x00DC
    uint32_t m_iParentAttachment; // 0x01F6
    uint32_t moveparent; // 0x020C
    fVector3 m_vecMinsPreScaled; // 0x0230
    fVector3 m_vecMaxsPreScaled; // 0x023C
    fVector3 m_vecMins; // 0x0248
    fVector3 m_vecMaxs; // 0x0254
    uint32_t m_usSolidFlags; // 0x0264
    uint32_t m_nSurroundType; // 0x0268
    uint32_t m_nSolidType; // 0x0269
    uint32_t m_triggerBloat; // 0x026A
    uint32_t m_bUniformTriggerBloat; // 0x026B
    fVector3 m_vecSpecifiedSurroundingMinsPreScaled; // 0x026C
    fVector3 m_vecSpecifiedSurroundingMaxsPreScaled; // 0x0278
    fVector3 m_vecSpecifiedSurroundingMins; // 0x0284
    fVector3 m_vecSpecifiedSurroundingMaxs; // 0x0290
    float m_flElasticity; // 0x02F0
    float m_flShadowCastDistance; // 0x02F4
    fVector3 m_vecOrigin; // 0x0428
    fVector3 m_angRotation; // 0x0434
    uint32_t m_CollisionGroup; // 0x0444
    uint32_t m_bIsPlayerSimulated; // 0x0724
    uint32_t m_bSimulatedEveryTick; // 0x0725
    uint32_t m_bAnimatedEveryTick; // 0x0726
    uint32_t m_bAlternateSorting; // 0x0727
    uint32_t m_iTextureFrameIndex; // 0x0728
    uint32_t m_hOwnerEntity; // 0x0734
    uint32_t m_hEffectEntity; // 0x0738
    float m_flTotalProgress; // 0x0788
    uint32_t m_iTrainSpeedLevel; // 0x0790
    float m_flRecedeTime; // 0x0798
    uint32_t m_nNumCappers; // 0x07A0
};

class CWeaponCSBase // parent CBaseEntity {
public:
    uint32_t movecollide; // 0x0000
    uint32_t movetype; // 0x0000
    uint32_t m_nRenderFX; // 0x008C
    uint32_t m_clrRender; // 0x0090
    uint32_t m_flAnimTime; // 0x00A0
    uint32_t m_flSimulationTime; // 0x00A8
    uint32_t m_ubInterpolationFrame; // 0x00B4
    uint32_t m_fEffects; // 0x00B8
    uint32_t m_nRenderMode; // 0x00BC
    uint32_t m_nNextThinkTick; // 0x00C4
    uint32_t m_nModelIndex; // 0x00CC
    uint32_t m_iTeamNum; // 0x00D8
    uint32_t m_PredictableID; // 0x00DC
    uint32_t m_iParentAttachment; // 0x01F6
    uint32_t moveparent; // 0x020C
    fVector3 m_vecMinsPreScaled; // 0x0230
    fVector3 m_vecMaxsPreScaled; // 0x023C
    fVector3 m_vecMins; // 0x0248
    fVector3 m_vecMaxs; // 0x0254
    uint32_t m_usSolidFlags; // 0x0264
    uint32_t m_nSurroundType; // 0x0268
    uint32_t m_nSolidType; // 0x0269
    uint32_t m_triggerBloat; // 0x026A
    uint32_t m_bUniformTriggerBloat; // 0x026B
    fVector3 m_vecSpecifiedSurroundingMinsPreScaled; // 0x026C
    fVector3 m_vecSpecifiedSurroundingMaxsPreScaled; // 0x0278
    fVector3 m_vecSpecifiedSurroundingMins; // 0x0284
    fVector3 m_vecSpecifiedSurroundingMaxs; // 0x0290
    float m_flElasticity; // 0x02F0
    float m_flShadowCastDistance; // 0x02F4
    fVector3 m_vecOrigin; // 0x0428
    fVector3 m_angRotation; // 0x0434
    uint32_t m_CollisionGroup; // 0x0444
    uint32_t m_bIsPlayerSimulated; // 0x0724
    uint32_t m_bSimulatedEveryTick; // 0x0725
    uint32_t m_bAnimatedEveryTick; // 0x0726
    uint32_t m_bAlternateSorting; // 0x0727
    uint32_t m_iTextureFrameIndex; // 0x0728
    uint32_t m_hOwnerEntity; // 0x0734
    uint32_t m_hEffectEntity; // 0x0738
    uint32_t m_nSkin; // 0x0798
    uint32_t m_nBody; // 0x079C
    uint32_t m_nHitboxSet; // 0x07A0
    float m_flPlaybackRate; // 0x07D4
    fVector3 m_vecForce; // 0x07E8
    uint32_t m_nForceBone; // 0x07F4
    uint32_t m_bClientSideFrameReset; // 0x0834
    float m_fadeMinDist; // 0x0878
    float m_fadeMaxDist; // 0x087C
    float m_flFadeScale; // 0x0880
    float m_flModelWidthScale; // 0x08E4
    float m_flModelScale; // 0x08E4
    uintptr_t m_flPoseParameter[24]; // 0x08E8
    uintptr_t m_flEncodedController[4]; // 0x0A30
    uint32_t m_bClientSideAnimation; // 0x0AA0
    uint32_t m_nNewSequenceParity; // 0x0AA4
    uint32_t m_nResetEventsParity; // 0x0AA8
    uint32_t m_nSequence; // 0x0AD0
    float m_flCycle; // 0x0AD8
    uint32_t m_hLightingOrigin; // 0x0BA0
    uint32_t m_hLightingOriginRelative; // 0x0BA4
    uint32_t m_nMuzzleFlashParity; // 0x0BA8
    uint32_t m_hOwner; // 0x0BE0
    uint32_t m_nViewModelIndex; // 0x0BE4
    float m_flNextPrimaryAttack; // 0x0BE8
    float m_flNextSecondaryAttack; // 0x0BEC
    float m_flTimeWeaponIdle; // 0x0BF0
    uint32_t m_iViewModelIndex; // 0x0BF8
    uint32_t m_iWorldModelIndex; // 0x0BFC
    uint32_t m_iState; // 0x0C1C
    uint32_t m_iPrimaryAmmoType; // 0x0C28
    uint32_t m_iSecondaryAmmoType; // 0x0C2C
    uint32_t m_iClip1; // 0x0C30
    uint32_t m_iClip2; // 0x0C34
    uint32_t m_bFlipViewModel; // 0x0C60
    uint32_t m_nCustomViewmodelModelIndex; // 0x0C84
    uint32_t m_weaponMode; // 0x0CAC
    float m_fAccuracyPenalty; // 0x0CB0
};

class CTEGlowSprite // parent CBaseTempEntity {
public:
    fVector3 m_vecOrigin; // 0x0020
    uint32_t m_nModelIndex; // 0x002C
    float m_fScale; // 0x0030
    float m_fLife; // 0x0034
    uint32_t m_nBrightness; // 0x0038
};

class CTEShatterSurface // parent CBaseTempEntity {
public:
    fVector3 m_vecOrigin; // 0x0020
    fVector3 m_vecAngles; // 0x002C
    fVector3 m_vecForce; // 0x0038
    fVector3 m_vecForcePos; // 0x0044
    float m_flWidth; // 0x0050
    float m_flHeight; // 0x0054
    float m_flShardSize; // 0x0058
    uint32_t m_nSurfaceType; // 0x0068
    uint32_t m_uchFrontColor[0]; // 0x006C
    uint32_t m_uchFrontColor[1]; // 0x006D
    uint32_t m_uchFrontColor[2]; // 0x006E
    uint32_t m_uchBackColor[0]; // 0x006F
    uint32_t m_uchBackColor[1]; // 0x0070
    uint32_t m_uchBackColor[2]; // 0x0071
};

class CPrecipitation // parent CBaseEntity {
public:
    uint32_t movecollide; // 0x0000
    uint32_t movetype; // 0x0000
    uint32_t m_nRenderFX; // 0x008C
    uint32_t m_clrRender; // 0x0090
    uint32_t m_flAnimTime; // 0x00A0
    uint32_t m_flSimulationTime; // 0x00A8
    uint32_t m_ubInterpolationFrame; // 0x00B4
    uint32_t m_fEffects; // 0x00B8
    uint32_t m_nRenderMode; // 0x00BC
    uint32_t m_nModelIndex; // 0x00CC
    uint32_t m_iTeamNum; // 0x00D8
    uint32_t m_PredictableID; // 0x00DC
    uint32_t m_iParentAttachment; // 0x01F6
    uint32_t moveparent; // 0x020C
    fVector3 m_vecMinsPreScaled; // 0x0230
    fVector3 m_vecMaxsPreScaled; // 0x023C
    fVector3 m_vecMins; // 0x0248
    fVector3 m_vecMaxs; // 0x0254
    uint32_t m_usSolidFlags; // 0x0264
    uint32_t m_nSurroundType; // 0x0268
    uint32_t m_nSolidType; // 0x0269
    uint32_t m_triggerBloat; // 0x026A
    uint32_t m_bUniformTriggerBloat; // 0x026B
    fVector3 m_vecSpecifiedSurroundingMinsPreScaled; // 0x026C
    fVector3 m_vecSpecifiedSurroundingMaxsPreScaled; // 0x0278
    fVector3 m_vecSpecifiedSurroundingMins; // 0x0284
    fVector3 m_vecSpecifiedSurroundingMaxs; // 0x0290
    float m_flElasticity; // 0x02F0
    float m_flShadowCastDistance; // 0x02F4
    fVector3 m_vecOrigin; // 0x0428
    fVector3 m_angRotation; // 0x0434
    uint32_t m_CollisionGroup; // 0x0444
    uint32_t m_bIsPlayerSimulated; // 0x0724
    uint32_t m_bSimulatedEveryTick; // 0x0725
    uint32_t m_bAnimatedEveryTick; // 0x0726
    uint32_t m_bAlternateSorting; // 0x0727
    uint32_t m_iTextureFrameIndex; // 0x0728
    uint32_t m_hOwnerEntity; // 0x0734
    uint32_t m_hEffectEntity; // 0x0738
    uint32_t m_nPrecipType; // 0x07B4
};

class CTEBeamLaser // parent CBaseBeam {
public:
    uint32_t m_nModelIndex; // 0x0020
    uint32_t m_nHaloIndex; // 0x0024
    uint32_t m_nStartFrame; // 0x0028
    uint32_t m_nFrameRate; // 0x002C
    float m_fLife; // 0x0030
    float m_fWidth; // 0x0034
    float m_fEndWidth; // 0x0038
    uint32_t m_nFadeLength; // 0x003C
    float m_fAmplitude; // 0x0040
    uint32_t r; // 0x0044
    uint32_t g; // 0x0048
    uint32_t b; // 0x004C
    uint32_t a; // 0x0050
    uint32_t m_nSpeed; // 0x0054
    uint32_t m_nFlags; // 0x0058
    uint32_t m_nStartEntity; // 0x0060
    uint32_t m_nEndEntity; // 0x0064
};

class CEnvTonemapController // parent CBaseEntity {
public:
    uint32_t movetype; // 0x0000
    uint32_t movecollide; // 0x0000
    uint32_t m_nRenderFX; // 0x008C
    uint32_t m_clrRender; // 0x0090
    uint32_t m_flAnimTime; // 0x00A0
    uint32_t m_flSimulationTime; // 0x00A8
    uint32_t m_ubInterpolationFrame; // 0x00B4
    uint32_t m_fEffects; // 0x00B8
    uint32_t m_nRenderMode; // 0x00BC
    uint32_t m_nModelIndex; // 0x00CC
    uint32_t m_iTeamNum; // 0x00D8
    uint32_t m_PredictableID; // 0x00DC
    uint32_t m_iParentAttachment; // 0x01F6
    uint32_t moveparent; // 0x020C
    fVector3 m_vecMinsPreScaled; // 0x0230
    fVector3 m_vecMaxsPreScaled; // 0x023C
    fVector3 m_vecMins; // 0x0248
    fVector3 m_vecMaxs; // 0x0254
    uint32_t m_usSolidFlags; // 0x0264
    uint32_t m_nSurroundType; // 0x0268
    uint32_t m_nSolidType; // 0x0269
    uint32_t m_triggerBloat; // 0x026A
    uint32_t m_bUniformTriggerBloat; // 0x026B
    fVector3 m_vecSpecifiedSurroundingMinsPreScaled; // 0x026C
    fVector3 m_vecSpecifiedSurroundingMaxsPreScaled; // 0x0278
    fVector3 m_vecSpecifiedSurroundingMins; // 0x0284
    fVector3 m_vecSpecifiedSurroundingMaxs; // 0x0290
    float m_flElasticity; // 0x02F0
    float m_flShadowCastDistance; // 0x02F4
    fVector3 m_vecOrigin; // 0x0428
    fVector3 m_angRotation; // 0x0434
    uint32_t m_CollisionGroup; // 0x0444
    uint32_t m_bIsPlayerSimulated; // 0x0724
    uint32_t m_bSimulatedEveryTick; // 0x0725
    uint32_t m_bAnimatedEveryTick; // 0x0726
    uint32_t m_bAlternateSorting; // 0x0727
    uint32_t m_iTextureFrameIndex; // 0x0728
    uint32_t m_hOwnerEntity; // 0x0734
    uint32_t m_hEffectEntity; // 0x0738
    uint32_t m_bUseCustomAutoExposureMin; // 0x0788
    uint32_t m_bUseCustomAutoExposureMax; // 0x0789
    uint32_t m_bUseCustomBloomScale; // 0x078A
    float m_flCustomAutoExposureMin; // 0x078C
    float m_flCustomAutoExposureMax; // 0x0790
    float m_flCustomBloomScale; // 0x0794
    float m_flCustomBloomScaleMinimum; // 0x0798
};

class CTEFootprintDecal // parent CBaseTempEntity {
public:
    fVector3 m_vecOrigin; // 0x0020
    fVector3 m_vecDirection; // 0x002C
    uint32_t m_nEntity; // 0x0044
    uint32_t m_nIndex; // 0x0048
    uint32_t m_chMaterialType; // 0x004C
};

class CPropVehicleChoreoGeneric // parent CBaseEntity {
public:
    uint32_t movetype; // 0x0000
    uint32_t movecollide; // 0x0000
    uint32_t m_nRenderFX; // 0x008C
    uint32_t m_clrRender; // 0x0090
    uint32_t m_flAnimTime; // 0x00A0
    uint32_t m_flSimulationTime; // 0x00A8
    uint32_t m_ubInterpolationFrame; // 0x00B4
    uint32_t m_fEffects; // 0x00B8
    uint32_t m_nRenderMode; // 0x00BC
    uint32_t m_nModelIndex; // 0x00CC
    uint32_t m_iTeamNum; // 0x00D8
    uint32_t m_PredictableID; // 0x00DC
    uint32_t m_iParentAttachment; // 0x01F6
    uint32_t moveparent; // 0x020C
    fVector3 m_vecMinsPreScaled; // 0x0230
    fVector3 m_vecMaxsPreScaled; // 0x023C
    fVector3 m_vecMins; // 0x0248
    fVector3 m_vecMaxs; // 0x0254
    uint32_t m_usSolidFlags; // 0x0264
    uint32_t m_nSurroundType; // 0x0268
    uint32_t m_nSolidType; // 0x0269
    uint32_t m_triggerBloat; // 0x026A
    uint32_t m_bUniformTriggerBloat; // 0x026B
    fVector3 m_vecSpecifiedSurroundingMinsPreScaled; // 0x026C
    fVector3 m_vecSpecifiedSurroundingMaxsPreScaled; // 0x0278
    fVector3 m_vecSpecifiedSurroundingMins; // 0x0284
    fVector3 m_vecSpecifiedSurroundingMaxs; // 0x0290
    float m_flElasticity; // 0x02F0
    float m_flShadowCastDistance; // 0x02F4
    fVector3 m_vecOrigin; // 0x0428
    fVector3 m_angRotation; // 0x0434
    uint32_t m_CollisionGroup; // 0x0444
    uint32_t m_bIsPlayerSimulated; // 0x0724
    uint32_t m_bSimulatedEveryTick; // 0x0725
    uint32_t m_bAnimatedEveryTick; // 0x0726
    uint32_t m_bAlternateSorting; // 0x0727
    uint32_t m_iTextureFrameIndex; // 0x0728
    uint32_t m_hOwnerEntity; // 0x0734
    uint32_t m_hEffectEntity; // 0x0738
    uint32_t m_nSkin; // 0x0798
    uint32_t m_nBody; // 0x079C
    uint32_t m_nHitboxSet; // 0x07A0
    float m_flPlaybackRate; // 0x07D4
    fVector3 m_vecForce; // 0x07E8
    uint32_t m_nForceBone; // 0x07F4
    uint32_t m_bClientSideFrameReset; // 0x0834
    float m_fadeMinDist; // 0x0878
    float m_fadeMaxDist; // 0x087C
    float m_flFadeScale; // 0x0880
    float m_flModelScale; // 0x08E4
    float m_flModelWidthScale; // 0x08E4
    uintptr_t m_flPoseParameter[24]; // 0x08E8
    uintptr_t m_flEncodedController[4]; // 0x0A30
    uint32_t m_bClientSideAnimation; // 0x0AA0
    uint32_t m_nNewSequenceParity; // 0x0AA4
    uint32_t m_nResetEventsParity; // 0x0AA8
    uint32_t m_nSequence; // 0x0AD0
    float m_flCycle; // 0x0AD8
    uint32_t m_hLightingOrigin; // 0x0BA0
    uint32_t m_hLightingOriginRelative; // 0x0BA4
    uint32_t m_nMuzzleFlashParity; // 0x0BA8
    uint32_t m_bUseHitboxesForRenderBox; // 0x0BE0
    uint32_t m_hPlayer; // 0x0C08
    uint32_t m_bEnterAnimOn; // 0x0C10
    uint32_t m_bExitAnimOn; // 0x0C11
    fVector3 m_vecEyeExitEndpoint; // 0x0C14
    uint32_t m_vehicleView.bClampEyeAngles; // 0x0CB0
    float m_vehicleView.flPitchCurveZero; // 0x0CB4
    float m_vehicleView.flPitchCurveLinear; // 0x0CB8
    float m_vehicleView.flRollCurveZero; // 0x0CBC
    float m_vehicleView.flRollCurveLinear; // 0x0CC0
    float m_vehicleView.flFOV; // 0x0CC4
    float m_vehicleView.flYawMin; // 0x0CC8
    float m_vehicleView.flYawMax; // 0x0CCC
    float m_vehicleView.flPitchMin; // 0x0CD0
    float m_vehicleView.flPitchMax; // 0x0CD4
};

class CTEFizz // parent CBaseTempEntity {
public:
    uint32_t m_nEntity; // 0x0020
    uint32_t m_nModelIndex; // 0x0024
    uint32_t m_nDensity; // 0x0028
    uint32_t m_nCurrent; // 0x002C
};

class CTEExplosion // parent CBaseTempEntity {
public:
    float m_vecOrigin[0]; // 0x0020
    float m_vecOrigin[1]; // 0x0024
    float m_vecOrigin[2]; // 0x0028
    uint32_t m_nModelIndex; // 0x0030
    float m_fScale; // 0x0034
    uint32_t m_nFrameRate; // 0x0038
    uint32_t m_nFlags; // 0x003C
    fVector3 m_vecNormal; // 0x0040
    uint32_t m_chMaterialType; // 0x004C
    uint32_t m_nRadius; // 0x0050
    uint32_t m_nMagnitude; // 0x0054
};

class CPhysicsPropMultiplayer // parent CBaseEntity {
public:
    uint32_t movetype; // 0x0000
    uint32_t movecollide; // 0x0000
    uint32_t m_nRenderFX; // 0x008C
    uint32_t m_clrRender; // 0x0090
    uint32_t m_flAnimTime; // 0x00A0
    uint32_t m_flSimulationTime; // 0x00A8
    uint32_t m_ubInterpolationFrame; // 0x00B4
    uint32_t m_fEffects; // 0x00B8
    uint32_t m_nRenderMode; // 0x00BC
    uint32_t m_nModelIndex; // 0x00CC
    uint32_t m_iTeamNum; // 0x00D8
    uint32_t m_PredictableID; // 0x00DC
    uint32_t m_iParentAttachment; // 0x01F6
    uint32_t moveparent; // 0x020C
    fVector3 m_vecMinsPreScaled; // 0x0230
    fVector3 m_vecMaxsPreScaled; // 0x023C
    fVector3 m_vecMins; // 0x0248
    fVector3 m_vecMaxs; // 0x0254
    uint32_t m_usSolidFlags; // 0x0264
    uint32_t m_nSurroundType; // 0x0268
    uint32_t m_nSolidType; // 0x0269
    uint32_t m_triggerBloat; // 0x026A
    uint32_t m_bUniformTriggerBloat; // 0x026B
    fVector3 m_vecSpecifiedSurroundingMinsPreScaled; // 0x026C
    fVector3 m_vecSpecifiedSurroundingMaxsPreScaled; // 0x0278
    fVector3 m_vecSpecifiedSurroundingMins; // 0x0284
    fVector3 m_vecSpecifiedSurroundingMaxs; // 0x0290
    float m_flElasticity; // 0x02F0
    float m_flShadowCastDistance; // 0x02F4
    fVector3 m_vecOrigin; // 0x0428
    fVector3 m_angRotation; // 0x0434
    uint32_t m_CollisionGroup; // 0x0444
    uint32_t m_bIsPlayerSimulated; // 0x0724
    uint32_t m_bSimulatedEveryTick; // 0x0725
    uint32_t m_bAnimatedEveryTick; // 0x0726
    uint32_t m_bAlternateSorting; // 0x0727
    uint32_t m_iTextureFrameIndex; // 0x0728
    uint32_t m_hOwnerEntity; // 0x0734
    uint32_t m_hEffectEntity; // 0x0738
    uint32_t m_nSkin; // 0x0798
    uint32_t m_nBody; // 0x079C
    uint32_t m_nHitboxSet; // 0x07A0
    float m_flPlaybackRate; // 0x07D4
    fVector3 m_vecForce; // 0x07E8
    uint32_t m_nForceBone; // 0x07F4
    uint32_t m_bClientSideFrameReset; // 0x0834
    float m_fadeMinDist; // 0x0878
    float m_fadeMaxDist; // 0x087C
    float m_flFadeScale; // 0x0880
    float m_flModelScale; // 0x08E4
    float m_flModelWidthScale; // 0x08E4
    uintptr_t m_flPoseParameter[24]; // 0x08E8
    uintptr_t m_flEncodedController[4]; // 0x0A30
    uint32_t m_bClientSideAnimation; // 0x0AA0
    uint32_t m_nNewSequenceParity; // 0x0AA4
    uint32_t m_nResetEventsParity; // 0x0AA8
    uint32_t m_nSequence; // 0x0AD0
    float m_flCycle; // 0x0AD8
    uint32_t m_hLightingOrigin; // 0x0BA0
    uint32_t m_hLightingOriginRelative; // 0x0BA4
    uint32_t m_nMuzzleFlashParity; // 0x0BA8
    uint32_t m_bAwake; // 0x0BE0
    uint32_t m_iPhysicsMode; // 0x0BF0
    float m_fMass; // 0x0BF4
    fVector3 m_collisionMins; // 0x0BF8
    fVector3 m_collisionMaxs; // 0x0C04
};

class CTEEnergySplash {
public:
    fVector3 m_vecPos; // 0x0020
    fVector3 m_vecDir; // 0x002C
    uint32_t m_bExplosive; // 0x0038
};

class CTEMetalSparks {
public:
    fVector3 m_vecPos; // 0x0020
    fVector3 m_vecDir; // 0x002C
};

class CTEEffectDispatch // parent CBaseTempEntity {
public:
    float m_vOrigin[0]; // 0x0020
    uint32_t entindex; // 0x0020
    float m_vOrigin[1]; // 0x0024
    float m_vOrigin[2]; // 0x0028
    float m_vStart[0]; // 0x002C
    float m_vStart[1]; // 0x0030
    float m_vStart[2]; // 0x0034
    fVector3 m_vNormal; // 0x0038
    fVector3 m_vAngles; // 0x0044
    uint32_t m_fFlags; // 0x0050
    float m_flScale; // 0x0058
    float m_flMagnitude; // 0x005C
    float m_flRadius; // 0x0060
    uint32_t m_nAttachmentIndex; // 0x0064
    uint32_t m_nSurfaceProp; // 0x0068
    uint32_t m_nMaterial; // 0x006C
    uint32_t m_nDamageType; // 0x0070
    uint32_t m_nHitBox; // 0x0074
    uint32_t m_nColor; // 0x0078
    uint32_t m_bCustomColors; // 0x0079
    fVector3 m_CustomColors.m_vecColor1; // 0x007C
    fVector3 m_CustomColors.m_vecColor2; // 0x0088
    uint32_t m_bControlPoint1; // 0x0094
    uint32_t m_ControlPoint1.m_eParticleAttachment; // 0x0098
    float m_ControlPoint1.m_vecOffset[0]; // 0x009C
    float m_ControlPoint1.m_vecOffset[1]; // 0x00A0
    float m_ControlPoint1.m_vecOffset[2]; // 0x00A4
    uint32_t m_iEffectName; // 0x00A8
};

class SmokeTrail // parent CBaseEntity {
public:
    uint32_t movetype; // 0x0000
    uint32_t movecollide; // 0x0000
    uint32_t m_nRenderFX; // 0x008C
    uint32_t m_clrRender; // 0x0090
    uint32_t m_flAnimTime; // 0x00A0
    uint32_t m_flSimulationTime; // 0x00A8
    uint32_t m_ubInterpolationFrame; // 0x00B4
    uint32_t m_fEffects; // 0x00B8
    uint32_t m_nRenderMode; // 0x00BC
    uint32_t m_nModelIndex; // 0x00CC
    uint32_t m_iTeamNum; // 0x00D8
    uint32_t m_PredictableID; // 0x00DC
    uint32_t m_iParentAttachment; // 0x01F6
    uint32_t moveparent; // 0x020C
    fVector3 m_vecMinsPreScaled; // 0x0230
    fVector3 m_vecMaxsPreScaled; // 0x023C
    fVector3 m_vecMins; // 0x0248
    fVector3 m_vecMaxs; // 0x0254
    uint32_t m_usSolidFlags; // 0x0264
    uint32_t m_nSurroundType; // 0x0268
    uint32_t m_nSolidType; // 0x0269
    uint32_t m_triggerBloat; // 0x026A
    uint32_t m_bUniformTriggerBloat; // 0x026B
    fVector3 m_vecSpecifiedSurroundingMinsPreScaled; // 0x026C
    fVector3 m_vecSpecifiedSurroundingMaxsPreScaled; // 0x0278
    fVector3 m_vecSpecifiedSurroundingMins; // 0x0284
    fVector3 m_vecSpecifiedSurroundingMaxs; // 0x0290
    float m_flElasticity; // 0x02F0
    float m_flShadowCastDistance; // 0x02F4
    fVector3 m_vecOrigin; // 0x0428
    fVector3 m_angRotation; // 0x0434
    uint32_t m_CollisionGroup; // 0x0444
    uint32_t m_bIsPlayerSimulated; // 0x0724
    uint32_t m_bSimulatedEveryTick; // 0x0725
    uint32_t m_bAnimatedEveryTick; // 0x0726
    uint32_t m_bAlternateSorting; // 0x0727
    uint32_t m_iTextureFrameIndex; // 0x0728
    uint32_t m_hOwnerEntity; // 0x0734
    uint32_t m_hEffectEntity; // 0x0738
    float m_SpawnRate; // 0x08C0
    fVector3 m_StartColor; // 0x08C4
    fVector3 m_EndColor; // 0x08D0
    float m_Opacity; // 0x08DC
    float m_ParticleLifetime; // 0x08E0
    float m_StopEmitTime; // 0x08E4
    float m_MinSpeed; // 0x08E8
    float m_MaxSpeed; // 0x08EC
    float m_MinDirectedSpeed; // 0x08F0
    float m_MaxDirectedSpeed; // 0x08F4
    float m_StartSize; // 0x08F8
    float m_EndSize; // 0x08FC
    float m_SpawnRadius; // 0x0900
    uint32_t m_bEmit; // 0x0910
    uint32_t m_nAttachment; // 0x0914
};

class CFireTrail // parent CBaseEntity {
public:
    uint32_t movecollide; // 0x0000
    uint32_t movetype; // 0x0000
    uint32_t m_nRenderFX; // 0x008C
    uint32_t m_clrRender; // 0x0090
    uint32_t m_flAnimTime; // 0x00A0
    uint32_t m_flSimulationTime; // 0x00A8
    uint32_t m_ubInterpolationFrame; // 0x00B4
    uint32_t m_fEffects; // 0x00B8
    uint32_t m_nRenderMode; // 0x00BC
    uint32_t m_nModelIndex; // 0x00CC
    uint32_t m_iTeamNum; // 0x00D8
    uint32_t m_PredictableID; // 0x00DC
    uint32_t m_iParentAttachment; // 0x01F6
    uint32_t moveparent; // 0x020C
    fVector3 m_vecMinsPreScaled; // 0x0230
    fVector3 m_vecMaxsPreScaled; // 0x023C
    fVector3 m_vecMins; // 0x0248
    fVector3 m_vecMaxs; // 0x0254
    uint32_t m_usSolidFlags; // 0x0264
    uint32_t m_nSurroundType; // 0x0268
    uint32_t m_nSolidType; // 0x0269
    uint32_t m_triggerBloat; // 0x026A
    uint32_t m_bUniformTriggerBloat; // 0x026B
    fVector3 m_vecSpecifiedSurroundingMinsPreScaled; // 0x026C
    fVector3 m_vecSpecifiedSurroundingMaxsPreScaled; // 0x0278
    fVector3 m_vecSpecifiedSurroundingMins; // 0x0284
    fVector3 m_vecSpecifiedSurroundingMaxs; // 0x0290
    float m_flElasticity; // 0x02F0
    float m_flShadowCastDistance; // 0x02F4
    fVector3 m_vecOrigin; // 0x0428
    fVector3 m_angRotation; // 0x0434
    uint32_t m_CollisionGroup; // 0x0444
    uint32_t m_bIsPlayerSimulated; // 0x0724
    uint32_t m_bSimulatedEveryTick; // 0x0725
    uint32_t m_bAnimatedEveryTick; // 0x0726
    uint32_t m_bAlternateSorting; // 0x0727
    uint32_t m_iTextureFrameIndex; // 0x0728
    uint32_t m_hOwnerEntity; // 0x0734
    uint32_t m_hEffectEntity; // 0x0738
    uint32_t m_nAttachment; // 0x08C0
    float m_flLifetime; // 0x08C4
};

class CBaseCSGrenadeProjectile // parent CBaseEntity {
public:
    uint32_t movetype; // 0x0000
    uint32_t movecollide; // 0x0000
    uint32_t m_nRenderFX; // 0x008C
    uint32_t m_clrRender; // 0x0090
    uint32_t m_flAnimTime; // 0x00A0
    uint32_t m_flSimulationTime; // 0x00A8
    uint32_t m_ubInterpolationFrame; // 0x00B4
    uint32_t m_fEffects; // 0x00B8
    uint32_t m_nRenderMode; // 0x00BC
    uint32_t m_nModelIndex; // 0x00CC
    uint32_t m_iTeamNum; // 0x00D8
    uint32_t m_PredictableID; // 0x00DC
    fVector3 m_vecVelocity; // 0x0148
    uint32_t m_iParentAttachment; // 0x01F6
    uint32_t moveparent; // 0x020C
    fVector3 m_vecMinsPreScaled; // 0x0230
    fVector3 m_vecMaxsPreScaled; // 0x023C
    fVector3 m_vecMins; // 0x0248
    fVector3 m_vecMaxs; // 0x0254
    uint32_t m_usSolidFlags; // 0x0264
    uint32_t m_nSurroundType; // 0x0268
    uint32_t m_nSolidType; // 0x0269
    uint32_t m_triggerBloat; // 0x026A
    uint32_t m_bUniformTriggerBloat; // 0x026B
    fVector3 m_vecSpecifiedSurroundingMinsPreScaled; // 0x026C
    fVector3 m_vecSpecifiedSurroundingMaxsPreScaled; // 0x0278
    fVector3 m_vecSpecifiedSurroundingMins; // 0x0284
    fVector3 m_vecSpecifiedSurroundingMaxs; // 0x0290
    float m_flElasticity; // 0x02F0
    float m_flShadowCastDistance; // 0x02F4
    fVector3 m_vecOrigin; // 0x0428
    fVector3 m_angRotation; // 0x0434
    uint32_t m_fFlags; // 0x0440
    uint32_t m_CollisionGroup; // 0x0444
    uint32_t m_bIsPlayerSimulated; // 0x0724
    uint32_t m_bSimulatedEveryTick; // 0x0725
    uint32_t m_bAnimatedEveryTick; // 0x0726
    uint32_t m_bAlternateSorting; // 0x0727
    uint32_t m_iTextureFrameIndex; // 0x0728
    uint32_t m_hOwnerEntity; // 0x0734
    uint32_t m_hEffectEntity; // 0x0738
    uint32_t m_nSkin; // 0x0798
    uint32_t m_nBody; // 0x079C
    uint32_t m_nHitboxSet; // 0x07A0
    float m_flPlaybackRate; // 0x07D4
    fVector3 m_vecForce; // 0x07E8
    uint32_t m_nForceBone; // 0x07F4
    uint32_t m_bClientSideFrameReset; // 0x0834
    float m_fadeMinDist; // 0x0878
    float m_fadeMaxDist; // 0x087C
    float m_flFadeScale; // 0x0880
    float m_flModelScale; // 0x08E4
    float m_flModelWidthScale; // 0x08E4
    uintptr_t m_flPoseParameter[24]; // 0x08E8
    uintptr_t m_flEncodedController[4]; // 0x0A30
    uint32_t m_bClientSideAnimation; // 0x0AA0
    uint32_t m_nNewSequenceParity; // 0x0AA4
    uint32_t m_nResetEventsParity; // 0x0AA8
    uint32_t m_nSequence; // 0x0AD0
    float m_flCycle; // 0x0AD8
    uint32_t m_hLightingOrigin; // 0x0BA0
    uint32_t m_hLightingOriginRelative; // 0x0BA4
    uint32_t m_nMuzzleFlashParity; // 0x0BA8
    uint32_t m_hOriginalLauncher; // 0x0BE0
    uint32_t m_bIsLive; // 0x0BE9
    float m_DmgRadius; // 0x0BEC
    float m_flDamage; // 0x0BFC
    uint32_t m_hThrower; // 0x0C08
    fVector3 m_vInitialVelocity; // 0x0C10
};

class CTEDynamicLight // parent CBaseTempEntity {
public:
    fVector3 m_vecOrigin; // 0x0020
    float m_fRadius; // 0x002C
    uint32_t r; // 0x0030
    uint32_t g; // 0x0034
    uint32_t b; // 0x0038
    uint32_t exponent; // 0x003C
    float m_fTime; // 0x0040
    float m_fDecay; // 0x0044
};

class CTEBloodSprite {
public:
    fVector3 m_vecOrigin; // 0x0020
    fVector3 m_vecDirection; // 0x002C
    uint32_t r; // 0x0038
    uint32_t g; // 0x003C
    uint32_t b; // 0x0040
    uint32_t a; // 0x0044
    uint32_t m_nDropModel; // 0x0048
    uint32_t m_nSprayModel; // 0x004C
    uint32_t m_nSize; // 0x0050
};

class CWeaponSG550 // parent CBaseEntity {
public:
    uint32_t movecollide; // 0x0000
    uint32_t movetype; // 0x0000
    uint32_t m_nRenderFX; // 0x008C
    uint32_t m_clrRender; // 0x0090
    uint32_t m_flAnimTime; // 0x00A0
    uint32_t m_flSimulationTime; // 0x00A8
    uint32_t m_ubInterpolationFrame; // 0x00B4
    uint32_t m_fEffects; // 0x00B8
    uint32_t m_nRenderMode; // 0x00BC
    uint32_t m_nNextThinkTick; // 0x00C4
    uint32_t m_nModelIndex; // 0x00CC
    uint32_t m_iTeamNum; // 0x00D8
    uint32_t m_PredictableID; // 0x00DC
    uint32_t m_iParentAttachment; // 0x01F6
    uint32_t moveparent; // 0x020C
    fVector3 m_vecMinsPreScaled; // 0x0230
    fVector3 m_vecMaxsPreScaled; // 0x023C
    fVector3 m_vecMins; // 0x0248
    fVector3 m_vecMaxs; // 0x0254
    uint32_t m_usSolidFlags; // 0x0264
    uint32_t m_nSurroundType; // 0x0268
    uint32_t m_nSolidType; // 0x0269
    uint32_t m_triggerBloat; // 0x026A
    uint32_t m_bUniformTriggerBloat; // 0x026B
    fVector3 m_vecSpecifiedSurroundingMinsPreScaled; // 0x026C
    fVector3 m_vecSpecifiedSurroundingMaxsPreScaled; // 0x0278
    fVector3 m_vecSpecifiedSurroundingMins; // 0x0284
    fVector3 m_vecSpecifiedSurroundingMaxs; // 0x0290
    float m_flElasticity; // 0x02F0
    float m_flShadowCastDistance; // 0x02F4
    fVector3 m_vecOrigin; // 0x0428
    fVector3 m_angRotation; // 0x0434
    uint32_t m_CollisionGroup; // 0x0444
    uint32_t m_bIsPlayerSimulated; // 0x0724
    uint32_t m_bSimulatedEveryTick; // 0x0725
    uint32_t m_bAnimatedEveryTick; // 0x0726
    uint32_t m_bAlternateSorting; // 0x0727
    uint32_t m_iTextureFrameIndex; // 0x0728
    uint32_t m_hOwnerEntity; // 0x0734
    uint32_t m_hEffectEntity; // 0x0738
    uint32_t m_nSkin; // 0x0798
    uint32_t m_nBody; // 0x079C
    uint32_t m_nHitboxSet; // 0x07A0
    float m_flPlaybackRate; // 0x07D4
    fVector3 m_vecForce; // 0x07E8
    uint32_t m_nForceBone; // 0x07F4
    uint32_t m_bClientSideFrameReset; // 0x0834
    float m_fadeMinDist; // 0x0878
    float m_fadeMaxDist; // 0x087C
    float m_flFadeScale; // 0x0880
    float m_flModelWidthScale; // 0x08E4
    float m_flModelScale; // 0x08E4
    uintptr_t m_flPoseParameter[24]; // 0x08E8
    uintptr_t m_flEncodedController[4]; // 0x0A30
    uint32_t m_bClientSideAnimation; // 0x0AA0
    uint32_t m_nNewSequenceParity; // 0x0AA4
    uint32_t m_nResetEventsParity; // 0x0AA8
    uint32_t m_nSequence; // 0x0AD0
    float m_flCycle; // 0x0AD8
    uint32_t m_hLightingOrigin; // 0x0BA0
    uint32_t m_hLightingOriginRelative; // 0x0BA4
    uint32_t m_nMuzzleFlashParity; // 0x0BA8
    uint32_t m_hOwner; // 0x0BE0
    uint32_t m_nViewModelIndex; // 0x0BE4
    float m_flNextPrimaryAttack; // 0x0BE8
    float m_flNextSecondaryAttack; // 0x0BEC
    float m_flTimeWeaponIdle; // 0x0BF0
    uint32_t m_iViewModelIndex; // 0x0BF8
    uint32_t m_iWorldModelIndex; // 0x0BFC
    uint32_t m_iState; // 0x0C1C
    uint32_t m_iPrimaryAmmoType; // 0x0C28
    uint32_t m_iSecondaryAmmoType; // 0x0C2C
    uint32_t m_iClip1; // 0x0C30
    uint32_t m_iClip2; // 0x0C34
    uint32_t m_bFlipViewModel; // 0x0C60
    uint32_t m_nCustomViewmodelModelIndex; // 0x0C84
    uint32_t m_weaponMode; // 0x0CAC
    float m_fAccuracyPenalty; // 0x0CB0
};

class CTEDecal // parent CBaseTempEntity {
public:
    fVector3 m_vecOrigin; // 0x0020
    fVector3 m_vecStart; // 0x002C
    uint32_t m_nEntity; // 0x0038
    uint32_t m_nHitbox; // 0x003C
    uint32_t m_nIndex; // 0x0040
};

class CTEBubbles // parent CBaseTempEntity {
public:
    fVector3 m_vecMins; // 0x0020
    fVector3 m_vecMaxs; // 0x002C
    float m_fHeight; // 0x0038
    uint32_t m_nModelIndex; // 0x003C
    uint32_t m_nCount; // 0x0040
    float m_fSpeed; // 0x0044
};

class CTeamplayRoundBasedRulesProxy // parent CGameRulesProxy {
public:
    uint32_t m_iRoundState; // 0x0070
    uint32_t m_bInOvertime; // 0x0074
    uint32_t m_bInSetup; // 0x0075
    uint32_t m_bSwitchedTeamsThisRound; // 0x0076
    uint32_t m_iWinningTeam; // 0x0078
    uint32_t m_bInWaitingForPlayers; // 0x0080
    uint32_t m_bAwaitingReadyRestart; // 0x0081
    float m_flRestartRoundTime; // 0x0084
    float m_flMapResetTime; // 0x0088
    uintptr_t m_flNextRespawnWave[32]; // 0x008C
    uintptr_t m_bTeamReady[32]; // 0x010C
    uint32_t m_bStopWatch; // 0x012C
    uint32_t m_bMultipleTrains; // 0x012D
    uintptr_t m_bPlayerReady[66]; // 0x012E
    uint32_t m_bCheatsEnabledDuringLevel; // 0x0170
    uint32_t m_nRoundsPlayed; // 0x0174
    float m_flCountdownTime; // 0x0178
    float m_flStateTransitionTime; // 0x017C
    uintptr_t m_TeamRespawnWaveTimes[32]; // 0x0180
};

class DustTrail // parent CBaseEntity {
public:
    uint32_t movetype; // 0x0000
    uint32_t movecollide; // 0x0000
    uint32_t m_nRenderFX; // 0x008C
    uint32_t m_clrRender; // 0x0090
    uint32_t m_flAnimTime; // 0x00A0
    uint32_t m_flSimulationTime; // 0x00A8
    uint32_t m_ubInterpolationFrame; // 0x00B4
    uint32_t m_fEffects; // 0x00B8
    uint32_t m_nRenderMode; // 0x00BC
    uint32_t m_nModelIndex; // 0x00CC
    uint32_t m_iTeamNum; // 0x00D8
    uint32_t m_PredictableID; // 0x00DC
    uint32_t m_iParentAttachment; // 0x01F6
    uint32_t moveparent; // 0x020C
    fVector3 m_vecMinsPreScaled; // 0x0230
    fVector3 m_vecMaxsPreScaled; // 0x023C
    fVector3 m_vecMins; // 0x0248
    fVector3 m_vecMaxs; // 0x0254
    uint32_t m_usSolidFlags; // 0x0264
    uint32_t m_nSurroundType; // 0x0268
    uint32_t m_nSolidType; // 0x0269
    uint32_t m_triggerBloat; // 0x026A
    uint32_t m_bUniformTriggerBloat; // 0x026B
    fVector3 m_vecSpecifiedSurroundingMinsPreScaled; // 0x026C
    fVector3 m_vecSpecifiedSurroundingMaxsPreScaled; // 0x0278
    fVector3 m_vecSpecifiedSurroundingMins; // 0x0284
    fVector3 m_vecSpecifiedSurroundingMaxs; // 0x0290
    float m_flElasticity; // 0x02F0
    float m_flShadowCastDistance; // 0x02F4
    fVector3 m_vecOrigin; // 0x0428
    fVector3 m_angRotation; // 0x0434
    uint32_t m_CollisionGroup; // 0x0444
    uint32_t m_bIsPlayerSimulated; // 0x0724
    uint32_t m_bSimulatedEveryTick; // 0x0725
    uint32_t m_bAnimatedEveryTick; // 0x0726
    uint32_t m_bAlternateSorting; // 0x0727
    uint32_t m_iTextureFrameIndex; // 0x0728
    uint32_t m_hOwnerEntity; // 0x0734
    uint32_t m_hEffectEntity; // 0x0738
    float m_SpawnRate; // 0x08C0
    fVector3 m_Color; // 0x08C4
    float m_Opacity; // 0x08D0
    float m_ParticleLifetime; // 0x08D4
    float m_StopEmitTime; // 0x08DC
    float m_MinSpeed; // 0x08E0
    float m_MaxSpeed; // 0x08E4
    float m_MinDirectedSpeed; // 0x08E8
    float m_MaxDirectedSpeed; // 0x08EC
    float m_StartSize; // 0x08F0
    float m_EndSize; // 0x08F4
    float m_SpawnRadius; // 0x08F8
    uint32_t m_bEmit; // 0x0908
};

class CTEBSPDecal // parent CBaseTempEntity {
public:
    fVector3 m_vecOrigin; // 0x0020
    uint32_t m_nEntity; // 0x002C
    uint32_t m_nIndex; // 0x0030
};

class CTEBeamSpline {
public:
    void* m_vecPoints; // 0x0000
    uint32_t m_nPoints; // 0x00E0
};

class CWeaponUSP // parent CBaseEntity {
public:
    uint32_t movetype; // 0x0000
    uint32_t movecollide; // 0x0000
    uint32_t m_nRenderFX; // 0x008C
    uint32_t m_clrRender; // 0x0090
    uint32_t m_flAnimTime; // 0x00A0
    uint32_t m_flSimulationTime; // 0x00A8
    uint32_t m_ubInterpolationFrame; // 0x00B4
    uint32_t m_fEffects; // 0x00B8
    uint32_t m_nRenderMode; // 0x00BC
    uint32_t m_nNextThinkTick; // 0x00C4
    uint32_t m_nModelIndex; // 0x00CC
    uint32_t m_iTeamNum; // 0x00D8
    uint32_t m_PredictableID; // 0x00DC
    uint32_t m_iParentAttachment; // 0x01F6
    uint32_t moveparent; // 0x020C
    fVector3 m_vecMinsPreScaled; // 0x0230
    fVector3 m_vecMaxsPreScaled; // 0x023C
    fVector3 m_vecMins; // 0x0248
    fVector3 m_vecMaxs; // 0x0254
    uint32_t m_usSolidFlags; // 0x0264
    uint32_t m_nSurroundType; // 0x0268
    uint32_t m_nSolidType; // 0x0269
    uint32_t m_triggerBloat; // 0x026A
    uint32_t m_bUniformTriggerBloat; // 0x026B
    fVector3 m_vecSpecifiedSurroundingMinsPreScaled; // 0x026C
    fVector3 m_vecSpecifiedSurroundingMaxsPreScaled; // 0x0278
    fVector3 m_vecSpecifiedSurroundingMins; // 0x0284
    fVector3 m_vecSpecifiedSurroundingMaxs; // 0x0290
    float m_flElasticity; // 0x02F0
    float m_flShadowCastDistance; // 0x02F4
    fVector3 m_vecOrigin; // 0x0428
    fVector3 m_angRotation; // 0x0434
    uint32_t m_CollisionGroup; // 0x0444
    uint32_t m_bIsPlayerSimulated; // 0x0724
    uint32_t m_bSimulatedEveryTick; // 0x0725
    uint32_t m_bAnimatedEveryTick; // 0x0726
    uint32_t m_bAlternateSorting; // 0x0727
    uint32_t m_iTextureFrameIndex; // 0x0728
    uint32_t m_hOwnerEntity; // 0x0734
    uint32_t m_hEffectEntity; // 0x0738
    uint32_t m_nSkin; // 0x0798
    uint32_t m_nBody; // 0x079C
    uint32_t m_nHitboxSet; // 0x07A0
    float m_flPlaybackRate; // 0x07D4
    fVector3 m_vecForce; // 0x07E8
    uint32_t m_nForceBone; // 0x07F4
    uint32_t m_bClientSideFrameReset; // 0x0834
    float m_fadeMinDist; // 0x0878
    float m_fadeMaxDist; // 0x087C
    float m_flFadeScale; // 0x0880
    float m_flModelScale; // 0x08E4
    float m_flModelWidthScale; // 0x08E4
    uintptr_t m_flPoseParameter[24]; // 0x08E8
    uintptr_t m_flEncodedController[4]; // 0x0A30
    uint32_t m_bClientSideAnimation; // 0x0AA0
    uint32_t m_nNewSequenceParity; // 0x0AA4
    uint32_t m_nResetEventsParity; // 0x0AA8
    uint32_t m_nSequence; // 0x0AD0
    float m_flCycle; // 0x0AD8
    uint32_t m_hLightingOrigin; // 0x0BA0
    uint32_t m_hLightingOriginRelative; // 0x0BA4
    uint32_t m_nMuzzleFlashParity; // 0x0BA8
    uint32_t m_hOwner; // 0x0BE0
    uint32_t m_nViewModelIndex; // 0x0BE4
    float m_flNextPrimaryAttack; // 0x0BE8
    float m_flNextSecondaryAttack; // 0x0BEC
    float m_flTimeWeaponIdle; // 0x0BF0
    uint32_t m_iViewModelIndex; // 0x0BF8
    uint32_t m_iWorldModelIndex; // 0x0BFC
    uint32_t m_iState; // 0x0C1C
    uint32_t m_iPrimaryAmmoType; // 0x0C28
    uint32_t m_iSecondaryAmmoType; // 0x0C2C
    uint32_t m_iClip1; // 0x0C30
    uint32_t m_iClip2; // 0x0C34
    uint32_t m_bFlipViewModel; // 0x0C60
    uint32_t m_nCustomViewmodelModelIndex; // 0x0C84
    uint32_t m_weaponMode; // 0x0CAC
    float m_fAccuracyPenalty; // 0x0CB0
    uint32_t m_bSilencerOn; // 0x0CF8
    float m_flDoneSwitchingSilencer; // 0x0CFC
};

class CBaseParticleEntity // parent CBaseEntity {
public:
    uint32_t movecollide; // 0x0000
    uint32_t movetype; // 0x0000
    uint32_t m_nRenderFX; // 0x008C
    uint32_t m_clrRender; // 0x0090
    uint32_t m_flAnimTime; // 0x00A0
    uint32_t m_flSimulationTime; // 0x00A8
    uint32_t m_ubInterpolationFrame; // 0x00B4
    uint32_t m_fEffects; // 0x00B8
    uint32_t m_nRenderMode; // 0x00BC
    uint32_t m_nModelIndex; // 0x00CC
    uint32_t m_iTeamNum; // 0x00D8
    uint32_t m_PredictableID; // 0x00DC
    uint32_t m_iParentAttachment; // 0x01F6
    uint32_t moveparent; // 0x020C
    fVector3 m_vecMinsPreScaled; // 0x0230
    fVector3 m_vecMaxsPreScaled; // 0x023C
    fVector3 m_vecMins; // 0x0248
    fVector3 m_vecMaxs; // 0x0254
    uint32_t m_usSolidFlags; // 0x0264
    uint32_t m_nSurroundType; // 0x0268
    uint32_t m_nSolidType; // 0x0269
    uint32_t m_triggerBloat; // 0x026A
    uint32_t m_bUniformTriggerBloat; // 0x026B
    fVector3 m_vecSpecifiedSurroundingMinsPreScaled; // 0x026C
    fVector3 m_vecSpecifiedSurroundingMaxsPreScaled; // 0x0278
    fVector3 m_vecSpecifiedSurroundingMins; // 0x0284
    fVector3 m_vecSpecifiedSurroundingMaxs; // 0x0290
    float m_flElasticity; // 0x02F0
    float m_flShadowCastDistance; // 0x02F4
    fVector3 m_vecOrigin; // 0x0428
    fVector3 m_angRotation; // 0x0434
    uint32_t m_CollisionGroup; // 0x0444
    uint32_t m_bIsPlayerSimulated; // 0x0724
    uint32_t m_bSimulatedEveryTick; // 0x0725
    uint32_t m_bAnimatedEveryTick; // 0x0726
    uint32_t m_bAlternateSorting; // 0x0727
    uint32_t m_iTextureFrameIndex; // 0x0728
    uint32_t m_hOwnerEntity; // 0x0734
    uint32_t m_hEffectEntity; // 0x0738
};

class CEnvQuadraticBeam // parent CBaseEntity {
public:
    uint32_t movecollide; // 0x0000
    uint32_t movetype; // 0x0000
    uint32_t m_nRenderFX; // 0x008C
    uint32_t m_clrRender; // 0x0090
    uint32_t m_flAnimTime; // 0x00A0
    uint32_t m_flSimulationTime; // 0x00A8
    uint32_t m_ubInterpolationFrame; // 0x00B4
    uint32_t m_fEffects; // 0x00B8
    uint32_t m_nRenderMode; // 0x00BC
    uint32_t m_nModelIndex; // 0x00CC
    uint32_t m_iTeamNum; // 0x00D8
    uint32_t m_PredictableID; // 0x00DC
    uint32_t m_iParentAttachment; // 0x01F6
    uint32_t moveparent; // 0x020C
    fVector3 m_vecMinsPreScaled; // 0x0230
    fVector3 m_vecMaxsPreScaled; // 0x023C
    fVector3 m_vecMins; // 0x0248
    fVector3 m_vecMaxs; // 0x0254
    uint32_t m_usSolidFlags; // 0x0264
    uint32_t m_nSurroundType; // 0x0268
    uint32_t m_nSolidType; // 0x0269
    uint32_t m_triggerBloat; // 0x026A
    uint32_t m_bUniformTriggerBloat; // 0x026B
    fVector3 m_vecSpecifiedSurroundingMinsPreScaled; // 0x026C
    fVector3 m_vecSpecifiedSurroundingMaxsPreScaled; // 0x0278
    fVector3 m_vecSpecifiedSurroundingMins; // 0x0284
    fVector3 m_vecSpecifiedSurroundingMaxs; // 0x0290
    float m_flElasticity; // 0x02F0
    float m_flShadowCastDistance; // 0x02F4
    fVector3 m_vecOrigin; // 0x0428
    fVector3 m_angRotation; // 0x0434
    uint32_t m_CollisionGroup; // 0x0444
    uint32_t m_bIsPlayerSimulated; // 0x0724
    uint32_t m_bSimulatedEveryTick; // 0x0725
    uint32_t m_bAnimatedEveryTick; // 0x0726
    uint32_t m_bAlternateSorting; // 0x0727
    uint32_t m_iTextureFrameIndex; // 0x0728
    uint32_t m_hOwnerEntity; // 0x0734
    uint32_t m_hEffectEntity; // 0x0738
    fVector3 m_targetPosition; // 0x0788
    fVector3 m_controlPosition; // 0x0794
    float m_scrollRate; // 0x07A0
    float m_flWidth; // 0x07A4
};

class MovieExplosion // parent CBaseEntity {
public:
    uint32_t movecollide; // 0x0000
    uint32_t movetype; // 0x0000
    uint32_t m_nRenderFX; // 0x008C
    uint32_t m_clrRender; // 0x0090
    uint32_t m_flAnimTime; // 0x00A0
    uint32_t m_flSimulationTime; // 0x00A8
    uint32_t m_ubInterpolationFrame; // 0x00B4
    uint32_t m_fEffects; // 0x00B8
    uint32_t m_nRenderMode; // 0x00BC
    uint32_t m_nModelIndex; // 0x00CC
    uint32_t m_iTeamNum; // 0x00D8
    uint32_t m_PredictableID; // 0x00DC
    uint32_t m_iParentAttachment; // 0x01F6
    uint32_t moveparent; // 0x020C
    fVector3 m_vecMinsPreScaled; // 0x0230
    fVector3 m_vecMaxsPreScaled; // 0x023C
    fVector3 m_vecMins; // 0x0248
    fVector3 m_vecMaxs; // 0x0254
    uint32_t m_usSolidFlags; // 0x0264
    uint32_t m_nSurroundType; // 0x0268
    uint32_t m_nSolidType; // 0x0269
    uint32_t m_triggerBloat; // 0x026A
    uint32_t m_bUniformTriggerBloat; // 0x026B
    fVector3 m_vecSpecifiedSurroundingMinsPreScaled; // 0x026C
    fVector3 m_vecSpecifiedSurroundingMaxsPreScaled; // 0x0278
    fVector3 m_vecSpecifiedSurroundingMins; // 0x0284
    fVector3 m_vecSpecifiedSurroundingMaxs; // 0x0290
    float m_flElasticity; // 0x02F0
    float m_flShadowCastDistance; // 0x02F4
    fVector3 m_vecOrigin; // 0x0428
    fVector3 m_angRotation; // 0x0434
    uint32_t m_CollisionGroup; // 0x0444
    uint32_t m_bIsPlayerSimulated; // 0x0724
    uint32_t m_bSimulatedEveryTick; // 0x0725
    uint32_t m_bAnimatedEveryTick; // 0x0726
    uint32_t m_bAlternateSorting; // 0x0727
    uint32_t m_iTextureFrameIndex; // 0x0728
    uint32_t m_hOwnerEntity; // 0x0734
    uint32_t m_hEffectEntity; // 0x0738
};

class CTEBeamRingPoint // parent CBaseBeam {
public:
    uint32_t m_nModelIndex; // 0x0020
    uint32_t m_nHaloIndex; // 0x0024
    uint32_t m_nStartFrame; // 0x0028
    uint32_t m_nFrameRate; // 0x002C
    float m_fLife; // 0x0030
    float m_fWidth; // 0x0034
    float m_fEndWidth; // 0x0038
    uint32_t m_nFadeLength; // 0x003C
    float m_fAmplitude; // 0x0040
    uint32_t r; // 0x0044
    uint32_t g; // 0x0048
    uint32_t b; // 0x004C
    uint32_t a; // 0x0050
    uint32_t m_nSpeed; // 0x0054
    uint32_t m_nFlags; // 0x0058
    fVector3 m_vecCenter; // 0x0060
    float m_flStartRadius; // 0x006C
    float m_flEndRadius; // 0x0070
};

class CTEBeamRing // parent CBaseBeam {
public:
    uint32_t m_nModelIndex; // 0x0020
    uint32_t m_nHaloIndex; // 0x0024
    uint32_t m_nStartFrame; // 0x0028
    uint32_t m_nFrameRate; // 0x002C
    float m_fLife; // 0x0030
    float m_fWidth; // 0x0034
    float m_fEndWidth; // 0x0038
    uint32_t m_nFadeLength; // 0x003C
    float m_fAmplitude; // 0x0040
    uint32_t r; // 0x0044
    uint32_t g; // 0x0048
    uint32_t b; // 0x004C
    uint32_t a; // 0x0050
    uint32_t m_nSpeed; // 0x0054
    uint32_t m_nFlags; // 0x0058
    uint32_t m_nStartEntity; // 0x0060
    uint32_t m_nEndEntity; // 0x0064
};

class CWeaponXM1014 // parent CBaseEntity {
public:
    uint32_t movetype; // 0x0000
    uint32_t movecollide; // 0x0000
    uint32_t m_nRenderFX; // 0x008C
    uint32_t m_clrRender; // 0x0090
    uint32_t m_flAnimTime; // 0x00A0
    uint32_t m_flSimulationTime; // 0x00A8
    uint32_t m_ubInterpolationFrame; // 0x00B4
    uint32_t m_fEffects; // 0x00B8
    uint32_t m_nRenderMode; // 0x00BC
    uint32_t m_nNextThinkTick; // 0x00C4
    uint32_t m_nModelIndex; // 0x00CC
    uint32_t m_iTeamNum; // 0x00D8
    uint32_t m_PredictableID; // 0x00DC
    uint32_t m_iParentAttachment; // 0x01F6
    uint32_t moveparent; // 0x020C
    fVector3 m_vecMinsPreScaled; // 0x0230
    fVector3 m_vecMaxsPreScaled; // 0x023C
    fVector3 m_vecMins; // 0x0248
    fVector3 m_vecMaxs; // 0x0254
    uint32_t m_usSolidFlags; // 0x0264
    uint32_t m_nSurroundType; // 0x0268
    uint32_t m_nSolidType; // 0x0269
    uint32_t m_triggerBloat; // 0x026A
    uint32_t m_bUniformTriggerBloat; // 0x026B
    fVector3 m_vecSpecifiedSurroundingMinsPreScaled; // 0x026C
    fVector3 m_vecSpecifiedSurroundingMaxsPreScaled; // 0x0278
    fVector3 m_vecSpecifiedSurroundingMins; // 0x0284
    fVector3 m_vecSpecifiedSurroundingMaxs; // 0x0290
    float m_flElasticity; // 0x02F0
    float m_flShadowCastDistance; // 0x02F4
    fVector3 m_vecOrigin; // 0x0428
    fVector3 m_angRotation; // 0x0434
    uint32_t m_CollisionGroup; // 0x0444
    uint32_t m_bIsPlayerSimulated; // 0x0724
    uint32_t m_bSimulatedEveryTick; // 0x0725
    uint32_t m_bAnimatedEveryTick; // 0x0726
    uint32_t m_bAlternateSorting; // 0x0727
    uint32_t m_iTextureFrameIndex; // 0x0728
    uint32_t m_hOwnerEntity; // 0x0734
    uint32_t m_hEffectEntity; // 0x0738
    uint32_t m_nSkin; // 0x0798
    uint32_t m_nBody; // 0x079C
    uint32_t m_nHitboxSet; // 0x07A0
    float m_flPlaybackRate; // 0x07D4
    fVector3 m_vecForce; // 0x07E8
    uint32_t m_nForceBone; // 0x07F4
    uint32_t m_bClientSideFrameReset; // 0x0834
    float m_fadeMinDist; // 0x0878
    float m_fadeMaxDist; // 0x087C
    float m_flFadeScale; // 0x0880
    float m_flModelWidthScale; // 0x08E4
    float m_flModelScale; // 0x08E4
    uintptr_t m_flPoseParameter[24]; // 0x08E8
    uintptr_t m_flEncodedController[4]; // 0x0A30
    uint32_t m_bClientSideAnimation; // 0x0AA0
    uint32_t m_nNewSequenceParity; // 0x0AA4
    uint32_t m_nResetEventsParity; // 0x0AA8
    uint32_t m_nSequence; // 0x0AD0
    float m_flCycle; // 0x0AD8
    uint32_t m_hLightingOrigin; // 0x0BA0
    uint32_t m_hLightingOriginRelative; // 0x0BA4
    uint32_t m_nMuzzleFlashParity; // 0x0BA8
    uint32_t m_hOwner; // 0x0BE0
    uint32_t m_nViewModelIndex; // 0x0BE4
    float m_flNextPrimaryAttack; // 0x0BE8
    float m_flNextSecondaryAttack; // 0x0BEC
    float m_flTimeWeaponIdle; // 0x0BF0
    uint32_t m_iViewModelIndex; // 0x0BF8
    uint32_t m_iWorldModelIndex; // 0x0BFC
    uint32_t m_iState; // 0x0C1C
    uint32_t m_iPrimaryAmmoType; // 0x0C28
    uint32_t m_iSecondaryAmmoType; // 0x0C2C
    uint32_t m_iClip1; // 0x0C30
    uint32_t m_iClip2; // 0x0C34
    uint32_t m_bFlipViewModel; // 0x0C60
    uint32_t m_nCustomViewmodelModelIndex; // 0x0C84
    uint32_t m_weaponMode; // 0x0CAC
    float m_fAccuracyPenalty; // 0x0CB0
    uint32_t m_reloadState; // 0x0CFC
};

class SporeExplosion // parent CBaseEntity {
public:
    uint32_t movecollide; // 0x0000
    uint32_t movetype; // 0x0000
    uint32_t m_nRenderFX; // 0x008C
    uint32_t m_clrRender; // 0x0090
    uint32_t m_flAnimTime; // 0x00A0
    uint32_t m_flSimulationTime; // 0x00A8
    uint32_t m_ubInterpolationFrame; // 0x00B4
    uint32_t m_fEffects; // 0x00B8
    uint32_t m_nRenderMode; // 0x00BC
    uint32_t m_nModelIndex; // 0x00CC
    uint32_t m_iTeamNum; // 0x00D8
    uint32_t m_PredictableID; // 0x00DC
    uint32_t m_iParentAttachment; // 0x01F6
    uint32_t moveparent; // 0x020C
    fVector3 m_vecMinsPreScaled; // 0x0230
    fVector3 m_vecMaxsPreScaled; // 0x023C
    fVector3 m_vecMins; // 0x0248
    fVector3 m_vecMaxs; // 0x0254
    uint32_t m_usSolidFlags; // 0x0264
    uint32_t m_nSurroundType; // 0x0268
    uint32_t m_nSolidType; // 0x0269
    uint32_t m_triggerBloat; // 0x026A
    uint32_t m_bUniformTriggerBloat; // 0x026B
    fVector3 m_vecSpecifiedSurroundingMinsPreScaled; // 0x026C
    fVector3 m_vecSpecifiedSurroundingMaxsPreScaled; // 0x0278
    fVector3 m_vecSpecifiedSurroundingMins; // 0x0284
    fVector3 m_vecSpecifiedSurroundingMaxs; // 0x0290
    float m_flElasticity; // 0x02F0
    float m_flShadowCastDistance; // 0x02F4
    fVector3 m_vecOrigin; // 0x0428
    fVector3 m_angRotation; // 0x0434
    uint32_t m_CollisionGroup; // 0x0444
    uint32_t m_bIsPlayerSimulated; // 0x0724
    uint32_t m_bSimulatedEveryTick; // 0x0725
    uint32_t m_bAnimatedEveryTick; // 0x0726
    uint32_t m_bAlternateSorting; // 0x0727
    uint32_t m_iTextureFrameIndex; // 0x0728
    uint32_t m_hOwnerEntity; // 0x0734
    uint32_t m_hEffectEntity; // 0x0738
    float m_flSpawnRate; // 0x08C0
    float m_flParticleLifetime; // 0x08C4
    float m_flStartSize; // 0x08C8
    float m_flEndSize; // 0x08CC
    float m_flSpawnRadius; // 0x08D0
    uint32_t m_bEmit; // 0x08D8
    uint32_t m_bDontRemove; // 0x08D9
};

class CTEBeamPoints // parent CBaseBeam {
public:
    uint32_t m_nModelIndex; // 0x0020
    uint32_t m_nHaloIndex; // 0x0024
    uint32_t m_nStartFrame; // 0x0028
    uint32_t m_nFrameRate; // 0x002C
    float m_fLife; // 0x0030
    float m_fWidth; // 0x0034
    float m_fEndWidth; // 0x0038
    uint32_t m_nFadeLength; // 0x003C
    float m_fAmplitude; // 0x0040
    uint32_t r; // 0x0044
    uint32_t g; // 0x0048
    uint32_t b; // 0x004C
    uint32_t a; // 0x0050
    uint32_t m_nSpeed; // 0x0054
    uint32_t m_nFlags; // 0x0058
    fVector3 m_vecStartPoint; // 0x0060
    fVector3 m_vecEndPoint; // 0x006C
};

class CSmokeStack // parent CBaseEntity {
public:
    uint32_t movetype; // 0x0000
    uint32_t movecollide; // 0x0000
    uint32_t m_nRenderFX; // 0x008C
    uint32_t m_clrRender; // 0x0090
    uint32_t m_flAnimTime; // 0x00A0
    uint32_t m_flSimulationTime; // 0x00A8
    uint32_t m_ubInterpolationFrame; // 0x00B4
    uint32_t m_fEffects; // 0x00B8
    uint32_t m_nRenderMode; // 0x00BC
    uint32_t m_nModelIndex; // 0x00CC
    uint32_t m_iTeamNum; // 0x00D8
    uint32_t m_PredictableID; // 0x00DC
    uint32_t m_iParentAttachment; // 0x01F6
    uint32_t moveparent; // 0x020C
    fVector3 m_vecMinsPreScaled; // 0x0230
    fVector3 m_vecMaxsPreScaled; // 0x023C
    fVector3 m_vecMins; // 0x0248
    fVector3 m_vecMaxs; // 0x0254
    uint32_t m_usSolidFlags; // 0x0264
    uint32_t m_nSurroundType; // 0x0268
    uint32_t m_nSolidType; // 0x0269
    uint32_t m_triggerBloat; // 0x026A
    uint32_t m_bUniformTriggerBloat; // 0x026B
    fVector3 m_vecSpecifiedSurroundingMinsPreScaled; // 0x026C
    fVector3 m_vecSpecifiedSurroundingMaxsPreScaled; // 0x0278
    fVector3 m_vecSpecifiedSurroundingMins; // 0x0284
    fVector3 m_vecSpecifiedSurroundingMaxs; // 0x0290
    float m_flElasticity; // 0x02F0
    float m_flShadowCastDistance; // 0x02F4
    fVector3 m_vecOrigin; // 0x0428
    fVector3 m_angRotation; // 0x0434
    uint32_t m_CollisionGroup; // 0x0444
    uint32_t m_bIsPlayerSimulated; // 0x0724
    uint32_t m_bSimulatedEveryTick; // 0x0725
    uint32_t m_bAnimatedEveryTick; // 0x0726
    uint32_t m_bAlternateSorting; // 0x0727
    uint32_t m_iTextureFrameIndex; // 0x0728
    uint32_t m_hOwnerEntity; // 0x0734
    uint32_t m_hEffectEntity; // 0x0738
    float m_SpreadSpeed; // 0x0918
    float m_Speed; // 0x091C
    float m_StartSize; // 0x0920
    float m_EndSize; // 0x0924
    float m_Rate; // 0x0928
    float m_JetLength; // 0x092C
    uint32_t m_bEmit; // 0x0930
    float m_flBaseSpread; // 0x0934
    fVector3 m_AmbientLight.m_vPos; // 0x0938
    fVector3 m_AmbientLight.m_vColor; // 0x0944
    float m_AmbientLight.m_flIntensity; // 0x0950
    fVector3 m_DirLight.m_vPos; // 0x0954
    fVector3 m_DirLight.m_vColor; // 0x0960
    float m_DirLight.m_flIntensity; // 0x096C
    fVector3 m_vWind; // 0x097C
    float m_flTwist; // 0x0988
    uint32_t m_iMaterialModel; // 0x098C
    float m_flRollSpeed; // 0x09D0
};

class CAI_BaseNPC // parent CBaseEntity {
public:
    uint32_t movecollide; // 0x0000
    uint32_t lengthprop15; // 0x0000
    uint32_t movetype; // 0x0000
    uint32_t m_nSequence; // 0x0000
    float m_flPrevCycle; // 0x0004
    float m_flWeight; // 0x0008
    uint32_t m_nOrder; // 0x000C
    float m_flCycle; // 0x0014
    uint32_t m_nRenderFX; // 0x008C
    uint32_t m_clrRender; // 0x0090
    uint32_t m_flAnimTime; // 0x00A0
    uint32_t m_flSimulationTime; // 0x00A8
    uint32_t m_ubInterpolationFrame; // 0x00B4
    uint32_t m_fEffects; // 0x00B8
    uint32_t m_nRenderMode; // 0x00BC
    uint32_t m_nModelIndex; // 0x00CC
    uint32_t m_lifeState; // 0x00CF
    uint32_t m_iTeamNum; // 0x00D8
    uint32_t m_PredictableID; // 0x00DC
    uint32_t m_iParentAttachment; // 0x01F6
    uint32_t moveparent; // 0x020C
    fVector3 m_vecMinsPreScaled; // 0x0230
    fVector3 m_vecMaxsPreScaled; // 0x023C
    fVector3 m_vecMins; // 0x0248
    fVector3 m_vecMaxs; // 0x0254
    uint32_t m_usSolidFlags; // 0x0264
    uint32_t m_nSurroundType; // 0x0268
    uint32_t m_nSolidType; // 0x0269
    uint32_t m_triggerBloat; // 0x026A
    uint32_t m_bUniformTriggerBloat; // 0x026B
    fVector3 m_vecSpecifiedSurroundingMinsPreScaled; // 0x026C
    fVector3 m_vecSpecifiedSurroundingMaxsPreScaled; // 0x0278
    fVector3 m_vecSpecifiedSurroundingMins; // 0x0284
    fVector3 m_vecSpecifiedSurroundingMaxs; // 0x0290
    float m_flElasticity; // 0x02F0
    float m_flShadowCastDistance; // 0x02F4
    fVector3 m_vecOrigin; // 0x0428
    fVector3 m_angRotation; // 0x0434
    uint32_t m_CollisionGroup; // 0x0444
    uint32_t m_bIsPlayerSimulated; // 0x0724
    uint32_t m_bSimulatedEveryTick; // 0x0725
    uint32_t m_bAnimatedEveryTick; // 0x0726
    uint32_t m_bAlternateSorting; // 0x0727
    uint32_t m_iTextureFrameIndex; // 0x0728
    uint32_t m_hOwnerEntity; // 0x0734
    uint32_t m_hEffectEntity; // 0x0738
    uint32_t m_nSkin; // 0x0798
    uint32_t m_nBody; // 0x079C
    uint32_t m_nHitboxSet; // 0x07A0
    float m_flPlaybackRate; // 0x07D4
    fVector3 m_vecForce; // 0x07E8
    uint32_t m_nForceBone; // 0x07F4
    uint32_t m_bClientSideFrameReset; // 0x0834
    float m_fadeMinDist; // 0x0878
    float m_fadeMaxDist; // 0x087C
    float m_flFadeScale; // 0x0880
    float m_flModelWidthScale; // 0x08E4
    float m_flModelScale; // 0x08E4
    uintptr_t m_flPoseParameter[24]; // 0x08E8
    uintptr_t m_flEncodedController[4]; // 0x0A30
    uint32_t m_bClientSideAnimation; // 0x0AA0
    uint32_t m_nNewSequenceParity; // 0x0AA4
    uint32_t m_nResetEventsParity; // 0x0AA8
    uint32_t m_hLightingOrigin; // 0x0BA0
    uint32_t m_hLightingOriginRelative; // 0x0BA4
    uint32_t m_nMuzzleFlashParity; // 0x0BA8
    fVector3 m_viewtarget; // 0x0C68
    uintptr_t m_flexWeight[96]; // 0x0CC8
    uint32_t m_blinktoggle; // 0x0E98
    float m_flNextAttack; // 0x1058
    uintptr_t m_hMyWeapons[48]; // 0x10E0
    uint32_t m_hActiveWeapon; // 0x11A0
    float m_flTimePingEffect; // 0x11A8
    uint32_t m_iDeathPose; // 0x11AC
    uint32_t m_iDeathFrame; // 0x11B0
    uint32_t m_iSpeedModRadius; // 0x11B4
    uint32_t m_iSpeedModSpeed; // 0x11B8
    uint32_t m_bPerformAvoidance; // 0x11BC
    uint32_t m_bIsMoving; // 0x11BD
    uint32_t m_bFadeCorpse; // 0x11BE
    uint32_t m_bSpeedModActive; // 0x11BF
    uint32_t m_bImportanRagdoll; // 0x11C0
};

class CTEBaseBeam {
public:
    uint32_t m_nModelIndex; // 0x0020
    uint32_t m_nHaloIndex; // 0x0024
    uint32_t m_nStartFrame; // 0x0028
    uint32_t m_nFrameRate; // 0x002C
    float m_fLife; // 0x0030
    float m_fWidth; // 0x0034
    float m_fEndWidth; // 0x0038
    uint32_t m_nFadeLength; // 0x003C
    float m_fAmplitude; // 0x0040
    uint32_t r; // 0x0044
    uint32_t g; // 0x0048
    uint32_t b; // 0x004C
    uint32_t a; // 0x0050
    uint32_t m_nSpeed; // 0x0054
    uint32_t m_nFlags; // 0x0058
};

class CInfoLadderDismount // parent CBaseEntity {
public:
    uint32_t movecollide; // 0x0000
    uint32_t movetype; // 0x0000
    uint32_t m_nRenderFX; // 0x008C
    uint32_t m_clrRender; // 0x0090
    uint32_t m_flAnimTime; // 0x00A0
    uint32_t m_flSimulationTime; // 0x00A8
    uint32_t m_ubInterpolationFrame; // 0x00B4
    uint32_t m_fEffects; // 0x00B8
    uint32_t m_nRenderMode; // 0x00BC
    uint32_t m_nModelIndex; // 0x00CC
    uint32_t m_iTeamNum; // 0x00D8
    uint32_t m_PredictableID; // 0x00DC
    uint32_t m_iParentAttachment; // 0x01F6
    uint32_t moveparent; // 0x020C
    fVector3 m_vecMinsPreScaled; // 0x0230
    fVector3 m_vecMaxsPreScaled; // 0x023C
    fVector3 m_vecMins; // 0x0248
    fVector3 m_vecMaxs; // 0x0254
    uint32_t m_usSolidFlags; // 0x0264
    uint32_t m_nSurroundType; // 0x0268
    uint32_t m_nSolidType; // 0x0269
    uint32_t m_triggerBloat; // 0x026A
    uint32_t m_bUniformTriggerBloat; // 0x026B
    fVector3 m_vecSpecifiedSurroundingMinsPreScaled; // 0x026C
    fVector3 m_vecSpecifiedSurroundingMaxsPreScaled; // 0x0278
    fVector3 m_vecSpecifiedSurroundingMins; // 0x0284
    fVector3 m_vecSpecifiedSurroundingMaxs; // 0x0290
    float m_flElasticity; // 0x02F0
    float m_flShadowCastDistance; // 0x02F4
    fVector3 m_vecOrigin; // 0x0428
    fVector3 m_angRotation; // 0x0434
    uint32_t m_CollisionGroup; // 0x0444
    uint32_t m_bIsPlayerSimulated; // 0x0724
    uint32_t m_bSimulatedEveryTick; // 0x0725
    uint32_t m_bAnimatedEveryTick; // 0x0726
    uint32_t m_bAlternateSorting; // 0x0727
    uint32_t m_iTextureFrameIndex; // 0x0728
    uint32_t m_hOwnerEntity; // 0x0734
    uint32_t m_hEffectEntity; // 0x0738
};

class CTEBeamFollow // parent CBaseBeam {
public:
    uint32_t m_nModelIndex; // 0x0020
    uint32_t m_nHaloIndex; // 0x0024
    uint32_t m_nStartFrame; // 0x0028
    uint32_t m_nFrameRate; // 0x002C
    float m_fLife; // 0x0030
    float m_fWidth; // 0x0034
    float m_fEndWidth; // 0x0038
    uint32_t m_nFadeLength; // 0x003C
    float m_fAmplitude; // 0x0040
    uint32_t r; // 0x0044
    uint32_t g; // 0x0048
    uint32_t b; // 0x004C
    uint32_t a; // 0x0050
    uint32_t m_nSpeed; // 0x0054
    uint32_t m_nFlags; // 0x0058
    uint32_t m_iEntIndex; // 0x0060
};

class CTEBeamEnts // parent CBaseBeam {
public:
    uint32_t m_nModelIndex; // 0x0020
    uint32_t m_nHaloIndex; // 0x0024
    uint32_t m_nStartFrame; // 0x0028
    uint32_t m_nFrameRate; // 0x002C
    float m_fLife; // 0x0030
    float m_fWidth; // 0x0034
    float m_fEndWidth; // 0x0038
    uint32_t m_nFadeLength; // 0x003C
    float m_fAmplitude; // 0x0040
    uint32_t r; // 0x0044
    uint32_t g; // 0x0048
    uint32_t b; // 0x004C
    uint32_t a; // 0x0050
    uint32_t m_nSpeed; // 0x0054
    uint32_t m_nFlags; // 0x0058
    uint32_t m_nStartEntity; // 0x0060
    uint32_t m_nEndEntity; // 0x0064
};

class CTEBeamEntPoint // parent CBaseBeam {
public:
    uint32_t m_nModelIndex; // 0x0020
    uint32_t m_nHaloIndex; // 0x0024
    uint32_t m_nStartFrame; // 0x0028
    uint32_t m_nFrameRate; // 0x002C
    float m_fLife; // 0x0030
    float m_fWidth; // 0x0034
    float m_fEndWidth; // 0x0038
    uint32_t m_nFadeLength; // 0x003C
    float m_fAmplitude; // 0x0040
    uint32_t r; // 0x0044
    uint32_t g; // 0x0048
    uint32_t b; // 0x004C
    uint32_t a; // 0x0050
    uint32_t m_nSpeed; // 0x0054
    uint32_t m_nFlags; // 0x0058
    uint32_t m_nStartEntity; // 0x0060
    uint32_t m_nEndEntity; // 0x0064
    fVector3 m_vecStartPoint; // 0x0068
    fVector3 m_vecEndPoint; // 0x0074
};

class CBaseTeamObjectiveResource {
public:
    void* m_vCPPositions; // 0x0000
    void* m_iszWarnSound; // 0x0000
    uint32_t m_iTimerToShowInHUD; // 0x0788
    uint32_t m_iStopWatchTimer; // 0x078C
    uint32_t m_iNumControlPoints; // 0x0790
    uint32_t m_bPlayingMiniRounds; // 0x0798
    uint32_t m_bControlPointsReset; // 0x0799
    uint32_t m_iUpdateCapHudParity; // 0x079C
    uintptr_t m_bCPIsVisible[8]; // 0x0804
    uintptr_t m_flLazyCapPerc[8]; // 0x080C
    uintptr_t m_iTeamIcons[64]; // 0x084C
    uintptr_t m_iTeamOverlays[64]; // 0x094C
    uintptr_t m_iTeamReqCappers[64]; // 0x0A4C
    uintptr_t m_flTeamCapTime[64]; // 0x0B4C
    uintptr_t m_iPreviousPoints[192]; // 0x0C4C
    uintptr_t m_bTeamCanCap[64]; // 0x0F4C
    uintptr_t m_iTeamBaseIcons[32]; // 0x0F8C
    uintptr_t m_iBaseControlPoints[32]; // 0x100C
    uintptr_t m_bInMiniRound[8]; // 0x108C
    uintptr_t m_iWarnOnCap[8]; // 0x1094
    uintptr_t m_flPathDistance[8]; // 0x18AC
    uintptr_t m_iCPGroup[8]; // 0x18CC
    uintptr_t m_bCPLocked[8]; // 0x18EC
    uintptr_t m_flUnlockTimes[8]; // 0x18F4
    uintptr_t m_flCPTimerTimes[8]; // 0x1934
    uintptr_t m_iNumTeamMembers[64]; // 0x1974
    uintptr_t m_iCappingTeam[8]; // 0x1A74
    uintptr_t m_iTeamInZone[8]; // 0x1A94
    uintptr_t m_bBlocked[8]; // 0x1AB4
    uintptr_t m_iOwner[8]; // 0x1ABC
    uintptr_t m_bCPCapRateScalesWithPlayers[8]; // 0x1ADC
    const char* m_pszCapLayoutInHUD; // 0x1B4C
    float m_flCustomPositionX; // 0x1B74
    float m_flCustomPositionY; // 0x1B78
    uintptr_t m_nNumNodeHillData[4]; // 0x1B7C
    uintptr_t m_flNodeHillData[40]; // 0x1B8C
    uintptr_t m_bTrackAlarm[4]; // 0x1C40
    uintptr_t m_bHillIsDownhill[20]; // 0x1C44
};

class CTEArmorRicochet // parent CTEMetalSparks {
public:
    fVector3 m_vecPos; // 0x0020
    fVector3 m_vecDir; // 0x002C
};

class CSteamJet // parent CBaseEntity {
public:
    uint32_t movecollide; // 0x0000
    uint32_t movetype; // 0x0000
    uint32_t m_nRenderFX; // 0x008C
    uint32_t m_clrRender; // 0x0090
    uint32_t m_flAnimTime; // 0x00A0
    uint32_t m_flSimulationTime; // 0x00A8
    uint32_t m_ubInterpolationFrame; // 0x00B4
    uint32_t m_fEffects; // 0x00B8
    uint32_t m_nRenderMode; // 0x00BC
    uint32_t m_nModelIndex; // 0x00CC
    uint32_t m_iTeamNum; // 0x00D8
    uint32_t m_PredictableID; // 0x00DC
    uint32_t m_iParentAttachment; // 0x01F6
    uint32_t moveparent; // 0x020C
    fVector3 m_vecMinsPreScaled; // 0x0230
    fVector3 m_vecMaxsPreScaled; // 0x023C
    fVector3 m_vecMins; // 0x0248
    fVector3 m_vecMaxs; // 0x0254
    uint32_t m_usSolidFlags; // 0x0264
    uint32_t m_nSurroundType; // 0x0268
    uint32_t m_nSolidType; // 0x0269
    uint32_t m_triggerBloat; // 0x026A
    uint32_t m_bUniformTriggerBloat; // 0x026B
    fVector3 m_vecSpecifiedSurroundingMinsPreScaled; // 0x026C
    fVector3 m_vecSpecifiedSurroundingMaxsPreScaled; // 0x0278
    fVector3 m_vecSpecifiedSurroundingMins; // 0x0284
    fVector3 m_vecSpecifiedSurroundingMaxs; // 0x0290
    float m_flElasticity; // 0x02F0
    float m_flShadowCastDistance; // 0x02F4
    fVector3 m_vecOrigin; // 0x0428
    fVector3 m_angRotation; // 0x0434
    uint32_t m_CollisionGroup; // 0x0444
    uint32_t m_bIsPlayerSimulated; // 0x0724
    uint32_t m_bSimulatedEveryTick; // 0x0725
    uint32_t m_bAnimatedEveryTick; // 0x0726
    uint32_t m_bAlternateSorting; // 0x0727
    uint32_t m_iTextureFrameIndex; // 0x0728
    uint32_t m_hOwnerEntity; // 0x0734
    uint32_t m_hEffectEntity; // 0x0738
    float m_SpreadSpeed; // 0x08C0
    float m_Speed; // 0x08C4
    float m_StartSize; // 0x08C8
    float m_EndSize; // 0x08CC
    float m_Rate; // 0x08D0
    float m_JetLength; // 0x08D4
    uint32_t m_bEmit; // 0x08D8
    uint32_t m_nType; // 0x08DC
    uint32_t m_bFaceLeft; // 0x08E0
    uint32_t m_spawnflags; // 0x08E4
    float m_flRollSpeed; // 0x08E8
};

class RocketTrail // parent CBaseEntity {
public:
    uint32_t movecollide; // 0x0000
    uint32_t movetype; // 0x0000
    uint32_t m_nRenderFX; // 0x008C
    uint32_t m_clrRender; // 0x0090
    uint32_t m_flAnimTime; // 0x00A0
    uint32_t m_flSimulationTime; // 0x00A8
    uint32_t m_ubInterpolationFrame; // 0x00B4
    uint32_t m_fEffects; // 0x00B8
    uint32_t m_nRenderMode; // 0x00BC
    uint32_t m_nModelIndex; // 0x00CC
    uint32_t m_iTeamNum; // 0x00D8
    uint32_t m_PredictableID; // 0x00DC
    uint32_t m_iParentAttachment; // 0x01F6
    uint32_t moveparent; // 0x020C
    fVector3 m_vecMinsPreScaled; // 0x0230
    fVector3 m_vecMaxsPreScaled; // 0x023C
    fVector3 m_vecMins; // 0x0248
    fVector3 m_vecMaxs; // 0x0254
    uint32_t m_usSolidFlags; // 0x0264
    uint32_t m_nSurroundType; // 0x0268
    uint32_t m_nSolidType; // 0x0269
    uint32_t m_triggerBloat; // 0x026A
    uint32_t m_bUniformTriggerBloat; // 0x026B
    fVector3 m_vecSpecifiedSurroundingMinsPreScaled; // 0x026C
    fVector3 m_vecSpecifiedSurroundingMaxsPreScaled; // 0x0278
    fVector3 m_vecSpecifiedSurroundingMins; // 0x0284
    fVector3 m_vecSpecifiedSurroundingMaxs; // 0x0290
    float m_flElasticity; // 0x02F0
    float m_flShadowCastDistance; // 0x02F4
    fVector3 m_vecOrigin; // 0x0428
    fVector3 m_angRotation; // 0x0434
    uint32_t m_CollisionGroup; // 0x0444
    uint32_t m_bIsPlayerSimulated; // 0x0724
    uint32_t m_bSimulatedEveryTick; // 0x0725
    uint32_t m_bAnimatedEveryTick; // 0x0726
    uint32_t m_bAlternateSorting; // 0x0727
    uint32_t m_iTextureFrameIndex; // 0x0728
    uint32_t m_hOwnerEntity; // 0x0734
    uint32_t m_hEffectEntity; // 0x0738
    float m_SpawnRate; // 0x08C0
    fVector3 m_StartColor; // 0x08C4
    fVector3 m_EndColor; // 0x08D0
    float m_Opacity; // 0x08DC
    float m_ParticleLifetime; // 0x08E0
    float m_StopEmitTime; // 0x08E4
    float m_MinSpeed; // 0x08E8
    float m_MaxSpeed; // 0x08EC
    float m_StartSize; // 0x08F0
    float m_EndSize; // 0x08F4
    float m_SpawnRadius; // 0x08F8
    uint32_t m_bEmit; // 0x0908
    uint32_t m_bDamaged; // 0x0909
    uint32_t m_nAttachment; // 0x090C
    float m_flFlareScale; // 0x091C
};

class CPropVehicleDriveable // parent CBaseEntity {
public:
    uint32_t movetype; // 0x0000
    uint32_t movecollide; // 0x0000
    uint32_t m_nRenderFX; // 0x008C
    uint32_t m_clrRender; // 0x0090
    uint32_t m_flAnimTime; // 0x00A0
    uint32_t m_flSimulationTime; // 0x00A8
    uint32_t m_ubInterpolationFrame; // 0x00B4
    uint32_t m_fEffects; // 0x00B8
    uint32_t m_nRenderMode; // 0x00BC
    uint32_t m_nModelIndex; // 0x00CC
    uint32_t m_iTeamNum; // 0x00D8
    uint32_t m_PredictableID; // 0x00DC
    uint32_t m_iParentAttachment; // 0x01F6
    uint32_t moveparent; // 0x020C
    fVector3 m_vecMinsPreScaled; // 0x0230
    fVector3 m_vecMaxsPreScaled; // 0x023C
    fVector3 m_vecMins; // 0x0248
    fVector3 m_vecMaxs; // 0x0254
    uint32_t m_usSolidFlags; // 0x0264
    uint32_t m_nSurroundType; // 0x0268
    uint32_t m_nSolidType; // 0x0269
    uint32_t m_triggerBloat; // 0x026A
    uint32_t m_bUniformTriggerBloat; // 0x026B
    fVector3 m_vecSpecifiedSurroundingMinsPreScaled; // 0x026C
    fVector3 m_vecSpecifiedSurroundingMaxsPreScaled; // 0x0278
    fVector3 m_vecSpecifiedSurroundingMins; // 0x0284
    fVector3 m_vecSpecifiedSurroundingMaxs; // 0x0290
    float m_flElasticity; // 0x02F0
    float m_flShadowCastDistance; // 0x02F4
    fVector3 m_vecOrigin; // 0x0428
    fVector3 m_angRotation; // 0x0434
    uint32_t m_CollisionGroup; // 0x0444
    uint32_t m_bIsPlayerSimulated; // 0x0724
    uint32_t m_bSimulatedEveryTick; // 0x0725
    uint32_t m_bAnimatedEveryTick; // 0x0726
    uint32_t m_bAlternateSorting; // 0x0727
    uint32_t m_iTextureFrameIndex; // 0x0728
    uint32_t m_hOwnerEntity; // 0x0734
    uint32_t m_hEffectEntity; // 0x0738
    uint32_t m_nSkin; // 0x0798
    uint32_t m_nBody; // 0x079C
    uint32_t m_nHitboxSet; // 0x07A0
    float m_flPlaybackRate; // 0x07D4
    fVector3 m_vecForce; // 0x07E8
    uint32_t m_nForceBone; // 0x07F4
    uint32_t m_bClientSideFrameReset; // 0x0834
    float m_fadeMinDist; // 0x0878
    float m_fadeMaxDist; // 0x087C
    float m_flFadeScale; // 0x0880
    float m_flModelScale; // 0x08E4
    float m_flModelWidthScale; // 0x08E4
    uintptr_t m_flPoseParameter[24]; // 0x08E8
    uintptr_t m_flEncodedController[4]; // 0x0A30
    uint32_t m_bClientSideAnimation; // 0x0AA0
    uint32_t m_nNewSequenceParity; // 0x0AA4
    uint32_t m_nResetEventsParity; // 0x0AA8
    uint32_t m_nSequence; // 0x0AD0
    float m_flCycle; // 0x0AD8
    uint32_t m_hLightingOrigin; // 0x0BA0
    uint32_t m_hLightingOriginRelative; // 0x0BA4
    uint32_t m_nMuzzleFlashParity; // 0x0BA8
    uint32_t m_hPlayer; // 0x0BE8
    uint32_t m_nSpeed; // 0x0BEC
    uint32_t m_nRPM; // 0x0BF0
    float m_flThrottle; // 0x0BF4
    uint32_t m_nBoostTimeLeft; // 0x0BF8
    uint32_t m_nHasBoost; // 0x0BFC
    uint32_t m_nScannerDisabledWeapons; // 0x0C00
    uint32_t m_nScannerDisabledVehicle; // 0x0C04
    uint32_t m_bEnterAnimOn; // 0x0C24
    uint32_t m_bExitAnimOn; // 0x0C25
    fVector3 m_vecGunCrosshair; // 0x0C2C
    fVector3 m_vecEyeExitEndpoint; // 0x0C88
    uint32_t m_bHasGun; // 0x0C94
    uint32_t m_bUnableToFire; // 0x0C95
};

class CParticleFire {
public:
    fVector3 m_vOrigin; // 0x08D0
    fVector3 m_vDirection; // 0x08DC
};

class CTEGaussExplosion // parent CBaseTempEntity {
public:
    float m_vecOrigin[0]; // 0x0020
    float m_vecOrigin[1]; // 0x0024
    float m_vecOrigin[2]; // 0x0028
    uint32_t m_nType; // 0x0030
    fVector3 m_vecDirection; // 0x0034
};

class CEnvWind // parent CBaseEntity {
public:
    uint32_t movetype; // 0x0000
    uint32_t movecollide; // 0x0000
    uint32_t m_nRenderFX; // 0x008C
    uint32_t m_clrRender; // 0x0090
    uint32_t m_flAnimTime; // 0x00A0
    uint32_t m_flSimulationTime; // 0x00A8
    uint32_t m_ubInterpolationFrame; // 0x00B4
    uint32_t m_fEffects; // 0x00B8
    uint32_t m_nRenderMode; // 0x00BC
    uint32_t m_nModelIndex; // 0x00CC
    uint32_t m_iTeamNum; // 0x00D8
    uint32_t m_PredictableID; // 0x00DC
    uint32_t m_iParentAttachment; // 0x01F6
    uint32_t moveparent; // 0x020C
    fVector3 m_vecMinsPreScaled; // 0x0230
    fVector3 m_vecMaxsPreScaled; // 0x023C
    fVector3 m_vecMins; // 0x0248
    fVector3 m_vecMaxs; // 0x0254
    uint32_t m_usSolidFlags; // 0x0264
    uint32_t m_nSurroundType; // 0x0268
    uint32_t m_nSolidType; // 0x0269
    uint32_t m_triggerBloat; // 0x026A
    uint32_t m_bUniformTriggerBloat; // 0x026B
    fVector3 m_vecSpecifiedSurroundingMinsPreScaled; // 0x026C
    fVector3 m_vecSpecifiedSurroundingMaxsPreScaled; // 0x0278
    fVector3 m_vecSpecifiedSurroundingMins; // 0x0284
    fVector3 m_vecSpecifiedSurroundingMaxs; // 0x0290
    float m_flElasticity; // 0x02F0
    float m_flShadowCastDistance; // 0x02F4
    fVector3 m_vecOrigin; // 0x0428
    fVector3 m_angRotation; // 0x0434
    uint32_t m_CollisionGroup; // 0x0444
    uint32_t m_bIsPlayerSimulated; // 0x0724
    uint32_t m_bSimulatedEveryTick; // 0x0725
    uint32_t m_bAnimatedEveryTick; // 0x0726
    uint32_t m_bAlternateSorting; // 0x0727
    uint32_t m_iTextureFrameIndex; // 0x0728
    uint32_t m_hOwnerEntity; // 0x0734
    uint32_t m_hEffectEntity; // 0x0738
    float m_flStartTime; // 0x0790
    uint32_t m_iWindSeed; // 0x0794
    uint32_t m_iMinWind; // 0x0798
    uint32_t m_iMaxWind; // 0x079C
    uint32_t m_iMinGust; // 0x07A4
    uint32_t m_iMaxGust; // 0x07A8
    float m_flMinGustDelay; // 0x07AC
    float m_flMaxGustDelay; // 0x07B0
    float m_flGustDuration; // 0x07B4
    uint32_t m_iGustDirChange; // 0x07B8
    uint32_t m_iInitialWindDir; // 0x07F8
    float m_flInitialWindSpeed; // 0x07FC
};

class CWeaponUMP45 // parent CBaseEntity {
public:
    uint32_t movecollide; // 0x0000
    uint32_t movetype; // 0x0000
    uint32_t m_nRenderFX; // 0x008C
    uint32_t m_clrRender; // 0x0090
    uint32_t m_flAnimTime; // 0x00A0
    uint32_t m_flSimulationTime; // 0x00A8
    uint32_t m_ubInterpolationFrame; // 0x00B4
    uint32_t m_fEffects; // 0x00B8
    uint32_t m_nRenderMode; // 0x00BC
    uint32_t m_nNextThinkTick; // 0x00C4
    uint32_t m_nModelIndex; // 0x00CC
    uint32_t m_iTeamNum; // 0x00D8
    uint32_t m_PredictableID; // 0x00DC
    uint32_t m_iParentAttachment; // 0x01F6
    uint32_t moveparent; // 0x020C
    fVector3 m_vecMinsPreScaled; // 0x0230
    fVector3 m_vecMaxsPreScaled; // 0x023C
    fVector3 m_vecMins; // 0x0248
    fVector3 m_vecMaxs; // 0x0254
    uint32_t m_usSolidFlags; // 0x0264
    uint32_t m_nSurroundType; // 0x0268
    uint32_t m_nSolidType; // 0x0269
    uint32_t m_triggerBloat; // 0x026A
    uint32_t m_bUniformTriggerBloat; // 0x026B
    fVector3 m_vecSpecifiedSurroundingMinsPreScaled; // 0x026C
    fVector3 m_vecSpecifiedSurroundingMaxsPreScaled; // 0x0278
    fVector3 m_vecSpecifiedSurroundingMins; // 0x0284
    fVector3 m_vecSpecifiedSurroundingMaxs; // 0x0290
    float m_flElasticity; // 0x02F0
    float m_flShadowCastDistance; // 0x02F4
    fVector3 m_vecOrigin; // 0x0428
    fVector3 m_angRotation; // 0x0434
    uint32_t m_CollisionGroup; // 0x0444
    uint32_t m_bIsPlayerSimulated; // 0x0724
    uint32_t m_bSimulatedEveryTick; // 0x0725
    uint32_t m_bAnimatedEveryTick; // 0x0726
    uint32_t m_bAlternateSorting; // 0x0727
    uint32_t m_iTextureFrameIndex; // 0x0728
    uint32_t m_hOwnerEntity; // 0x0734
    uint32_t m_hEffectEntity; // 0x0738
    uint32_t m_nSkin; // 0x0798
    uint32_t m_nBody; // 0x079C
    uint32_t m_nHitboxSet; // 0x07A0
    float m_flPlaybackRate; // 0x07D4
    fVector3 m_vecForce; // 0x07E8
    uint32_t m_nForceBone; // 0x07F4
    uint32_t m_bClientSideFrameReset; // 0x0834
    float m_fadeMinDist; // 0x0878
    float m_fadeMaxDist; // 0x087C
    float m_flFadeScale; // 0x0880
    float m_flModelWidthScale; // 0x08E4
    float m_flModelScale; // 0x08E4
    uintptr_t m_flPoseParameter[24]; // 0x08E8
    uintptr_t m_flEncodedController[4]; // 0x0A30
    uint32_t m_bClientSideAnimation; // 0x0AA0
    uint32_t m_nNewSequenceParity; // 0x0AA4
    uint32_t m_nResetEventsParity; // 0x0AA8
    uint32_t m_nSequence; // 0x0AD0
    float m_flCycle; // 0x0AD8
    uint32_t m_hLightingOrigin; // 0x0BA0
    uint32_t m_hLightingOriginRelative; // 0x0BA4
    uint32_t m_nMuzzleFlashParity; // 0x0BA8
    uint32_t m_hOwner; // 0x0BE0
    uint32_t m_nViewModelIndex; // 0x0BE4
    float m_flNextPrimaryAttack; // 0x0BE8
    float m_flNextSecondaryAttack; // 0x0BEC
    float m_flTimeWeaponIdle; // 0x0BF0
    uint32_t m_iViewModelIndex; // 0x0BF8
    uint32_t m_iWorldModelIndex; // 0x0BFC
    uint32_t m_iState; // 0x0C1C
    uint32_t m_iPrimaryAmmoType; // 0x0C28
    uint32_t m_iSecondaryAmmoType; // 0x0C2C
    uint32_t m_iClip1; // 0x0C30
    uint32_t m_iClip2; // 0x0C34
    uint32_t m_bFlipViewModel; // 0x0C60
    uint32_t m_nCustomViewmodelModelIndex; // 0x0C84
    uint32_t m_weaponMode; // 0x0CAC
    float m_fAccuracyPenalty; // 0x0CB0
};

class CWeaponSG552 // parent CBaseEntity {
public:
    uint32_t movecollide; // 0x0000
    uint32_t movetype; // 0x0000
    uint32_t m_nRenderFX; // 0x008C
    uint32_t m_clrRender; // 0x0090
    uint32_t m_flAnimTime; // 0x00A0
    uint32_t m_flSimulationTime; // 0x00A8
    uint32_t m_ubInterpolationFrame; // 0x00B4
    uint32_t m_fEffects; // 0x00B8
    uint32_t m_nRenderMode; // 0x00BC
    uint32_t m_nNextThinkTick; // 0x00C4
    uint32_t m_nModelIndex; // 0x00CC
    uint32_t m_iTeamNum; // 0x00D8
    uint32_t m_PredictableID; // 0x00DC
    uint32_t m_iParentAttachment; // 0x01F6
    uint32_t moveparent; // 0x020C
    fVector3 m_vecMinsPreScaled; // 0x0230
    fVector3 m_vecMaxsPreScaled; // 0x023C
    fVector3 m_vecMins; // 0x0248
    fVector3 m_vecMaxs; // 0x0254
    uint32_t m_usSolidFlags; // 0x0264
    uint32_t m_nSurroundType; // 0x0268
    uint32_t m_nSolidType; // 0x0269
    uint32_t m_triggerBloat; // 0x026A
    uint32_t m_bUniformTriggerBloat; // 0x026B
    fVector3 m_vecSpecifiedSurroundingMinsPreScaled; // 0x026C
    fVector3 m_vecSpecifiedSurroundingMaxsPreScaled; // 0x0278
    fVector3 m_vecSpecifiedSurroundingMins; // 0x0284
    fVector3 m_vecSpecifiedSurroundingMaxs; // 0x0290
    float m_flElasticity; // 0x02F0
    float m_flShadowCastDistance; // 0x02F4
    fVector3 m_vecOrigin; // 0x0428
    fVector3 m_angRotation; // 0x0434
    uint32_t m_CollisionGroup; // 0x0444
    uint32_t m_bIsPlayerSimulated; // 0x0724
    uint32_t m_bSimulatedEveryTick; // 0x0725
    uint32_t m_bAnimatedEveryTick; // 0x0726
    uint32_t m_bAlternateSorting; // 0x0727
    uint32_t m_iTextureFrameIndex; // 0x0728
    uint32_t m_hOwnerEntity; // 0x0734
    uint32_t m_hEffectEntity; // 0x0738
    uint32_t m_nSkin; // 0x0798
    uint32_t m_nBody; // 0x079C
    uint32_t m_nHitboxSet; // 0x07A0
    float m_flPlaybackRate; // 0x07D4
    fVector3 m_vecForce; // 0x07E8
    uint32_t m_nForceBone; // 0x07F4
    uint32_t m_bClientSideFrameReset; // 0x0834
    float m_fadeMinDist; // 0x0878
    float m_fadeMaxDist; // 0x087C
    float m_flFadeScale; // 0x0880
    float m_flModelWidthScale; // 0x08E4
    float m_flModelScale; // 0x08E4
    uintptr_t m_flPoseParameter[24]; // 0x08E8
    uintptr_t m_flEncodedController[4]; // 0x0A30
    uint32_t m_bClientSideAnimation; // 0x0AA0
    uint32_t m_nNewSequenceParity; // 0x0AA4
    uint32_t m_nResetEventsParity; // 0x0AA8
    uint32_t m_nSequence; // 0x0AD0
    float m_flCycle; // 0x0AD8
    uint32_t m_hLightingOrigin; // 0x0BA0
    uint32_t m_hLightingOriginRelative; // 0x0BA4
    uint32_t m_nMuzzleFlashParity; // 0x0BA8
    uint32_t m_hOwner; // 0x0BE0
    uint32_t m_nViewModelIndex; // 0x0BE4
    float m_flNextPrimaryAttack; // 0x0BE8
    float m_flNextSecondaryAttack; // 0x0BEC
    float m_flTimeWeaponIdle; // 0x0BF0
    uint32_t m_iViewModelIndex; // 0x0BF8
    uint32_t m_iWorldModelIndex; // 0x0BFC
    uint32_t m_iState; // 0x0C1C
    uint32_t m_iPrimaryAmmoType; // 0x0C28
    uint32_t m_iSecondaryAmmoType; // 0x0C2C
    uint32_t m_iClip1; // 0x0C30
    uint32_t m_iClip2; // 0x0C34
    uint32_t m_bFlipViewModel; // 0x0C60
    uint32_t m_nCustomViewmodelModelIndex; // 0x0C84
    uint32_t m_weaponMode; // 0x0CAC
    float m_fAccuracyPenalty; // 0x0CB0
};

class CFunc_LOD // parent CBaseEntity {
public:
    uint32_t movecollide; // 0x0000
    uint32_t movetype; // 0x0000
    uint32_t m_nRenderFX; // 0x008C
    uint32_t m_clrRender; // 0x0090
    uint32_t m_flAnimTime; // 0x00A0
    uint32_t m_flSimulationTime; // 0x00A8
    uint32_t m_ubInterpolationFrame; // 0x00B4
    uint32_t m_fEffects; // 0x00B8
    uint32_t m_nRenderMode; // 0x00BC
    uint32_t m_nModelIndex; // 0x00CC
    uint32_t m_iTeamNum; // 0x00D8
    uint32_t m_PredictableID; // 0x00DC
    uint32_t m_iParentAttachment; // 0x01F6
    uint32_t moveparent; // 0x020C
    fVector3 m_vecMinsPreScaled; // 0x0230
    fVector3 m_vecMaxsPreScaled; // 0x023C
    fVector3 m_vecMins; // 0x0248
    fVector3 m_vecMaxs; // 0x0254
    uint32_t m_usSolidFlags; // 0x0264
    uint32_t m_nSurroundType; // 0x0268
    uint32_t m_nSolidType; // 0x0269
    uint32_t m_triggerBloat; // 0x026A
    uint32_t m_bUniformTriggerBloat; // 0x026B
    fVector3 m_vecSpecifiedSurroundingMinsPreScaled; // 0x026C
    fVector3 m_vecSpecifiedSurroundingMaxsPreScaled; // 0x0278
    fVector3 m_vecSpecifiedSurroundingMins; // 0x0284
    fVector3 m_vecSpecifiedSurroundingMaxs; // 0x0290
    float m_flElasticity; // 0x02F0
    float m_flShadowCastDistance; // 0x02F4
    fVector3 m_vecOrigin; // 0x0428
    fVector3 m_angRotation; // 0x0434
    uint32_t m_CollisionGroup; // 0x0444
    uint32_t m_bIsPlayerSimulated; // 0x0724
    uint32_t m_bSimulatedEveryTick; // 0x0725
    uint32_t m_bAnimatedEveryTick; // 0x0726
    uint32_t m_bAlternateSorting; // 0x0727
    uint32_t m_iTextureFrameIndex; // 0x0728
    uint32_t m_hOwnerEntity; // 0x0734
    uint32_t m_hEffectEntity; // 0x0738
    float m_fDisappearDist; // 0x0788
};

class CWeaponScout // parent CBaseEntity {
public:
    uint32_t movecollide; // 0x0000
    uint32_t movetype; // 0x0000
    uint32_t m_nRenderFX; // 0x008C
    uint32_t m_clrRender; // 0x0090
    uint32_t m_flAnimTime; // 0x00A0
    uint32_t m_flSimulationTime; // 0x00A8
    uint32_t m_ubInterpolationFrame; // 0x00B4
    uint32_t m_fEffects; // 0x00B8
    uint32_t m_nRenderMode; // 0x00BC
    uint32_t m_nNextThinkTick; // 0x00C4
    uint32_t m_nModelIndex; // 0x00CC
    uint32_t m_iTeamNum; // 0x00D8
    uint32_t m_PredictableID; // 0x00DC
    uint32_t m_iParentAttachment; // 0x01F6
    uint32_t moveparent; // 0x020C
    fVector3 m_vecMinsPreScaled; // 0x0230
    fVector3 m_vecMaxsPreScaled; // 0x023C
    fVector3 m_vecMins; // 0x0248
    fVector3 m_vecMaxs; // 0x0254
    uint32_t m_usSolidFlags; // 0x0264
    uint32_t m_nSurroundType; // 0x0268
    uint32_t m_nSolidType; // 0x0269
    uint32_t m_triggerBloat; // 0x026A
    uint32_t m_bUniformTriggerBloat; // 0x026B
    fVector3 m_vecSpecifiedSurroundingMinsPreScaled; // 0x026C
    fVector3 m_vecSpecifiedSurroundingMaxsPreScaled; // 0x0278
    fVector3 m_vecSpecifiedSurroundingMins; // 0x0284
    fVector3 m_vecSpecifiedSurroundingMaxs; // 0x0290
    float m_flElasticity; // 0x02F0
    float m_flShadowCastDistance; // 0x02F4
    fVector3 m_vecOrigin; // 0x0428
    fVector3 m_angRotation; // 0x0434
    uint32_t m_CollisionGroup; // 0x0444
    uint32_t m_bIsPlayerSimulated; // 0x0724
    uint32_t m_bSimulatedEveryTick; // 0x0725
    uint32_t m_bAnimatedEveryTick; // 0x0726
    uint32_t m_bAlternateSorting; // 0x0727
    uint32_t m_iTextureFrameIndex; // 0x0728
    uint32_t m_hOwnerEntity; // 0x0734
    uint32_t m_hEffectEntity; // 0x0738
    uint32_t m_nSkin; // 0x0798
    uint32_t m_nBody; // 0x079C
    uint32_t m_nHitboxSet; // 0x07A0
    float m_flPlaybackRate; // 0x07D4
    fVector3 m_vecForce; // 0x07E8
    uint32_t m_nForceBone; // 0x07F4
    uint32_t m_bClientSideFrameReset; // 0x0834
    float m_fadeMinDist; // 0x0878
    float m_fadeMaxDist; // 0x087C
    float m_flFadeScale; // 0x0880
    float m_flModelWidthScale; // 0x08E4
    float m_flModelScale; // 0x08E4
    uintptr_t m_flPoseParameter[24]; // 0x08E8
    uintptr_t m_flEncodedController[4]; // 0x0A30
    uint32_t m_bClientSideAnimation; // 0x0AA0
    uint32_t m_nNewSequenceParity; // 0x0AA4
    uint32_t m_nResetEventsParity; // 0x0AA8
    uint32_t m_nSequence; // 0x0AD0
    float m_flCycle; // 0x0AD8
    uint32_t m_hLightingOrigin; // 0x0BA0
    uint32_t m_hLightingOriginRelative; // 0x0BA4
    uint32_t m_nMuzzleFlashParity; // 0x0BA8
    uint32_t m_hOwner; // 0x0BE0
    uint32_t m_nViewModelIndex; // 0x0BE4
    float m_flNextPrimaryAttack; // 0x0BE8
    float m_flNextSecondaryAttack; // 0x0BEC
    float m_flTimeWeaponIdle; // 0x0BF0
    uint32_t m_iViewModelIndex; // 0x0BF8
    uint32_t m_iWorldModelIndex; // 0x0BFC
    uint32_t m_iState; // 0x0C1C
    uint32_t m_iPrimaryAmmoType; // 0x0C28
    uint32_t m_iSecondaryAmmoType; // 0x0C2C
    uint32_t m_iClip1; // 0x0C30
    uint32_t m_iClip2; // 0x0C34
    uint32_t m_bFlipViewModel; // 0x0C60
    uint32_t m_nCustomViewmodelModelIndex; // 0x0C84
    uint32_t m_weaponMode; // 0x0CAC
    float m_fAccuracyPenalty; // 0x0CB0
};

class CWeaponP228 // parent CBaseEntity {
public:
    uint32_t movecollide; // 0x0000
    uint32_t movetype; // 0x0000
    uint32_t m_nRenderFX; // 0x008C
    uint32_t m_clrRender; // 0x0090
    uint32_t m_flAnimTime; // 0x00A0
    uint32_t m_flSimulationTime; // 0x00A8
    uint32_t m_ubInterpolationFrame; // 0x00B4
    uint32_t m_fEffects; // 0x00B8
    uint32_t m_nRenderMode; // 0x00BC
    uint32_t m_nNextThinkTick; // 0x00C4
    uint32_t m_nModelIndex; // 0x00CC
    uint32_t m_iTeamNum; // 0x00D8
    uint32_t m_PredictableID; // 0x00DC
    uint32_t m_iParentAttachment; // 0x01F6
    uint32_t moveparent; // 0x020C
    fVector3 m_vecMinsPreScaled; // 0x0230
    fVector3 m_vecMaxsPreScaled; // 0x023C
    fVector3 m_vecMins; // 0x0248
    fVector3 m_vecMaxs; // 0x0254
    uint32_t m_usSolidFlags; // 0x0264
    uint32_t m_nSurroundType; // 0x0268
    uint32_t m_nSolidType; // 0x0269
    uint32_t m_triggerBloat; // 0x026A
    uint32_t m_bUniformTriggerBloat; // 0x026B
    fVector3 m_vecSpecifiedSurroundingMinsPreScaled; // 0x026C
    fVector3 m_vecSpecifiedSurroundingMaxsPreScaled; // 0x0278
    fVector3 m_vecSpecifiedSurroundingMins; // 0x0284
    fVector3 m_vecSpecifiedSurroundingMaxs; // 0x0290
    float m_flElasticity; // 0x02F0
    float m_flShadowCastDistance; // 0x02F4
    fVector3 m_vecOrigin; // 0x0428
    fVector3 m_angRotation; // 0x0434
    uint32_t m_CollisionGroup; // 0x0444
    uint32_t m_bIsPlayerSimulated; // 0x0724
    uint32_t m_bSimulatedEveryTick; // 0x0725
    uint32_t m_bAnimatedEveryTick; // 0x0726
    uint32_t m_bAlternateSorting; // 0x0727
    uint32_t m_iTextureFrameIndex; // 0x0728
    uint32_t m_hOwnerEntity; // 0x0734
    uint32_t m_hEffectEntity; // 0x0738
    uint32_t m_nSkin; // 0x0798
    uint32_t m_nBody; // 0x079C
    uint32_t m_nHitboxSet; // 0x07A0
    float m_flPlaybackRate; // 0x07D4
    fVector3 m_vecForce; // 0x07E8
    uint32_t m_nForceBone; // 0x07F4
    uint32_t m_bClientSideFrameReset; // 0x0834
    float m_fadeMinDist; // 0x0878
    float m_fadeMaxDist; // 0x087C
    float m_flFadeScale; // 0x0880
    float m_flModelWidthScale; // 0x08E4
    float m_flModelScale; // 0x08E4
    uintptr_t m_flPoseParameter[24]; // 0x08E8
    uintptr_t m_flEncodedController[4]; // 0x0A30
    uint32_t m_bClientSideAnimation; // 0x0AA0
    uint32_t m_nNewSequenceParity; // 0x0AA4
    uint32_t m_nResetEventsParity; // 0x0AA8
    uint32_t m_nSequence; // 0x0AD0
    float m_flCycle; // 0x0AD8
    uint32_t m_hLightingOrigin; // 0x0BA0
    uint32_t m_hLightingOriginRelative; // 0x0BA4
    uint32_t m_nMuzzleFlashParity; // 0x0BA8
    uint32_t m_hOwner; // 0x0BE0
    uint32_t m_nViewModelIndex; // 0x0BE4
    float m_flNextPrimaryAttack; // 0x0BE8
    float m_flNextSecondaryAttack; // 0x0BEC
    float m_flTimeWeaponIdle; // 0x0BF0
    uint32_t m_iViewModelIndex; // 0x0BF8
    uint32_t m_iWorldModelIndex; // 0x0BFC
    uint32_t m_iState; // 0x0C1C
    uint32_t m_iPrimaryAmmoType; // 0x0C28
    uint32_t m_iSecondaryAmmoType; // 0x0C2C
    uint32_t m_iClip1; // 0x0C30
    uint32_t m_iClip2; // 0x0C34
    uint32_t m_bFlipViewModel; // 0x0C60
    uint32_t m_nCustomViewmodelModelIndex; // 0x0C84
    uint32_t m_weaponMode; // 0x0CAC
    float m_fAccuracyPenalty; // 0x0CB0
};

class CWeaponMP5Navy // parent CBaseEntity {
public:
    uint32_t movecollide; // 0x0000
    uint32_t movetype; // 0x0000
    uint32_t m_nRenderFX; // 0x008C
    uint32_t m_clrRender; // 0x0090
    uint32_t m_flAnimTime; // 0x00A0
    uint32_t m_flSimulationTime; // 0x00A8
    uint32_t m_ubInterpolationFrame; // 0x00B4
    uint32_t m_fEffects; // 0x00B8
    uint32_t m_nRenderMode; // 0x00BC
    uint32_t m_nNextThinkTick; // 0x00C4
    uint32_t m_nModelIndex; // 0x00CC
    uint32_t m_iTeamNum; // 0x00D8
    uint32_t m_PredictableID; // 0x00DC
    uint32_t m_iParentAttachment; // 0x01F6
    uint32_t moveparent; // 0x020C
    fVector3 m_vecMinsPreScaled; // 0x0230
    fVector3 m_vecMaxsPreScaled; // 0x023C
    fVector3 m_vecMins; // 0x0248
    fVector3 m_vecMaxs; // 0x0254
    uint32_t m_usSolidFlags; // 0x0264
    uint32_t m_nSurroundType; // 0x0268
    uint32_t m_nSolidType; // 0x0269
    uint32_t m_triggerBloat; // 0x026A
    uint32_t m_bUniformTriggerBloat; // 0x026B
    fVector3 m_vecSpecifiedSurroundingMinsPreScaled; // 0x026C
    fVector3 m_vecSpecifiedSurroundingMaxsPreScaled; // 0x0278
    fVector3 m_vecSpecifiedSurroundingMins; // 0x0284
    fVector3 m_vecSpecifiedSurroundingMaxs; // 0x0290
    float m_flElasticity; // 0x02F0
    float m_flShadowCastDistance; // 0x02F4
    fVector3 m_vecOrigin; // 0x0428
    fVector3 m_angRotation; // 0x0434
    uint32_t m_CollisionGroup; // 0x0444
    uint32_t m_bIsPlayerSimulated; // 0x0724
    uint32_t m_bSimulatedEveryTick; // 0x0725
    uint32_t m_bAnimatedEveryTick; // 0x0726
    uint32_t m_bAlternateSorting; // 0x0727
    uint32_t m_iTextureFrameIndex; // 0x0728
    uint32_t m_hOwnerEntity; // 0x0734
    uint32_t m_hEffectEntity; // 0x0738
    uint32_t m_nSkin; // 0x0798
    uint32_t m_nBody; // 0x079C
    uint32_t m_nHitboxSet; // 0x07A0
    float m_flPlaybackRate; // 0x07D4
    fVector3 m_vecForce; // 0x07E8
    uint32_t m_nForceBone; // 0x07F4
    uint32_t m_bClientSideFrameReset; // 0x0834
    float m_fadeMinDist; // 0x0878
    float m_fadeMaxDist; // 0x087C
    float m_flFadeScale; // 0x0880
    float m_flModelWidthScale; // 0x08E4
    float m_flModelScale; // 0x08E4
    uintptr_t m_flPoseParameter[24]; // 0x08E8
    uintptr_t m_flEncodedController[4]; // 0x0A30
    uint32_t m_bClientSideAnimation; // 0x0AA0
    uint32_t m_nNewSequenceParity; // 0x0AA4
    uint32_t m_nResetEventsParity; // 0x0AA8
    uint32_t m_nSequence; // 0x0AD0
    float m_flCycle; // 0x0AD8
    uint32_t m_hLightingOrigin; // 0x0BA0
    uint32_t m_hLightingOriginRelative; // 0x0BA4
    uint32_t m_nMuzzleFlashParity; // 0x0BA8
    uint32_t m_hOwner; // 0x0BE0
    uint32_t m_nViewModelIndex; // 0x0BE4
    float m_flNextPrimaryAttack; // 0x0BE8
    float m_flNextSecondaryAttack; // 0x0BEC
    float m_flTimeWeaponIdle; // 0x0BF0
    uint32_t m_iViewModelIndex; // 0x0BF8
    uint32_t m_iWorldModelIndex; // 0x0BFC
    uint32_t m_iState; // 0x0C1C
    uint32_t m_iPrimaryAmmoType; // 0x0C28
    uint32_t m_iSecondaryAmmoType; // 0x0C2C
    uint32_t m_iClip1; // 0x0C30
    uint32_t m_iClip2; // 0x0C34
    uint32_t m_bFlipViewModel; // 0x0C60
    uint32_t m_nCustomViewmodelModelIndex; // 0x0C84
    uint32_t m_weaponMode; // 0x0CAC
    float m_fAccuracyPenalty; // 0x0CB0
};

class NextBotCombatCharacter // parent CBaseEntity {
public:
    uint32_t lengthprop15; // 0x0000
    uint32_t movetype; // 0x0000
    uint32_t movecollide; // 0x0000
    uint32_t m_nSequence; // 0x0000
    float m_flPrevCycle; // 0x0004
    float m_flWeight; // 0x0008
    uint32_t m_nOrder; // 0x000C
    float m_flCycle; // 0x0014
    uint32_t m_nRenderFX; // 0x008C
    uint32_t m_clrRender; // 0x0090
    uint32_t m_flAnimTime; // 0x00A0
    uint32_t m_flSimulationTime; // 0x00A8
    uint32_t m_ubInterpolationFrame; // 0x00B4
    uint32_t m_fEffects; // 0x00B8
    uint32_t m_nRenderMode; // 0x00BC
    uint32_t m_nModelIndex; // 0x00CC
    uint32_t m_iTeamNum; // 0x00D8
    uint32_t m_PredictableID; // 0x00DC
    uint32_t m_iParentAttachment; // 0x01F6
    uint32_t moveparent; // 0x020C
    fVector3 m_vecMinsPreScaled; // 0x0230
    fVector3 m_vecMaxsPreScaled; // 0x023C
    fVector3 m_vecMins; // 0x0248
    fVector3 m_vecMaxs; // 0x0254
    uint32_t m_usSolidFlags; // 0x0264
    uint32_t m_nSurroundType; // 0x0268
    uint32_t m_nSolidType; // 0x0269
    uint32_t m_triggerBloat; // 0x026A
    uint32_t m_bUniformTriggerBloat; // 0x026B
    fVector3 m_vecSpecifiedSurroundingMinsPreScaled; // 0x026C
    fVector3 m_vecSpecifiedSurroundingMaxsPreScaled; // 0x0278
    fVector3 m_vecSpecifiedSurroundingMins; // 0x0284
    fVector3 m_vecSpecifiedSurroundingMaxs; // 0x0290
    float m_flElasticity; // 0x02F0
    float m_flShadowCastDistance; // 0x02F4
    fVector3 m_vecOrigin; // 0x0428
    fVector3 m_angRotation; // 0x0434
    uint32_t m_CollisionGroup; // 0x0444
    uint32_t m_bIsPlayerSimulated; // 0x0724
    uint32_t m_bSimulatedEveryTick; // 0x0725
    uint32_t m_bAnimatedEveryTick; // 0x0726
    uint32_t m_bAlternateSorting; // 0x0727
    uint32_t m_iTextureFrameIndex; // 0x0728
    uint32_t m_hOwnerEntity; // 0x0734
    uint32_t m_hEffectEntity; // 0x0738
    uint32_t m_nSkin; // 0x0798
    uint32_t m_nBody; // 0x079C
    uint32_t m_nHitboxSet; // 0x07A0
    float m_flPlaybackRate; // 0x07D4
    fVector3 m_vecForce; // 0x07E8
    uint32_t m_nForceBone; // 0x07F4
    uint32_t m_bClientSideFrameReset; // 0x0834
    float m_fadeMinDist; // 0x0878
    float m_fadeMaxDist; // 0x087C
    float m_flFadeScale; // 0x0880
    float m_flModelWidthScale; // 0x08E4
    float m_flModelScale; // 0x08E4
    uintptr_t m_flPoseParameter[24]; // 0x08E8
    uintptr_t m_flEncodedController[4]; // 0x0A30
    uint32_t m_bClientSideAnimation; // 0x0AA0
    uint32_t m_nNewSequenceParity; // 0x0AA4
    uint32_t m_nResetEventsParity; // 0x0AA8
    uint32_t m_hLightingOrigin; // 0x0BA0
    uint32_t m_hLightingOriginRelative; // 0x0BA4
    uint32_t m_nMuzzleFlashParity; // 0x0BA8
    fVector3 m_viewtarget; // 0x0C68
    uintptr_t m_flexWeight[96]; // 0x0CC8
    uint32_t m_blinktoggle; // 0x0E98
    float m_flNextAttack; // 0x1058
    uintptr_t m_hMyWeapons[48]; // 0x10E0
    uint32_t m_hActiveWeapon; // 0x11A0
};

class CWeaponMAC10 // parent CBaseEntity {
public:
    uint32_t movecollide; // 0x0000
    uint32_t movetype; // 0x0000
    uint32_t m_nRenderFX; // 0x008C
    uint32_t m_clrRender; // 0x0090
    uint32_t m_flAnimTime; // 0x00A0
    uint32_t m_flSimulationTime; // 0x00A8
    uint32_t m_ubInterpolationFrame; // 0x00B4
    uint32_t m_fEffects; // 0x00B8
    uint32_t m_nRenderMode; // 0x00BC
    uint32_t m_nNextThinkTick; // 0x00C4
    uint32_t m_nModelIndex; // 0x00CC
    uint32_t m_iTeamNum; // 0x00D8
    uint32_t m_PredictableID; // 0x00DC
    uint32_t m_iParentAttachment; // 0x01F6
    uint32_t moveparent; // 0x020C
    fVector3 m_vecMinsPreScaled; // 0x0230
    fVector3 m_vecMaxsPreScaled; // 0x023C
    fVector3 m_vecMins; // 0x0248
    fVector3 m_vecMaxs; // 0x0254
    uint32_t m_usSolidFlags; // 0x0264
    uint32_t m_nSurroundType; // 0x0268
    uint32_t m_nSolidType; // 0x0269
    uint32_t m_triggerBloat; // 0x026A
    uint32_t m_bUniformTriggerBloat; // 0x026B
    fVector3 m_vecSpecifiedSurroundingMinsPreScaled; // 0x026C
    fVector3 m_vecSpecifiedSurroundingMaxsPreScaled; // 0x0278
    fVector3 m_vecSpecifiedSurroundingMins; // 0x0284
    fVector3 m_vecSpecifiedSurroundingMaxs; // 0x0290
    float m_flElasticity; // 0x02F0
    float m_flShadowCastDistance; // 0x02F4
    fVector3 m_vecOrigin; // 0x0428
    fVector3 m_angRotation; // 0x0434
    uint32_t m_CollisionGroup; // 0x0444
    uint32_t m_bIsPlayerSimulated; // 0x0724
    uint32_t m_bSimulatedEveryTick; // 0x0725
    uint32_t m_bAnimatedEveryTick; // 0x0726
    uint32_t m_bAlternateSorting; // 0x0727
    uint32_t m_iTextureFrameIndex; // 0x0728
    uint32_t m_hOwnerEntity; // 0x0734
    uint32_t m_hEffectEntity; // 0x0738
    uint32_t m_nSkin; // 0x0798
    uint32_t m_nBody; // 0x079C
    uint32_t m_nHitboxSet; // 0x07A0
    float m_flPlaybackRate; // 0x07D4
    fVector3 m_vecForce; // 0x07E8
    uint32_t m_nForceBone; // 0x07F4
    uint32_t m_bClientSideFrameReset; // 0x0834
    float m_fadeMinDist; // 0x0878
    float m_fadeMaxDist; // 0x087C
    float m_flFadeScale; // 0x0880
    float m_flModelWidthScale; // 0x08E4
    float m_flModelScale; // 0x08E4
    uintptr_t m_flPoseParameter[24]; // 0x08E8
    uintptr_t m_flEncodedController[4]; // 0x0A30
    uint32_t m_bClientSideAnimation; // 0x0AA0
    uint32_t m_nNewSequenceParity; // 0x0AA4
    uint32_t m_nResetEventsParity; // 0x0AA8
    uint32_t m_nSequence; // 0x0AD0
    float m_flCycle; // 0x0AD8
    uint32_t m_hLightingOrigin; // 0x0BA0
    uint32_t m_hLightingOriginRelative; // 0x0BA4
    uint32_t m_nMuzzleFlashParity; // 0x0BA8
    uint32_t m_hOwner; // 0x0BE0
    uint32_t m_nViewModelIndex; // 0x0BE4
    float m_flNextPrimaryAttack; // 0x0BE8
    float m_flNextSecondaryAttack; // 0x0BEC
    float m_flTimeWeaponIdle; // 0x0BF0
    uint32_t m_iViewModelIndex; // 0x0BF8
    uint32_t m_iWorldModelIndex; // 0x0BFC
    uint32_t m_iState; // 0x0C1C
    uint32_t m_iPrimaryAmmoType; // 0x0C28
    uint32_t m_iSecondaryAmmoType; // 0x0C2C
    uint32_t m_iClip1; // 0x0C30
    uint32_t m_iClip2; // 0x0C34
    uint32_t m_bFlipViewModel; // 0x0C60
    uint32_t m_nCustomViewmodelModelIndex; // 0x0C84
    uint32_t m_weaponMode; // 0x0CAC
    float m_fAccuracyPenalty; // 0x0CB0
};

class CWeaponM4A1 // parent CBaseEntity {
public:
    uint32_t movetype; // 0x0000
    uint32_t movecollide; // 0x0000
    uint32_t m_nRenderFX; // 0x008C
    uint32_t m_clrRender; // 0x0090
    uint32_t m_flAnimTime; // 0x00A0
    uint32_t m_flSimulationTime; // 0x00A8
    uint32_t m_ubInterpolationFrame; // 0x00B4
    uint32_t m_fEffects; // 0x00B8
    uint32_t m_nRenderMode; // 0x00BC
    uint32_t m_nNextThinkTick; // 0x00C4
    uint32_t m_nModelIndex; // 0x00CC
    uint32_t m_iTeamNum; // 0x00D8
    uint32_t m_PredictableID; // 0x00DC
    uint32_t m_iParentAttachment; // 0x01F6
    uint32_t moveparent; // 0x020C
    fVector3 m_vecMinsPreScaled; // 0x0230
    fVector3 m_vecMaxsPreScaled; // 0x023C
    fVector3 m_vecMins; // 0x0248
    fVector3 m_vecMaxs; // 0x0254
    uint32_t m_usSolidFlags; // 0x0264
    uint32_t m_nSurroundType; // 0x0268
    uint32_t m_nSolidType; // 0x0269
    uint32_t m_triggerBloat; // 0x026A
    uint32_t m_bUniformTriggerBloat; // 0x026B
    fVector3 m_vecSpecifiedSurroundingMinsPreScaled; // 0x026C
    fVector3 m_vecSpecifiedSurroundingMaxsPreScaled; // 0x0278
    fVector3 m_vecSpecifiedSurroundingMins; // 0x0284
    fVector3 m_vecSpecifiedSurroundingMaxs; // 0x0290
    float m_flElasticity; // 0x02F0
    float m_flShadowCastDistance; // 0x02F4
    fVector3 m_vecOrigin; // 0x0428
    fVector3 m_angRotation; // 0x0434
    uint32_t m_CollisionGroup; // 0x0444
    uint32_t m_bIsPlayerSimulated; // 0x0724
    uint32_t m_bSimulatedEveryTick; // 0x0725
    uint32_t m_bAnimatedEveryTick; // 0x0726
    uint32_t m_bAlternateSorting; // 0x0727
    uint32_t m_iTextureFrameIndex; // 0x0728
    uint32_t m_hOwnerEntity; // 0x0734
    uint32_t m_hEffectEntity; // 0x0738
    uint32_t m_nSkin; // 0x0798
    uint32_t m_nBody; // 0x079C
    uint32_t m_nHitboxSet; // 0x07A0
    float m_flPlaybackRate; // 0x07D4
    fVector3 m_vecForce; // 0x07E8
    uint32_t m_nForceBone; // 0x07F4
    uint32_t m_bClientSideFrameReset; // 0x0834
    float m_fadeMinDist; // 0x0878
    float m_fadeMaxDist; // 0x087C
    float m_flFadeScale; // 0x0880
    float m_flModelScale; // 0x08E4
    float m_flModelWidthScale; // 0x08E4
    uintptr_t m_flPoseParameter[24]; // 0x08E8
    uintptr_t m_flEncodedController[4]; // 0x0A30
    uint32_t m_bClientSideAnimation; // 0x0AA0
    uint32_t m_nNewSequenceParity; // 0x0AA4
    uint32_t m_nResetEventsParity; // 0x0AA8
    uint32_t m_nSequence; // 0x0AD0
    float m_flCycle; // 0x0AD8
    uint32_t m_hLightingOrigin; // 0x0BA0
    uint32_t m_hLightingOriginRelative; // 0x0BA4
    uint32_t m_nMuzzleFlashParity; // 0x0BA8
    uint32_t m_hOwner; // 0x0BE0
    uint32_t m_nViewModelIndex; // 0x0BE4
    float m_flNextPrimaryAttack; // 0x0BE8
    float m_flNextSecondaryAttack; // 0x0BEC
    float m_flTimeWeaponIdle; // 0x0BF0
    uint32_t m_iViewModelIndex; // 0x0BF8
    uint32_t m_iWorldModelIndex; // 0x0BFC
    uint32_t m_iState; // 0x0C1C
    uint32_t m_iPrimaryAmmoType; // 0x0C28
    uint32_t m_iSecondaryAmmoType; // 0x0C2C
    uint32_t m_iClip1; // 0x0C30
    uint32_t m_iClip2; // 0x0C34
    uint32_t m_bFlipViewModel; // 0x0C60
    uint32_t m_nCustomViewmodelModelIndex; // 0x0C84
    uint32_t m_weaponMode; // 0x0CAC
    float m_fAccuracyPenalty; // 0x0CB0
    uint32_t m_bSilencerOn; // 0x0D00
    float m_flDoneSwitchingSilencer; // 0x0D04
};

class CWeaponM3 // parent CBaseEntity {
public:
    uint32_t movetype; // 0x0000
    uint32_t movecollide; // 0x0000
    uint32_t m_nRenderFX; // 0x008C
    uint32_t m_clrRender; // 0x0090
    uint32_t m_flAnimTime; // 0x00A0
    uint32_t m_flSimulationTime; // 0x00A8
    uint32_t m_ubInterpolationFrame; // 0x00B4
    uint32_t m_fEffects; // 0x00B8
    uint32_t m_nRenderMode; // 0x00BC
    uint32_t m_nNextThinkTick; // 0x00C4
    uint32_t m_nModelIndex; // 0x00CC
    uint32_t m_iTeamNum; // 0x00D8
    uint32_t m_PredictableID; // 0x00DC
    uint32_t m_iParentAttachment; // 0x01F6
    uint32_t moveparent; // 0x020C
    fVector3 m_vecMinsPreScaled; // 0x0230
    fVector3 m_vecMaxsPreScaled; // 0x023C
    fVector3 m_vecMins; // 0x0248
    fVector3 m_vecMaxs; // 0x0254
    uint32_t m_usSolidFlags; // 0x0264
    uint32_t m_nSurroundType; // 0x0268
    uint32_t m_nSolidType; // 0x0269
    uint32_t m_triggerBloat; // 0x026A
    uint32_t m_bUniformTriggerBloat; // 0x026B
    fVector3 m_vecSpecifiedSurroundingMinsPreScaled; // 0x026C
    fVector3 m_vecSpecifiedSurroundingMaxsPreScaled; // 0x0278
    fVector3 m_vecSpecifiedSurroundingMins; // 0x0284
    fVector3 m_vecSpecifiedSurroundingMaxs; // 0x0290
    float m_flElasticity; // 0x02F0
    float m_flShadowCastDistance; // 0x02F4
    fVector3 m_vecOrigin; // 0x0428
    fVector3 m_angRotation; // 0x0434
    uint32_t m_CollisionGroup; // 0x0444
    uint32_t m_bIsPlayerSimulated; // 0x0724
    uint32_t m_bSimulatedEveryTick; // 0x0725
    uint32_t m_bAnimatedEveryTick; // 0x0726
    uint32_t m_bAlternateSorting; // 0x0727
    uint32_t m_iTextureFrameIndex; // 0x0728
    uint32_t m_hOwnerEntity; // 0x0734
    uint32_t m_hEffectEntity; // 0x0738
    uint32_t m_nSkin; // 0x0798
    uint32_t m_nBody; // 0x079C
    uint32_t m_nHitboxSet; // 0x07A0
    float m_flPlaybackRate; // 0x07D4
    fVector3 m_vecForce; // 0x07E8
    uint32_t m_nForceBone; // 0x07F4
    uint32_t m_bClientSideFrameReset; // 0x0834
    float m_fadeMinDist; // 0x0878
    float m_fadeMaxDist; // 0x087C
    float m_flFadeScale; // 0x0880
    float m_flModelWidthScale; // 0x08E4
    float m_flModelScale; // 0x08E4
    uintptr_t m_flPoseParameter[24]; // 0x08E8
    uintptr_t m_flEncodedController[4]; // 0x0A30
    uint32_t m_bClientSideAnimation; // 0x0AA0
    uint32_t m_nNewSequenceParity; // 0x0AA4
    uint32_t m_nResetEventsParity; // 0x0AA8
    uint32_t m_nSequence; // 0x0AD0
    float m_flCycle; // 0x0AD8
    uint32_t m_hLightingOrigin; // 0x0BA0
    uint32_t m_hLightingOriginRelative; // 0x0BA4
    uint32_t m_nMuzzleFlashParity; // 0x0BA8
    uint32_t m_hOwner; // 0x0BE0
    uint32_t m_nViewModelIndex; // 0x0BE4
    float m_flNextPrimaryAttack; // 0x0BE8
    float m_flNextSecondaryAttack; // 0x0BEC
    float m_flTimeWeaponIdle; // 0x0BF0
    uint32_t m_iViewModelIndex; // 0x0BF8
    uint32_t m_iWorldModelIndex; // 0x0BFC
    uint32_t m_iState; // 0x0C1C
    uint32_t m_iPrimaryAmmoType; // 0x0C28
    uint32_t m_iSecondaryAmmoType; // 0x0C2C
    uint32_t m_iClip1; // 0x0C30
    uint32_t m_iClip2; // 0x0C34
    uint32_t m_bFlipViewModel; // 0x0C60
    uint32_t m_nCustomViewmodelModelIndex; // 0x0C84
    uint32_t m_weaponMode; // 0x0CAC
    float m_fAccuracyPenalty; // 0x0CB0
    uint32_t m_reloadState; // 0x0CFC
};

class CWeaponM249 // parent CBaseEntity {
public:
    uint32_t movecollide; // 0x0000
    uint32_t movetype; // 0x0000
    uint32_t m_nRenderFX; // 0x008C
    uint32_t m_clrRender; // 0x0090
    uint32_t m_flAnimTime; // 0x00A0
    uint32_t m_flSimulationTime; // 0x00A8
    uint32_t m_ubInterpolationFrame; // 0x00B4
    uint32_t m_fEffects; // 0x00B8
    uint32_t m_nRenderMode; // 0x00BC
    uint32_t m_nNextThinkTick; // 0x00C4
    uint32_t m_nModelIndex; // 0x00CC
    uint32_t m_iTeamNum; // 0x00D8
    uint32_t m_PredictableID; // 0x00DC
    uint32_t m_iParentAttachment; // 0x01F6
    uint32_t moveparent; // 0x020C
    fVector3 m_vecMinsPreScaled; // 0x0230
    fVector3 m_vecMaxsPreScaled; // 0x023C
    fVector3 m_vecMins; // 0x0248
    fVector3 m_vecMaxs; // 0x0254
    uint32_t m_usSolidFlags; // 0x0264
    uint32_t m_nSurroundType; // 0x0268
    uint32_t m_nSolidType; // 0x0269
    uint32_t m_triggerBloat; // 0x026A
    uint32_t m_bUniformTriggerBloat; // 0x026B
    fVector3 m_vecSpecifiedSurroundingMinsPreScaled; // 0x026C
    fVector3 m_vecSpecifiedSurroundingMaxsPreScaled; // 0x0278
    fVector3 m_vecSpecifiedSurroundingMins; // 0x0284
    fVector3 m_vecSpecifiedSurroundingMaxs; // 0x0290
    float m_flElasticity; // 0x02F0
    float m_flShadowCastDistance; // 0x02F4
    fVector3 m_vecOrigin; // 0x0428
    fVector3 m_angRotation; // 0x0434
    uint32_t m_CollisionGroup; // 0x0444
    uint32_t m_bIsPlayerSimulated; // 0x0724
    uint32_t m_bSimulatedEveryTick; // 0x0725
    uint32_t m_bAnimatedEveryTick; // 0x0726
    uint32_t m_bAlternateSorting; // 0x0727
    uint32_t m_iTextureFrameIndex; // 0x0728
    uint32_t m_hOwnerEntity; // 0x0734
    uint32_t m_hEffectEntity; // 0x0738
    uint32_t m_nSkin; // 0x0798
    uint32_t m_nBody; // 0x079C
    uint32_t m_nHitboxSet; // 0x07A0
    float m_flPlaybackRate; // 0x07D4
    fVector3 m_vecForce; // 0x07E8
    uint32_t m_nForceBone; // 0x07F4
    uint32_t m_bClientSideFrameReset; // 0x0834
    float m_fadeMinDist; // 0x0878
    float m_fadeMaxDist; // 0x087C
    float m_flFadeScale; // 0x0880
    float m_flModelWidthScale; // 0x08E4
    float m_flModelScale; // 0x08E4
    uintptr_t m_flPoseParameter[24]; // 0x08E8
    uintptr_t m_flEncodedController[4]; // 0x0A30
    uint32_t m_bClientSideAnimation; // 0x0AA0
    uint32_t m_nNewSequenceParity; // 0x0AA4
    uint32_t m_nResetEventsParity; // 0x0AA8
    uint32_t m_nSequence; // 0x0AD0
    float m_flCycle; // 0x0AD8
    uint32_t m_hLightingOrigin; // 0x0BA0
    uint32_t m_hLightingOriginRelative; // 0x0BA4
    uint32_t m_nMuzzleFlashParity; // 0x0BA8
    uint32_t m_hOwner; // 0x0BE0
    uint32_t m_nViewModelIndex; // 0x0BE4
    float m_flNextPrimaryAttack; // 0x0BE8
    float m_flNextSecondaryAttack; // 0x0BEC
    float m_flTimeWeaponIdle; // 0x0BF0
    uint32_t m_iViewModelIndex; // 0x0BF8
    uint32_t m_iWorldModelIndex; // 0x0BFC
    uint32_t m_iState; // 0x0C1C
    uint32_t m_iPrimaryAmmoType; // 0x0C28
    uint32_t m_iSecondaryAmmoType; // 0x0C2C
    uint32_t m_iClip1; // 0x0C30
    uint32_t m_iClip2; // 0x0C34
    uint32_t m_bFlipViewModel; // 0x0C60
    uint32_t m_nCustomViewmodelModelIndex; // 0x0C84
    uint32_t m_weaponMode; // 0x0CAC
    float m_fAccuracyPenalty; // 0x0CB0
};

class CKnife // parent CBaseEntity {
public:
    uint32_t movecollide; // 0x0000
    uint32_t movetype; // 0x0000
    uint32_t m_nRenderFX; // 0x008C
    uint32_t m_clrRender; // 0x0090
    uint32_t m_flAnimTime; // 0x00A0
    uint32_t m_flSimulationTime; // 0x00A8
    uint32_t m_ubInterpolationFrame; // 0x00B4
    uint32_t m_fEffects; // 0x00B8
    uint32_t m_nRenderMode; // 0x00BC
    uint32_t m_nNextThinkTick; // 0x00C4
    uint32_t m_nModelIndex; // 0x00CC
    uint32_t m_iTeamNum; // 0x00D8
    uint32_t m_PredictableID; // 0x00DC
    uint32_t m_iParentAttachment; // 0x01F6
    uint32_t moveparent; // 0x020C
    fVector3 m_vecMinsPreScaled; // 0x0230
    fVector3 m_vecMaxsPreScaled; // 0x023C
    fVector3 m_vecMins; // 0x0248
    fVector3 m_vecMaxs; // 0x0254
    uint32_t m_usSolidFlags; // 0x0264
    uint32_t m_nSurroundType; // 0x0268
    uint32_t m_nSolidType; // 0x0269
    uint32_t m_triggerBloat; // 0x026A
    uint32_t m_bUniformTriggerBloat; // 0x026B
    fVector3 m_vecSpecifiedSurroundingMinsPreScaled; // 0x026C
    fVector3 m_vecSpecifiedSurroundingMaxsPreScaled; // 0x0278
    fVector3 m_vecSpecifiedSurroundingMins; // 0x0284
    fVector3 m_vecSpecifiedSurroundingMaxs; // 0x0290
    float m_flElasticity; // 0x02F0
    float m_flShadowCastDistance; // 0x02F4
    fVector3 m_vecOrigin; // 0x0428
    fVector3 m_angRotation; // 0x0434
    uint32_t m_CollisionGroup; // 0x0444
    uint32_t m_bIsPlayerSimulated; // 0x0724
    uint32_t m_bSimulatedEveryTick; // 0x0725
    uint32_t m_bAnimatedEveryTick; // 0x0726
    uint32_t m_bAlternateSorting; // 0x0727
    uint32_t m_iTextureFrameIndex; // 0x0728
    uint32_t m_hOwnerEntity; // 0x0734
    uint32_t m_hEffectEntity; // 0x0738
    uint32_t m_nSkin; // 0x0798
    uint32_t m_nBody; // 0x079C
    uint32_t m_nHitboxSet; // 0x07A0
    float m_flPlaybackRate; // 0x07D4
    fVector3 m_vecForce; // 0x07E8
    uint32_t m_nForceBone; // 0x07F4
    uint32_t m_bClientSideFrameReset; // 0x0834
    float m_fadeMinDist; // 0x0878
    float m_fadeMaxDist; // 0x087C
    float m_flFadeScale; // 0x0880
    float m_flModelWidthScale; // 0x08E4
    float m_flModelScale; // 0x08E4
    uintptr_t m_flPoseParameter[24]; // 0x08E8
    uintptr_t m_flEncodedController[4]; // 0x0A30
    uint32_t m_bClientSideAnimation; // 0x0AA0
    uint32_t m_nNewSequenceParity; // 0x0AA4
    uint32_t m_nResetEventsParity; // 0x0AA8
    uint32_t m_nSequence; // 0x0AD0
    float m_flCycle; // 0x0AD8
    uint32_t m_hLightingOrigin; // 0x0BA0
    uint32_t m_hLightingOriginRelative; // 0x0BA4
    uint32_t m_nMuzzleFlashParity; // 0x0BA8
    uint32_t m_hOwner; // 0x0BE0
    uint32_t m_nViewModelIndex; // 0x0BE4
    float m_flNextPrimaryAttack; // 0x0BE8
    float m_flNextSecondaryAttack; // 0x0BEC
    float m_flTimeWeaponIdle; // 0x0BF0
    uint32_t m_iViewModelIndex; // 0x0BF8
    uint32_t m_iWorldModelIndex; // 0x0BFC
    uint32_t m_iState; // 0x0C1C
    uint32_t m_iPrimaryAmmoType; // 0x0C28
    uint32_t m_iSecondaryAmmoType; // 0x0C2C
    uint32_t m_iClip1; // 0x0C30
    uint32_t m_iClip2; // 0x0C34
    uint32_t m_bFlipViewModel; // 0x0C60
    uint32_t m_nCustomViewmodelModelIndex; // 0x0C84
    uint32_t m_weaponMode; // 0x0CAC
    float m_fAccuracyPenalty; // 0x0CB0
    float m_flSmackTime; // 0x0D64
};

class CHEGrenade // parent CBaseEntity {
public:
    uint32_t movecollide; // 0x0000
    uint32_t movetype; // 0x0000
    uint32_t m_nRenderFX; // 0x008C
    uint32_t m_clrRender; // 0x0090
    uint32_t m_flAnimTime; // 0x00A0
    uint32_t m_flSimulationTime; // 0x00A8
    uint32_t m_ubInterpolationFrame; // 0x00B4
    uint32_t m_fEffects; // 0x00B8
    uint32_t m_nRenderMode; // 0x00BC
    uint32_t m_nNextThinkTick; // 0x00C4
    uint32_t m_nModelIndex; // 0x00CC
    uint32_t m_iTeamNum; // 0x00D8
    uint32_t m_PredictableID; // 0x00DC
    uint32_t m_iParentAttachment; // 0x01F6
    uint32_t moveparent; // 0x020C
    fVector3 m_vecMinsPreScaled; // 0x0230
    fVector3 m_vecMaxsPreScaled; // 0x023C
    fVector3 m_vecMins; // 0x0248
    fVector3 m_vecMaxs; // 0x0254
    uint32_t m_usSolidFlags; // 0x0264
    uint32_t m_nSurroundType; // 0x0268
    uint32_t m_nSolidType; // 0x0269
    uint32_t m_triggerBloat; // 0x026A
    uint32_t m_bUniformTriggerBloat; // 0x026B
    fVector3 m_vecSpecifiedSurroundingMinsPreScaled; // 0x026C
    fVector3 m_vecSpecifiedSurroundingMaxsPreScaled; // 0x0278
    fVector3 m_vecSpecifiedSurroundingMins; // 0x0284
    fVector3 m_vecSpecifiedSurroundingMaxs; // 0x0290
    float m_flElasticity; // 0x02F0
    float m_flShadowCastDistance; // 0x02F4
    fVector3 m_vecOrigin; // 0x0428
    fVector3 m_angRotation; // 0x0434
    uint32_t m_CollisionGroup; // 0x0444
    uint32_t m_bIsPlayerSimulated; // 0x0724
    uint32_t m_bSimulatedEveryTick; // 0x0725
    uint32_t m_bAnimatedEveryTick; // 0x0726
    uint32_t m_bAlternateSorting; // 0x0727
    uint32_t m_iTextureFrameIndex; // 0x0728
    uint32_t m_hOwnerEntity; // 0x0734
    uint32_t m_hEffectEntity; // 0x0738
    uint32_t m_nSkin; // 0x0798
    uint32_t m_nBody; // 0x079C
    uint32_t m_nHitboxSet; // 0x07A0
    float m_flPlaybackRate; // 0x07D4
    fVector3 m_vecForce; // 0x07E8
    uint32_t m_nForceBone; // 0x07F4
    uint32_t m_bClientSideFrameReset; // 0x0834
    float m_fadeMinDist; // 0x0878
    float m_fadeMaxDist; // 0x087C
    float m_flFadeScale; // 0x0880
    float m_flModelScale; // 0x08E4
    float m_flModelWidthScale; // 0x08E4
    uintptr_t m_flPoseParameter[24]; // 0x08E8
    uintptr_t m_flEncodedController[4]; // 0x0A30
    uint32_t m_bClientSideAnimation; // 0x0AA0
    uint32_t m_nNewSequenceParity; // 0x0AA4
    uint32_t m_nResetEventsParity; // 0x0AA8
    uint32_t m_nSequence; // 0x0AD0
    float m_flCycle; // 0x0AD8
    uint32_t m_hLightingOrigin; // 0x0BA0
    uint32_t m_hLightingOriginRelative; // 0x0BA4
    uint32_t m_nMuzzleFlashParity; // 0x0BA8
    uint32_t m_hOwner; // 0x0BE0
    uint32_t m_nViewModelIndex; // 0x0BE4
    float m_flNextPrimaryAttack; // 0x0BE8
    float m_flNextSecondaryAttack; // 0x0BEC
    float m_flTimeWeaponIdle; // 0x0BF0
    uint32_t m_iViewModelIndex; // 0x0BF8
    uint32_t m_iWorldModelIndex; // 0x0BFC
    uint32_t m_iState; // 0x0C1C
    uint32_t m_iPrimaryAmmoType; // 0x0C28
    uint32_t m_iSecondaryAmmoType; // 0x0C2C
    uint32_t m_iClip1; // 0x0C30
    uint32_t m_iClip2; // 0x0C34
    uint32_t m_bFlipViewModel; // 0x0C60
    uint32_t m_nCustomViewmodelModelIndex; // 0x0C84
    uint32_t m_weaponMode; // 0x0CAC
    float m_fAccuracyPenalty; // 0x0CB0
    uint32_t m_bRedraw; // 0x0CF8
    uint32_t m_bPinPulled; // 0x0CF9
    float m_fThrowTime; // 0x0CFC
};

class CWeaponGlock // parent CBaseEntity {
public:
    uint32_t movecollide; // 0x0000
    uint32_t movetype; // 0x0000
    uint32_t m_nRenderFX; // 0x008C
    uint32_t m_clrRender; // 0x0090
    uint32_t m_flAnimTime; // 0x00A0
    uint32_t m_flSimulationTime; // 0x00A8
    uint32_t m_ubInterpolationFrame; // 0x00B4
    uint32_t m_fEffects; // 0x00B8
    uint32_t m_nRenderMode; // 0x00BC
    uint32_t m_nNextThinkTick; // 0x00C4
    uint32_t m_nModelIndex; // 0x00CC
    uint32_t m_iTeamNum; // 0x00D8
    uint32_t m_PredictableID; // 0x00DC
    uint32_t m_iParentAttachment; // 0x01F6
    uint32_t moveparent; // 0x020C
    fVector3 m_vecMinsPreScaled; // 0x0230
    fVector3 m_vecMaxsPreScaled; // 0x023C
    fVector3 m_vecMins; // 0x0248
    fVector3 m_vecMaxs; // 0x0254
    uint32_t m_usSolidFlags; // 0x0264
    uint32_t m_nSurroundType; // 0x0268
    uint32_t m_nSolidType; // 0x0269
    uint32_t m_triggerBloat; // 0x026A
    uint32_t m_bUniformTriggerBloat; // 0x026B
    fVector3 m_vecSpecifiedSurroundingMinsPreScaled; // 0x026C
    fVector3 m_vecSpecifiedSurroundingMaxsPreScaled; // 0x0278
    fVector3 m_vecSpecifiedSurroundingMins; // 0x0284
    fVector3 m_vecSpecifiedSurroundingMaxs; // 0x0290
    float m_flElasticity; // 0x02F0
    float m_flShadowCastDistance; // 0x02F4
    fVector3 m_vecOrigin; // 0x0428
    fVector3 m_angRotation; // 0x0434
    uint32_t m_CollisionGroup; // 0x0444
    uint32_t m_bIsPlayerSimulated; // 0x0724
    uint32_t m_bSimulatedEveryTick; // 0x0725
    uint32_t m_bAnimatedEveryTick; // 0x0726
    uint32_t m_bAlternateSorting; // 0x0727
    uint32_t m_iTextureFrameIndex; // 0x0728
    uint32_t m_hOwnerEntity; // 0x0734
    uint32_t m_hEffectEntity; // 0x0738
    uint32_t m_nSkin; // 0x0798
    uint32_t m_nBody; // 0x079C
    uint32_t m_nHitboxSet; // 0x07A0
    float m_flPlaybackRate; // 0x07D4
    fVector3 m_vecForce; // 0x07E8
    uint32_t m_nForceBone; // 0x07F4
    uint32_t m_bClientSideFrameReset; // 0x0834
    float m_fadeMinDist; // 0x0878
    float m_fadeMaxDist; // 0x087C
    float m_flFadeScale; // 0x0880
    float m_flModelScale; // 0x08E4
    float m_flModelWidthScale; // 0x08E4
    uintptr_t m_flPoseParameter[24]; // 0x08E8
    uintptr_t m_flEncodedController[4]; // 0x0A30
    uint32_t m_bClientSideAnimation; // 0x0AA0
    uint32_t m_nNewSequenceParity; // 0x0AA4
    uint32_t m_nResetEventsParity; // 0x0AA8
    uint32_t m_nSequence; // 0x0AD0
    float m_flCycle; // 0x0AD8
    uint32_t m_hLightingOrigin; // 0x0BA0
    uint32_t m_hLightingOriginRelative; // 0x0BA4
    uint32_t m_nMuzzleFlashParity; // 0x0BA8
    uint32_t m_hOwner; // 0x0BE0
    uint32_t m_nViewModelIndex; // 0x0BE4
    float m_flNextPrimaryAttack; // 0x0BE8
    float m_flNextSecondaryAttack; // 0x0BEC
    float m_flTimeWeaponIdle; // 0x0BF0
    uint32_t m_iViewModelIndex; // 0x0BF8
    uint32_t m_iWorldModelIndex; // 0x0BFC
    uint32_t m_iState; // 0x0C1C
    uint32_t m_iPrimaryAmmoType; // 0x0C28
    uint32_t m_iSecondaryAmmoType; // 0x0C2C
    uint32_t m_iClip1; // 0x0C30
    uint32_t m_iClip2; // 0x0C34
    uint32_t m_bFlipViewModel; // 0x0C60
    uint32_t m_nCustomViewmodelModelIndex; // 0x0C84
    uint32_t m_weaponMode; // 0x0CAC
    float m_fAccuracyPenalty; // 0x0CB0
    uint32_t m_bBurstMode; // 0x0CF8
    uint32_t m_iBurstShotsRemaining; // 0x0CFC
};

class CEnvScreenOverlay // parent CBaseEntity {
public:
    void* m_flOverlayTimes; // 0x0000
    uint32_t movecollide; // 0x0000
    void* m_iszOverlayNames; // 0x0000
    uint32_t movetype; // 0x0000
    uint32_t m_nRenderFX; // 0x008C
    uint32_t m_clrRender; // 0x0090
    uint32_t m_flAnimTime; // 0x00A0
    uint32_t m_flSimulationTime; // 0x00A8
    uint32_t m_ubInterpolationFrame; // 0x00B4
    uint32_t m_fEffects; // 0x00B8
    uint32_t m_nRenderMode; // 0x00BC
    uint32_t m_nModelIndex; // 0x00CC
    uint32_t m_iTeamNum; // 0x00D8
    uint32_t m_PredictableID; // 0x00DC
    uint32_t m_iParentAttachment; // 0x01F6
    uint32_t moveparent; // 0x020C
    fVector3 m_vecMinsPreScaled; // 0x0230
    fVector3 m_vecMaxsPreScaled; // 0x023C
    fVector3 m_vecMins; // 0x0248
    fVector3 m_vecMaxs; // 0x0254
    uint32_t m_usSolidFlags; // 0x0264
    uint32_t m_nSurroundType; // 0x0268
    uint32_t m_nSolidType; // 0x0269
    uint32_t m_triggerBloat; // 0x026A
    uint32_t m_bUniformTriggerBloat; // 0x026B
    fVector3 m_vecSpecifiedSurroundingMinsPreScaled; // 0x026C
    fVector3 m_vecSpecifiedSurroundingMaxsPreScaled; // 0x0278
    fVector3 m_vecSpecifiedSurroundingMins; // 0x0284
    fVector3 m_vecSpecifiedSurroundingMaxs; // 0x0290
    float m_flElasticity; // 0x02F0
    float m_flShadowCastDistance; // 0x02F4
    fVector3 m_vecOrigin; // 0x0428
    fVector3 m_angRotation; // 0x0434
    uint32_t m_CollisionGroup; // 0x0444
    uint32_t m_bIsPlayerSimulated; // 0x0724
    uint32_t m_bSimulatedEveryTick; // 0x0725
    uint32_t m_bAnimatedEveryTick; // 0x0726
    uint32_t m_bAlternateSorting; // 0x0727
    uint32_t m_iTextureFrameIndex; // 0x0728
    uint32_t m_hOwnerEntity; // 0x0734
    uint32_t m_hEffectEntity; // 0x0738
    float m_flStartTime; // 0x11A8
    uint32_t m_iDesiredOverlay; // 0x11AC
    uint32_t m_bIsActive; // 0x11B0
};

class CWeaponGalil // parent CBaseEntity {
public:
    uint32_t movecollide; // 0x0000
    uint32_t movetype; // 0x0000
    uint32_t m_nRenderFX; // 0x008C
    uint32_t m_clrRender; // 0x0090
    uint32_t m_flAnimTime; // 0x00A0
    uint32_t m_flSimulationTime; // 0x00A8
    uint32_t m_ubInterpolationFrame; // 0x00B4
    uint32_t m_fEffects; // 0x00B8
    uint32_t m_nRenderMode; // 0x00BC
    uint32_t m_nNextThinkTick; // 0x00C4
    uint32_t m_nModelIndex; // 0x00CC
    uint32_t m_iTeamNum; // 0x00D8
    uint32_t m_PredictableID; // 0x00DC
    uint32_t m_iParentAttachment; // 0x01F6
    uint32_t moveparent; // 0x020C
    fVector3 m_vecMinsPreScaled; // 0x0230
    fVector3 m_vecMaxsPreScaled; // 0x023C
    fVector3 m_vecMins; // 0x0248
    fVector3 m_vecMaxs; // 0x0254
    uint32_t m_usSolidFlags; // 0x0264
    uint32_t m_nSurroundType; // 0x0268
    uint32_t m_nSolidType; // 0x0269
    uint32_t m_triggerBloat; // 0x026A
    uint32_t m_bUniformTriggerBloat; // 0x026B
    fVector3 m_vecSpecifiedSurroundingMinsPreScaled; // 0x026C
    fVector3 m_vecSpecifiedSurroundingMaxsPreScaled; // 0x0278
    fVector3 m_vecSpecifiedSurroundingMins; // 0x0284
    fVector3 m_vecSpecifiedSurroundingMaxs; // 0x0290
    float m_flElasticity; // 0x02F0
    float m_flShadowCastDistance; // 0x02F4
    fVector3 m_vecOrigin; // 0x0428
    fVector3 m_angRotation; // 0x0434
    uint32_t m_CollisionGroup; // 0x0444
    uint32_t m_bIsPlayerSimulated; // 0x0724
    uint32_t m_bSimulatedEveryTick; // 0x0725
    uint32_t m_bAnimatedEveryTick; // 0x0726
    uint32_t m_bAlternateSorting; // 0x0727
    uint32_t m_iTextureFrameIndex; // 0x0728
    uint32_t m_hOwnerEntity; // 0x0734
    uint32_t m_hEffectEntity; // 0x0738
    uint32_t m_nSkin; // 0x0798
    uint32_t m_nBody; // 0x079C
    uint32_t m_nHitboxSet; // 0x07A0
    float m_flPlaybackRate; // 0x07D4
    fVector3 m_vecForce; // 0x07E8
    uint32_t m_nForceBone; // 0x07F4
    uint32_t m_bClientSideFrameReset; // 0x0834
    float m_fadeMinDist; // 0x0878
    float m_fadeMaxDist; // 0x087C
    float m_flFadeScale; // 0x0880
    float m_flModelWidthScale; // 0x08E4
    float m_flModelScale; // 0x08E4
    uintptr_t m_flPoseParameter[24]; // 0x08E8
    uintptr_t m_flEncodedController[4]; // 0x0A30
    uint32_t m_bClientSideAnimation; // 0x0AA0
    uint32_t m_nNewSequenceParity; // 0x0AA4
    uint32_t m_nResetEventsParity; // 0x0AA8
    uint32_t m_nSequence; // 0x0AD0
    float m_flCycle; // 0x0AD8
    uint32_t m_hLightingOrigin; // 0x0BA0
    uint32_t m_hLightingOriginRelative; // 0x0BA4
    uint32_t m_nMuzzleFlashParity; // 0x0BA8
    uint32_t m_hOwner; // 0x0BE0
    uint32_t m_nViewModelIndex; // 0x0BE4
    float m_flNextPrimaryAttack; // 0x0BE8
    float m_flNextSecondaryAttack; // 0x0BEC
    float m_flTimeWeaponIdle; // 0x0BF0
    uint32_t m_iViewModelIndex; // 0x0BF8
    uint32_t m_iWorldModelIndex; // 0x0BFC
    uint32_t m_iState; // 0x0C1C
    uint32_t m_iPrimaryAmmoType; // 0x0C28
    uint32_t m_iSecondaryAmmoType; // 0x0C2C
    uint32_t m_iClip1; // 0x0C30
    uint32_t m_iClip2; // 0x0C34
    uint32_t m_bFlipViewModel; // 0x0C60
    uint32_t m_nCustomViewmodelModelIndex; // 0x0C84
    uint32_t m_weaponMode; // 0x0CAC
    float m_fAccuracyPenalty; // 0x0CB0
};

class CC4 // parent CBaseEntity {
public:
    uint32_t movetype; // 0x0000
    uint32_t movecollide; // 0x0000
    uint32_t m_nRenderFX; // 0x008C
    uint32_t m_clrRender; // 0x0090
    uint32_t m_flAnimTime; // 0x00A0
    uint32_t m_flSimulationTime; // 0x00A8
    uint32_t m_ubInterpolationFrame; // 0x00B4
    uint32_t m_fEffects; // 0x00B8
    uint32_t m_nRenderMode; // 0x00BC
    uint32_t m_nNextThinkTick; // 0x00C4
    uint32_t m_nModelIndex; // 0x00CC
    uint32_t m_iTeamNum; // 0x00D8
    uint32_t m_PredictableID; // 0x00DC
    uint32_t m_iParentAttachment; // 0x01F6
    uint32_t moveparent; // 0x020C
    fVector3 m_vecMinsPreScaled; // 0x0230
    fVector3 m_vecMaxsPreScaled; // 0x023C
    fVector3 m_vecMins; // 0x0248
    fVector3 m_vecMaxs; // 0x0254
    uint32_t m_usSolidFlags; // 0x0264
    uint32_t m_nSurroundType; // 0x0268
    uint32_t m_nSolidType; // 0x0269
    uint32_t m_triggerBloat; // 0x026A
    uint32_t m_bUniformTriggerBloat; // 0x026B
    fVector3 m_vecSpecifiedSurroundingMinsPreScaled; // 0x026C
    fVector3 m_vecSpecifiedSurroundingMaxsPreScaled; // 0x0278
    fVector3 m_vecSpecifiedSurroundingMins; // 0x0284
    fVector3 m_vecSpecifiedSurroundingMaxs; // 0x0290
    float m_flElasticity; // 0x02F0
    float m_flShadowCastDistance; // 0x02F4
    fVector3 m_vecOrigin; // 0x0428
    fVector3 m_angRotation; // 0x0434
    uint32_t m_CollisionGroup; // 0x0444
    uint32_t m_bIsPlayerSimulated; // 0x0724
    uint32_t m_bSimulatedEveryTick; // 0x0725
    uint32_t m_bAnimatedEveryTick; // 0x0726
    uint32_t m_bAlternateSorting; // 0x0727
    uint32_t m_iTextureFrameIndex; // 0x0728
    uint32_t m_hOwnerEntity; // 0x0734
    uint32_t m_hEffectEntity; // 0x0738
    uint32_t m_nSkin; // 0x0798
    uint32_t m_nBody; // 0x079C
    uint32_t m_nHitboxSet; // 0x07A0
    float m_flPlaybackRate; // 0x07D4
    fVector3 m_vecForce; // 0x07E8
    uint32_t m_nForceBone; // 0x07F4
    uint32_t m_bClientSideFrameReset; // 0x0834
    float m_fadeMinDist; // 0x0878
    float m_fadeMaxDist; // 0x087C
    float m_flFadeScale; // 0x0880
    float m_flModelScale; // 0x08E4
    float m_flModelWidthScale; // 0x08E4
    uintptr_t m_flPoseParameter[24]; // 0x08E8
    uintptr_t m_flEncodedController[4]; // 0x0A30
    uint32_t m_bClientSideAnimation; // 0x0AA0
    uint32_t m_nNewSequenceParity; // 0x0AA4
    uint32_t m_nResetEventsParity; // 0x0AA8
    uint32_t m_nSequence; // 0x0AD0
    float m_flCycle; // 0x0AD8
    uint32_t m_hLightingOrigin; // 0x0BA0
    uint32_t m_hLightingOriginRelative; // 0x0BA4
    uint32_t m_nMuzzleFlashParity; // 0x0BA8
    uint32_t m_hOwner; // 0x0BE0
    uint32_t m_nViewModelIndex; // 0x0BE4
    float m_flNextPrimaryAttack; // 0x0BE8
    float m_flNextSecondaryAttack; // 0x0BEC
    float m_flTimeWeaponIdle; // 0x0BF0
    uint32_t m_iViewModelIndex; // 0x0BF8
    uint32_t m_iWorldModelIndex; // 0x0BFC
    uint32_t m_iState; // 0x0C1C
    uint32_t m_iPrimaryAmmoType; // 0x0C28
    uint32_t m_iSecondaryAmmoType; // 0x0C2C
    uint32_t m_iClip1; // 0x0C30
    uint32_t m_iClip2; // 0x0C34
    uint32_t m_bFlipViewModel; // 0x0C60
    uint32_t m_nCustomViewmodelModelIndex; // 0x0C84
    uint32_t m_weaponMode; // 0x0CAC
    float m_fAccuracyPenalty; // 0x0CB0
    uint32_t m_bStartedArming; // 0x0D18
    float m_fArmedTime; // 0x0D1C
    uint32_t m_bBombPlacedAnimation; // 0x0D20
};

class CWeaponG3SG1 // parent CBaseEntity {
public:
    uint32_t movecollide; // 0x0000
    uint32_t movetype; // 0x0000
    uint32_t m_nRenderFX; // 0x008C
    uint32_t m_clrRender; // 0x0090
    uint32_t m_flAnimTime; // 0x00A0
    uint32_t m_flSimulationTime; // 0x00A8
    uint32_t m_ubInterpolationFrame; // 0x00B4
    uint32_t m_fEffects; // 0x00B8
    uint32_t m_nRenderMode; // 0x00BC
    uint32_t m_nNextThinkTick; // 0x00C4
    uint32_t m_nModelIndex; // 0x00CC
    uint32_t m_iTeamNum; // 0x00D8
    uint32_t m_PredictableID; // 0x00DC
    uint32_t m_iParentAttachment; // 0x01F6
    uint32_t moveparent; // 0x020C
    fVector3 m_vecMinsPreScaled; // 0x0230
    fVector3 m_vecMaxsPreScaled; // 0x023C
    fVector3 m_vecMins; // 0x0248
    fVector3 m_vecMaxs; // 0x0254
    uint32_t m_usSolidFlags; // 0x0264
    uint32_t m_nSurroundType; // 0x0268
    uint32_t m_nSolidType; // 0x0269
    uint32_t m_triggerBloat; // 0x026A
    uint32_t m_bUniformTriggerBloat; // 0x026B
    fVector3 m_vecSpecifiedSurroundingMinsPreScaled; // 0x026C
    fVector3 m_vecSpecifiedSurroundingMaxsPreScaled; // 0x0278
    fVector3 m_vecSpecifiedSurroundingMins; // 0x0284
    fVector3 m_vecSpecifiedSurroundingMaxs; // 0x0290
    float m_flElasticity; // 0x02F0
    float m_flShadowCastDistance; // 0x02F4
    fVector3 m_vecOrigin; // 0x0428
    fVector3 m_angRotation; // 0x0434
    uint32_t m_CollisionGroup; // 0x0444
    uint32_t m_bIsPlayerSimulated; // 0x0724
    uint32_t m_bSimulatedEveryTick; // 0x0725
    uint32_t m_bAnimatedEveryTick; // 0x0726
    uint32_t m_bAlternateSorting; // 0x0727
    uint32_t m_iTextureFrameIndex; // 0x0728
    uint32_t m_hOwnerEntity; // 0x0734
    uint32_t m_hEffectEntity; // 0x0738
    uint32_t m_nSkin; // 0x0798
    uint32_t m_nBody; // 0x079C
    uint32_t m_nHitboxSet; // 0x07A0
    float m_flPlaybackRate; // 0x07D4
    fVector3 m_vecForce; // 0x07E8
    uint32_t m_nForceBone; // 0x07F4
    uint32_t m_bClientSideFrameReset; // 0x0834
    float m_fadeMinDist; // 0x0878
    float m_fadeMaxDist; // 0x087C
    float m_flFadeScale; // 0x0880
    float m_flModelWidthScale; // 0x08E4
    float m_flModelScale; // 0x08E4
    uintptr_t m_flPoseParameter[24]; // 0x08E8
    uintptr_t m_flEncodedController[4]; // 0x0A30
    uint32_t m_bClientSideAnimation; // 0x0AA0
    uint32_t m_nNewSequenceParity; // 0x0AA4
    uint32_t m_nResetEventsParity; // 0x0AA8
    uint32_t m_nSequence; // 0x0AD0
    float m_flCycle; // 0x0AD8
    uint32_t m_hLightingOrigin; // 0x0BA0
    uint32_t m_hLightingOriginRelative; // 0x0BA4
    uint32_t m_nMuzzleFlashParity; // 0x0BA8
    uint32_t m_hOwner; // 0x0BE0
    uint32_t m_nViewModelIndex; // 0x0BE4
    float m_flNextPrimaryAttack; // 0x0BE8
    float m_flNextSecondaryAttack; // 0x0BEC
    float m_flTimeWeaponIdle; // 0x0BF0
    uint32_t m_iViewModelIndex; // 0x0BF8
    uint32_t m_iWorldModelIndex; // 0x0BFC
    uint32_t m_iState; // 0x0C1C
    uint32_t m_iPrimaryAmmoType; // 0x0C28
    uint32_t m_iSecondaryAmmoType; // 0x0C2C
    uint32_t m_iClip1; // 0x0C30
    uint32_t m_iClip2; // 0x0C34
    uint32_t m_bFlipViewModel; // 0x0C60
    uint32_t m_nCustomViewmodelModelIndex; // 0x0C84
    uint32_t m_weaponMode; // 0x0CAC
    float m_fAccuracyPenalty; // 0x0CB0
};

class CFlashbang // parent CBaseEntity {
public:
    uint32_t movecollide; // 0x0000
    uint32_t movetype; // 0x0000
    uint32_t m_nRenderFX; // 0x008C
    uint32_t m_clrRender; // 0x0090
    uint32_t m_flAnimTime; // 0x00A0
    uint32_t m_flSimulationTime; // 0x00A8
    uint32_t m_ubInterpolationFrame; // 0x00B4
    uint32_t m_fEffects; // 0x00B8
    uint32_t m_nRenderMode; // 0x00BC
    uint32_t m_nNextThinkTick; // 0x00C4
    uint32_t m_nModelIndex; // 0x00CC
    uint32_t m_iTeamNum; // 0x00D8
    uint32_t m_PredictableID; // 0x00DC
    uint32_t m_iParentAttachment; // 0x01F6
    uint32_t moveparent; // 0x020C
    fVector3 m_vecMinsPreScaled; // 0x0230
    fVector3 m_vecMaxsPreScaled; // 0x023C
    fVector3 m_vecMins; // 0x0248
    fVector3 m_vecMaxs; // 0x0254
    uint32_t m_usSolidFlags; // 0x0264
    uint32_t m_nSurroundType; // 0x0268
    uint32_t m_nSolidType; // 0x0269
    uint32_t m_triggerBloat; // 0x026A
    uint32_t m_bUniformTriggerBloat; // 0x026B
    fVector3 m_vecSpecifiedSurroundingMinsPreScaled; // 0x026C
    fVector3 m_vecSpecifiedSurroundingMaxsPreScaled; // 0x0278
    fVector3 m_vecSpecifiedSurroundingMins; // 0x0284
    fVector3 m_vecSpecifiedSurroundingMaxs; // 0x0290
    float m_flElasticity; // 0x02F0
    float m_flShadowCastDistance; // 0x02F4
    fVector3 m_vecOrigin; // 0x0428
    fVector3 m_angRotation; // 0x0434
    uint32_t m_CollisionGroup; // 0x0444
    uint32_t m_bIsPlayerSimulated; // 0x0724
    uint32_t m_bSimulatedEveryTick; // 0x0725
    uint32_t m_bAnimatedEveryTick; // 0x0726
    uint32_t m_bAlternateSorting; // 0x0727
    uint32_t m_iTextureFrameIndex; // 0x0728
    uint32_t m_hOwnerEntity; // 0x0734
    uint32_t m_hEffectEntity; // 0x0738
    uint32_t m_nSkin; // 0x0798
    uint32_t m_nBody; // 0x079C
    uint32_t m_nHitboxSet; // 0x07A0
    float m_flPlaybackRate; // 0x07D4
    fVector3 m_vecForce; // 0x07E8
    uint32_t m_nForceBone; // 0x07F4
    uint32_t m_bClientSideFrameReset; // 0x0834
    float m_fadeMinDist; // 0x0878
    float m_fadeMaxDist; // 0x087C
    float m_flFadeScale; // 0x0880
    float m_flModelScale; // 0x08E4
    float m_flModelWidthScale; // 0x08E4
    uintptr_t m_flPoseParameter[24]; // 0x08E8
    uintptr_t m_flEncodedController[4]; // 0x0A30
    uint32_t m_bClientSideAnimation; // 0x0AA0
    uint32_t m_nNewSequenceParity; // 0x0AA4
    uint32_t m_nResetEventsParity; // 0x0AA8
    uint32_t m_nSequence; // 0x0AD0
    float m_flCycle; // 0x0AD8
    uint32_t m_hLightingOrigin; // 0x0BA0
    uint32_t m_hLightingOriginRelative; // 0x0BA4
    uint32_t m_nMuzzleFlashParity; // 0x0BA8
    uint32_t m_hOwner; // 0x0BE0
    uint32_t m_nViewModelIndex; // 0x0BE4
    float m_flNextPrimaryAttack; // 0x0BE8
    float m_flNextSecondaryAttack; // 0x0BEC
    float m_flTimeWeaponIdle; // 0x0BF0
    uint32_t m_iViewModelIndex; // 0x0BF8
    uint32_t m_iWorldModelIndex; // 0x0BFC
    uint32_t m_iState; // 0x0C1C
    uint32_t m_iPrimaryAmmoType; // 0x0C28
    uint32_t m_iSecondaryAmmoType; // 0x0C2C
    uint32_t m_iClip1; // 0x0C30
    uint32_t m_iClip2; // 0x0C34
    uint32_t m_bFlipViewModel; // 0x0C60
    uint32_t m_nCustomViewmodelModelIndex; // 0x0C84
    uint32_t m_weaponMode; // 0x0CAC
    float m_fAccuracyPenalty; // 0x0CB0
    uint32_t m_bRedraw; // 0x0CF8
    uint32_t m_bPinPulled; // 0x0CF9
    float m_fThrowTime; // 0x0CFC
};

class CBaseViewModel {
public:
    void* m_flPoseParameter; // 0x0000
    uint32_t m_fEffects; // 0x00B8
    uint32_t m_nModelIndex; // 0x00CC
    uint32_t m_nSkin; // 0x0798
    uint32_t m_nBody; // 0x079C
    float m_flPlaybackRate; // 0x07D4
    uint32_t m_nNewSequenceParity; // 0x0AA4
    uint32_t m_nResetEventsParity; // 0x0AA8
    uint32_t m_nSequence; // 0x0AD0
    uint32_t m_nMuzzleFlashParity; // 0x0BA8
    uint32_t m_nViewModelIndex; // 0x0BF4
    uint32_t m_hOwner; // 0x0BF8
    uint32_t m_nAnimationParity; // 0x0C04
    uint32_t m_hWeapon; // 0x0C1C
};

class CWeaponFiveSeven // parent CBaseEntity {
public:
    uint32_t movecollide; // 0x0000
    uint32_t movetype; // 0x0000
    uint32_t m_nRenderFX; // 0x008C
    uint32_t m_clrRender; // 0x0090
    uint32_t m_flAnimTime; // 0x00A0
    uint32_t m_flSimulationTime; // 0x00A8
    uint32_t m_ubInterpolationFrame; // 0x00B4
    uint32_t m_fEffects; // 0x00B8
    uint32_t m_nRenderMode; // 0x00BC
    uint32_t m_nNextThinkTick; // 0x00C4
    uint32_t m_nModelIndex; // 0x00CC
    uint32_t m_iTeamNum; // 0x00D8
    uint32_t m_PredictableID; // 0x00DC
    uint32_t m_iParentAttachment; // 0x01F6
    uint32_t moveparent; // 0x020C
    fVector3 m_vecMinsPreScaled; // 0x0230
    fVector3 m_vecMaxsPreScaled; // 0x023C
    fVector3 m_vecMins; // 0x0248
    fVector3 m_vecMaxs; // 0x0254
    uint32_t m_usSolidFlags; // 0x0264
    uint32_t m_nSurroundType; // 0x0268
    uint32_t m_nSolidType; // 0x0269
    uint32_t m_triggerBloat; // 0x026A
    uint32_t m_bUniformTriggerBloat; // 0x026B
    fVector3 m_vecSpecifiedSurroundingMinsPreScaled; // 0x026C
    fVector3 m_vecSpecifiedSurroundingMaxsPreScaled; // 0x0278
    fVector3 m_vecSpecifiedSurroundingMins; // 0x0284
    fVector3 m_vecSpecifiedSurroundingMaxs; // 0x0290
    float m_flElasticity; // 0x02F0
    float m_flShadowCastDistance; // 0x02F4
    fVector3 m_vecOrigin; // 0x0428
    fVector3 m_angRotation; // 0x0434
    uint32_t m_CollisionGroup; // 0x0444
    uint32_t m_bIsPlayerSimulated; // 0x0724
    uint32_t m_bSimulatedEveryTick; // 0x0725
    uint32_t m_bAnimatedEveryTick; // 0x0726
    uint32_t m_bAlternateSorting; // 0x0727
    uint32_t m_iTextureFrameIndex; // 0x0728
    uint32_t m_hOwnerEntity; // 0x0734
    uint32_t m_hEffectEntity; // 0x0738
    uint32_t m_nSkin; // 0x0798
    uint32_t m_nBody; // 0x079C
    uint32_t m_nHitboxSet; // 0x07A0
    float m_flPlaybackRate; // 0x07D4
    fVector3 m_vecForce; // 0x07E8
    uint32_t m_nForceBone; // 0x07F4
    uint32_t m_bClientSideFrameReset; // 0x0834
    float m_fadeMinDist; // 0x0878
    float m_fadeMaxDist; // 0x087C
    float m_flFadeScale; // 0x0880
    float m_flModelWidthScale; // 0x08E4
    float m_flModelScale; // 0x08E4
    uintptr_t m_flPoseParameter[24]; // 0x08E8
    uintptr_t m_flEncodedController[4]; // 0x0A30
    uint32_t m_bClientSideAnimation; // 0x0AA0
    uint32_t m_nNewSequenceParity; // 0x0AA4
    uint32_t m_nResetEventsParity; // 0x0AA8
    uint32_t m_nSequence; // 0x0AD0
    float m_flCycle; // 0x0AD8
    uint32_t m_hLightingOrigin; // 0x0BA0
    uint32_t m_hLightingOriginRelative; // 0x0BA4
    uint32_t m_nMuzzleFlashParity; // 0x0BA8
    uint32_t m_hOwner; // 0x0BE0
    uint32_t m_nViewModelIndex; // 0x0BE4
    float m_flNextPrimaryAttack; // 0x0BE8
    float m_flNextSecondaryAttack; // 0x0BEC
    float m_flTimeWeaponIdle; // 0x0BF0
    uint32_t m_iViewModelIndex; // 0x0BF8
    uint32_t m_iWorldModelIndex; // 0x0BFC
    uint32_t m_iState; // 0x0C1C
    uint32_t m_iPrimaryAmmoType; // 0x0C28
    uint32_t m_iSecondaryAmmoType; // 0x0C2C
    uint32_t m_iClip1; // 0x0C30
    uint32_t m_iClip2; // 0x0C34
    uint32_t m_bFlipViewModel; // 0x0C60
    uint32_t m_nCustomViewmodelModelIndex; // 0x0C84
    uint32_t m_weaponMode; // 0x0CAC
    float m_fAccuracyPenalty; // 0x0CB0
};

class CWeaponFamas // parent CBaseEntity {
public:
    uint32_t movecollide; // 0x0000
    uint32_t movetype; // 0x0000
    uint32_t m_nRenderFX; // 0x008C
    uint32_t m_clrRender; // 0x0090
    uint32_t m_flAnimTime; // 0x00A0
    uint32_t m_flSimulationTime; // 0x00A8
    uint32_t m_ubInterpolationFrame; // 0x00B4
    uint32_t m_fEffects; // 0x00B8
    uint32_t m_nRenderMode; // 0x00BC
    uint32_t m_nNextThinkTick; // 0x00C4
    uint32_t m_nModelIndex; // 0x00CC
    uint32_t m_iTeamNum; // 0x00D8
    uint32_t m_PredictableID; // 0x00DC
    uint32_t m_iParentAttachment; // 0x01F6
    uint32_t moveparent; // 0x020C
    fVector3 m_vecMinsPreScaled; // 0x0230
    fVector3 m_vecMaxsPreScaled; // 0x023C
    fVector3 m_vecMins; // 0x0248
    fVector3 m_vecMaxs; // 0x0254
    uint32_t m_usSolidFlags; // 0x0264
    uint32_t m_nSurroundType; // 0x0268
    uint32_t m_nSolidType; // 0x0269
    uint32_t m_triggerBloat; // 0x026A
    uint32_t m_bUniformTriggerBloat; // 0x026B
    fVector3 m_vecSpecifiedSurroundingMinsPreScaled; // 0x026C
    fVector3 m_vecSpecifiedSurroundingMaxsPreScaled; // 0x0278
    fVector3 m_vecSpecifiedSurroundingMins; // 0x0284
    fVector3 m_vecSpecifiedSurroundingMaxs; // 0x0290
    float m_flElasticity; // 0x02F0
    float m_flShadowCastDistance; // 0x02F4
    fVector3 m_vecOrigin; // 0x0428
    fVector3 m_angRotation; // 0x0434
    uint32_t m_CollisionGroup; // 0x0444
    uint32_t m_bIsPlayerSimulated; // 0x0724
    uint32_t m_bSimulatedEveryTick; // 0x0725
    uint32_t m_bAnimatedEveryTick; // 0x0726
    uint32_t m_bAlternateSorting; // 0x0727
    uint32_t m_iTextureFrameIndex; // 0x0728
    uint32_t m_hOwnerEntity; // 0x0734
    uint32_t m_hEffectEntity; // 0x0738
    uint32_t m_nSkin; // 0x0798
    uint32_t m_nBody; // 0x079C
    uint32_t m_nHitboxSet; // 0x07A0
    float m_flPlaybackRate; // 0x07D4
    fVector3 m_vecForce; // 0x07E8
    uint32_t m_nForceBone; // 0x07F4
    uint32_t m_bClientSideFrameReset; // 0x0834
    float m_fadeMinDist; // 0x0878
    float m_fadeMaxDist; // 0x087C
    float m_flFadeScale; // 0x0880
    float m_flModelScale; // 0x08E4
    float m_flModelWidthScale; // 0x08E4
    uintptr_t m_flPoseParameter[24]; // 0x08E8
    uintptr_t m_flEncodedController[4]; // 0x0A30
    uint32_t m_bClientSideAnimation; // 0x0AA0
    uint32_t m_nNewSequenceParity; // 0x0AA4
    uint32_t m_nResetEventsParity; // 0x0AA8
    uint32_t m_nSequence; // 0x0AD0
    float m_flCycle; // 0x0AD8
    uint32_t m_hLightingOrigin; // 0x0BA0
    uint32_t m_hLightingOriginRelative; // 0x0BA4
    uint32_t m_nMuzzleFlashParity; // 0x0BA8
    uint32_t m_hOwner; // 0x0BE0
    uint32_t m_nViewModelIndex; // 0x0BE4
    float m_flNextPrimaryAttack; // 0x0BE8
    float m_flNextSecondaryAttack; // 0x0BEC
    float m_flTimeWeaponIdle; // 0x0BF0
    uint32_t m_iViewModelIndex; // 0x0BF8
    uint32_t m_iWorldModelIndex; // 0x0BFC
    uint32_t m_iState; // 0x0C1C
    uint32_t m_iPrimaryAmmoType; // 0x0C28
    uint32_t m_iSecondaryAmmoType; // 0x0C2C
    uint32_t m_iClip1; // 0x0C30
    uint32_t m_iClip2; // 0x0C34
    uint32_t m_bFlipViewModel; // 0x0C60
    uint32_t m_nCustomViewmodelModelIndex; // 0x0C84
    uint32_t m_weaponMode; // 0x0CAC
    float m_fAccuracyPenalty; // 0x0CB0
    uint32_t m_bBurstMode; // 0x0D00
    uint32_t m_iBurstShotsRemaining; // 0x0D04
};

class CWeaponElite // parent CBaseEntity {
public:
    uint32_t movecollide; // 0x0000
    uint32_t movetype; // 0x0000
    uint32_t m_nRenderFX; // 0x008C
    uint32_t m_clrRender; // 0x0090
    uint32_t m_flAnimTime; // 0x00A0
    uint32_t m_flSimulationTime; // 0x00A8
    uint32_t m_ubInterpolationFrame; // 0x00B4
    uint32_t m_fEffects; // 0x00B8
    uint32_t m_nRenderMode; // 0x00BC
    uint32_t m_nNextThinkTick; // 0x00C4
    uint32_t m_nModelIndex; // 0x00CC
    uint32_t m_iTeamNum; // 0x00D8
    uint32_t m_PredictableID; // 0x00DC
    uint32_t m_iParentAttachment; // 0x01F6
    uint32_t moveparent; // 0x020C
    fVector3 m_vecMinsPreScaled; // 0x0230
    fVector3 m_vecMaxsPreScaled; // 0x023C
    fVector3 m_vecMins; // 0x0248
    fVector3 m_vecMaxs; // 0x0254
    uint32_t m_usSolidFlags; // 0x0264
    uint32_t m_nSurroundType; // 0x0268
    uint32_t m_nSolidType; // 0x0269
    uint32_t m_triggerBloat; // 0x026A
    uint32_t m_bUniformTriggerBloat; // 0x026B
    fVector3 m_vecSpecifiedSurroundingMinsPreScaled; // 0x026C
    fVector3 m_vecSpecifiedSurroundingMaxsPreScaled; // 0x0278
    fVector3 m_vecSpecifiedSurroundingMins; // 0x0284
    fVector3 m_vecSpecifiedSurroundingMaxs; // 0x0290
    float m_flElasticity; // 0x02F0
    float m_flShadowCastDistance; // 0x02F4
    fVector3 m_vecOrigin; // 0x0428
    fVector3 m_angRotation; // 0x0434
    uint32_t m_CollisionGroup; // 0x0444
    uint32_t m_bIsPlayerSimulated; // 0x0724
    uint32_t m_bSimulatedEveryTick; // 0x0725
    uint32_t m_bAnimatedEveryTick; // 0x0726
    uint32_t m_bAlternateSorting; // 0x0727
    uint32_t m_iTextureFrameIndex; // 0x0728
    uint32_t m_hOwnerEntity; // 0x0734
    uint32_t m_hEffectEntity; // 0x0738
    uint32_t m_nSkin; // 0x0798
    uint32_t m_nBody; // 0x079C
    uint32_t m_nHitboxSet; // 0x07A0
    float m_flPlaybackRate; // 0x07D4
    fVector3 m_vecForce; // 0x07E8
    uint32_t m_nForceBone; // 0x07F4
    uint32_t m_bClientSideFrameReset; // 0x0834
    float m_fadeMinDist; // 0x0878
    float m_fadeMaxDist; // 0x087C
    float m_flFadeScale; // 0x0880
    float m_flModelWidthScale; // 0x08E4
    float m_flModelScale; // 0x08E4
    uintptr_t m_flPoseParameter[24]; // 0x08E8
    uintptr_t m_flEncodedController[4]; // 0x0A30
    uint32_t m_bClientSideAnimation; // 0x0AA0
    uint32_t m_nNewSequenceParity; // 0x0AA4
    uint32_t m_nResetEventsParity; // 0x0AA8
    uint32_t m_nSequence; // 0x0AD0
    float m_flCycle; // 0x0AD8
    uint32_t m_hLightingOrigin; // 0x0BA0
    uint32_t m_hLightingOriginRelative; // 0x0BA4
    uint32_t m_nMuzzleFlashParity; // 0x0BA8
    uint32_t m_hOwner; // 0x0BE0
    uint32_t m_nViewModelIndex; // 0x0BE4
    float m_flNextPrimaryAttack; // 0x0BE8
    float m_flNextSecondaryAttack; // 0x0BEC
    float m_flTimeWeaponIdle; // 0x0BF0
    uint32_t m_iViewModelIndex; // 0x0BF8
    uint32_t m_iWorldModelIndex; // 0x0BFC
    uint32_t m_iState; // 0x0C1C
    uint32_t m_iPrimaryAmmoType; // 0x0C28
    uint32_t m_iSecondaryAmmoType; // 0x0C2C
    uint32_t m_iClip1; // 0x0C30
    uint32_t m_iClip2; // 0x0C34
    uint32_t m_bFlipViewModel; // 0x0C60
    uint32_t m_nCustomViewmodelModelIndex; // 0x0C84
    uint32_t m_weaponMode; // 0x0CAC
    float m_fAccuracyPenalty; // 0x0CB0
};

class CDEagle // parent CBaseEntity {
public:
    uint32_t movecollide; // 0x0000
    uint32_t movetype; // 0x0000
    uint32_t m_nRenderFX; // 0x008C
    uint32_t m_clrRender; // 0x0090
    uint32_t m_flAnimTime; // 0x00A0
    uint32_t m_flSimulationTime; // 0x00A8
    uint32_t m_ubInterpolationFrame; // 0x00B4
    uint32_t m_fEffects; // 0x00B8
    uint32_t m_nRenderMode; // 0x00BC
    uint32_t m_nNextThinkTick; // 0x00C4
    uint32_t m_nModelIndex; // 0x00CC
    uint32_t m_iTeamNum; // 0x00D8
    uint32_t m_PredictableID; // 0x00DC
    uint32_t m_iParentAttachment; // 0x01F6
    uint32_t moveparent; // 0x020C
    fVector3 m_vecMinsPreScaled; // 0x0230
    fVector3 m_vecMaxsPreScaled; // 0x023C
    fVector3 m_vecMins; // 0x0248
    fVector3 m_vecMaxs; // 0x0254
    uint32_t m_usSolidFlags; // 0x0264
    uint32_t m_nSurroundType; // 0x0268
    uint32_t m_nSolidType; // 0x0269
    uint32_t m_triggerBloat; // 0x026A
    uint32_t m_bUniformTriggerBloat; // 0x026B
    fVector3 m_vecSpecifiedSurroundingMinsPreScaled; // 0x026C
    fVector3 m_vecSpecifiedSurroundingMaxsPreScaled; // 0x0278
    fVector3 m_vecSpecifiedSurroundingMins; // 0x0284
    fVector3 m_vecSpecifiedSurroundingMaxs; // 0x0290
    float m_flElasticity; // 0x02F0
    float m_flShadowCastDistance; // 0x02F4
    fVector3 m_vecOrigin; // 0x0428
    fVector3 m_angRotation; // 0x0434
    uint32_t m_CollisionGroup; // 0x0444
    uint32_t m_bIsPlayerSimulated; // 0x0724
    uint32_t m_bSimulatedEveryTick; // 0x0725
    uint32_t m_bAnimatedEveryTick; // 0x0726
    uint32_t m_bAlternateSorting; // 0x0727
    uint32_t m_iTextureFrameIndex; // 0x0728
    uint32_t m_hOwnerEntity; // 0x0734
    uint32_t m_hEffectEntity; // 0x0738
    uint32_t m_nSkin; // 0x0798
    uint32_t m_nBody; // 0x079C
    uint32_t m_nHitboxSet; // 0x07A0
    float m_flPlaybackRate; // 0x07D4
    fVector3 m_vecForce; // 0x07E8
    uint32_t m_nForceBone; // 0x07F4
    uint32_t m_bClientSideFrameReset; // 0x0834
    float m_fadeMinDist; // 0x0878
    float m_fadeMaxDist; // 0x087C
    float m_flFadeScale; // 0x0880
    float m_flModelWidthScale; // 0x08E4
    float m_flModelScale; // 0x08E4
    uintptr_t m_flPoseParameter[24]; // 0x08E8
    uintptr_t m_flEncodedController[4]; // 0x0A30
    uint32_t m_bClientSideAnimation; // 0x0AA0
    uint32_t m_nNewSequenceParity; // 0x0AA4
    uint32_t m_nResetEventsParity; // 0x0AA8
    uint32_t m_nSequence; // 0x0AD0
    float m_flCycle; // 0x0AD8
    uint32_t m_hLightingOrigin; // 0x0BA0
    uint32_t m_hLightingOriginRelative; // 0x0BA4
    uint32_t m_nMuzzleFlashParity; // 0x0BA8
    uint32_t m_hOwner; // 0x0BE0
    uint32_t m_nViewModelIndex; // 0x0BE4
    float m_flNextPrimaryAttack; // 0x0BE8
    float m_flNextSecondaryAttack; // 0x0BEC
    float m_flTimeWeaponIdle; // 0x0BF0
    uint32_t m_iViewModelIndex; // 0x0BF8
    uint32_t m_iWorldModelIndex; // 0x0BFC
    uint32_t m_iState; // 0x0C1C
    uint32_t m_iPrimaryAmmoType; // 0x0C28
    uint32_t m_iSecondaryAmmoType; // 0x0C2C
    uint32_t m_iClip1; // 0x0C30
    uint32_t m_iClip2; // 0x0C34
    uint32_t m_bFlipViewModel; // 0x0C60
    uint32_t m_nCustomViewmodelModelIndex; // 0x0C84
    uint32_t m_weaponMode; // 0x0CAC
    float m_fAccuracyPenalty; // 0x0CB0
};

class CFootstepControl // parent CBaseEntity {
public:
    uint32_t movecollide; // 0x0000
    uint32_t movetype; // 0x0000
    uint32_t m_nRenderFX; // 0x008C
    uint32_t m_clrRender; // 0x0090
    uint32_t m_flAnimTime; // 0x00A0
    uint32_t m_flSimulationTime; // 0x00A8
    uint32_t m_ubInterpolationFrame; // 0x00B4
    uint32_t m_fEffects; // 0x00B8
    uint32_t m_nRenderMode; // 0x00BC
    uint32_t m_nModelIndex; // 0x00CC
    uint32_t m_iTeamNum; // 0x00D8
    uint32_t m_PredictableID; // 0x00DC
    uint32_t m_iParentAttachment; // 0x01F6
    uint32_t moveparent; // 0x020C
    fVector3 m_vecMinsPreScaled; // 0x0230
    fVector3 m_vecMaxsPreScaled; // 0x023C
    fVector3 m_vecMins; // 0x0248
    fVector3 m_vecMaxs; // 0x0254
    uint32_t m_usSolidFlags; // 0x0264
    uint32_t m_nSurroundType; // 0x0268
    uint32_t m_nSolidType; // 0x0269
    uint32_t m_triggerBloat; // 0x026A
    uint32_t m_bUniformTriggerBloat; // 0x026B
    fVector3 m_vecSpecifiedSurroundingMinsPreScaled; // 0x026C
    fVector3 m_vecSpecifiedSurroundingMaxsPreScaled; // 0x0278
    fVector3 m_vecSpecifiedSurroundingMins; // 0x0284
    fVector3 m_vecSpecifiedSurroundingMaxs; // 0x0290
    float m_flElasticity; // 0x02F0
    float m_flShadowCastDistance; // 0x02F4
    fVector3 m_vecOrigin; // 0x0428
    fVector3 m_angRotation; // 0x0434
    uint32_t m_CollisionGroup; // 0x0444
    uint32_t m_bIsPlayerSimulated; // 0x0724
    uint32_t m_bSimulatedEveryTick; // 0x0725
    uint32_t m_bAnimatedEveryTick; // 0x0726
    uint32_t m_bAlternateSorting; // 0x0727
    uint32_t m_iTextureFrameIndex; // 0x0728
    uint32_t m_hOwnerEntity; // 0x0734
    uint32_t m_hEffectEntity; // 0x0738
    const char* m_source; // 0x0788
    const char* m_destination; // 0x0798
};

class CWeaponCSBaseGun // parent CBaseEntity {
public:
    uint32_t movecollide; // 0x0000
    uint32_t movetype; // 0x0000
    uint32_t m_nRenderFX; // 0x008C
    uint32_t m_clrRender; // 0x0090
    uint32_t m_flAnimTime; // 0x00A0
    uint32_t m_flSimulationTime; // 0x00A8
    uint32_t m_ubInterpolationFrame; // 0x00B4
    uint32_t m_fEffects; // 0x00B8
    uint32_t m_nRenderMode; // 0x00BC
    uint32_t m_nNextThinkTick; // 0x00C4
    uint32_t m_nModelIndex; // 0x00CC
    uint32_t m_iTeamNum; // 0x00D8
    uint32_t m_PredictableID; // 0x00DC
    uint32_t m_iParentAttachment; // 0x01F6
    uint32_t moveparent; // 0x020C
    fVector3 m_vecMinsPreScaled; // 0x0230
    fVector3 m_vecMaxsPreScaled; // 0x023C
    fVector3 m_vecMins; // 0x0248
    fVector3 m_vecMaxs; // 0x0254
    uint32_t m_usSolidFlags; // 0x0264
    uint32_t m_nSurroundType; // 0x0268
    uint32_t m_nSolidType; // 0x0269
    uint32_t m_triggerBloat; // 0x026A
    uint32_t m_bUniformTriggerBloat; // 0x026B
    fVector3 m_vecSpecifiedSurroundingMinsPreScaled; // 0x026C
    fVector3 m_vecSpecifiedSurroundingMaxsPreScaled; // 0x0278
    fVector3 m_vecSpecifiedSurroundingMins; // 0x0284
    fVector3 m_vecSpecifiedSurroundingMaxs; // 0x0290
    float m_flElasticity; // 0x02F0
    float m_flShadowCastDistance; // 0x02F4
    fVector3 m_vecOrigin; // 0x0428
    fVector3 m_angRotation; // 0x0434
    uint32_t m_CollisionGroup; // 0x0444
    uint32_t m_bIsPlayerSimulated; // 0x0724
    uint32_t m_bSimulatedEveryTick; // 0x0725
    uint32_t m_bAnimatedEveryTick; // 0x0726
    uint32_t m_bAlternateSorting; // 0x0727
    uint32_t m_iTextureFrameIndex; // 0x0728
    uint32_t m_hOwnerEntity; // 0x0734
    uint32_t m_hEffectEntity; // 0x0738
    uint32_t m_nSkin; // 0x0798
    uint32_t m_nBody; // 0x079C
    uint32_t m_nHitboxSet; // 0x07A0
    float m_flPlaybackRate; // 0x07D4
    fVector3 m_vecForce; // 0x07E8
    uint32_t m_nForceBone; // 0x07F4
    uint32_t m_bClientSideFrameReset; // 0x0834
    float m_fadeMinDist; // 0x0878
    float m_fadeMaxDist; // 0x087C
    float m_flFadeScale; // 0x0880
    float m_flModelWidthScale; // 0x08E4
    float m_flModelScale; // 0x08E4
    uintptr_t m_flPoseParameter[24]; // 0x08E8
    uintptr_t m_flEncodedController[4]; // 0x0A30
    uint32_t m_bClientSideAnimation; // 0x0AA0
    uint32_t m_nNewSequenceParity; // 0x0AA4
    uint32_t m_nResetEventsParity; // 0x0AA8
    uint32_t m_nSequence; // 0x0AD0
    float m_flCycle; // 0x0AD8
    uint32_t m_hLightingOrigin; // 0x0BA0
    uint32_t m_hLightingOriginRelative; // 0x0BA4
    uint32_t m_nMuzzleFlashParity; // 0x0BA8
    uint32_t m_hOwner; // 0x0BE0
    uint32_t m_nViewModelIndex; // 0x0BE4
    float m_flNextPrimaryAttack; // 0x0BE8
    float m_flNextSecondaryAttack; // 0x0BEC
    float m_flTimeWeaponIdle; // 0x0BF0
    uint32_t m_iViewModelIndex; // 0x0BF8
    uint32_t m_iWorldModelIndex; // 0x0BFC
    uint32_t m_iState; // 0x0C1C
    uint32_t m_iPrimaryAmmoType; // 0x0C28
    uint32_t m_iSecondaryAmmoType; // 0x0C2C
    uint32_t m_iClip1; // 0x0C30
    uint32_t m_iClip2; // 0x0C34
    uint32_t m_bFlipViewModel; // 0x0C60
    uint32_t m_nCustomViewmodelModelIndex; // 0x0C84
    uint32_t m_weaponMode; // 0x0CAC
    float m_fAccuracyPenalty; // 0x0CB0
};

class CBaseCSGrenade // parent CBaseEntity {
public:
    uint32_t movecollide; // 0x0000
    uint32_t movetype; // 0x0000
    uint32_t m_nRenderFX; // 0x008C
    uint32_t m_clrRender; // 0x0090
    uint32_t m_flAnimTime; // 0x00A0
    uint32_t m_flSimulationTime; // 0x00A8
    uint32_t m_ubInterpolationFrame; // 0x00B4
    uint32_t m_fEffects; // 0x00B8
    uint32_t m_nRenderMode; // 0x00BC
    uint32_t m_nNextThinkTick; // 0x00C4
    uint32_t m_nModelIndex; // 0x00CC
    uint32_t m_iTeamNum; // 0x00D8
    uint32_t m_PredictableID; // 0x00DC
    uint32_t m_iParentAttachment; // 0x01F6
    uint32_t moveparent; // 0x020C
    fVector3 m_vecMinsPreScaled; // 0x0230
    fVector3 m_vecMaxsPreScaled; // 0x023C
    fVector3 m_vecMins; // 0x0248
    fVector3 m_vecMaxs; // 0x0254
    uint32_t m_usSolidFlags; // 0x0264
    uint32_t m_nSurroundType; // 0x0268
    uint32_t m_nSolidType; // 0x0269
    uint32_t m_triggerBloat; // 0x026A
    uint32_t m_bUniformTriggerBloat; // 0x026B
    fVector3 m_vecSpecifiedSurroundingMinsPreScaled; // 0x026C
    fVector3 m_vecSpecifiedSurroundingMaxsPreScaled; // 0x0278
    fVector3 m_vecSpecifiedSurroundingMins; // 0x0284
    fVector3 m_vecSpecifiedSurroundingMaxs; // 0x0290
    float m_flElasticity; // 0x02F0
    float m_flShadowCastDistance; // 0x02F4
    fVector3 m_vecOrigin; // 0x0428
    fVector3 m_angRotation; // 0x0434
    uint32_t m_CollisionGroup; // 0x0444
    uint32_t m_bIsPlayerSimulated; // 0x0724
    uint32_t m_bSimulatedEveryTick; // 0x0725
    uint32_t m_bAnimatedEveryTick; // 0x0726
    uint32_t m_bAlternateSorting; // 0x0727
    uint32_t m_iTextureFrameIndex; // 0x0728
    uint32_t m_hOwnerEntity; // 0x0734
    uint32_t m_hEffectEntity; // 0x0738
    uint32_t m_nSkin; // 0x0798
    uint32_t m_nBody; // 0x079C
    uint32_t m_nHitboxSet; // 0x07A0
    float m_flPlaybackRate; // 0x07D4
    fVector3 m_vecForce; // 0x07E8
    uint32_t m_nForceBone; // 0x07F4
    uint32_t m_bClientSideFrameReset; // 0x0834
    float m_fadeMinDist; // 0x0878
    float m_fadeMaxDist; // 0x087C
    float m_flFadeScale; // 0x0880
    float m_flModelScale; // 0x08E4
    float m_flModelWidthScale; // 0x08E4
    uintptr_t m_flPoseParameter[24]; // 0x08E8
    uintptr_t m_flEncodedController[4]; // 0x0A30
    uint32_t m_bClientSideAnimation; // 0x0AA0
    uint32_t m_nNewSequenceParity; // 0x0AA4
    uint32_t m_nResetEventsParity; // 0x0AA8
    uint32_t m_nSequence; // 0x0AD0
    float m_flCycle; // 0x0AD8
    uint32_t m_hLightingOrigin; // 0x0BA0
    uint32_t m_hLightingOriginRelative; // 0x0BA4
    uint32_t m_nMuzzleFlashParity; // 0x0BA8
    uint32_t m_hOwner; // 0x0BE0
    uint32_t m_nViewModelIndex; // 0x0BE4
    float m_flNextPrimaryAttack; // 0x0BE8
    float m_flNextSecondaryAttack; // 0x0BEC
    float m_flTimeWeaponIdle; // 0x0BF0
    uint32_t m_iViewModelIndex; // 0x0BF8
    uint32_t m_iWorldModelIndex; // 0x0BFC
    uint32_t m_iState; // 0x0C1C
    uint32_t m_iPrimaryAmmoType; // 0x0C28
    uint32_t m_iSecondaryAmmoType; // 0x0C2C
    uint32_t m_iClip1; // 0x0C30
    uint32_t m_iClip2; // 0x0C34
    uint32_t m_bFlipViewModel; // 0x0C60
    uint32_t m_nCustomViewmodelModelIndex; // 0x0C84
    uint32_t m_weaponMode; // 0x0CAC
    float m_fAccuracyPenalty; // 0x0CB0
    uint32_t m_bRedraw; // 0x0CF8
    uint32_t m_bPinPulled; // 0x0CF9
    float m_fThrowTime; // 0x0CFC
};

class CWeaponAWP // parent CBaseEntity {
public:
    uint32_t movecollide; // 0x0000
    uint32_t movetype; // 0x0000
    uint32_t m_nRenderFX; // 0x008C
    uint32_t m_clrRender; // 0x0090
    uint32_t m_flAnimTime; // 0x00A0
    uint32_t m_flSimulationTime; // 0x00A8
    uint32_t m_ubInterpolationFrame; // 0x00B4
    uint32_t m_fEffects; // 0x00B8
    uint32_t m_nRenderMode; // 0x00BC
    uint32_t m_nNextThinkTick; // 0x00C4
    uint32_t m_nModelIndex; // 0x00CC
    uint32_t m_iTeamNum; // 0x00D8
    uint32_t m_PredictableID; // 0x00DC
    uint32_t m_iParentAttachment; // 0x01F6
    uint32_t moveparent; // 0x020C
    fVector3 m_vecMinsPreScaled; // 0x0230
    fVector3 m_vecMaxsPreScaled; // 0x023C
    fVector3 m_vecMins; // 0x0248
    fVector3 m_vecMaxs; // 0x0254
    uint32_t m_usSolidFlags; // 0x0264
    uint32_t m_nSurroundType; // 0x0268
    uint32_t m_nSolidType; // 0x0269
    uint32_t m_triggerBloat; // 0x026A
    uint32_t m_bUniformTriggerBloat; // 0x026B
    fVector3 m_vecSpecifiedSurroundingMinsPreScaled; // 0x026C
    fVector3 m_vecSpecifiedSurroundingMaxsPreScaled; // 0x0278
    fVector3 m_vecSpecifiedSurroundingMins; // 0x0284
    fVector3 m_vecSpecifiedSurroundingMaxs; // 0x0290
    float m_flElasticity; // 0x02F0
    float m_flShadowCastDistance; // 0x02F4
    fVector3 m_vecOrigin; // 0x0428
    fVector3 m_angRotation; // 0x0434
    uint32_t m_CollisionGroup; // 0x0444
    uint32_t m_bIsPlayerSimulated; // 0x0724
    uint32_t m_bSimulatedEveryTick; // 0x0725
    uint32_t m_bAnimatedEveryTick; // 0x0726
    uint32_t m_bAlternateSorting; // 0x0727
    uint32_t m_iTextureFrameIndex; // 0x0728
    uint32_t m_hOwnerEntity; // 0x0734
    uint32_t m_hEffectEntity; // 0x0738
    uint32_t m_nSkin; // 0x0798
    uint32_t m_nBody; // 0x079C
    uint32_t m_nHitboxSet; // 0x07A0
    float m_flPlaybackRate; // 0x07D4
    fVector3 m_vecForce; // 0x07E8
    uint32_t m_nForceBone; // 0x07F4
    uint32_t m_bClientSideFrameReset; // 0x0834
    float m_fadeMinDist; // 0x0878
    float m_fadeMaxDist; // 0x087C
    float m_flFadeScale; // 0x0880
    float m_flModelWidthScale; // 0x08E4
    float m_flModelScale; // 0x08E4
    uintptr_t m_flPoseParameter[24]; // 0x08E8
    uintptr_t m_flEncodedController[4]; // 0x0A30
    uint32_t m_bClientSideAnimation; // 0x0AA0
    uint32_t m_nNewSequenceParity; // 0x0AA4
    uint32_t m_nResetEventsParity; // 0x0AA8
    uint32_t m_nSequence; // 0x0AD0
    float m_flCycle; // 0x0AD8
    uint32_t m_hLightingOrigin; // 0x0BA0
    uint32_t m_hLightingOriginRelative; // 0x0BA4
    uint32_t m_nMuzzleFlashParity; // 0x0BA8
    uint32_t m_hOwner; // 0x0BE0
    uint32_t m_nViewModelIndex; // 0x0BE4
    float m_flNextPrimaryAttack; // 0x0BE8
    float m_flNextSecondaryAttack; // 0x0BEC
    float m_flTimeWeaponIdle; // 0x0BF0
    uint32_t m_iViewModelIndex; // 0x0BF8
    uint32_t m_iWorldModelIndex; // 0x0BFC
    uint32_t m_iState; // 0x0C1C
    uint32_t m_iPrimaryAmmoType; // 0x0C28
    uint32_t m_iSecondaryAmmoType; // 0x0C2C
    uint32_t m_iClip1; // 0x0C30
    uint32_t m_iClip2; // 0x0C34
    uint32_t m_bFlipViewModel; // 0x0C60
    uint32_t m_nCustomViewmodelModelIndex; // 0x0C84
    uint32_t m_weaponMode; // 0x0CAC
    float m_fAccuracyPenalty; // 0x0CB0
};

class CWeaponAug // parent CBaseEntity {
public:
    uint32_t movecollide; // 0x0000
    uint32_t movetype; // 0x0000
    uint32_t m_nRenderFX; // 0x008C
    uint32_t m_clrRender; // 0x0090
    uint32_t m_flAnimTime; // 0x00A0
    uint32_t m_flSimulationTime; // 0x00A8
    uint32_t m_ubInterpolationFrame; // 0x00B4
    uint32_t m_fEffects; // 0x00B8
    uint32_t m_nRenderMode; // 0x00BC
    uint32_t m_nNextThinkTick; // 0x00C4
    uint32_t m_nModelIndex; // 0x00CC
    uint32_t m_iTeamNum; // 0x00D8
    uint32_t m_PredictableID; // 0x00DC
    uint32_t m_iParentAttachment; // 0x01F6
    uint32_t moveparent; // 0x020C
    fVector3 m_vecMinsPreScaled; // 0x0230
    fVector3 m_vecMaxsPreScaled; // 0x023C
    fVector3 m_vecMins; // 0x0248
    fVector3 m_vecMaxs; // 0x0254
    uint32_t m_usSolidFlags; // 0x0264
    uint32_t m_nSurroundType; // 0x0268
    uint32_t m_nSolidType; // 0x0269
    uint32_t m_triggerBloat; // 0x026A
    uint32_t m_bUniformTriggerBloat; // 0x026B
    fVector3 m_vecSpecifiedSurroundingMinsPreScaled; // 0x026C
    fVector3 m_vecSpecifiedSurroundingMaxsPreScaled; // 0x0278
    fVector3 m_vecSpecifiedSurroundingMins; // 0x0284
    fVector3 m_vecSpecifiedSurroundingMaxs; // 0x0290
    float m_flElasticity; // 0x02F0
    float m_flShadowCastDistance; // 0x02F4
    fVector3 m_vecOrigin; // 0x0428
    fVector3 m_angRotation; // 0x0434
    uint32_t m_CollisionGroup; // 0x0444
    uint32_t m_bIsPlayerSimulated; // 0x0724
    uint32_t m_bSimulatedEveryTick; // 0x0725
    uint32_t m_bAnimatedEveryTick; // 0x0726
    uint32_t m_bAlternateSorting; // 0x0727
    uint32_t m_iTextureFrameIndex; // 0x0728
    uint32_t m_hOwnerEntity; // 0x0734
    uint32_t m_hEffectEntity; // 0x0738
    uint32_t m_nSkin; // 0x0798
    uint32_t m_nBody; // 0x079C
    uint32_t m_nHitboxSet; // 0x07A0
    float m_flPlaybackRate; // 0x07D4
    fVector3 m_vecForce; // 0x07E8
    uint32_t m_nForceBone; // 0x07F4
    uint32_t m_bClientSideFrameReset; // 0x0834
    float m_fadeMinDist; // 0x0878
    float m_fadeMaxDist; // 0x087C
    float m_flFadeScale; // 0x0880
    float m_flModelWidthScale; // 0x08E4
    float m_flModelScale; // 0x08E4
    uintptr_t m_flPoseParameter[24]; // 0x08E8
    uintptr_t m_flEncodedController[4]; // 0x0A30
    uint32_t m_bClientSideAnimation; // 0x0AA0
    uint32_t m_nNewSequenceParity; // 0x0AA4
    uint32_t m_nResetEventsParity; // 0x0AA8
    uint32_t m_nSequence; // 0x0AD0
    float m_flCycle; // 0x0AD8
    uint32_t m_hLightingOrigin; // 0x0BA0
    uint32_t m_hLightingOriginRelative; // 0x0BA4
    uint32_t m_nMuzzleFlashParity; // 0x0BA8
    uint32_t m_hOwner; // 0x0BE0
    uint32_t m_nViewModelIndex; // 0x0BE4
    float m_flNextPrimaryAttack; // 0x0BE8
    float m_flNextSecondaryAttack; // 0x0BEC
    float m_flTimeWeaponIdle; // 0x0BF0
    uint32_t m_iViewModelIndex; // 0x0BF8
    uint32_t m_iWorldModelIndex; // 0x0BFC
    uint32_t m_iState; // 0x0C1C
    uint32_t m_iPrimaryAmmoType; // 0x0C28
    uint32_t m_iSecondaryAmmoType; // 0x0C2C
    uint32_t m_iClip1; // 0x0C30
    uint32_t m_iClip2; // 0x0C34
    uint32_t m_bFlipViewModel; // 0x0C60
    uint32_t m_nCustomViewmodelModelIndex; // 0x0C84
    uint32_t m_weaponMode; // 0x0CAC
    float m_fAccuracyPenalty; // 0x0CB0
};

class CFuncAreaPortalWindow // parent CBaseEntity {
public:
    uint32_t movetype; // 0x0000
    uint32_t movecollide; // 0x0000
    uint32_t m_nRenderFX; // 0x008C
    uint32_t m_clrRender; // 0x0090
    uint32_t m_flAnimTime; // 0x00A0
    uint32_t m_flSimulationTime; // 0x00A8
    uint32_t m_ubInterpolationFrame; // 0x00B4
    uint32_t m_fEffects; // 0x00B8
    uint32_t m_nRenderMode; // 0x00BC
    uint32_t m_nModelIndex; // 0x00CC
    uint32_t m_iTeamNum; // 0x00D8
    uint32_t m_PredictableID; // 0x00DC
    uint32_t m_iParentAttachment; // 0x01F6
    uint32_t moveparent; // 0x020C
    fVector3 m_vecMinsPreScaled; // 0x0230
    fVector3 m_vecMaxsPreScaled; // 0x023C
    fVector3 m_vecMins; // 0x0248
    fVector3 m_vecMaxs; // 0x0254
    uint32_t m_usSolidFlags; // 0x0264
    uint32_t m_nSurroundType; // 0x0268
    uint32_t m_nSolidType; // 0x0269
    uint32_t m_triggerBloat; // 0x026A
    uint32_t m_bUniformTriggerBloat; // 0x026B
    fVector3 m_vecSpecifiedSurroundingMinsPreScaled; // 0x026C
    fVector3 m_vecSpecifiedSurroundingMaxsPreScaled; // 0x0278
    fVector3 m_vecSpecifiedSurroundingMins; // 0x0284
    fVector3 m_vecSpecifiedSurroundingMaxs; // 0x0290
    float m_flElasticity; // 0x02F0
    float m_flShadowCastDistance; // 0x02F4
    fVector3 m_vecOrigin; // 0x0428
    fVector3 m_angRotation; // 0x0434
    uint32_t m_CollisionGroup; // 0x0444
    uint32_t m_bIsPlayerSimulated; // 0x0724
    uint32_t m_bSimulatedEveryTick; // 0x0725
    uint32_t m_bAnimatedEveryTick; // 0x0726
    uint32_t m_bAlternateSorting; // 0x0727
    uint32_t m_iTextureFrameIndex; // 0x0728
    uint32_t m_hOwnerEntity; // 0x0734
    uint32_t m_hEffectEntity; // 0x0738
    float m_flFadeStartDist; // 0x0788
    float m_flFadeDist; // 0x078C
    float m_flTranslucencyLimit; // 0x0790
    uint32_t m_iBackgroundModelIndex; // 0x0794
};

class CAK47 // parent CBaseEntity {
public:
    uint32_t movecollide; // 0x0000
    uint32_t movetype; // 0x0000
    uint32_t m_nRenderFX; // 0x008C
    uint32_t m_clrRender; // 0x0090
    uint32_t m_flAnimTime; // 0x00A0
    uint32_t m_flSimulationTime; // 0x00A8
    uint32_t m_ubInterpolationFrame; // 0x00B4
    uint32_t m_fEffects; // 0x00B8
    uint32_t m_nRenderMode; // 0x00BC
    uint32_t m_nNextThinkTick; // 0x00C4
    uint32_t m_nModelIndex; // 0x00CC
    uint32_t m_iTeamNum; // 0x00D8
    uint32_t m_PredictableID; // 0x00DC
    uint32_t m_iParentAttachment; // 0x01F6
    uint32_t moveparent; // 0x020C
    fVector3 m_vecMinsPreScaled; // 0x0230
    fVector3 m_vecMaxsPreScaled; // 0x023C
    fVector3 m_vecMins; // 0x0248
    fVector3 m_vecMaxs; // 0x0254
    uint32_t m_usSolidFlags; // 0x0264
    uint32_t m_nSurroundType; // 0x0268
    uint32_t m_nSolidType; // 0x0269
    uint32_t m_triggerBloat; // 0x026A
    uint32_t m_bUniformTriggerBloat; // 0x026B
    fVector3 m_vecSpecifiedSurroundingMinsPreScaled; // 0x026C
    fVector3 m_vecSpecifiedSurroundingMaxsPreScaled; // 0x0278
    fVector3 m_vecSpecifiedSurroundingMins; // 0x0284
    fVector3 m_vecSpecifiedSurroundingMaxs; // 0x0290
    float m_flElasticity; // 0x02F0
    float m_flShadowCastDistance; // 0x02F4
    fVector3 m_vecOrigin; // 0x0428
    fVector3 m_angRotation; // 0x0434
    uint32_t m_CollisionGroup; // 0x0444
    uint32_t m_bIsPlayerSimulated; // 0x0724
    uint32_t m_bSimulatedEveryTick; // 0x0725
    uint32_t m_bAnimatedEveryTick; // 0x0726
    uint32_t m_bAlternateSorting; // 0x0727
    uint32_t m_iTextureFrameIndex; // 0x0728
    uint32_t m_hOwnerEntity; // 0x0734
    uint32_t m_hEffectEntity; // 0x0738
    uint32_t m_nSkin; // 0x0798
    uint32_t m_nBody; // 0x079C
    uint32_t m_nHitboxSet; // 0x07A0
    float m_flPlaybackRate; // 0x07D4
    fVector3 m_vecForce; // 0x07E8
    uint32_t m_nForceBone; // 0x07F4
    uint32_t m_bClientSideFrameReset; // 0x0834
    float m_fadeMinDist; // 0x0878
    float m_fadeMaxDist; // 0x087C
    float m_flFadeScale; // 0x0880
    float m_flModelWidthScale; // 0x08E4
    float m_flModelScale; // 0x08E4
    uintptr_t m_flPoseParameter[24]; // 0x08E8
    uintptr_t m_flEncodedController[4]; // 0x0A30
    uint32_t m_bClientSideAnimation; // 0x0AA0
    uint32_t m_nNewSequenceParity; // 0x0AA4
    uint32_t m_nResetEventsParity; // 0x0AA8
    uint32_t m_nSequence; // 0x0AD0
    float m_flCycle; // 0x0AD8
    uint32_t m_hLightingOrigin; // 0x0BA0
    uint32_t m_hLightingOriginRelative; // 0x0BA4
    uint32_t m_nMuzzleFlashParity; // 0x0BA8
    uint32_t m_hOwner; // 0x0BE0
    uint32_t m_nViewModelIndex; // 0x0BE4
    float m_flNextPrimaryAttack; // 0x0BE8
    float m_flNextSecondaryAttack; // 0x0BEC
    float m_flTimeWeaponIdle; // 0x0BF0
    uint32_t m_iViewModelIndex; // 0x0BF8
    uint32_t m_iWorldModelIndex; // 0x0BFC
    uint32_t m_iState; // 0x0C1C
    uint32_t m_iPrimaryAmmoType; // 0x0C28
    uint32_t m_iSecondaryAmmoType; // 0x0C2C
    uint32_t m_iClip1; // 0x0C30
    uint32_t m_iClip2; // 0x0C34
    uint32_t m_bFlipViewModel; // 0x0C60
    uint32_t m_nCustomViewmodelModelIndex; // 0x0C84
    uint32_t m_weaponMode; // 0x0CAC
    float m_fAccuracyPenalty; // 0x0CB0
};

class CFuncTrackTrain // parent CBaseEntity {
public:
    uint32_t movecollide; // 0x0000
    uint32_t movetype; // 0x0000
    uint32_t m_nRenderFX; // 0x008C
    uint32_t m_clrRender; // 0x0090
    uint32_t m_flAnimTime; // 0x00A0
    uint32_t m_flSimulationTime; // 0x00A8
    uint32_t m_ubInterpolationFrame; // 0x00B4
    uint32_t m_fEffects; // 0x00B8
    uint32_t m_nRenderMode; // 0x00BC
    uint32_t m_nModelIndex; // 0x00CC
    uint32_t m_iTeamNum; // 0x00D8
    uint32_t m_PredictableID; // 0x00DC
    uint32_t m_iParentAttachment; // 0x01F6
    uint32_t moveparent; // 0x020C
    fVector3 m_vecMinsPreScaled; // 0x0230
    fVector3 m_vecMaxsPreScaled; // 0x023C
    fVector3 m_vecMins; // 0x0248
    fVector3 m_vecMaxs; // 0x0254
    uint32_t m_usSolidFlags; // 0x0264
    uint32_t m_nSurroundType; // 0x0268
    uint32_t m_nSolidType; // 0x0269
    uint32_t m_triggerBloat; // 0x026A
    uint32_t m_bUniformTriggerBloat; // 0x026B
    fVector3 m_vecSpecifiedSurroundingMinsPreScaled; // 0x026C
    fVector3 m_vecSpecifiedSurroundingMaxsPreScaled; // 0x0278
    fVector3 m_vecSpecifiedSurroundingMins; // 0x0284
    fVector3 m_vecSpecifiedSurroundingMaxs; // 0x0290
    float m_flElasticity; // 0x02F0
    float m_flShadowCastDistance; // 0x02F4
    fVector3 m_vecOrigin; // 0x0428
    fVector3 m_angRotation; // 0x0434
    uint32_t m_CollisionGroup; // 0x0444
    uint32_t m_bIsPlayerSimulated; // 0x0724
    uint32_t m_bSimulatedEveryTick; // 0x0725
    uint32_t m_bAnimatedEveryTick; // 0x0726
    uint32_t m_bAlternateSorting; // 0x0727
    uint32_t m_iTextureFrameIndex; // 0x0728
    uint32_t m_hOwnerEntity; // 0x0734
    uint32_t m_hEffectEntity; // 0x0738
};

class CCSGameRulesProxy // parent CGameRulesProxy {
public:
    uint32_t m_bFreezePeriod; // 0x0058
    uint32_t m_iRoundTime; // 0x005C
    float m_fRoundStartTime; // 0x0060
    float m_flGameStartTime; // 0x0064
    uint32_t m_iHostagesRemaining; // 0x0068
    uint32_t m_bMapHasBombTarget; // 0x006C
    uint32_t m_bMapHasRescueZone; // 0x006D
    uint32_t m_bLogoMap; // 0x006E
    uint32_t m_bBlackMarket; // 0x006F
    uint32_t m_bWinterHolidayActive; // 0x0070
};

class CWeaponCubemap // parent CBaseEntity {
public:
    uint32_t movecollide; // 0x0000
    uint32_t movetype; // 0x0000
    uint32_t m_nRenderFX; // 0x008C
    uint32_t m_clrRender; // 0x0090
    uint32_t m_flAnimTime; // 0x00A0
    uint32_t m_flSimulationTime; // 0x00A8
    uint32_t m_ubInterpolationFrame; // 0x00B4
    uint32_t m_fEffects; // 0x00B8
    uint32_t m_nRenderMode; // 0x00BC
    uint32_t m_nNextThinkTick; // 0x00C4
    uint32_t m_nModelIndex; // 0x00CC
    uint32_t m_iTeamNum; // 0x00D8
    uint32_t m_PredictableID; // 0x00DC
    uint32_t m_iParentAttachment; // 0x01F6
    uint32_t moveparent; // 0x020C
    fVector3 m_vecMinsPreScaled; // 0x0230
    fVector3 m_vecMaxsPreScaled; // 0x023C
    fVector3 m_vecMins; // 0x0248
    fVector3 m_vecMaxs; // 0x0254
    uint32_t m_usSolidFlags; // 0x0264
    uint32_t m_nSurroundType; // 0x0268
    uint32_t m_nSolidType; // 0x0269
    uint32_t m_triggerBloat; // 0x026A
    uint32_t m_bUniformTriggerBloat; // 0x026B
    fVector3 m_vecSpecifiedSurroundingMinsPreScaled; // 0x026C
    fVector3 m_vecSpecifiedSurroundingMaxsPreScaled; // 0x0278
    fVector3 m_vecSpecifiedSurroundingMins; // 0x0284
    fVector3 m_vecSpecifiedSurroundingMaxs; // 0x0290
    float m_flElasticity; // 0x02F0
    float m_flShadowCastDistance; // 0x02F4
    fVector3 m_vecOrigin; // 0x0428
    fVector3 m_angRotation; // 0x0434
    uint32_t m_CollisionGroup; // 0x0444
    uint32_t m_bIsPlayerSimulated; // 0x0724
    uint32_t m_bSimulatedEveryTick; // 0x0725
    uint32_t m_bAnimatedEveryTick; // 0x0726
    uint32_t m_bAlternateSorting; // 0x0727
    uint32_t m_iTextureFrameIndex; // 0x0728
    uint32_t m_hOwnerEntity; // 0x0734
    uint32_t m_hEffectEntity; // 0x0738
    uint32_t m_nSkin; // 0x0798
    uint32_t m_nBody; // 0x079C
    uint32_t m_nHitboxSet; // 0x07A0
    float m_flPlaybackRate; // 0x07D4
    fVector3 m_vecForce; // 0x07E8
    uint32_t m_nForceBone; // 0x07F4
    uint32_t m_bClientSideFrameReset; // 0x0834
    float m_fadeMinDist; // 0x0878
    float m_fadeMaxDist; // 0x087C
    float m_flFadeScale; // 0x0880
    float m_flModelWidthScale; // 0x08E4
    float m_flModelScale; // 0x08E4
    uintptr_t m_flPoseParameter[24]; // 0x08E8
    uintptr_t m_flEncodedController[4]; // 0x0A30
    uint32_t m_bClientSideAnimation; // 0x0AA0
    uint32_t m_nNewSequenceParity; // 0x0AA4
    uint32_t m_nResetEventsParity; // 0x0AA8
    uint32_t m_nSequence; // 0x0AD0
    float m_flCycle; // 0x0AD8
    uint32_t m_hLightingOrigin; // 0x0BA0
    uint32_t m_hLightingOriginRelative; // 0x0BA4
    uint32_t m_nMuzzleFlashParity; // 0x0BA8
    uint32_t m_hOwner; // 0x0BE0
    uint32_t m_nViewModelIndex; // 0x0BE4
    float m_flNextPrimaryAttack; // 0x0BE8
    float m_flNextSecondaryAttack; // 0x0BEC
    float m_flTimeWeaponIdle; // 0x0BF0
    uint32_t m_iViewModelIndex; // 0x0BF8
    uint32_t m_iWorldModelIndex; // 0x0BFC
    uint32_t m_iState; // 0x0C1C
    uint32_t m_iPrimaryAmmoType; // 0x0C28
    uint32_t m_iSecondaryAmmoType; // 0x0C2C
    uint32_t m_iClip1; // 0x0C30
    uint32_t m_iClip2; // 0x0C34
    uint32_t m_bFlipViewModel; // 0x0C60
    uint32_t m_nCustomViewmodelModelIndex; // 0x0C84
};

class CWeaponCycler // parent CBaseEntity {
public:
    uint32_t movecollide; // 0x0000
    uint32_t movetype; // 0x0000
    uint32_t m_nRenderFX; // 0x008C
    uint32_t m_clrRender; // 0x0090
    uint32_t m_flAnimTime; // 0x00A0
    uint32_t m_flSimulationTime; // 0x00A8
    uint32_t m_ubInterpolationFrame; // 0x00B4
    uint32_t m_fEffects; // 0x00B8
    uint32_t m_nRenderMode; // 0x00BC
    uint32_t m_nNextThinkTick; // 0x00C4
    uint32_t m_nModelIndex; // 0x00CC
    uint32_t m_iTeamNum; // 0x00D8
    uint32_t m_PredictableID; // 0x00DC
    uint32_t m_iParentAttachment; // 0x01F6
    uint32_t moveparent; // 0x020C
    fVector3 m_vecMinsPreScaled; // 0x0230
    fVector3 m_vecMaxsPreScaled; // 0x023C
    fVector3 m_vecMins; // 0x0248
    fVector3 m_vecMaxs; // 0x0254
    uint32_t m_usSolidFlags; // 0x0264
    uint32_t m_nSurroundType; // 0x0268
    uint32_t m_nSolidType; // 0x0269
    uint32_t m_triggerBloat; // 0x026A
    uint32_t m_bUniformTriggerBloat; // 0x026B
    fVector3 m_vecSpecifiedSurroundingMinsPreScaled; // 0x026C
    fVector3 m_vecSpecifiedSurroundingMaxsPreScaled; // 0x0278
    fVector3 m_vecSpecifiedSurroundingMins; // 0x0284
    fVector3 m_vecSpecifiedSurroundingMaxs; // 0x0290
    float m_flElasticity; // 0x02F0
    float m_flShadowCastDistance; // 0x02F4
    fVector3 m_vecOrigin; // 0x0428
    fVector3 m_angRotation; // 0x0434
    uint32_t m_CollisionGroup; // 0x0444
    uint32_t m_bIsPlayerSimulated; // 0x0724
    uint32_t m_bSimulatedEveryTick; // 0x0725
    uint32_t m_bAnimatedEveryTick; // 0x0726
    uint32_t m_bAlternateSorting; // 0x0727
    uint32_t m_iTextureFrameIndex; // 0x0728
    uint32_t m_hOwnerEntity; // 0x0734
    uint32_t m_hEffectEntity; // 0x0738
    uint32_t m_nSkin; // 0x0798
    uint32_t m_nBody; // 0x079C
    uint32_t m_nHitboxSet; // 0x07A0
    float m_flPlaybackRate; // 0x07D4
    fVector3 m_vecForce; // 0x07E8
    uint32_t m_nForceBone; // 0x07F4
    uint32_t m_bClientSideFrameReset; // 0x0834
    float m_fadeMinDist; // 0x0878
    float m_fadeMaxDist; // 0x087C
    float m_flFadeScale; // 0x0880
    float m_flModelWidthScale; // 0x08E4
    float m_flModelScale; // 0x08E4
    uintptr_t m_flPoseParameter[24]; // 0x08E8
    uintptr_t m_flEncodedController[4]; // 0x0A30
    uint32_t m_bClientSideAnimation; // 0x0AA0
    uint32_t m_nNewSequenceParity; // 0x0AA4
    uint32_t m_nResetEventsParity; // 0x0AA8
    uint32_t m_nSequence; // 0x0AD0
    float m_flCycle; // 0x0AD8
    uint32_t m_hLightingOrigin; // 0x0BA0
    uint32_t m_hLightingOriginRelative; // 0x0BA4
    uint32_t m_nMuzzleFlashParity; // 0x0BA8
    uint32_t m_hOwner; // 0x0BE0
    uint32_t m_nViewModelIndex; // 0x0BE4
    float m_flNextPrimaryAttack; // 0x0BE8
    float m_flNextSecondaryAttack; // 0x0BEC
    float m_flTimeWeaponIdle; // 0x0BF0
    uint32_t m_iViewModelIndex; // 0x0BF8
    uint32_t m_iWorldModelIndex; // 0x0BFC
    uint32_t m_iState; // 0x0C1C
    uint32_t m_iPrimaryAmmoType; // 0x0C28
    uint32_t m_iSecondaryAmmoType; // 0x0C2C
    uint32_t m_iClip1; // 0x0C30
    uint32_t m_iClip2; // 0x0C34
    uint32_t m_bFlipViewModel; // 0x0C60
    uint32_t m_nCustomViewmodelModelIndex; // 0x0C84
};

class CTEPlantBomb {
public:
    uint32_t m_iPlayer; // 0x0020
    fVector3 m_vecOrigin; // 0x0024
    uint32_t m_option; // 0x0030
};

class CTEFireBullets {
public:
    uint32_t m_iPlayer; // 0x0020
    fVector3 m_vecOrigin; // 0x0024
    float m_vecAngles[0]; // 0x0030
    float m_vecAngles[1]; // 0x0034
    uint32_t m_iWeaponID; // 0x003C
    uint32_t m_iMode; // 0x0040
    uint32_t m_iSeed; // 0x0044
    float m_fInaccuracy; // 0x0048
    float m_fSpread; // 0x004C
};

class CBaseAnimating // parent CBaseEntity {
public:
    uint32_t movetype; // 0x0000
    uint32_t movecollide; // 0x0000
    uint32_t m_nRenderFX; // 0x008C
    uint32_t m_clrRender; // 0x0090
    uint32_t m_flAnimTime; // 0x00A0
    uint32_t m_flSimulationTime; // 0x00A8
    uint32_t m_ubInterpolationFrame; // 0x00B4
    uint32_t m_fEffects; // 0x00B8
    uint32_t m_nRenderMode; // 0x00BC
    uint32_t m_nModelIndex; // 0x00CC
    uint32_t m_iTeamNum; // 0x00D8
    uint32_t m_PredictableID; // 0x00DC
    uint32_t m_iParentAttachment; // 0x01F6
    uint32_t moveparent; // 0x020C
    fVector3 m_vecMinsPreScaled; // 0x0230
    fVector3 m_vecMaxsPreScaled; // 0x023C
    fVector3 m_vecMins; // 0x0248
    fVector3 m_vecMaxs; // 0x0254
    uint32_t m_usSolidFlags; // 0x0264
    uint32_t m_nSurroundType; // 0x0268
    uint32_t m_nSolidType; // 0x0269
    uint32_t m_triggerBloat; // 0x026A
    uint32_t m_bUniformTriggerBloat; // 0x026B
    fVector3 m_vecSpecifiedSurroundingMinsPreScaled; // 0x026C
    fVector3 m_vecSpecifiedSurroundingMaxsPreScaled; // 0x0278
    fVector3 m_vecSpecifiedSurroundingMins; // 0x0284
    fVector3 m_vecSpecifiedSurroundingMaxs; // 0x0290
    float m_flElasticity; // 0x02F0
    float m_flShadowCastDistance; // 0x02F4
    fVector3 m_vecOrigin; // 0x0428
    fVector3 m_angRotation; // 0x0434
    uint32_t m_CollisionGroup; // 0x0444
    uint32_t m_bIsPlayerSimulated; // 0x0724
    uint32_t m_bSimulatedEveryTick; // 0x0725
    uint32_t m_bAnimatedEveryTick; // 0x0726
    uint32_t m_bAlternateSorting; // 0x0727
    uint32_t m_iTextureFrameIndex; // 0x0728
    uint32_t m_hOwnerEntity; // 0x0734
    uint32_t m_hEffectEntity; // 0x0738
    uint32_t m_nSkin; // 0x0798
    uint32_t m_nBody; // 0x079C
    uint32_t m_nHitboxSet; // 0x07A0
    float m_flPlaybackRate; // 0x07D4
    fVector3 m_vecForce; // 0x07E8
    uint32_t m_nForceBone; // 0x07F4
    uint32_t m_bClientSideFrameReset; // 0x0834
    float m_fadeMinDist; // 0x0878
    float m_fadeMaxDist; // 0x087C
    float m_flFadeScale; // 0x0880
    float m_flModelScale; // 0x08E4
    float m_flModelWidthScale; // 0x08E4
    uintptr_t m_flPoseParameter[24]; // 0x08E8
    uintptr_t m_flEncodedController[4]; // 0x0A30
    uint32_t m_bClientSideAnimation; // 0x0AA0
    uint32_t m_nNewSequenceParity; // 0x0AA4
    uint32_t m_nResetEventsParity; // 0x0AA8
    uint32_t m_nSequence; // 0x0AD0
    float m_flCycle; // 0x0AD8
    uint32_t m_hLightingOrigin; // 0x0BA0
    uint32_t m_hLightingOriginRelative; // 0x0BA4
    uint32_t m_nMuzzleFlashParity; // 0x0BA8
};

class CTERadioIcon // parent CBaseTempEntity {
public:
    uint32_t m_iAttachToClient; // 0x0020
};

class CSceneEntity // parent CBaseEntity {
public:
    uint32_t 008; // 0x0000
    uint32_t 002; // 0x0000
    uint32_t lengthprop16; // 0x0000
    uint32_t 013; // 0x0000
    uint32_t 011; // 0x0000
    uint32_t movecollide; // 0x0000
    uint32_t 014; // 0x0000
    uint32_t 000; // 0x0000
    uint32_t 015; // 0x0000
    uint32_t 012; // 0x0000
    uint32_t 005; // 0x0000
    uint32_t 010; // 0x0000
    uint32_t 009; // 0x0000
    uint32_t 007; // 0x0000
    uint32_t 006; // 0x0000
    uint32_t 004; // 0x0000
    uint32_t 003; // 0x0000
    uint32_t 001; // 0x0000
    uint32_t movetype; // 0x0000
    uint32_t m_nRenderFX; // 0x008C
    uint32_t m_clrRender; // 0x0090
    uint32_t m_flAnimTime; // 0x00A0
    uint32_t m_flSimulationTime; // 0x00A8
    uint32_t m_ubInterpolationFrame; // 0x00B4
    uint32_t m_fEffects; // 0x00B8
    uint32_t m_nRenderMode; // 0x00BC
    uint32_t m_nModelIndex; // 0x00CC
    uint32_t m_iTeamNum; // 0x00D8
    uint32_t m_PredictableID; // 0x00DC
    uint32_t m_iParentAttachment; // 0x01F6
    uint32_t moveparent; // 0x020C
    fVector3 m_vecMinsPreScaled; // 0x0230
    fVector3 m_vecMaxsPreScaled; // 0x023C
    fVector3 m_vecMins; // 0x0248
    fVector3 m_vecMaxs; // 0x0254
    uint32_t m_usSolidFlags; // 0x0264
    uint32_t m_nSurroundType; // 0x0268
    uint32_t m_nSolidType; // 0x0269
    uint32_t m_triggerBloat; // 0x026A
    uint32_t m_bUniformTriggerBloat; // 0x026B
    fVector3 m_vecSpecifiedSurroundingMinsPreScaled; // 0x026C
    fVector3 m_vecSpecifiedSurroundingMaxsPreScaled; // 0x0278
    fVector3 m_vecSpecifiedSurroundingMins; // 0x0284
    fVector3 m_vecSpecifiedSurroundingMaxs; // 0x0290
    float m_flElasticity; // 0x02F0
    float m_flShadowCastDistance; // 0x02F4
    fVector3 m_vecOrigin; // 0x0428
    fVector3 m_angRotation; // 0x0434
    uint32_t m_CollisionGroup; // 0x0444
    uint32_t m_bIsPlayerSimulated; // 0x0724
    uint32_t m_bSimulatedEveryTick; // 0x0725
    uint32_t m_bAnimatedEveryTick; // 0x0726
    uint32_t m_bAlternateSorting; // 0x0727
    uint32_t m_iTextureFrameIndex; // 0x0728
    uint32_t m_hOwnerEntity; // 0x0734
    uint32_t m_hEffectEntity; // 0x0738
    uint32_t m_bIsPlayingBack; // 0x0790
    uint32_t m_bPaused; // 0x0791
    uint32_t m_bMultiplayer; // 0x0792
    float m_flForceClientTime; // 0x0798
    uint32_t m_nSceneStringIndex; // 0x079C
};

class CPlantedC4 // parent CBaseEntity {
public:
    uint32_t movetype; // 0x0000
    uint32_t movecollide; // 0x0000
    uint32_t m_nRenderFX; // 0x008C
    uint32_t m_clrRender; // 0x0090
    uint32_t m_flAnimTime; // 0x00A0
    uint32_t m_flSimulationTime; // 0x00A8
    uint32_t m_ubInterpolationFrame; // 0x00B4
    uint32_t m_fEffects; // 0x00B8
    uint32_t m_nRenderMode; // 0x00BC
    uint32_t m_nModelIndex; // 0x00CC
    uint32_t m_iTeamNum; // 0x00D8
    uint32_t m_PredictableID; // 0x00DC
    uint32_t m_iParentAttachment; // 0x01F6
    uint32_t moveparent; // 0x020C
    fVector3 m_vecMinsPreScaled; // 0x0230
    fVector3 m_vecMaxsPreScaled; // 0x023C
    fVector3 m_vecMins; // 0x0248
    fVector3 m_vecMaxs; // 0x0254
    uint32_t m_usSolidFlags; // 0x0264
    uint32_t m_nSurroundType; // 0x0268
    uint32_t m_nSolidType; // 0x0269
    uint32_t m_triggerBloat; // 0x026A
    uint32_t m_bUniformTriggerBloat; // 0x026B
    fVector3 m_vecSpecifiedSurroundingMinsPreScaled; // 0x026C
    fVector3 m_vecSpecifiedSurroundingMaxsPreScaled; // 0x0278
    fVector3 m_vecSpecifiedSurroundingMins; // 0x0284
    fVector3 m_vecSpecifiedSurroundingMaxs; // 0x0290
    float m_flElasticity; // 0x02F0
    float m_flShadowCastDistance; // 0x02F4
    fVector3 m_vecOrigin; // 0x0428
    fVector3 m_angRotation; // 0x0434
    uint32_t m_CollisionGroup; // 0x0444
    uint32_t m_bIsPlayerSimulated; // 0x0724
    uint32_t m_bSimulatedEveryTick; // 0x0725
    uint32_t m_bAnimatedEveryTick; // 0x0726
    uint32_t m_bAlternateSorting; // 0x0727
    uint32_t m_iTextureFrameIndex; // 0x0728
    uint32_t m_hOwnerEntity; // 0x0734
    uint32_t m_hEffectEntity; // 0x0738
    uint32_t m_nSkin; // 0x0798
    uint32_t m_nBody; // 0x079C
    uint32_t m_nHitboxSet; // 0x07A0
    float m_flPlaybackRate; // 0x07D4
    fVector3 m_vecForce; // 0x07E8
    uint32_t m_nForceBone; // 0x07F4
    uint32_t m_bClientSideFrameReset; // 0x0834
    float m_fadeMinDist; // 0x0878
    float m_fadeMaxDist; // 0x087C
    float m_flFadeScale; // 0x0880
    float m_flModelScale; // 0x08E4
    float m_flModelWidthScale; // 0x08E4
    uintptr_t m_flPoseParameter[24]; // 0x08E8
    uintptr_t m_flEncodedController[4]; // 0x0A30
    uint32_t m_bClientSideAnimation; // 0x0AA0
    uint32_t m_nNewSequenceParity; // 0x0AA4
    uint32_t m_nResetEventsParity; // 0x0AA8
    uint32_t m_nSequence; // 0x0AD0
    float m_flCycle; // 0x0AD8
    uint32_t m_hLightingOrigin; // 0x0BA0
    uint32_t m_hLightingOriginRelative; // 0x0BA4
    uint32_t m_nMuzzleFlashParity; // 0x0BA8
    uint32_t m_bBombTicking; // 0x0BE0
    float m_flC4Blow; // 0x0BEC
    float m_flTimerLength; // 0x0BF0
    float m_flDefuseLength; // 0x0BF4
    float m_flDefuseCountDown; // 0x0BF8
};

class CCSTeam // parent CTeam {
public:
    void* "player_array"; // 0x0000
    const char* m_szTeamname; // 0x07A8
    uint32_t m_iScore; // 0x07C8
    uint32_t m_iRoundsWon; // 0x07CC
    uint32_t m_iTeamNum; // 0x07DC
};

class CCSPlayerResource // parent CPlayerResource {
public:
    uintptr_t m_iPing[66]; // 0x09A0
    uintptr_t m_iScore[66]; // 0x0AA8
    uintptr_t m_iDeaths[66]; // 0x0BB0
    uintptr_t m_bConnected[66]; // 0x0CB8
    uintptr_t m_iTeam[66]; // 0x0CFC
    uintptr_t m_bAlive[66]; // 0x0E04
    uintptr_t m_iHealth[66]; // 0x0E48
    uintptr_t m_iAccountID[66]; // 0x0FD0
    uintptr_t m_bValid[66]; // 0x10D8
    uintptr_t m_iUserID[66]; // 0x111C
    uint32_t m_iPlayerC4; // 0x1230
    uint32_t m_iPlayerVIP; // 0x1234
    fVector3 m_vecC4; // 0x1238
    fVector3 m_bombsiteCenterA; // 0x1244
    fVector3 m_bombsiteCenterB; // 0x1250
    uintptr_t m_bHostageAlive[12]; // 0x125C
    uintptr_t m_isHostageFollowingSomeone[12]; // 0x1268
    uintptr_t m_iHostageEntityIDs[12]; // 0x1274
    uintptr_t m_iHostageX[12]; // 0x12A4
    uintptr_t m_iHostageY[12]; // 0x12D4
    uintptr_t m_iHostageZ[12]; // 0x1304
    uintptr_t m_hostageRescueX[4]; // 0x1334
    uintptr_t m_hostageRescueY[4]; // 0x1344
    uintptr_t m_hostageRescueZ[4]; // 0x1354
    uint32_t m_bBombSpotted; // 0x1364
    uintptr_t m_bPlayerSpotted[66]; // 0x1365
    uintptr_t m_szClan[66]; // 0x14B0
    uintptr_t m_iMVPs[66]; // 0x18D0
    uintptr_t m_bHasDefuser[66]; // 0x19D8
};

class CCSPlayer // parent CBaseEntity {
public:
    uint32_t movetype; // 0x0000
    uint32_t lengthprop15; // 0x0000
    uint32_t m_nSequence; // 0x0000
    void* m_hViewModel; // 0x0000
    uint32_t movecollide; // 0x0000
    float m_flPrevCycle; // 0x0004
    float m_flWeight; // 0x0008
    uint32_t m_nOrder; // 0x000C
    float m_flCycle; // 0x0014
    uint32_t m_nRenderFX; // 0x008C
    uint32_t m_clrRender; // 0x0090
    uint32_t m_flAnimTime; // 0x00A0
    uint32_t m_flSimulationTime; // 0x00A8
    uint32_t m_ubInterpolationFrame; // 0x00B4
    uint32_t m_fEffects; // 0x00B8
    uint32_t m_nRenderMode; // 0x00BC
    uint32_t m_nNextThinkTick; // 0x00C4
    uint32_t m_nModelIndex; // 0x00CC
    uint32_t m_lifeState; // 0x00CF
    uint32_t m_iHealth; // 0x00D0
    uint32_t m_iTeamNum; // 0x00D8
    uint32_t m_PredictableID; // 0x00DC
    float m_vecViewOffset[0]; // 0x013C
    float m_vecViewOffset[1]; // 0x0140
    float m_vecViewOffset[2]; // 0x0144
    float m_vecVelocity[0]; // 0x0148
    float m_vecVelocity[1]; // 0x014C
    float m_vecVelocity[2]; // 0x0150
    fVector3 m_vecBaseVelocity; // 0x01D0
    uint32_t m_iParentAttachment; // 0x01F6
    uint32_t m_nWaterLevel; // 0x01F8
    uint32_t moveparent; // 0x020C
    fVector3 m_vecMinsPreScaled; // 0x0230
    fVector3 m_vecMaxsPreScaled; // 0x023C
    fVector3 m_vecMins; // 0x0248
    fVector3 m_vecMaxs; // 0x0254
    uint32_t m_usSolidFlags; // 0x0264
    uint32_t m_nSurroundType; // 0x0268
    uint32_t m_nSolidType; // 0x0269
    uint32_t m_triggerBloat; // 0x026A
    uint32_t m_bUniformTriggerBloat; // 0x026B
    fVector3 m_vecSpecifiedSurroundingMinsPreScaled; // 0x026C
    fVector3 m_vecSpecifiedSurroundingMaxsPreScaled; // 0x0278
    fVector3 m_vecSpecifiedSurroundingMins; // 0x0284
    fVector3 m_vecSpecifiedSurroundingMaxs; // 0x0290
    float m_flElasticity; // 0x02F0
    float m_flShadowCastDistance; // 0x02F4
    uint32_t m_hGroundEntity; // 0x02FC
    float m_flFriction; // 0x0304
    fVector3 m_vecOrigin; // 0x0428
    fVector3 m_angRotation; // 0x0434
    uint32_t m_fFlags; // 0x0440
    uint32_t m_CollisionGroup; // 0x0444
    uint32_t m_bIsPlayerSimulated; // 0x0724
    uint32_t m_bSimulatedEveryTick; // 0x0725
    uint32_t m_bAnimatedEveryTick; // 0x0726
    uint32_t m_bAlternateSorting; // 0x0727
    uint32_t m_iTextureFrameIndex; // 0x0728
    uint32_t m_hOwnerEntity; // 0x0734
    uint32_t m_hEffectEntity; // 0x0738
    uint32_t m_nSkin; // 0x0798
    uint32_t m_nBody; // 0x079C
    uint32_t m_nHitboxSet; // 0x07A0
    float m_flPlaybackRate; // 0x07D4
    fVector3 m_vecForce; // 0x07E8
    uint32_t m_nForceBone; // 0x07F4
    uint32_t m_bClientSideFrameReset; // 0x0834
    float m_fadeMinDist; // 0x0878
    float m_fadeMaxDist; // 0x087C
    float m_flFadeScale; // 0x0880
    float m_flModelScale; // 0x08E4
    float m_flModelWidthScale; // 0x08E4
    uintptr_t m_flPoseParameter[24]; // 0x08E8
    uintptr_t m_flEncodedController[4]; // 0x0A30
    uint32_t m_bClientSideAnimation; // 0x0AA0
    uint32_t m_nNewSequenceParity; // 0x0AA4
    uint32_t m_nResetEventsParity; // 0x0AA8
    uint32_t m_hLightingOrigin; // 0x0BA0
    uint32_t m_hLightingOriginRelative; // 0x0BA4
    uint32_t m_nMuzzleFlashParity; // 0x0BA8
    fVector3 m_viewtarget; // 0x0C68
    uintptr_t m_flexWeight[96]; // 0x0CC8
    uint32_t m_blinktoggle; // 0x0E98
    float m_flNextAttack; // 0x1058
    uintptr_t m_iAmmo[32]; // 0x1060
    uintptr_t m_hMyWeapons[48]; // 0x10E0
    uint32_t m_hActiveWeapon; // 0x11A0
    uintptr_t m_chAreaBits[32]; // 0x1210
    uintptr_t m_chAreaPortalBits[24]; // 0x1230
    uint32_t m_iHideHUD; // 0x1248
    float m_flFOVRate; // 0x124C
    uint32_t m_bDucked; // 0x1250
    uint32_t m_bDucking; // 0x1251
    uint32_t m_bInDuckJump; // 0x1252
    float m_flDucktime; // 0x1254
    float m_flDuckJumpTime; // 0x1258
    float m_flJumpTime; // 0x125C
    float m_flFallVelocity; // 0x1264
    fVector3 m_vecPunchAngle; // 0x127C
    fVector3 m_vecPunchAngleVel; // 0x12D8
    uint32_t m_bDrawViewmodel; // 0x1338
    uint32_t m_bWearingSuit; // 0x1339
    uint32_t m_bPoisoned; // 0x133A
    uint32_t m_bForceLocalPlayerDraw; // 0x133B
    float m_flStepSize; // 0x1340
    uint32_t m_bAllowAutoMovement; // 0x1344
    uint32_t m_skybox3d.scale; // 0x1350
    fVector3 m_skybox3d.origin; // 0x1354
    uint32_t m_skybox3d.area; // 0x1360
    fVector3 m_skybox3d.fog.dirPrimary; // 0x1370
    uint32_t m_skybox3d.fog.colorPrimary; // 0x137C
    uint32_t m_skybox3d.fog.colorSecondary; // 0x1380
    float m_skybox3d.fog.start; // 0x138C
    float m_skybox3d.fog.end; // 0x1390
    float m_skybox3d.fog.maxdensity; // 0x1398
    uint32_t m_skybox3d.fog.enable; // 0x13AC
    uint32_t m_skybox3d.fog.blend; // 0x13AD
    uint32_t m_skybox3d.fog.radial; // 0x13AE
    uint32_t m_PlayerFog.m_hCtrl; // 0x13B8
    fVector3 m_audio.localSound[0]; // 0x13E0
    fVector3 m_audio.localSound[1]; // 0x13EC
    fVector3 m_audio.localSound[2]; // 0x13F8
    fVector3 m_audio.localSound[3]; // 0x1404
    fVector3 m_audio.localSound[4]; // 0x1410
    fVector3 m_audio.localSound[5]; // 0x141C
    fVector3 m_audio.localSound[6]; // 0x1428
    fVector3 m_audio.localSound[7]; // 0x1434
    uint32_t m_audio.soundscapeIndex; // 0x1440
    uint32_t m_audio.localBits; // 0x1444
    uint32_t m_audio.entIndex; // 0x1448
    const char* m_szScriptOverlayMaterial; // 0x1451
    uint32_t deadflag; // 0x1560
    uint32_t m_iFOV; // 0x1570
    uint32_t m_iFOVStart; // 0x1574
    float m_flFOVTime; // 0x1578
    uint32_t m_iDefaultFOV; // 0x157C
    uint32_t m_hZoomOwner; // 0x1580
    uint32_t m_fOnTarget; // 0x1584
    uint32_t m_hConstraintEntity; // 0x15C0
    fVector3 m_vecConstraintCenter; // 0x15C4
    float m_flConstraintRadius; // 0x15D0
    float m_flConstraintWidth; // 0x15D4
    float m_flConstraintSpeedFactor; // 0x15D8
    uint32_t m_iObserverMode; // 0x15DC
    uint32_t m_hObserverTarget; // 0x15E0
    float m_flDeathTime; // 0x1600
    uint32_t m_hVehicle; // 0x160C
    uint32_t m_hUseEntity; // 0x1614
    float m_flMaxspeed; // 0x1618
    uint32_t m_iBonusProgress; // 0x161C
    uint32_t m_iBonusChallenge; // 0x1620
    uint32_t m_nTickBase; // 0x16B0
    uint32_t m_hLastWeapon; // 0x16C8
    float m_flLaggedMovementValue; // 0x1828
    const char* m_szLastPlaceName; // 0x1848
    uint32_t m_bResumeZoom; // 0x1A04
    uint32_t m_iLastZoom; // 0x1A08
    uint32_t m_iPlayerState; // 0x1A0C
    uint32_t m_bIsDefusing; // 0x1A10
    uint32_t m_bInBombZone; // 0x1A11
    uint32_t m_bInBuyZone; // 0x1A12
    uint32_t m_iThrowGrenadeCounter; // 0x1A14
    uint32_t m_iAddonBits; // 0x1A18
    uint32_t m_iPrimaryAddon; // 0x1A1C
    uint32_t m_iSecondaryAddon; // 0x1A20
    uint32_t m_iProgressBarDuration; // 0x1A24
    float m_flProgressBarStartTime; // 0x1A28
    float m_flStamina; // 0x1A2C
    uint32_t m_iDirection; // 0x1A30
    uint32_t m_iShotsFired; // 0x1A34
    uint32_t m_bNightVisionOn; // 0x1A38
    uint32_t m_bHasNightVision; // 0x1A39
    float m_flVelocityModifier; // 0x1A3C
    uint32_t m_hRagdoll; // 0x1A44
    float m_flFlashMaxAlpha; // 0x1A54
    float m_flFlashDuration; // 0x1A58
    uint32_t m_iAccount; // 0x1A98
    uint32_t m_bHasHelmet; // 0x1A9C
    uint32_t m_iClass; // 0x1AA0
    uint32_t m_ArmorValue; // 0x1AA4
    float m_angEyeAngles[0]; // 0x1AA8
    float m_angEyeAngles[1]; // 0x1AAC
    uint32_t m_bHasDefuser; // 0x1AB4
    uint32_t m_bInHostageRescueZone; // 0x1AB5
    fVector3 m_vecRagdollVelocity; // 0x1AC0
    uint32_t m_cycleLatch; // 0x1BC4
    uintptr_t m_bPlayerDominated[66]; // 0x1BCC
    uintptr_t m_bPlayerDominatingMe[66]; // 0x1C0E
};

class CCSRagdoll {
public:
    uint32_t m_nModelIndex; // 0x00CC
    uint32_t m_iTeamNum; // 0x00D8
    fVector3 m_vecOrigin; // 0x0428
    fVector3 m_vecForce; // 0x07E8
    uint32_t m_nForceBone; // 0x07F4
    uint32_t m_bClientSideAnimation; // 0x0AA0
    uint32_t m_hPlayer; // 0x0C60
    fVector3 m_vecRagdollVelocity; // 0x0C64
    fVector3 m_vecRagdollOrigin; // 0x0C70
    uint32_t m_iDeathPose; // 0x0C7C
    uint32_t m_iDeathFrame; // 0x0C80
};

class CTEPlayerAnimEvent {
public:
    uint32_t m_hPlayer; // 0x0020
    uint32_t m_iEvent; // 0x0024
    uint32_t m_nData; // 0x0028
};

class CHostage // parent CBaseEntity {
public:
    uint32_t lengthprop15; // 0x0000
    uint32_t m_nSequence; // 0x0000
    uint32_t movetype; // 0x0000
    uint32_t movecollide; // 0x0000
    float m_flPrevCycle; // 0x0004
    float m_flWeight; // 0x0008
    uint32_t m_nOrder; // 0x000C
    float m_flCycle; // 0x0014
    uint32_t m_nRenderFX; // 0x008C
    uint32_t m_clrRender; // 0x0090
    uint32_t m_flAnimTime; // 0x00A0
    uint32_t m_flSimulationTime; // 0x00A8
    uint32_t m_ubInterpolationFrame; // 0x00B4
    uint32_t m_fEffects; // 0x00B8
    uint32_t m_nRenderMode; // 0x00BC
    uint32_t m_nModelIndex; // 0x00CC
    uint32_t m_lifeState; // 0x00CF
    uint32_t m_iHealth; // 0x00D0
    uint32_t m_iTeamNum; // 0x00D8
    uint32_t m_PredictableID; // 0x00DC
    uint32_t m_iParentAttachment; // 0x01F6
    uint32_t moveparent; // 0x020C
    fVector3 m_vecMinsPreScaled; // 0x0230
    fVector3 m_vecMaxsPreScaled; // 0x023C
    fVector3 m_vecMins; // 0x0248
    fVector3 m_vecMaxs; // 0x0254
    uint32_t m_usSolidFlags; // 0x0264
    uint32_t m_nSurroundType; // 0x0268
    uint32_t m_nSolidType; // 0x0269
    uint32_t m_triggerBloat; // 0x026A
    uint32_t m_bUniformTriggerBloat; // 0x026B
    fVector3 m_vecSpecifiedSurroundingMinsPreScaled; // 0x026C
    fVector3 m_vecSpecifiedSurroundingMaxsPreScaled; // 0x0278
    fVector3 m_vecSpecifiedSurroundingMins; // 0x0284
    fVector3 m_vecSpecifiedSurroundingMaxs; // 0x0290
    float m_flElasticity; // 0x02F0
    float m_flShadowCastDistance; // 0x02F4
    fVector3 m_vecOrigin; // 0x0428
    fVector3 m_angRotation; // 0x0434
    uint32_t m_CollisionGroup; // 0x0444
    uint32_t m_bIsPlayerSimulated; // 0x0724
    uint32_t m_bSimulatedEveryTick; // 0x0725
    uint32_t m_bAnimatedEveryTick; // 0x0726
    uint32_t m_bAlternateSorting; // 0x0727
    uint32_t m_iTextureFrameIndex; // 0x0728
    uint32_t m_hOwnerEntity; // 0x0734
    uint32_t m_hEffectEntity; // 0x0738
    uint32_t m_nSkin; // 0x0798
    uint32_t m_nBody; // 0x079C
    uint32_t m_nHitboxSet; // 0x07A0
    float m_flPlaybackRate; // 0x07D4
    fVector3 m_vecForce; // 0x07E8
    uint32_t m_nForceBone; // 0x07F4
    uint32_t m_bClientSideFrameReset; // 0x0834
    float m_fadeMinDist; // 0x0878
    float m_fadeMaxDist; // 0x087C
    float m_flFadeScale; // 0x0880
    float m_flModelWidthScale; // 0x08E4
    float m_flModelScale; // 0x08E4
    uintptr_t m_flPoseParameter[24]; // 0x08E8
    uintptr_t m_flEncodedController[4]; // 0x0A30
    uint32_t m_bClientSideAnimation; // 0x0AA0
    uint32_t m_nNewSequenceParity; // 0x0AA4
    uint32_t m_nResetEventsParity; // 0x0AA8
    uint32_t m_hLightingOrigin; // 0x0BA0
    uint32_t m_hLightingOriginRelative; // 0x0BA4
    uint32_t m_nMuzzleFlashParity; // 0x0BA8
    fVector3 m_viewtarget; // 0x0C68
    uintptr_t m_flexWeight[96]; // 0x0CC8
    uint32_t m_blinktoggle; // 0x0E98
    float m_flNextAttack; // 0x1058
    uintptr_t m_hMyWeapons[48]; // 0x10E0
    uint32_t m_hActiveWeapon; // 0x11A0
    uint32_t m_iMaxHealth; // 0x11B4
    uint32_t m_leader; // 0x11C0
    uint32_t m_isRescued; // 0x11C4
};

class CHandleTest // parent CBaseEntity {
public:
    uint32_t movecollide; // 0x0000
    uint32_t movetype; // 0x0000
    uint32_t m_nRenderFX; // 0x008C
    uint32_t m_clrRender; // 0x0090
    uint32_t m_flAnimTime; // 0x00A0
    uint32_t m_flSimulationTime; // 0x00A8
    uint32_t m_ubInterpolationFrame; // 0x00B4
    uint32_t m_fEffects; // 0x00B8
    uint32_t m_nRenderMode; // 0x00BC
    uint32_t m_nModelIndex; // 0x00CC
    uint32_t m_iTeamNum; // 0x00D8
    uint32_t m_PredictableID; // 0x00DC
    uint32_t m_iParentAttachment; // 0x01F6
    uint32_t moveparent; // 0x020C
    fVector3 m_vecMinsPreScaled; // 0x0230
    fVector3 m_vecMaxsPreScaled; // 0x023C
    fVector3 m_vecMins; // 0x0248
    fVector3 m_vecMaxs; // 0x0254
    uint32_t m_usSolidFlags; // 0x0264
    uint32_t m_nSurroundType; // 0x0268
    uint32_t m_nSolidType; // 0x0269
    uint32_t m_triggerBloat; // 0x026A
    uint32_t m_bUniformTriggerBloat; // 0x026B
    fVector3 m_vecSpecifiedSurroundingMinsPreScaled; // 0x026C
    fVector3 m_vecSpecifiedSurroundingMaxsPreScaled; // 0x0278
    fVector3 m_vecSpecifiedSurroundingMins; // 0x0284
    fVector3 m_vecSpecifiedSurroundingMaxs; // 0x0290
    float m_flElasticity; // 0x02F0
    float m_flShadowCastDistance; // 0x02F4
    fVector3 m_vecOrigin; // 0x0428
    fVector3 m_angRotation; // 0x0434
    uint32_t m_CollisionGroup; // 0x0444
    uint32_t m_bIsPlayerSimulated; // 0x0724
    uint32_t m_bSimulatedEveryTick; // 0x0725
    uint32_t m_bAnimatedEveryTick; // 0x0726
    uint32_t m_bAlternateSorting; // 0x0727
    uint32_t m_iTextureFrameIndex; // 0x0728
    uint32_t m_hOwnerEntity; // 0x0734
    uint32_t m_hEffectEntity; // 0x0738
    uint32_t m_Handle; // 0x0788
    uint32_t m_bSendHandle; // 0x078C
};

class CSpriteTrail // parent CBaseEntity {
public:
    uint32_t movetype; // 0x0000
    uint32_t movecollide; // 0x0000
    uint32_t m_nRenderFX; // 0x008C
    uint32_t m_clrRender; // 0x0090
    uint32_t m_flAnimTime; // 0x00A0
    uint32_t m_flSimulationTime; // 0x00A8
    uint32_t m_ubInterpolationFrame; // 0x00B4
    uint32_t m_fEffects; // 0x00B8
    uint32_t m_nRenderMode; // 0x00BC
    uint32_t m_nModelIndex; // 0x00CC
    uint32_t m_iTeamNum; // 0x00D8
    uint32_t m_PredictableID; // 0x00DC
    uint32_t m_iParentAttachment; // 0x01F6
    uint32_t moveparent; // 0x020C
    fVector3 m_vecMinsPreScaled; // 0x0230
    fVector3 m_vecMaxsPreScaled; // 0x023C
    fVector3 m_vecMins; // 0x0248
    fVector3 m_vecMaxs; // 0x0254
    uint32_t m_usSolidFlags; // 0x0264
    uint32_t m_nSurroundType; // 0x0268
    uint32_t m_nSolidType; // 0x0269
    uint32_t m_triggerBloat; // 0x026A
    uint32_t m_bUniformTriggerBloat; // 0x026B
    fVector3 m_vecSpecifiedSurroundingMinsPreScaled; // 0x026C
    fVector3 m_vecSpecifiedSurroundingMaxsPreScaled; // 0x0278
    fVector3 m_vecSpecifiedSurroundingMins; // 0x0284
    fVector3 m_vecSpecifiedSurroundingMaxs; // 0x0290
    float m_flElasticity; // 0x02F0
    float m_flShadowCastDistance; // 0x02F4
    fVector3 m_vecOrigin; // 0x0428
    fVector3 m_angRotation; // 0x0434
    uint32_t m_CollisionGroup; // 0x0444
    uint32_t m_bIsPlayerSimulated; // 0x0724
    uint32_t m_bSimulatedEveryTick; // 0x0725
    uint32_t m_bAnimatedEveryTick; // 0x0726
    uint32_t m_bAlternateSorting; // 0x0727
    uint32_t m_iTextureFrameIndex; // 0x0728
    uint32_t m_hOwnerEntity; // 0x0734
    uint32_t m_hEffectEntity; // 0x0738
    uint32_t m_hAttachedToEntity; // 0x07A0
    uint32_t m_nAttachment; // 0x07A4
    float m_flSpriteFramerate; // 0x07A8
    float m_flFrame; // 0x07AC
    uint32_t m_nBrightness; // 0x07B4
    float m_flBrightnessTime; // 0x07B8
    float m_flSpriteScale; // 0x07BC
    float m_flScaleTime; // 0x07C0
    uint32_t m_bWorldSpaceScale; // 0x07C4
    float m_flGlowProxySize; // 0x07C8
    float m_flHDRColorScale; // 0x07CC
    float m_flLifeTime; // 0x2024
    float m_flStartWidth; // 0x2028
    float m_flEndWidth; // 0x202C
    float m_flStartWidthVariance; // 0x2030
    float m_flTextureRes; // 0x2034
    float m_flMinFadeLength; // 0x2038
    fVector3 m_vecSkyboxOrigin; // 0x203C
    float m_flSkyboxScale; // 0x2048
};

class CFuncSmokeVolume // parent CBaseEntity {
public:
    uint32_t movetype; // 0x0000
    uint32_t movecollide; // 0x0000
    uint32_t m_nRenderFX; // 0x008C
    uint32_t m_clrRender; // 0x0090
    uint32_t m_flAnimTime; // 0x00A0
    uint32_t m_flSimulationTime; // 0x00A8
    uint32_t m_ubInterpolationFrame; // 0x00B4
    uint32_t m_fEffects; // 0x00B8
    uint32_t m_nRenderMode; // 0x00BC
    uint32_t m_nModelIndex; // 0x00CC
    uint32_t m_iTeamNum; // 0x00D8
    uint32_t m_PredictableID; // 0x00DC
    uint32_t m_iParentAttachment; // 0x01F6
    uint32_t moveparent; // 0x020C
    fVector3 m_vecMinsPreScaled; // 0x0230
    fVector3 m_vecMaxsPreScaled; // 0x023C
    fVector3 m_vecMins; // 0x0248
    fVector3 m_vecMaxs; // 0x0254
    uint32_t m_usSolidFlags; // 0x0264
    uint32_t m_nSurroundType; // 0x0268
    uint32_t m_nSolidType; // 0x0269
    uint32_t m_triggerBloat; // 0x026A
    uint32_t m_bUniformTriggerBloat; // 0x026B
    fVector3 m_vecSpecifiedSurroundingMinsPreScaled; // 0x026C
    fVector3 m_vecSpecifiedSurroundingMaxsPreScaled; // 0x0278
    fVector3 m_vecSpecifiedSurroundingMins; // 0x0284
    fVector3 m_vecSpecifiedSurroundingMaxs; // 0x0290
    float m_flElasticity; // 0x02F0
    float m_flShadowCastDistance; // 0x02F4
    fVector3 m_vecOrigin; // 0x0428
    fVector3 m_angRotation; // 0x0434
    uint32_t m_CollisionGroup; // 0x0444
    uint32_t m_bIsPlayerSimulated; // 0x0724
    uint32_t m_bSimulatedEveryTick; // 0x0725
    uint32_t m_bAnimatedEveryTick; // 0x0726
    uint32_t m_bAlternateSorting; // 0x0727
    uint32_t m_iTextureFrameIndex; // 0x0728
    uint32_t m_hOwnerEntity; // 0x0734
    uint32_t m_hEffectEntity; // 0x0738
    uint32_t m_Color1; // 0x08C0
    uint32_t m_Color2; // 0x08C4
    const char* m_MaterialName; // 0x08C8
    float m_ParticleDrawWidth; // 0x09C8
    float m_ParticleSpacingDistance; // 0x09CC
    float m_DensityRampSpeed; // 0x09D0
    float m_RotationSpeed; // 0x09D4
    float m_MovementSpeed; // 0x09D8
    float m_Density; // 0x09DC
    uint32_t m_spawnflags; // 0x09E0
};

class CSpriteOriented // parent CBaseEntity {
public:
    uint32_t movetype; // 0x0000
    uint32_t movecollide; // 0x0000
    uint32_t m_nRenderFX; // 0x008C
    uint32_t m_clrRender; // 0x0090
    uint32_t m_flAnimTime; // 0x00A0
    uint32_t m_flSimulationTime; // 0x00A8
    uint32_t m_ubInterpolationFrame; // 0x00B4
    uint32_t m_fEffects; // 0x00B8
    uint32_t m_nRenderMode; // 0x00BC
    uint32_t m_nModelIndex; // 0x00CC
    uint32_t m_iTeamNum; // 0x00D8
    uint32_t m_PredictableID; // 0x00DC
    uint32_t m_iParentAttachment; // 0x01F6
    uint32_t moveparent; // 0x020C
    fVector3 m_vecMinsPreScaled; // 0x0230
    fVector3 m_vecMaxsPreScaled; // 0x023C
    fVector3 m_vecMins; // 0x0248
    fVector3 m_vecMaxs; // 0x0254
    uint32_t m_usSolidFlags; // 0x0264
    uint32_t m_nSurroundType; // 0x0268
    uint32_t m_nSolidType; // 0x0269
    uint32_t m_triggerBloat; // 0x026A
    uint32_t m_bUniformTriggerBloat; // 0x026B
    fVector3 m_vecSpecifiedSurroundingMinsPreScaled; // 0x026C
    fVector3 m_vecSpecifiedSurroundingMaxsPreScaled; // 0x0278
    fVector3 m_vecSpecifiedSurroundingMins; // 0x0284
    fVector3 m_vecSpecifiedSurroundingMaxs; // 0x0290
    float m_flElasticity; // 0x02F0
    float m_flShadowCastDistance; // 0x02F4
    fVector3 m_vecOrigin; // 0x0428
    fVector3 m_angRotation; // 0x0434
    uint32_t m_CollisionGroup; // 0x0444
    uint32_t m_bIsPlayerSimulated; // 0x0724
    uint32_t m_bSimulatedEveryTick; // 0x0725
    uint32_t m_bAnimatedEveryTick; // 0x0726
    uint32_t m_bAlternateSorting; // 0x0727
    uint32_t m_iTextureFrameIndex; // 0x0728
    uint32_t m_hOwnerEntity; // 0x0734
    uint32_t m_hEffectEntity; // 0x0738
    uint32_t m_hAttachedToEntity; // 0x07A0
    uint32_t m_nAttachment; // 0x07A4
    float m_flSpriteFramerate; // 0x07A8
    float m_flFrame; // 0x07AC
    uint32_t m_nBrightness; // 0x07B4
    float m_flBrightnessTime; // 0x07B8
    float m_flSpriteScale; // 0x07BC
    float m_flScaleTime; // 0x07C0
    uint32_t m_bWorldSpaceScale; // 0x07C4
    float m_flGlowProxySize; // 0x07C8
    float m_flHDRColorScale; // 0x07CC
};

class CSprite // parent CBaseEntity {
public:
    uint32_t movetype; // 0x0000
    uint32_t movecollide; // 0x0000
    uint32_t m_nRenderFX; // 0x008C
    uint32_t m_clrRender; // 0x0090
    uint32_t m_flAnimTime; // 0x00A0
    uint32_t m_flSimulationTime; // 0x00A8
    uint32_t m_ubInterpolationFrame; // 0x00B4
    uint32_t m_fEffects; // 0x00B8
    uint32_t m_nRenderMode; // 0x00BC
    uint32_t m_nModelIndex; // 0x00CC
    uint32_t m_iTeamNum; // 0x00D8
    uint32_t m_PredictableID; // 0x00DC
    uint32_t m_iParentAttachment; // 0x01F6
    uint32_t moveparent; // 0x020C
    fVector3 m_vecMinsPreScaled; // 0x0230
    fVector3 m_vecMaxsPreScaled; // 0x023C
    fVector3 m_vecMins; // 0x0248
    fVector3 m_vecMaxs; // 0x0254
    uint32_t m_usSolidFlags; // 0x0264
    uint32_t m_nSurroundType; // 0x0268
    uint32_t m_nSolidType; // 0x0269
    uint32_t m_triggerBloat; // 0x026A
    uint32_t m_bUniformTriggerBloat; // 0x026B
    fVector3 m_vecSpecifiedSurroundingMinsPreScaled; // 0x026C
    fVector3 m_vecSpecifiedSurroundingMaxsPreScaled; // 0x0278
    fVector3 m_vecSpecifiedSurroundingMins; // 0x0284
    fVector3 m_vecSpecifiedSurroundingMaxs; // 0x0290
    float m_flElasticity; // 0x02F0
    float m_flShadowCastDistance; // 0x02F4
    fVector3 m_vecOrigin; // 0x0428
    fVector3 m_angRotation; // 0x0434
    uint32_t m_CollisionGroup; // 0x0444
    uint32_t m_bIsPlayerSimulated; // 0x0724
    uint32_t m_bSimulatedEveryTick; // 0x0725
    uint32_t m_bAnimatedEveryTick; // 0x0726
    uint32_t m_bAlternateSorting; // 0x0727
    uint32_t m_iTextureFrameIndex; // 0x0728
    uint32_t m_hOwnerEntity; // 0x0734
    uint32_t m_hEffectEntity; // 0x0738
    uint32_t m_hAttachedToEntity; // 0x07A0
    uint32_t m_nAttachment; // 0x07A4
    float m_flSpriteFramerate; // 0x07A8
    float m_flFrame; // 0x07AC
    uint32_t m_nBrightness; // 0x07B4
    float m_flBrightnessTime; // 0x07B8
    float m_flSpriteScale; // 0x07BC
    float m_flScaleTime; // 0x07C0
    uint32_t m_bWorldSpaceScale; // 0x07C4
    float m_flGlowProxySize; // 0x07C8
    float m_flHDRColorScale; // 0x07CC
};

class CBaseProjectile // parent CBaseEntity {
public:
    uint32_t movetype; // 0x0000
    uint32_t movecollide; // 0x0000
    uint32_t m_nRenderFX; // 0x008C
    uint32_t m_clrRender; // 0x0090
    uint32_t m_flAnimTime; // 0x00A0
    uint32_t m_flSimulationTime; // 0x00A8
    uint32_t m_ubInterpolationFrame; // 0x00B4
    uint32_t m_fEffects; // 0x00B8
    uint32_t m_nRenderMode; // 0x00BC
    uint32_t m_nModelIndex; // 0x00CC
    uint32_t m_iTeamNum; // 0x00D8
    uint32_t m_PredictableID; // 0x00DC
    uint32_t m_iParentAttachment; // 0x01F6
    uint32_t moveparent; // 0x020C
    fVector3 m_vecMinsPreScaled; // 0x0230
    fVector3 m_vecMaxsPreScaled; // 0x023C
    fVector3 m_vecMins; // 0x0248
    fVector3 m_vecMaxs; // 0x0254
    uint32_t m_usSolidFlags; // 0x0264
    uint32_t m_nSurroundType; // 0x0268
    uint32_t m_nSolidType; // 0x0269
    uint32_t m_triggerBloat; // 0x026A
    uint32_t m_bUniformTriggerBloat; // 0x026B
    fVector3 m_vecSpecifiedSurroundingMinsPreScaled; // 0x026C
    fVector3 m_vecSpecifiedSurroundingMaxsPreScaled; // 0x0278
    fVector3 m_vecSpecifiedSurroundingMins; // 0x0284
    fVector3 m_vecSpecifiedSurroundingMaxs; // 0x0290
    float m_flElasticity; // 0x02F0
    float m_flShadowCastDistance; // 0x02F4
    fVector3 m_vecOrigin; // 0x0428
    fVector3 m_angRotation; // 0x0434
    uint32_t m_CollisionGroup; // 0x0444
    uint32_t m_bIsPlayerSimulated; // 0x0724
    uint32_t m_bSimulatedEveryTick; // 0x0725
    uint32_t m_bAnimatedEveryTick; // 0x0726
    uint32_t m_bAlternateSorting; // 0x0727
    uint32_t m_iTextureFrameIndex; // 0x0728
    uint32_t m_hOwnerEntity; // 0x0734
    uint32_t m_hEffectEntity; // 0x0738
    uint32_t m_nSkin; // 0x0798
    uint32_t m_nBody; // 0x079C
    uint32_t m_nHitboxSet; // 0x07A0
    float m_flPlaybackRate; // 0x07D4
    fVector3 m_vecForce; // 0x07E8
    uint32_t m_nForceBone; // 0x07F4
    uint32_t m_bClientSideFrameReset; // 0x0834
    float m_fadeMinDist; // 0x0878
    float m_fadeMaxDist; // 0x087C
    float m_flFadeScale; // 0x0880
    float m_flModelWidthScale; // 0x08E4
    float m_flModelScale; // 0x08E4
    uintptr_t m_flPoseParameter[24]; // 0x08E8
    uintptr_t m_flEncodedController[4]; // 0x0A30
    uint32_t m_bClientSideAnimation; // 0x0AA0
    uint32_t m_nNewSequenceParity; // 0x0AA4
    uint32_t m_nResetEventsParity; // 0x0AA8
    uint32_t m_nSequence; // 0x0AD0
    float m_flCycle; // 0x0AD8
    uint32_t m_hLightingOrigin; // 0x0BA0
    uint32_t m_hLightingOriginRelative; // 0x0BA4
    uint32_t m_nMuzzleFlashParity; // 0x0BA8
    uint32_t m_hOriginalLauncher; // 0x0BE0
};

class CRagdollPropAttached // parent CBaseEntity {
public:
    void* m_ragAngles; // 0x0000
    void* m_ragPos; // 0x0000
    uint32_t movetype; // 0x0000
    uint32_t movecollide; // 0x0000
    uint32_t m_nRenderFX; // 0x008C
    uint32_t m_clrRender; // 0x0090
    uint32_t m_flAnimTime; // 0x00A0
    uint32_t m_flSimulationTime; // 0x00A8
    uint32_t m_ubInterpolationFrame; // 0x00B4
    uint32_t m_fEffects; // 0x00B8
    uint32_t m_nRenderMode; // 0x00BC
    uint32_t m_nModelIndex; // 0x00CC
    uint32_t m_iTeamNum; // 0x00D8
    uint32_t m_PredictableID; // 0x00DC
    uint32_t m_iParentAttachment; // 0x01F6
    uint32_t moveparent; // 0x020C
    fVector3 m_vecMinsPreScaled; // 0x0230
    fVector3 m_vecMaxsPreScaled; // 0x023C
    fVector3 m_vecMins; // 0x0248
    fVector3 m_vecMaxs; // 0x0254
    uint32_t m_usSolidFlags; // 0x0264
    uint32_t m_nSurroundType; // 0x0268
    uint32_t m_nSolidType; // 0x0269
    uint32_t m_triggerBloat; // 0x026A
    uint32_t m_bUniformTriggerBloat; // 0x026B
    fVector3 m_vecSpecifiedSurroundingMinsPreScaled; // 0x026C
    fVector3 m_vecSpecifiedSurroundingMaxsPreScaled; // 0x0278
    fVector3 m_vecSpecifiedSurroundingMins; // 0x0284
    fVector3 m_vecSpecifiedSurroundingMaxs; // 0x0290
    float m_flElasticity; // 0x02F0
    float m_flShadowCastDistance; // 0x02F4
    fVector3 m_vecOrigin; // 0x0428
    fVector3 m_angRotation; // 0x0434
    uint32_t m_CollisionGroup; // 0x0444
    uint32_t m_bIsPlayerSimulated; // 0x0724
    uint32_t m_bSimulatedEveryTick; // 0x0725
    uint32_t m_bAnimatedEveryTick; // 0x0726
    uint32_t m_bAlternateSorting; // 0x0727
    uint32_t m_iTextureFrameIndex; // 0x0728
    uint32_t m_hOwnerEntity; // 0x0734
    uint32_t m_hEffectEntity; // 0x0738
    uint32_t m_nSkin; // 0x0798
    uint32_t m_nBody; // 0x079C
    uint32_t m_nHitboxSet; // 0x07A0
    float m_flPlaybackRate; // 0x07D4
    fVector3 m_vecForce; // 0x07E8
    uint32_t m_nForceBone; // 0x07F4
    uint32_t m_bClientSideFrameReset; // 0x0834
    float m_fadeMinDist; // 0x0878
    float m_fadeMaxDist; // 0x087C
    float m_flFadeScale; // 0x0880
    float m_flModelScale; // 0x08E4
    float m_flModelWidthScale; // 0x08E4
    uintptr_t m_flPoseParameter[24]; // 0x08E8
    uintptr_t m_flEncodedController[4]; // 0x0A30
    uint32_t m_bClientSideAnimation; // 0x0AA0
    uint32_t m_nNewSequenceParity; // 0x0AA4
    uint32_t m_nResetEventsParity; // 0x0AA8
    uint32_t m_nSequence; // 0x0AD0
    float m_flCycle; // 0x0AD8
    uint32_t m_hLightingOrigin; // 0x0BA0
    uint32_t m_hLightingOriginRelative; // 0x0BA4
    uint32_t m_nMuzzleFlashParity; // 0x0BA8
    uint32_t m_hUnragdoll; // 0x0F24
    float m_flBlendWeight; // 0x0F28
    uint32_t m_nOverlaySequence; // 0x0F30
    fVector3 m_attachmentPointBoneSpace; // 0x0F38
    fVector3 m_attachmentPointRagdollSpace; // 0x0F50
    uint32_t m_ragdollAttachedObjectIndex; // 0x0F5C
    uint32_t m_boneIndexAttached; // 0x0F60
};

class CBaseEntity {
public:
    uint32_t movecollide; // 0x0000
    uint32_t movetype; // 0x0000
    uint32_t m_nRenderFX; // 0x008C
    uint32_t m_clrRender; // 0x0090
    uint32_t m_flAnimTime; // 0x00A0
    uint32_t m_flSimulationTime; // 0x00A8
    uint32_t m_ubInterpolationFrame; // 0x00B4
    uint32_t m_fEffects; // 0x00B8
    uint32_t m_nRenderMode; // 0x00BC
    uint32_t m_nModelIndex; // 0x00CC
    uint32_t m_iTeamNum; // 0x00D8
    uint32_t m_PredictableID; // 0x00DC
    uint32_t m_iParentAttachment; // 0x01F6
    uint32_t moveparent; // 0x020C
    fVector3 m_vecMinsPreScaled; // 0x0230
    fVector3 m_vecMaxsPreScaled; // 0x023C
    fVector3 m_vecMins; // 0x0248
    fVector3 m_vecMaxs; // 0x0254
    uint32_t m_usSolidFlags; // 0x0264
    uint32_t m_nSurroundType; // 0x0268
    uint32_t m_nSolidType; // 0x0269
    uint32_t m_triggerBloat; // 0x026A
    uint32_t m_bUniformTriggerBloat; // 0x026B
    fVector3 m_vecSpecifiedSurroundingMinsPreScaled; // 0x026C
    fVector3 m_vecSpecifiedSurroundingMaxsPreScaled; // 0x0278
    fVector3 m_vecSpecifiedSurroundingMins; // 0x0284
    fVector3 m_vecSpecifiedSurroundingMaxs; // 0x0290
    float m_flElasticity; // 0x02F0
    float m_flShadowCastDistance; // 0x02F4
    fVector3 m_vecOrigin; // 0x0428
    fVector3 m_angRotation; // 0x0434
    uint32_t m_CollisionGroup; // 0x0444
    uint32_t m_bIsPlayerSimulated; // 0x0724
    uint32_t m_bSimulatedEveryTick; // 0x0725
    uint32_t m_bAnimatedEveryTick; // 0x0726
    uint32_t m_bAlternateSorting; // 0x0727
    uint32_t m_iTextureFrameIndex; // 0x0728
    uint32_t m_hOwnerEntity; // 0x0734
    uint32_t m_hEffectEntity; // 0x0738
};

class CRagdollProp // parent CBaseEntity {
public:
    void* m_ragAngles; // 0x0000
    void* m_ragPos; // 0x0000
    uint32_t movetype; // 0x0000
    uint32_t movecollide; // 0x0000
    uint32_t m_nRenderFX; // 0x008C
    uint32_t m_clrRender; // 0x0090
    uint32_t m_flAnimTime; // 0x00A0
    uint32_t m_flSimulationTime; // 0x00A8
    uint32_t m_ubInterpolationFrame; // 0x00B4
    uint32_t m_fEffects; // 0x00B8
    uint32_t m_nRenderMode; // 0x00BC
    uint32_t m_nModelIndex; // 0x00CC
    uint32_t m_iTeamNum; // 0x00D8
    uint32_t m_PredictableID; // 0x00DC
    uint32_t m_iParentAttachment; // 0x01F6
    uint32_t moveparent; // 0x020C
    fVector3 m_vecMinsPreScaled; // 0x0230
    fVector3 m_vecMaxsPreScaled; // 0x023C
    fVector3 m_vecMins; // 0x0248
    fVector3 m_vecMaxs; // 0x0254
    uint32_t m_usSolidFlags; // 0x0264
    uint32_t m_nSurroundType; // 0x0268
    uint32_t m_nSolidType; // 0x0269
    uint32_t m_triggerBloat; // 0x026A
    uint32_t m_bUniformTriggerBloat; // 0x026B
    fVector3 m_vecSpecifiedSurroundingMinsPreScaled; // 0x026C
    fVector3 m_vecSpecifiedSurroundingMaxsPreScaled; // 0x0278
    fVector3 m_vecSpecifiedSurroundingMins; // 0x0284
    fVector3 m_vecSpecifiedSurroundingMaxs; // 0x0290
    float m_flElasticity; // 0x02F0
    float m_flShadowCastDistance; // 0x02F4
    fVector3 m_vecOrigin; // 0x0428
    fVector3 m_angRotation; // 0x0434
    uint32_t m_CollisionGroup; // 0x0444
    uint32_t m_bIsPlayerSimulated; // 0x0724
    uint32_t m_bSimulatedEveryTick; // 0x0725
    uint32_t m_bAnimatedEveryTick; // 0x0726
    uint32_t m_bAlternateSorting; // 0x0727
    uint32_t m_iTextureFrameIndex; // 0x0728
    uint32_t m_hOwnerEntity; // 0x0734
    uint32_t m_hEffectEntity; // 0x0738
    uint32_t m_nSkin; // 0x0798
    uint32_t m_nBody; // 0x079C
    uint32_t m_nHitboxSet; // 0x07A0
    float m_flPlaybackRate; // 0x07D4
    fVector3 m_vecForce; // 0x07E8
    uint32_t m_nForceBone; // 0x07F4
    uint32_t m_bClientSideFrameReset; // 0x0834
    float m_fadeMinDist; // 0x0878
    float m_fadeMaxDist; // 0x087C
    float m_flFadeScale; // 0x0880
    float m_flModelScale; // 0x08E4
    float m_flModelWidthScale; // 0x08E4
    uintptr_t m_flPoseParameter[24]; // 0x08E8
    uintptr_t m_flEncodedController[4]; // 0x0A30
    uint32_t m_bClientSideAnimation; // 0x0AA0
    uint32_t m_nNewSequenceParity; // 0x0AA4
    uint32_t m_nResetEventsParity; // 0x0AA8
    uint32_t m_nSequence; // 0x0AD0
    float m_flCycle; // 0x0AD8
    uint32_t m_hLightingOrigin; // 0x0BA0
    uint32_t m_hLightingOriginRelative; // 0x0BA4
    uint32_t m_nMuzzleFlashParity; // 0x0BA8
    uint32_t m_hUnragdoll; // 0x0F24
    float m_flBlendWeight; // 0x0F28
    uint32_t m_nOverlaySequence; // 0x0F30
};

class CPredictedViewModel // parent CBaseViewModel {
public:
    void* m_flPoseParameter; // 0x0000
    uint32_t m_fEffects; // 0x00B8
    uint32_t m_nModelIndex; // 0x00CC
    uint32_t m_nSkin; // 0x0798
    uint32_t m_nBody; // 0x079C
    float m_flPlaybackRate; // 0x07D4
    uint32_t m_nNewSequenceParity; // 0x0AA4
    uint32_t m_nResetEventsParity; // 0x0AA8
    uint32_t m_nSequence; // 0x0AD0
    uint32_t m_nMuzzleFlashParity; // 0x0BA8
    uint32_t m_nViewModelIndex; // 0x0BF4
    uint32_t m_hOwner; // 0x0BF8
    uint32_t m_nAnimationParity; // 0x0C04
    uint32_t m_hWeapon; // 0x0C1C
};

class CPoseController // parent CBaseEntity {
public:
    uint32_t movetype; // 0x0000
    uint32_t movecollide; // 0x0000
    uint32_t m_nRenderFX; // 0x008C
    uint32_t m_clrRender; // 0x0090
    uint32_t m_flAnimTime; // 0x00A0
    uint32_t m_flSimulationTime; // 0x00A8
    uint32_t m_ubInterpolationFrame; // 0x00B4
    uint32_t m_fEffects; // 0x00B8
    uint32_t m_nRenderMode; // 0x00BC
    uint32_t m_nModelIndex; // 0x00CC
    uint32_t m_iTeamNum; // 0x00D8
    uint32_t m_PredictableID; // 0x00DC
    uint32_t m_iParentAttachment; // 0x01F6
    uint32_t moveparent; // 0x020C
    fVector3 m_vecMinsPreScaled; // 0x0230
    fVector3 m_vecMaxsPreScaled; // 0x023C
    fVector3 m_vecMins; // 0x0248
    fVector3 m_vecMaxs; // 0x0254
    uint32_t m_usSolidFlags; // 0x0264
    uint32_t m_nSurroundType; // 0x0268
    uint32_t m_nSolidType; // 0x0269
    uint32_t m_triggerBloat; // 0x026A
    uint32_t m_bUniformTriggerBloat; // 0x026B
    fVector3 m_vecSpecifiedSurroundingMinsPreScaled; // 0x026C
    fVector3 m_vecSpecifiedSurroundingMaxsPreScaled; // 0x0278
    fVector3 m_vecSpecifiedSurroundingMins; // 0x0284
    fVector3 m_vecSpecifiedSurroundingMaxs; // 0x0290
    float m_flElasticity; // 0x02F0
    float m_flShadowCastDistance; // 0x02F4
    fVector3 m_vecOrigin; // 0x0428
    fVector3 m_angRotation; // 0x0434
    uint32_t m_CollisionGroup; // 0x0444
    uint32_t m_bIsPlayerSimulated; // 0x0724
    uint32_t m_bSimulatedEveryTick; // 0x0725
    uint32_t m_bAnimatedEveryTick; // 0x0726
    uint32_t m_bAlternateSorting; // 0x0727
    uint32_t m_iTextureFrameIndex; // 0x0728
    uint32_t m_hOwnerEntity; // 0x0734
    uint32_t m_hEffectEntity; // 0x0738
    uintptr_t m_hProps[4]; // 0x0788
    uintptr_t m_chPoseIndex[4]; // 0x0798
    uint32_t m_bPoseValueParity; // 0x079C
    float m_fPoseValue; // 0x07A0
    float m_fInterpolationTime; // 0x07A4
    uint32_t m_bInterpolationWrap; // 0x07A8
    float m_fCycleFrequency; // 0x07AC
    uint32_t m_nFModType; // 0x07B0
    float m_fFModTimeOffset; // 0x07B4
    float m_fFModRate; // 0x07B8
    float m_fFModAmplitude; // 0x07BC
};

class CFuncLadder // parent CBaseEntity {
public:
    uint32_t movecollide; // 0x0000
    uint32_t movetype; // 0x0000
    uint32_t m_nRenderFX; // 0x008C
    uint32_t m_clrRender; // 0x0090
    uint32_t m_flAnimTime; // 0x00A0
    uint32_t m_flSimulationTime; // 0x00A8
    uint32_t m_ubInterpolationFrame; // 0x00B4
    uint32_t m_fEffects; // 0x00B8
    uint32_t m_nRenderMode; // 0x00BC
    uint32_t m_nModelIndex; // 0x00CC
    uint32_t m_iTeamNum; // 0x00D8
    uint32_t m_PredictableID; // 0x00DC
    uint32_t m_iParentAttachment; // 0x01F6
    uint32_t moveparent; // 0x020C
    fVector3 m_vecMinsPreScaled; // 0x0230
    fVector3 m_vecMaxsPreScaled; // 0x023C
    fVector3 m_vecMins; // 0x0248
    fVector3 m_vecMaxs; // 0x0254
    uint32_t m_usSolidFlags; // 0x0264
    uint32_t m_nSurroundType; // 0x0268
    uint32_t m_nSolidType; // 0x0269
    uint32_t m_triggerBloat; // 0x026A
    uint32_t m_bUniformTriggerBloat; // 0x026B
    fVector3 m_vecSpecifiedSurroundingMinsPreScaled; // 0x026C
    fVector3 m_vecSpecifiedSurroundingMaxsPreScaled; // 0x0278
    fVector3 m_vecSpecifiedSurroundingMins; // 0x0284
    fVector3 m_vecSpecifiedSurroundingMaxs; // 0x0290
    float m_flElasticity; // 0x02F0
    float m_flShadowCastDistance; // 0x02F4
    fVector3 m_vecOrigin; // 0x0428
    fVector3 m_angRotation; // 0x0434
    uint32_t m_CollisionGroup; // 0x0444
    uint32_t m_bIsPlayerSimulated; // 0x0724
    uint32_t m_bSimulatedEveryTick; // 0x0725
    uint32_t m_bAnimatedEveryTick; // 0x0726
    uint32_t m_bAlternateSorting; // 0x0727
    uint32_t m_iTextureFrameIndex; // 0x0728
    uint32_t m_hOwnerEntity; // 0x0734
    uint32_t m_hEffectEntity; // 0x0738
    fVector3 m_vecLadderDir; // 0x0788
    fVector3 m_vecPlayerMountPositionTop; // 0x07B8
    fVector3 m_vecPlayerMountPositionBottom; // 0x07C4
    uint32_t m_bFakeLadder; // 0x07D1
};

class CEnvDetailController {
public:
    float m_flFadeStartDist; // 0x0788
    float m_flFadeEndDist; // 0x078C
};

class CWorld // parent CBaseEntity {
public:
    uint32_t movecollide; // 0x0000
    uint32_t movetype; // 0x0000
    uint32_t m_nRenderFX; // 0x008C
    uint32_t m_clrRender; // 0x0090
    uint32_t m_flAnimTime; // 0x00A0
    uint32_t m_flSimulationTime; // 0x00A8
    uint32_t m_ubInterpolationFrame; // 0x00B4
    uint32_t m_fEffects; // 0x00B8
    uint32_t m_nRenderMode; // 0x00BC
    uint32_t m_nModelIndex; // 0x00CC
    uint32_t m_iTeamNum; // 0x00D8
    uint32_t m_PredictableID; // 0x00DC
    uint32_t m_iParentAttachment; // 0x01F6
    uint32_t moveparent; // 0x020C
    fVector3 m_vecMinsPreScaled; // 0x0230
    fVector3 m_vecMaxsPreScaled; // 0x023C
    fVector3 m_vecMins; // 0x0248
    fVector3 m_vecMaxs; // 0x0254
    uint32_t m_usSolidFlags; // 0x0264
    uint32_t m_nSurroundType; // 0x0268
    uint32_t m_nSolidType; // 0x0269
    uint32_t m_triggerBloat; // 0x026A
    uint32_t m_bUniformTriggerBloat; // 0x026B
    fVector3 m_vecSpecifiedSurroundingMinsPreScaled; // 0x026C
    fVector3 m_vecSpecifiedSurroundingMaxsPreScaled; // 0x0278
    fVector3 m_vecSpecifiedSurroundingMins; // 0x0284
    fVector3 m_vecSpecifiedSurroundingMaxs; // 0x0290
    float m_flElasticity; // 0x02F0
    float m_flShadowCastDistance; // 0x02F4
    fVector3 m_vecOrigin; // 0x0428
    fVector3 m_angRotation; // 0x0434
    uint32_t m_CollisionGroup; // 0x0444
    uint32_t m_bIsPlayerSimulated; // 0x0724
    uint32_t m_bSimulatedEveryTick; // 0x0725
    uint32_t m_bAnimatedEveryTick; // 0x0726
    uint32_t m_bAlternateSorting; // 0x0727
    uint32_t m_iTextureFrameIndex; // 0x0728
    uint32_t m_hOwnerEntity; // 0x0734
    uint32_t m_hEffectEntity; // 0x0738
    float m_flWaveHeight; // 0x0788
    fVector3 m_WorldMins; // 0x078C
    fVector3 m_WorldMaxs; // 0x0798
    uint32_t m_bStartDark; // 0x07A4
    float m_flMaxOccludeeArea; // 0x07A8
    float m_flMinOccluderArea; // 0x07AC
    float m_flMinPropScreenSpaceWidth; // 0x07B0
    float m_flMaxPropScreenSpaceWidth; // 0x07B4
    uint32_t m_bColdWorld; // 0x07B8
    const char* m_iszDetailSpriteMaterial; // 0x07B9
};

class CWaterBullet // parent CBaseEntity {
public:
    uint32_t movetype; // 0x0000
    uint32_t movecollide; // 0x0000
    uint32_t m_nRenderFX; // 0x008C
    uint32_t m_clrRender; // 0x0090
    uint32_t m_flAnimTime; // 0x00A0
    uint32_t m_flSimulationTime; // 0x00A8
    uint32_t m_ubInterpolationFrame; // 0x00B4
    uint32_t m_fEffects; // 0x00B8
    uint32_t m_nRenderMode; // 0x00BC
    uint32_t m_nModelIndex; // 0x00CC
    uint32_t m_iTeamNum; // 0x00D8
    uint32_t m_PredictableID; // 0x00DC
    uint32_t m_iParentAttachment; // 0x01F6
    uint32_t moveparent; // 0x020C
    fVector3 m_vecMinsPreScaled; // 0x0230
    fVector3 m_vecMaxsPreScaled; // 0x023C
    fVector3 m_vecMins; // 0x0248
    fVector3 m_vecMaxs; // 0x0254
    uint32_t m_usSolidFlags; // 0x0264
    uint32_t m_nSurroundType; // 0x0268
    uint32_t m_nSolidType; // 0x0269
    uint32_t m_triggerBloat; // 0x026A
    uint32_t m_bUniformTriggerBloat; // 0x026B
    fVector3 m_vecSpecifiedSurroundingMinsPreScaled; // 0x026C
    fVector3 m_vecSpecifiedSurroundingMaxsPreScaled; // 0x0278
    fVector3 m_vecSpecifiedSurroundingMins; // 0x0284
    fVector3 m_vecSpecifiedSurroundingMaxs; // 0x0290
    float m_flElasticity; // 0x02F0
    float m_flShadowCastDistance; // 0x02F4
    fVector3 m_vecOrigin; // 0x0428
    fVector3 m_angRotation; // 0x0434
    uint32_t m_CollisionGroup; // 0x0444
    uint32_t m_bIsPlayerSimulated; // 0x0724
    uint32_t m_bSimulatedEveryTick; // 0x0725
    uint32_t m_bAnimatedEveryTick; // 0x0726
    uint32_t m_bAlternateSorting; // 0x0727
    uint32_t m_iTextureFrameIndex; // 0x0728
    uint32_t m_hOwnerEntity; // 0x0734
    uint32_t m_hEffectEntity; // 0x0738
    uint32_t m_nSkin; // 0x0798
    uint32_t m_nBody; // 0x079C
    uint32_t m_nHitboxSet; // 0x07A0
    float m_flPlaybackRate; // 0x07D4
    fVector3 m_vecForce; // 0x07E8
    uint32_t m_nForceBone; // 0x07F4
    uint32_t m_bClientSideFrameReset; // 0x0834
    float m_fadeMinDist; // 0x0878
    float m_fadeMaxDist; // 0x087C
    float m_flFadeScale; // 0x0880
    float m_flModelScale; // 0x08E4
    float m_flModelWidthScale; // 0x08E4
    uintptr_t m_flPoseParameter[24]; // 0x08E8
    uintptr_t m_flEncodedController[4]; // 0x0A30
    uint32_t m_bClientSideAnimation; // 0x0AA0
    uint32_t m_nNewSequenceParity; // 0x0AA4
    uint32_t m_nResetEventsParity; // 0x0AA8
    uint32_t m_nSequence; // 0x0AD0
    float m_flCycle; // 0x0AD8
    uint32_t m_hLightingOrigin; // 0x0BA0
    uint32_t m_hLightingOriginRelative; // 0x0BA4
    uint32_t m_nMuzzleFlashParity; // 0x0BA8
};

class CVoteController // parent CBaseEntity {
public:
    uint32_t movetype; // 0x0000
    uint32_t movecollide; // 0x0000
    uint32_t m_nRenderFX; // 0x008C
    uint32_t m_clrRender; // 0x0090
    uint32_t m_flAnimTime; // 0x00A0
    uint32_t m_flSimulationTime; // 0x00A8
    uint32_t m_ubInterpolationFrame; // 0x00B4
    uint32_t m_fEffects; // 0x00B8
    uint32_t m_nRenderMode; // 0x00BC
    uint32_t m_nModelIndex; // 0x00CC
    uint32_t m_iTeamNum; // 0x00D8
    uint32_t m_PredictableID; // 0x00DC
    uint32_t m_iParentAttachment; // 0x01F6
    uint32_t moveparent; // 0x020C
    fVector3 m_vecMinsPreScaled; // 0x0230
    fVector3 m_vecMaxsPreScaled; // 0x023C
    fVector3 m_vecMins; // 0x0248
    fVector3 m_vecMaxs; // 0x0254
    uint32_t m_usSolidFlags; // 0x0264
    uint32_t m_nSurroundType; // 0x0268
    uint32_t m_nSolidType; // 0x0269
    uint32_t m_triggerBloat; // 0x026A
    uint32_t m_bUniformTriggerBloat; // 0x026B
    fVector3 m_vecSpecifiedSurroundingMinsPreScaled; // 0x026C
    fVector3 m_vecSpecifiedSurroundingMaxsPreScaled; // 0x0278
    fVector3 m_vecSpecifiedSurroundingMins; // 0x0284
    fVector3 m_vecSpecifiedSurroundingMaxs; // 0x0290
    float m_flElasticity; // 0x02F0
    float m_flShadowCastDistance; // 0x02F4
    fVector3 m_vecOrigin; // 0x0428
    fVector3 m_angRotation; // 0x0434
    uint32_t m_CollisionGroup; // 0x0444
    uint32_t m_bIsPlayerSimulated; // 0x0724
    uint32_t m_bSimulatedEveryTick; // 0x0725
    uint32_t m_bAnimatedEveryTick; // 0x0726
    uint32_t m_bAlternateSorting; // 0x0727
    uint32_t m_iTextureFrameIndex; // 0x0728
    uint32_t m_hOwnerEntity; // 0x0734
    uint32_t m_hEffectEntity; // 0x0738
    uint32_t m_iActiveIssueIndex; // 0x0798
    uint32_t m_iOnlyTeamToVote; // 0x079C
    uintptr_t m_nVoteOptionCount[5]; // 0x07A0
    uint32_t m_nPotentialVotes; // 0x07B8
    uint32_t m_bIsYesNoVote; // 0x07BE
    uint32_t m_nVoteIdx; // 0x07C0
};

class CVGuiScreen // parent CBaseEntity {
public:
    uint32_t movetype; // 0x0000
    uint32_t movecollide; // 0x0000
    uint32_t m_nRenderFX; // 0x008C
    uint32_t m_clrRender; // 0x0090
    uint32_t m_flAnimTime; // 0x00A0
    uint32_t m_flSimulationTime; // 0x00A8
    uint32_t m_ubInterpolationFrame; // 0x00B4
    uint32_t m_fEffects; // 0x00B8
    uint32_t m_nRenderMode; // 0x00BC
    uint32_t m_nModelIndex; // 0x00CC
    uint32_t m_iTeamNum; // 0x00D8
    uint32_t m_PredictableID; // 0x00DC
    uint32_t m_iParentAttachment; // 0x01F6
    uint32_t moveparent; // 0x020C
    fVector3 m_vecMinsPreScaled; // 0x0230
    fVector3 m_vecMaxsPreScaled; // 0x023C
    fVector3 m_vecMins; // 0x0248
    fVector3 m_vecMaxs; // 0x0254
    uint32_t m_usSolidFlags; // 0x0264
    uint32_t m_nSurroundType; // 0x0268
    uint32_t m_nSolidType; // 0x0269
    uint32_t m_triggerBloat; // 0x026A
    uint32_t m_bUniformTriggerBloat; // 0x026B
    fVector3 m_vecSpecifiedSurroundingMinsPreScaled; // 0x026C
    fVector3 m_vecSpecifiedSurroundingMaxsPreScaled; // 0x0278
    fVector3 m_vecSpecifiedSurroundingMins; // 0x0284
    fVector3 m_vecSpecifiedSurroundingMaxs; // 0x0290
    float m_flElasticity; // 0x02F0
    float m_flShadowCastDistance; // 0x02F4
    fVector3 m_vecOrigin; // 0x0428
    fVector3 m_angRotation; // 0x0434
    uint32_t m_CollisionGroup; // 0x0444
    uint32_t m_bIsPlayerSimulated; // 0x0724
    uint32_t m_bSimulatedEveryTick; // 0x0725
    uint32_t m_bAnimatedEveryTick; // 0x0726
    uint32_t m_bAlternateSorting; // 0x0727
    uint32_t m_iTextureFrameIndex; // 0x0728
    uint32_t m_hOwnerEntity; // 0x0734
    uint32_t m_hEffectEntity; // 0x0738
    float m_flWidth; // 0x0790
    float m_flHeight; // 0x0794
    uint32_t m_nPanelName; // 0x0798
    uint32_t m_nAttachmentIndex; // 0x07B4
    uint32_t m_nOverlayMaterial; // 0x07B8
    uint32_t m_fScreenFlags; // 0x07BC
    uint32_t m_hPlayerOwner; // 0x0828
};

class CPropJeep // parent CBaseEntity {
public:
    uint32_t movetype; // 0x0000
    uint32_t movecollide; // 0x0000
    uint32_t m_nRenderFX; // 0x008C
    uint32_t m_clrRender; // 0x0090
    uint32_t m_flAnimTime; // 0x00A0
    uint32_t m_flSimulationTime; // 0x00A8
    uint32_t m_ubInterpolationFrame; // 0x00B4
    uint32_t m_fEffects; // 0x00B8
    uint32_t m_nRenderMode; // 0x00BC
    uint32_t m_nModelIndex; // 0x00CC
    uint32_t m_iTeamNum; // 0x00D8
    uint32_t m_PredictableID; // 0x00DC
    uint32_t m_iParentAttachment; // 0x01F6
    uint32_t moveparent; // 0x020C
    fVector3 m_vecMinsPreScaled; // 0x0230
    fVector3 m_vecMaxsPreScaled; // 0x023C
    fVector3 m_vecMins; // 0x0248
    fVector3 m_vecMaxs; // 0x0254
    uint32_t m_usSolidFlags; // 0x0264
    uint32_t m_nSurroundType; // 0x0268
    uint32_t m_nSolidType; // 0x0269
    uint32_t m_triggerBloat; // 0x026A
    uint32_t m_bUniformTriggerBloat; // 0x026B
    fVector3 m_vecSpecifiedSurroundingMinsPreScaled; // 0x026C
    fVector3 m_vecSpecifiedSurroundingMaxsPreScaled; // 0x0278
    fVector3 m_vecSpecifiedSurroundingMins; // 0x0284
    fVector3 m_vecSpecifiedSurroundingMaxs; // 0x0290
    float m_flElasticity; // 0x02F0
    float m_flShadowCastDistance; // 0x02F4
    fVector3 m_vecOrigin; // 0x0428
    fVector3 m_angRotation; // 0x0434
    uint32_t m_CollisionGroup; // 0x0444
    uint32_t m_bIsPlayerSimulated; // 0x0724
    uint32_t m_bSimulatedEveryTick; // 0x0725
    uint32_t m_bAnimatedEveryTick; // 0x0726
    uint32_t m_bAlternateSorting; // 0x0727
    uint32_t m_iTextureFrameIndex; // 0x0728
    uint32_t m_hOwnerEntity; // 0x0734
    uint32_t m_hEffectEntity; // 0x0738
    uint32_t m_nSkin; // 0x0798
    uint32_t m_nBody; // 0x079C
    uint32_t m_nHitboxSet; // 0x07A0
    float m_flPlaybackRate; // 0x07D4
    fVector3 m_vecForce; // 0x07E8
    uint32_t m_nForceBone; // 0x07F4
    uint32_t m_bClientSideFrameReset; // 0x0834
    float m_fadeMinDist; // 0x0878
    float m_fadeMaxDist; // 0x087C
    float m_flFadeScale; // 0x0880
    float m_flModelScale; // 0x08E4
    float m_flModelWidthScale; // 0x08E4
    uintptr_t m_flPoseParameter[24]; // 0x08E8
    uintptr_t m_flEncodedController[4]; // 0x0A30
    uint32_t m_bClientSideAnimation; // 0x0AA0
    uint32_t m_nNewSequenceParity; // 0x0AA4
    uint32_t m_nResetEventsParity; // 0x0AA8
    uint32_t m_nSequence; // 0x0AD0
    float m_flCycle; // 0x0AD8
    uint32_t m_hLightingOrigin; // 0x0BA0
    uint32_t m_hLightingOriginRelative; // 0x0BA4
    uint32_t m_nMuzzleFlashParity; // 0x0BA8
    uint32_t m_hPlayer; // 0x0BE8
    uint32_t m_nSpeed; // 0x0BEC
    uint32_t m_nRPM; // 0x0BF0
    float m_flThrottle; // 0x0BF4
    uint32_t m_nBoostTimeLeft; // 0x0BF8
    uint32_t m_nHasBoost; // 0x0BFC
    uint32_t m_nScannerDisabledWeapons; // 0x0C00
    uint32_t m_nScannerDisabledVehicle; // 0x0C04
    uint32_t m_bEnterAnimOn; // 0x0C24
    uint32_t m_bExitAnimOn; // 0x0C25
    fVector3 m_vecGunCrosshair; // 0x0C2C
    fVector3 m_vecEyeExitEndpoint; // 0x0C88
    uint32_t m_bHasGun; // 0x0C94
    uint32_t m_bUnableToFire; // 0x0C95
    uint32_t m_bHeadlightIsOn; // 0x0D60
};

class CTest_ProxyToggle_Networkable // parent CBaseEntity {
public:
    uint32_t movecollide; // 0x0000
    uint32_t movetype; // 0x0000
    uint32_t m_nRenderFX; // 0x008C
    uint32_t m_clrRender; // 0x0090
    uint32_t m_flAnimTime; // 0x00A0
    uint32_t m_flSimulationTime; // 0x00A8
    uint32_t m_ubInterpolationFrame; // 0x00B4
    uint32_t m_fEffects; // 0x00B8
    uint32_t m_nRenderMode; // 0x00BC
    uint32_t m_nModelIndex; // 0x00CC
    uint32_t m_iTeamNum; // 0x00D8
    uint32_t m_PredictableID; // 0x00DC
    uint32_t m_iParentAttachment; // 0x01F6
    uint32_t moveparent; // 0x020C
    fVector3 m_vecMinsPreScaled; // 0x0230
    fVector3 m_vecMaxsPreScaled; // 0x023C
    fVector3 m_vecMins; // 0x0248
    fVector3 m_vecMaxs; // 0x0254
    uint32_t m_usSolidFlags; // 0x0264
    uint32_t m_nSurroundType; // 0x0268
    uint32_t m_nSolidType; // 0x0269
    uint32_t m_triggerBloat; // 0x026A
    uint32_t m_bUniformTriggerBloat; // 0x026B
    fVector3 m_vecSpecifiedSurroundingMinsPreScaled; // 0x026C
    fVector3 m_vecSpecifiedSurroundingMaxsPreScaled; // 0x0278
    fVector3 m_vecSpecifiedSurroundingMins; // 0x0284
    fVector3 m_vecSpecifiedSurroundingMaxs; // 0x0290
    float m_flElasticity; // 0x02F0
    float m_flShadowCastDistance; // 0x02F4
    fVector3 m_vecOrigin; // 0x0428
    fVector3 m_angRotation; // 0x0434
    uint32_t m_CollisionGroup; // 0x0444
    uint32_t m_bIsPlayerSimulated; // 0x0724
    uint32_t m_bSimulatedEveryTick; // 0x0725
    uint32_t m_bAnimatedEveryTick; // 0x0726
    uint32_t m_bAlternateSorting; // 0x0727
    uint32_t m_iTextureFrameIndex; // 0x0728
    uint32_t m_hOwnerEntity; // 0x0734
    uint32_t m_hEffectEntity; // 0x0738
    uint32_t m_WithProxy; // 0x0788
};

class CTesla // parent CBaseEntity {
public:
    uint32_t movetype; // 0x0000
    uint32_t movecollide; // 0x0000
    uint32_t m_nRenderFX; // 0x008C
    uint32_t m_clrRender; // 0x0090
    uint32_t m_flAnimTime; // 0x00A0
    uint32_t m_flSimulationTime; // 0x00A8
    uint32_t m_ubInterpolationFrame; // 0x00B4
    uint32_t m_fEffects; // 0x00B8
    uint32_t m_nRenderMode; // 0x00BC
    uint32_t m_nModelIndex; // 0x00CC
    uint32_t m_iTeamNum; // 0x00D8
    uint32_t m_PredictableID; // 0x00DC
    uint32_t m_iParentAttachment; // 0x01F6
    uint32_t moveparent; // 0x020C
    fVector3 m_vecMinsPreScaled; // 0x0230
    fVector3 m_vecMaxsPreScaled; // 0x023C
    fVector3 m_vecMins; // 0x0248
    fVector3 m_vecMaxs; // 0x0254
    uint32_t m_usSolidFlags; // 0x0264
    uint32_t m_nSurroundType; // 0x0268
    uint32_t m_nSolidType; // 0x0269
    uint32_t m_triggerBloat; // 0x026A
    uint32_t m_bUniformTriggerBloat; // 0x026B
    fVector3 m_vecSpecifiedSurroundingMinsPreScaled; // 0x026C
    fVector3 m_vecSpecifiedSurroundingMaxsPreScaled; // 0x0278
    fVector3 m_vecSpecifiedSurroundingMins; // 0x0284
    fVector3 m_vecSpecifiedSurroundingMaxs; // 0x0290
    float m_flElasticity; // 0x02F0
    float m_flShadowCastDistance; // 0x02F4
    fVector3 m_vecOrigin; // 0x0428
    fVector3 m_angRotation; // 0x0434
    uint32_t m_CollisionGroup; // 0x0444
    uint32_t m_bIsPlayerSimulated; // 0x0724
    uint32_t m_bSimulatedEveryTick; // 0x0725
    uint32_t m_bAnimatedEveryTick; // 0x0726
    uint32_t m_bAlternateSorting; // 0x0727
    uint32_t m_iTextureFrameIndex; // 0x0728
    uint32_t m_hOwnerEntity; // 0x0734
    uint32_t m_hEffectEntity; // 0x0738
    const char* m_SoundName; // 0x07B8
    const char* m_iszSpriteName; // 0x07F8
};

class CBaseAnimatingOverlay // parent CBaseEntity {
public:
    uint32_t m_nSequence; // 0x0000
    uint32_t lengthprop15; // 0x0000
    uint32_t movetype; // 0x0000
    uint32_t movecollide; // 0x0000
    float m_flPrevCycle; // 0x0004
    float m_flWeight; // 0x0008
    uint32_t m_nOrder; // 0x000C
    float m_flCycle; // 0x0014
    uint32_t m_nRenderFX; // 0x008C
    uint32_t m_clrRender; // 0x0090
    uint32_t m_flAnimTime; // 0x00A0
    uint32_t m_flSimulationTime; // 0x00A8
    uint32_t m_ubInterpolationFrame; // 0x00B4
    uint32_t m_fEffects; // 0x00B8
    uint32_t m_nRenderMode; // 0x00BC
    uint32_t m_nModelIndex; // 0x00CC
    uint32_t m_iTeamNum; // 0x00D8
    uint32_t m_PredictableID; // 0x00DC
    uint32_t m_iParentAttachment; // 0x01F6
    uint32_t moveparent; // 0x020C
    fVector3 m_vecMinsPreScaled; // 0x0230
    fVector3 m_vecMaxsPreScaled; // 0x023C
    fVector3 m_vecMins; // 0x0248
    fVector3 m_vecMaxs; // 0x0254
    uint32_t m_usSolidFlags; // 0x0264
    uint32_t m_nSurroundType; // 0x0268
    uint32_t m_nSolidType; // 0x0269
    uint32_t m_triggerBloat; // 0x026A
    uint32_t m_bUniformTriggerBloat; // 0x026B
    fVector3 m_vecSpecifiedSurroundingMinsPreScaled; // 0x026C
    fVector3 m_vecSpecifiedSurroundingMaxsPreScaled; // 0x0278
    fVector3 m_vecSpecifiedSurroundingMins; // 0x0284
    fVector3 m_vecSpecifiedSurroundingMaxs; // 0x0290
    float m_flElasticity; // 0x02F0
    float m_flShadowCastDistance; // 0x02F4
    fVector3 m_vecOrigin; // 0x0428
    fVector3 m_angRotation; // 0x0434
    uint32_t m_CollisionGroup; // 0x0444
    uint32_t m_bIsPlayerSimulated; // 0x0724
    uint32_t m_bSimulatedEveryTick; // 0x0725
    uint32_t m_bAnimatedEveryTick; // 0x0726
    uint32_t m_bAlternateSorting; // 0x0727
    uint32_t m_iTextureFrameIndex; // 0x0728
    uint32_t m_hOwnerEntity; // 0x0734
    uint32_t m_hEffectEntity; // 0x0738
    uint32_t m_nSkin; // 0x0798
    uint32_t m_nBody; // 0x079C
    uint32_t m_nHitboxSet; // 0x07A0
    float m_flPlaybackRate; // 0x07D4
    fVector3 m_vecForce; // 0x07E8
    uint32_t m_nForceBone; // 0x07F4
    uint32_t m_bClientSideFrameReset; // 0x0834
    float m_fadeMinDist; // 0x0878
    float m_fadeMaxDist; // 0x087C
    float m_flFadeScale; // 0x0880
    float m_flModelScale; // 0x08E4
    float m_flModelWidthScale; // 0x08E4
    uintptr_t m_flPoseParameter[24]; // 0x08E8
    uintptr_t m_flEncodedController[4]; // 0x0A30
    uint32_t m_bClientSideAnimation; // 0x0AA0
    uint32_t m_nNewSequenceParity; // 0x0AA4
    uint32_t m_nResetEventsParity; // 0x0AA8
    uint32_t m_hLightingOrigin; // 0x0BA0
    uint32_t m_hLightingOriginRelative; // 0x0BA4
    uint32_t m_nMuzzleFlashParity; // 0x0BA8
};

class CTeam {
public:
    void* "player_array"; // 0x0000
    const char* m_szTeamname; // 0x07A8
    uint32_t m_iScore; // 0x07C8
    uint32_t m_iRoundsWon; // 0x07CC
    uint32_t m_iTeamNum; // 0x07DC
};

class CSun {
public:
    float HDRColorScale; // 0x0000
    uint32_t m_clrRender; // 0x0090
    uint32_t m_clrOverlay; // 0x0938
    uint32_t m_nSize; // 0x093C
    uint32_t m_nOverlaySize; // 0x0940
    fVector3 m_vDirection; // 0x0944
    uint32_t m_bOn; // 0x0950
    uint32_t m_nMaterial; // 0x0954
    uint32_t m_nOverlayMaterial; // 0x0958
};

class CParticlePerformanceMonitor // parent CBaseEntity {
public:
    uint32_t movecollide; // 0x0000
    uint32_t movetype; // 0x0000
    uint32_t m_nRenderFX; // 0x008C
    uint32_t m_clrRender; // 0x0090
    uint32_t m_flAnimTime; // 0x00A0
    uint32_t m_flSimulationTime; // 0x00A8
    uint32_t m_ubInterpolationFrame; // 0x00B4
    uint32_t m_fEffects; // 0x00B8
    uint32_t m_nRenderMode; // 0x00BC
    uint32_t m_nModelIndex; // 0x00CC
    uint32_t m_iTeamNum; // 0x00D8
    uint32_t m_PredictableID; // 0x00DC
    uint32_t m_iParentAttachment; // 0x01F6
    uint32_t moveparent; // 0x020C
    fVector3 m_vecMinsPreScaled; // 0x0230
    fVector3 m_vecMaxsPreScaled; // 0x023C
    fVector3 m_vecMins; // 0x0248
    fVector3 m_vecMaxs; // 0x0254
    uint32_t m_usSolidFlags; // 0x0264
    uint32_t m_nSurroundType; // 0x0268
    uint32_t m_nSolidType; // 0x0269
    uint32_t m_triggerBloat; // 0x026A
    uint32_t m_bUniformTriggerBloat; // 0x026B
    fVector3 m_vecSpecifiedSurroundingMinsPreScaled; // 0x026C
    fVector3 m_vecSpecifiedSurroundingMaxsPreScaled; // 0x0278
    fVector3 m_vecSpecifiedSurroundingMins; // 0x0284
    fVector3 m_vecSpecifiedSurroundingMaxs; // 0x0290
    float m_flElasticity; // 0x02F0
    float m_flShadowCastDistance; // 0x02F4
    fVector3 m_vecOrigin; // 0x0428
    fVector3 m_angRotation; // 0x0434
    uint32_t m_CollisionGroup; // 0x0444
    uint32_t m_bIsPlayerSimulated; // 0x0724
    uint32_t m_bSimulatedEveryTick; // 0x0725
    uint32_t m_bAnimatedEveryTick; // 0x0726
    uint32_t m_bAlternateSorting; // 0x0727
    uint32_t m_iTextureFrameIndex; // 0x0728
    uint32_t m_hOwnerEntity; // 0x0734
    uint32_t m_hEffectEntity; // 0x0738
    uint32_t m_bDisplayPerf; // 0x0788
    uint32_t m_bMeasurePerf; // 0x0789
};

class CSpotlightEnd // parent CBaseEntity {
public:
    uint32_t movecollide; // 0x0000
    uint32_t movetype; // 0x0000
    uint32_t m_nRenderFX; // 0x008C
    uint32_t m_clrRender; // 0x0090
    uint32_t m_flAnimTime; // 0x00A0
    uint32_t m_flSimulationTime; // 0x00A8
    uint32_t m_ubInterpolationFrame; // 0x00B4
    uint32_t m_fEffects; // 0x00B8
    uint32_t m_nRenderMode; // 0x00BC
    uint32_t m_nModelIndex; // 0x00CC
    uint32_t m_iTeamNum; // 0x00D8
    uint32_t m_PredictableID; // 0x00DC
    uint32_t m_iParentAttachment; // 0x01F6
    uint32_t moveparent; // 0x020C
    fVector3 m_vecMinsPreScaled; // 0x0230
    fVector3 m_vecMaxsPreScaled; // 0x023C
    fVector3 m_vecMins; // 0x0248
    fVector3 m_vecMaxs; // 0x0254
    uint32_t m_usSolidFlags; // 0x0264
    uint32_t m_nSurroundType; // 0x0268
    uint32_t m_nSolidType; // 0x0269
    uint32_t m_triggerBloat; // 0x026A
    uint32_t m_bUniformTriggerBloat; // 0x026B
    fVector3 m_vecSpecifiedSurroundingMinsPreScaled; // 0x026C
    fVector3 m_vecSpecifiedSurroundingMaxsPreScaled; // 0x0278
    fVector3 m_vecSpecifiedSurroundingMins; // 0x0284
    fVector3 m_vecSpecifiedSurroundingMaxs; // 0x0290
    float m_flElasticity; // 0x02F0
    float m_flShadowCastDistance; // 0x02F4
    fVector3 m_vecOrigin; // 0x0428
    fVector3 m_angRotation; // 0x0434
    uint32_t m_CollisionGroup; // 0x0444
    uint32_t m_bIsPlayerSimulated; // 0x0724
    uint32_t m_bSimulatedEveryTick; // 0x0725
    uint32_t m_bAnimatedEveryTick; // 0x0726
    uint32_t m_bAlternateSorting; // 0x0727
    uint32_t m_iTextureFrameIndex; // 0x0728
    uint32_t m_hOwnerEntity; // 0x0734
    uint32_t m_hEffectEntity; // 0x0738
    float m_flLightScale; // 0x0788
    float m_Radius; // 0x078C
};

class CSlideshowDisplay // parent CBaseEntity {
public:
    uint32_t movecollide; // 0x0000
    uint32_t movetype; // 0x0000
    uint32_t m_nRenderFX; // 0x008C
    uint32_t m_clrRender; // 0x0090
    uint32_t m_flAnimTime; // 0x00A0
    uint32_t m_flSimulationTime; // 0x00A8
    uint32_t m_ubInterpolationFrame; // 0x00B4
    uint32_t m_fEffects; // 0x00B8
    uint32_t m_nRenderMode; // 0x00BC
    uint32_t m_nModelIndex; // 0x00CC
    uint32_t m_iTeamNum; // 0x00D8
    uint32_t m_PredictableID; // 0x00DC
    uint32_t m_iParentAttachment; // 0x01F6
    uint32_t moveparent; // 0x020C
    fVector3 m_vecMinsPreScaled; // 0x0230
    fVector3 m_vecMaxsPreScaled; // 0x023C
    fVector3 m_vecMins; // 0x0248
    fVector3 m_vecMaxs; // 0x0254
    uint32_t m_usSolidFlags; // 0x0264
    uint32_t m_nSurroundType; // 0x0268
    uint32_t m_nSolidType; // 0x0269
    uint32_t m_triggerBloat; // 0x026A
    uint32_t m_bUniformTriggerBloat; // 0x026B
    fVector3 m_vecSpecifiedSurroundingMinsPreScaled; // 0x026C
    fVector3 m_vecSpecifiedSurroundingMaxsPreScaled; // 0x0278
    fVector3 m_vecSpecifiedSurroundingMins; // 0x0284
    fVector3 m_vecSpecifiedSurroundingMaxs; // 0x0290
    float m_flElasticity; // 0x02F0
    float m_flShadowCastDistance; // 0x02F4
    fVector3 m_vecOrigin; // 0x0428
    fVector3 m_angRotation; // 0x0434
    uint32_t m_CollisionGroup; // 0x0444
    uint32_t m_bIsPlayerSimulated; // 0x0724
    uint32_t m_bSimulatedEveryTick; // 0x0725
    uint32_t m_bAnimatedEveryTick; // 0x0726
    uint32_t m_bAlternateSorting; // 0x0727
    uint32_t m_iTextureFrameIndex; // 0x0728
    uint32_t m_hOwnerEntity; // 0x0734
    uint32_t m_hEffectEntity; // 0x0738
    uint32_t m_bEnabled; // 0x0788
    const char* m_szDisplayText; // 0x0789
    const char* m_szSlideshowDirectory; // 0x0809
    uintptr_t m_chCurrentSlideLists[16]; // 0x08B0
    float m_fMinSlideTime; // 0x08C8
    float m_fMaxSlideTime; // 0x08CC
    uint32_t m_iCycleType; // 0x08D4
    uint32_t m_bNoListRepeats; // 0x08D8
};

class CShadowControl // parent CBaseEntity {
public:
    uint32_t movecollide; // 0x0000
    uint32_t movetype; // 0x0000
    uint32_t m_nRenderFX; // 0x008C
    uint32_t m_clrRender; // 0x0090
    uint32_t m_flAnimTime; // 0x00A0
    uint32_t m_flSimulationTime; // 0x00A8
    uint32_t m_ubInterpolationFrame; // 0x00B4
    uint32_t m_fEffects; // 0x00B8
    uint32_t m_nRenderMode; // 0x00BC
    uint32_t m_nModelIndex; // 0x00CC
    uint32_t m_iTeamNum; // 0x00D8
    uint32_t m_PredictableID; // 0x00DC
    uint32_t m_iParentAttachment; // 0x01F6
    uint32_t moveparent; // 0x020C
    fVector3 m_vecMinsPreScaled; // 0x0230
    fVector3 m_vecMaxsPreScaled; // 0x023C
    fVector3 m_vecMins; // 0x0248
    fVector3 m_vecMaxs; // 0x0254
    uint32_t m_usSolidFlags; // 0x0264
    uint32_t m_nSurroundType; // 0x0268
    uint32_t m_nSolidType; // 0x0269
    uint32_t m_triggerBloat; // 0x026A
    uint32_t m_bUniformTriggerBloat; // 0x026B
    fVector3 m_vecSpecifiedSurroundingMinsPreScaled; // 0x026C
    fVector3 m_vecSpecifiedSurroundingMaxsPreScaled; // 0x0278
    fVector3 m_vecSpecifiedSurroundingMins; // 0x0284
    fVector3 m_vecSpecifiedSurroundingMaxs; // 0x0290
    float m_flElasticity; // 0x02F0
    float m_flShadowCastDistance; // 0x02F4
    fVector3 m_vecOrigin; // 0x0428
    fVector3 m_angRotation; // 0x0434
    uint32_t m_CollisionGroup; // 0x0444
    uint32_t m_bIsPlayerSimulated; // 0x0724
    uint32_t m_bSimulatedEveryTick; // 0x0725
    uint32_t m_bAnimatedEveryTick; // 0x0726
    uint32_t m_bAlternateSorting; // 0x0727
    uint32_t m_iTextureFrameIndex; // 0x0728
    uint32_t m_hOwnerEntity; // 0x0734
    uint32_t m_hEffectEntity; // 0x0738
    fVector3 m_shadowDirection; // 0x0788
    uint32_t m_shadowColor; // 0x0794
    float m_flShadowMaxDist; // 0x0798
    uint32_t m_bDisableShadows; // 0x079C
};

class CRopeKeyframe {
public:
    uint32_t m_iParentAttachment; // 0x01F6
    uint32_t moveparent; // 0x020C
    fVector3 m_vecOrigin; // 0x0428
    float m_flScrollSpeed; // 0x07BC
    uint32_t m_RopeFlags; // 0x07C0
    uint32_t m_iRopeMaterialModelIndex; // 0x07C4
    uint32_t m_nSegments; // 0x0AB0
    uint32_t m_hStartPoint; // 0x0AB4
    uint32_t m_hEndPoint; // 0x0AB8
    uint32_t m_iStartAttachment; // 0x0ABC
    uint32_t m_iEndAttachment; // 0x0ABE
    uint32_t m_Subdiv; // 0x0AC0
    uint32_t m_RopeLength; // 0x0AC4
    uint32_t m_Slack; // 0x0AC8
    float m_TextureScale; // 0x0ACC
    uint32_t m_fLockedPoints; // 0x0AD0
    float m_Width; // 0x0AD4
    uint32_t m_bConstrainBetweenEndpoints; // 0x0B68
};

class CRagdollManager {
public:
    uint32_t m_iCurrentMaxRagdollCount; // 0x0788
};

class CPhysBoxMultiplayer // parent CBaseEntity {
public:
    uint32_t movecollide; // 0x0000
    uint32_t movetype; // 0x0000
    uint32_t m_nRenderFX; // 0x008C
    uint32_t m_clrRender; // 0x0090
    uint32_t m_flAnimTime; // 0x00A0
    uint32_t m_flSimulationTime; // 0x00A8
    uint32_t m_ubInterpolationFrame; // 0x00B4
    uint32_t m_fEffects; // 0x00B8
    uint32_t m_nRenderMode; // 0x00BC
    uint32_t m_nModelIndex; // 0x00CC
    uint32_t m_iTeamNum; // 0x00D8
    uint32_t m_PredictableID; // 0x00DC
    uint32_t m_iParentAttachment; // 0x01F6
    uint32_t moveparent; // 0x020C
    fVector3 m_vecMinsPreScaled; // 0x0230
    fVector3 m_vecMaxsPreScaled; // 0x023C
    fVector3 m_vecMins; // 0x0248
    fVector3 m_vecMaxs; // 0x0254
    uint32_t m_usSolidFlags; // 0x0264
    uint32_t m_nSurroundType; // 0x0268
    uint32_t m_nSolidType; // 0x0269
    uint32_t m_triggerBloat; // 0x026A
    uint32_t m_bUniformTriggerBloat; // 0x026B
    fVector3 m_vecSpecifiedSurroundingMinsPreScaled; // 0x026C
    fVector3 m_vecSpecifiedSurroundingMaxsPreScaled; // 0x0278
    fVector3 m_vecSpecifiedSurroundingMins; // 0x0284
    fVector3 m_vecSpecifiedSurroundingMaxs; // 0x0290
    float m_flElasticity; // 0x02F0
    float m_flShadowCastDistance; // 0x02F4
    fVector3 m_vecOrigin; // 0x0428
    fVector3 m_angRotation; // 0x0434
    uint32_t m_CollisionGroup; // 0x0444
    uint32_t m_bIsPlayerSimulated; // 0x0724
    uint32_t m_bSimulatedEveryTick; // 0x0725
    uint32_t m_bAnimatedEveryTick; // 0x0726
    uint32_t m_bAlternateSorting; // 0x0727
    uint32_t m_iTextureFrameIndex; // 0x0728
    uint32_t m_hOwnerEntity; // 0x0734
    uint32_t m_hEffectEntity; // 0x0738
    float m_mass; // 0x0788
    uint32_t m_iPhysicsMode; // 0x0798
    float m_fMass; // 0x079C
};

class CBasePropDoor // parent CBaseEntity {
public:
    uint32_t movetype; // 0x0000
    uint32_t movecollide; // 0x0000
    uint32_t m_nRenderFX; // 0x008C
    uint32_t m_clrRender; // 0x0090
    uint32_t m_flAnimTime; // 0x00A0
    uint32_t m_flSimulationTime; // 0x00A8
    uint32_t m_ubInterpolationFrame; // 0x00B4
    uint32_t m_fEffects; // 0x00B8
    uint32_t m_nRenderMode; // 0x00BC
    uint32_t m_nModelIndex; // 0x00CC
    uint32_t m_iTeamNum; // 0x00D8
    uint32_t m_PredictableID; // 0x00DC
    uint32_t m_iParentAttachment; // 0x01F6
    uint32_t moveparent; // 0x020C
    fVector3 m_vecMinsPreScaled; // 0x0230
    fVector3 m_vecMaxsPreScaled; // 0x023C
    fVector3 m_vecMins; // 0x0248
    fVector3 m_vecMaxs; // 0x0254
    uint32_t m_usSolidFlags; // 0x0264
    uint32_t m_nSurroundType; // 0x0268
    uint32_t m_nSolidType; // 0x0269
    uint32_t m_triggerBloat; // 0x026A
    uint32_t m_bUniformTriggerBloat; // 0x026B
    fVector3 m_vecSpecifiedSurroundingMinsPreScaled; // 0x026C
    fVector3 m_vecSpecifiedSurroundingMaxsPreScaled; // 0x0278
    fVector3 m_vecSpecifiedSurroundingMins; // 0x0284
    fVector3 m_vecSpecifiedSurroundingMaxs; // 0x0290
    float m_flElasticity; // 0x02F0
    float m_flShadowCastDistance; // 0x02F4
    fVector3 m_vecOrigin; // 0x0428
    fVector3 m_angRotation; // 0x0434
    uint32_t m_CollisionGroup; // 0x0444
    uint32_t m_bIsPlayerSimulated; // 0x0724
    uint32_t m_bSimulatedEveryTick; // 0x0725
    uint32_t m_bAnimatedEveryTick; // 0x0726
    uint32_t m_bAlternateSorting; // 0x0727
    uint32_t m_iTextureFrameIndex; // 0x0728
    uint32_t m_hOwnerEntity; // 0x0734
    uint32_t m_hEffectEntity; // 0x0738
    uint32_t m_nSkin; // 0x0798
    uint32_t m_nBody; // 0x079C
    uint32_t m_nHitboxSet; // 0x07A0
    float m_flPlaybackRate; // 0x07D4
    fVector3 m_vecForce; // 0x07E8
    uint32_t m_nForceBone; // 0x07F4
    uint32_t m_bClientSideFrameReset; // 0x0834
    float m_fadeMinDist; // 0x0878
    float m_fadeMaxDist; // 0x087C
    float m_flFadeScale; // 0x0880
    float m_flModelScale; // 0x08E4
    float m_flModelWidthScale; // 0x08E4
    uintptr_t m_flPoseParameter[24]; // 0x08E8
    uintptr_t m_flEncodedController[4]; // 0x0A30
    uint32_t m_bClientSideAnimation; // 0x0AA0
    uint32_t m_nNewSequenceParity; // 0x0AA4
    uint32_t m_nResetEventsParity; // 0x0AA8
    uint32_t m_nSequence; // 0x0AD0
    float m_flCycle; // 0x0AD8
    uint32_t m_hLightingOrigin; // 0x0BA0
    uint32_t m_hLightingOriginRelative; // 0x0BA4
    uint32_t m_nMuzzleFlashParity; // 0x0BA8
    uint32_t m_bUseHitboxesForRenderBox; // 0x0BE0
};

class CDynamicProp // parent CBaseEntity {
public:
    uint32_t movetype; // 0x0000
    uint32_t movecollide; // 0x0000
    uint32_t m_nRenderFX; // 0x008C
    uint32_t m_clrRender; // 0x0090
    uint32_t m_flAnimTime; // 0x00A0
    uint32_t m_flSimulationTime; // 0x00A8
    uint32_t m_ubInterpolationFrame; // 0x00B4
    uint32_t m_fEffects; // 0x00B8
    uint32_t m_nRenderMode; // 0x00BC
    uint32_t m_nModelIndex; // 0x00CC
    uint32_t m_iTeamNum; // 0x00D8
    uint32_t m_PredictableID; // 0x00DC
    uint32_t m_iParentAttachment; // 0x01F6
    uint32_t moveparent; // 0x020C
    fVector3 m_vecMinsPreScaled; // 0x0230
    fVector3 m_vecMaxsPreScaled; // 0x023C
    fVector3 m_vecMins; // 0x0248
    fVector3 m_vecMaxs; // 0x0254
    uint32_t m_usSolidFlags; // 0x0264
    uint32_t m_nSurroundType; // 0x0268
    uint32_t m_nSolidType; // 0x0269
    uint32_t m_triggerBloat; // 0x026A
    uint32_t m_bUniformTriggerBloat; // 0x026B
    fVector3 m_vecSpecifiedSurroundingMinsPreScaled; // 0x026C
    fVector3 m_vecSpecifiedSurroundingMaxsPreScaled; // 0x0278
    fVector3 m_vecSpecifiedSurroundingMins; // 0x0284
    fVector3 m_vecSpecifiedSurroundingMaxs; // 0x0290
    float m_flElasticity; // 0x02F0
    float m_flShadowCastDistance; // 0x02F4
    fVector3 m_vecOrigin; // 0x0428
    fVector3 m_angRotation; // 0x0434
    uint32_t m_CollisionGroup; // 0x0444
    uint32_t m_bIsPlayerSimulated; // 0x0724
    uint32_t m_bSimulatedEveryTick; // 0x0725
    uint32_t m_bAnimatedEveryTick; // 0x0726
    uint32_t m_bAlternateSorting; // 0x0727
    uint32_t m_iTextureFrameIndex; // 0x0728
    uint32_t m_hOwnerEntity; // 0x0734
    uint32_t m_hEffectEntity; // 0x0738
    uint32_t m_nSkin; // 0x0798
    uint32_t m_nBody; // 0x079C
    uint32_t m_nHitboxSet; // 0x07A0
    float m_flPlaybackRate; // 0x07D4
    fVector3 m_vecForce; // 0x07E8
    uint32_t m_nForceBone; // 0x07F4
    uint32_t m_bClientSideFrameReset; // 0x0834
    float m_fadeMinDist; // 0x0878
    float m_fadeMaxDist; // 0x087C
    float m_flFadeScale; // 0x0880
    float m_flModelScale; // 0x08E4
    float m_flModelWidthScale; // 0x08E4
    uintptr_t m_flPoseParameter[24]; // 0x08E8
    uintptr_t m_flEncodedController[4]; // 0x0A30
    uint32_t m_bClientSideAnimation; // 0x0AA0
    uint32_t m_nNewSequenceParity; // 0x0AA4
    uint32_t m_nResetEventsParity; // 0x0AA8
    uint32_t m_nSequence; // 0x0AD0
    float m_flCycle; // 0x0AD8
    uint32_t m_hLightingOrigin; // 0x0BA0
    uint32_t m_hLightingOriginRelative; // 0x0BA4
    uint32_t m_nMuzzleFlashParity; // 0x0BA8
    uint32_t m_bUseHitboxesForRenderBox; // 0x0BE0
};

class CPointWorldText // parent CBaseEntity {
public:
    uint32_t movetype; // 0x0000
    uint32_t movecollide; // 0x0000
    uint32_t m_nRenderFX; // 0x008C
    uint32_t m_clrRender; // 0x0090
    uint32_t m_flAnimTime; // 0x00A0
    uint32_t m_flSimulationTime; // 0x00A8
    uint32_t m_ubInterpolationFrame; // 0x00B4
    uint32_t m_fEffects; // 0x00B8
    uint32_t m_nRenderMode; // 0x00BC
    uint32_t m_nModelIndex; // 0x00CC
    uint32_t m_iTeamNum; // 0x00D8
    uint32_t m_PredictableID; // 0x00DC
    uint32_t m_iParentAttachment; // 0x01F6
    uint32_t moveparent; // 0x020C
    fVector3 m_vecMinsPreScaled; // 0x0230
    fVector3 m_vecMaxsPreScaled; // 0x023C
    fVector3 m_vecMins; // 0x0248
    fVector3 m_vecMaxs; // 0x0254
    uint32_t m_usSolidFlags; // 0x0264
    uint32_t m_nSurroundType; // 0x0268
    uint32_t m_nSolidType; // 0x0269
    uint32_t m_triggerBloat; // 0x026A
    uint32_t m_bUniformTriggerBloat; // 0x026B
    fVector3 m_vecSpecifiedSurroundingMinsPreScaled; // 0x026C
    fVector3 m_vecSpecifiedSurroundingMaxsPreScaled; // 0x0278
    fVector3 m_vecSpecifiedSurroundingMins; // 0x0284
    fVector3 m_vecSpecifiedSurroundingMaxs; // 0x0290
    float m_flElasticity; // 0x02F0
    float m_flShadowCastDistance; // 0x02F4
    fVector3 m_vecOrigin; // 0x0428
    fVector3 m_angRotation; // 0x0434
    uint32_t m_CollisionGroup; // 0x0444
    uint32_t m_bIsPlayerSimulated; // 0x0724
    uint32_t m_bSimulatedEveryTick; // 0x0725
    uint32_t m_bAnimatedEveryTick; // 0x0726
    uint32_t m_bAlternateSorting; // 0x0727
    uint32_t m_iTextureFrameIndex; // 0x0728
    uint32_t m_hOwnerEntity; // 0x0734
    uint32_t m_hEffectEntity; // 0x0738
    const char* m_szText; // 0x07A0
    float m_flTextSize; // 0x08A4
    float m_flTextSpacingX; // 0x08A8
    float m_flTextSpacingY; // 0x08AC
    uint32_t m_colTextColor; // 0x08B0
    uint32_t m_nOrientation; // 0x08B4
    uint32_t m_nFont; // 0x08BC
    uint32_t m_bRainbow; // 0x08C0
};

class CPointCommentaryNode // parent CBaseEntity {
public:
    uint32_t movecollide; // 0x0000
    uint32_t movetype; // 0x0000
    uint32_t m_nRenderFX; // 0x008C
    uint32_t m_clrRender; // 0x0090
    uint32_t m_flAnimTime; // 0x00A0
    uint32_t m_flSimulationTime; // 0x00A8
    uint32_t m_ubInterpolationFrame; // 0x00B4
    uint32_t m_fEffects; // 0x00B8
    uint32_t m_nRenderMode; // 0x00BC
    uint32_t m_nModelIndex; // 0x00CC
    uint32_t m_iTeamNum; // 0x00D8
    uint32_t m_PredictableID; // 0x00DC
    uint32_t m_iParentAttachment; // 0x01F6
    uint32_t moveparent; // 0x020C
    fVector3 m_vecMinsPreScaled; // 0x0230
    fVector3 m_vecMaxsPreScaled; // 0x023C
    fVector3 m_vecMins; // 0x0248
    fVector3 m_vecMaxs; // 0x0254
    uint32_t m_usSolidFlags; // 0x0264
    uint32_t m_nSurroundType; // 0x0268
    uint32_t m_nSolidType; // 0x0269
    uint32_t m_triggerBloat; // 0x026A
    uint32_t m_bUniformTriggerBloat; // 0x026B
    fVector3 m_vecSpecifiedSurroundingMinsPreScaled; // 0x026C
    fVector3 m_vecSpecifiedSurroundingMaxsPreScaled; // 0x0278
    fVector3 m_vecSpecifiedSurroundingMins; // 0x0284
    fVector3 m_vecSpecifiedSurroundingMaxs; // 0x0290
    float m_flElasticity; // 0x02F0
    float m_flShadowCastDistance; // 0x02F4
    fVector3 m_vecOrigin; // 0x0428
    fVector3 m_angRotation; // 0x0434
    uint32_t m_CollisionGroup; // 0x0444
    uint32_t m_bIsPlayerSimulated; // 0x0724
    uint32_t m_bSimulatedEveryTick; // 0x0725
    uint32_t m_bAnimatedEveryTick; // 0x0726
    uint32_t m_bAlternateSorting; // 0x0727
    uint32_t m_iTextureFrameIndex; // 0x0728
    uint32_t m_hOwnerEntity; // 0x0734
    uint32_t m_hEffectEntity; // 0x0738
    uint32_t m_nSkin; // 0x0798
    uint32_t m_nBody; // 0x079C
    uint32_t m_nHitboxSet; // 0x07A0
    float m_flPlaybackRate; // 0x07D4
    fVector3 m_vecForce; // 0x07E8
    uint32_t m_nForceBone; // 0x07F4
    uint32_t m_bClientSideFrameReset; // 0x0834
    float m_fadeMinDist; // 0x0878
    float m_fadeMaxDist; // 0x087C
    float m_flFadeScale; // 0x0880
    float m_flModelScale; // 0x08E4
    float m_flModelWidthScale; // 0x08E4
    uintptr_t m_flPoseParameter[24]; // 0x08E8
    uintptr_t m_flEncodedController[4]; // 0x0A30
    uint32_t m_bClientSideAnimation; // 0x0AA0
    uint32_t m_nNewSequenceParity; // 0x0AA4
    uint32_t m_nResetEventsParity; // 0x0AA8
    uint32_t m_nSequence; // 0x0AD0
    float m_flCycle; // 0x0AD8
    uint32_t m_hLightingOrigin; // 0x0BA0
    uint32_t m_hLightingOriginRelative; // 0x0BA4
    uint32_t m_nMuzzleFlashParity; // 0x0BA8
    uint32_t m_bActive; // 0x0BE0
    float m_flStartTime; // 0x0BE4
    const char* m_iszCommentaryFile; // 0x0BE8
    const char* m_iszCommentaryFileNoHDR; // 0x0CEC
    const char* m_iszSpeakers; // 0x0DF0
    uint32_t m_iNodeNumber; // 0x0EF0
    uint32_t m_iNodeNumberMax; // 0x0EF4
    uint32_t m_hViewPosition; // 0x0F00
};

class CPointCamera // parent CBaseEntity {
public:
    uint32_t movetype; // 0x0000
    uint32_t movecollide; // 0x0000
    uint32_t m_nRenderFX; // 0x008C
    uint32_t m_clrRender; // 0x0090
    uint32_t m_flAnimTime; // 0x00A0
    uint32_t m_flSimulationTime; // 0x00A8
    uint32_t m_ubInterpolationFrame; // 0x00B4
    uint32_t m_fEffects; // 0x00B8
    uint32_t m_nRenderMode; // 0x00BC
    uint32_t m_nModelIndex; // 0x00CC
    uint32_t m_iTeamNum; // 0x00D8
    uint32_t m_PredictableID; // 0x00DC
    uint32_t m_iParentAttachment; // 0x01F6
    uint32_t moveparent; // 0x020C
    fVector3 m_vecMinsPreScaled; // 0x0230
    fVector3 m_vecMaxsPreScaled; // 0x023C
    fVector3 m_vecMins; // 0x0248
    fVector3 m_vecMaxs; // 0x0254
    uint32_t m_usSolidFlags; // 0x0264
    uint32_t m_nSurroundType; // 0x0268
    uint32_t m_nSolidType; // 0x0269
    uint32_t m_triggerBloat; // 0x026A
    uint32_t m_bUniformTriggerBloat; // 0x026B
    fVector3 m_vecSpecifiedSurroundingMinsPreScaled; // 0x026C
    fVector3 m_vecSpecifiedSurroundingMaxsPreScaled; // 0x0278
    fVector3 m_vecSpecifiedSurroundingMins; // 0x0284
    fVector3 m_vecSpecifiedSurroundingMaxs; // 0x0290
    float m_flElasticity; // 0x02F0
    float m_flShadowCastDistance; // 0x02F4
    fVector3 m_vecOrigin; // 0x0428
    fVector3 m_angRotation; // 0x0434
    uint32_t m_CollisionGroup; // 0x0444
    uint32_t m_bIsPlayerSimulated; // 0x0724
    uint32_t m_bSimulatedEveryTick; // 0x0725
    uint32_t m_bAnimatedEveryTick; // 0x0726
    uint32_t m_bAlternateSorting; // 0x0727
    uint32_t m_iTextureFrameIndex; // 0x0728
    uint32_t m_hOwnerEntity; // 0x0734
    uint32_t m_hEffectEntity; // 0x0738
    float m_FOV; // 0x0788
    float m_Resolution; // 0x078C
    uint32_t m_bFogEnable; // 0x0790
    uint32_t m_FogColor; // 0x0791
    float m_flFogStart; // 0x0798
    float m_flFogEnd; // 0x079C
    float m_flFogMaxDensity; // 0x07A0
    uint32_t m_bFogRadial; // 0x07A4
    uint32_t m_bActive; // 0x07A5
    uint32_t m_bUseScreenAspectRatio; // 0x07A6
};

class CPlayerResource {
public:
    uintptr_t m_iPing[66]; // 0x09A0
    uintptr_t m_iScore[66]; // 0x0AA8
    uintptr_t m_iDeaths[66]; // 0x0BB0
    uintptr_t m_bConnected[66]; // 0x0CB8
    uintptr_t m_iTeam[66]; // 0x0CFC
    uintptr_t m_bAlive[66]; // 0x0E04
    uintptr_t m_iHealth[66]; // 0x0E48
    uintptr_t m_iAccountID[66]; // 0x0FD0
    uintptr_t m_bValid[66]; // 0x10D8
    uintptr_t m_iUserID[66]; // 0x111C
};

class CPlasma // parent CBaseEntity {
public:
    uint32_t movecollide; // 0x0000
    uint32_t movetype; // 0x0000
    uint32_t m_nRenderFX; // 0x008C
    uint32_t m_clrRender; // 0x0090
    uint32_t m_flAnimTime; // 0x00A0
    uint32_t m_flSimulationTime; // 0x00A8
    uint32_t m_ubInterpolationFrame; // 0x00B4
    uint32_t m_fEffects; // 0x00B8
    uint32_t m_nRenderMode; // 0x00BC
    uint32_t m_nModelIndex; // 0x00CC
    uint32_t m_iTeamNum; // 0x00D8
    uint32_t m_PredictableID; // 0x00DC
    uint32_t m_iParentAttachment; // 0x01F6
    uint32_t moveparent; // 0x020C
    fVector3 m_vecMinsPreScaled; // 0x0230
    fVector3 m_vecMaxsPreScaled; // 0x023C
    fVector3 m_vecMins; // 0x0248
    fVector3 m_vecMaxs; // 0x0254
    uint32_t m_usSolidFlags; // 0x0264
    uint32_t m_nSurroundType; // 0x0268
    uint32_t m_nSolidType; // 0x0269
    uint32_t m_triggerBloat; // 0x026A
    uint32_t m_bUniformTriggerBloat; // 0x026B
    fVector3 m_vecSpecifiedSurroundingMinsPreScaled; // 0x026C
    fVector3 m_vecSpecifiedSurroundingMaxsPreScaled; // 0x0278
    fVector3 m_vecSpecifiedSurroundingMins; // 0x0284
    fVector3 m_vecSpecifiedSurroundingMaxs; // 0x0290
    float m_flElasticity; // 0x02F0
    float m_flShadowCastDistance; // 0x02F4
    fVector3 m_vecOrigin; // 0x0428
    fVector3 m_angRotation; // 0x0434
    uint32_t m_CollisionGroup; // 0x0444
    uint32_t m_bIsPlayerSimulated; // 0x0724
    uint32_t m_bSimulatedEveryTick; // 0x0725
    uint32_t m_bAnimatedEveryTick; // 0x0726
    uint32_t m_bAlternateSorting; // 0x0727
    uint32_t m_iTextureFrameIndex; // 0x0728
    uint32_t m_hOwnerEntity; // 0x0734
    uint32_t m_hEffectEntity; // 0x0738
    float m_flStartScale; // 0x0788
    float m_flScale; // 0x078C
    float m_flScaleTime; // 0x0790
    uint32_t m_nFlags; // 0x0794
    uint32_t m_nPlasmaModelIndex; // 0x0798
    uint32_t m_nPlasmaModelIndex2; // 0x079C
    uint32_t m_nGlowModelIndex; // 0x07A0
};

class CPhysMagnet // parent CBaseEntity {
public:
    uint32_t movetype; // 0x0000
    uint32_t movecollide; // 0x0000
    uint32_t m_nRenderFX; // 0x008C
    uint32_t m_clrRender; // 0x0090
    uint32_t m_flAnimTime; // 0x00A0
    uint32_t m_flSimulationTime; // 0x00A8
    uint32_t m_ubInterpolationFrame; // 0x00B4
    uint32_t m_fEffects; // 0x00B8
    uint32_t m_nRenderMode; // 0x00BC
    uint32_t m_nModelIndex; // 0x00CC
    uint32_t m_iTeamNum; // 0x00D8
    uint32_t m_PredictableID; // 0x00DC
    uint32_t m_iParentAttachment; // 0x01F6
    uint32_t moveparent; // 0x020C
    fVector3 m_vecMinsPreScaled; // 0x0230
    fVector3 m_vecMaxsPreScaled; // 0x023C
    fVector3 m_vecMins; // 0x0248
    fVector3 m_vecMaxs; // 0x0254
    uint32_t m_usSolidFlags; // 0x0264
    uint32_t m_nSurroundType; // 0x0268
    uint32_t m_nSolidType; // 0x0269
    uint32_t m_triggerBloat; // 0x026A
    uint32_t m_bUniformTriggerBloat; // 0x026B
    fVector3 m_vecSpecifiedSurroundingMinsPreScaled; // 0x026C
    fVector3 m_vecSpecifiedSurroundingMaxsPreScaled; // 0x0278
    fVector3 m_vecSpecifiedSurroundingMins; // 0x0284
    fVector3 m_vecSpecifiedSurroundingMaxs; // 0x0290
    float m_flElasticity; // 0x02F0
    float m_flShadowCastDistance; // 0x02F4
    fVector3 m_vecOrigin; // 0x0428
    fVector3 m_angRotation; // 0x0434
    uint32_t m_CollisionGroup; // 0x0444
    uint32_t m_bIsPlayerSimulated; // 0x0724
    uint32_t m_bSimulatedEveryTick; // 0x0725
    uint32_t m_bAnimatedEveryTick; // 0x0726
    uint32_t m_bAlternateSorting; // 0x0727
    uint32_t m_iTextureFrameIndex; // 0x0728
    uint32_t m_hOwnerEntity; // 0x0734
    uint32_t m_hEffectEntity; // 0x0738
    uint32_t m_nSkin; // 0x0798
    uint32_t m_nBody; // 0x079C
    uint32_t m_nHitboxSet; // 0x07A0
    float m_flPlaybackRate; // 0x07D4
    fVector3 m_vecForce; // 0x07E8
    uint32_t m_nForceBone; // 0x07F4
    uint32_t m_bClientSideFrameReset; // 0x0834
    float m_fadeMinDist; // 0x0878
    float m_fadeMaxDist; // 0x087C
    float m_flFadeScale; // 0x0880
    float m_flModelScale; // 0x08E4
    float m_flModelWidthScale; // 0x08E4
    uintptr_t m_flPoseParameter[24]; // 0x08E8
    uintptr_t m_flEncodedController[4]; // 0x0A30
    uint32_t m_bClientSideAnimation; // 0x0AA0
    uint32_t m_nNewSequenceParity; // 0x0AA4
    uint32_t m_nResetEventsParity; // 0x0AA8
    uint32_t m_nSequence; // 0x0AD0
    float m_flCycle; // 0x0AD8
    uint32_t m_hLightingOrigin; // 0x0BA0
    uint32_t m_hLightingOriginRelative; // 0x0BA4
    uint32_t m_nMuzzleFlashParity; // 0x0BA8
};

class CPhysicsProp // parent CBaseEntity {
public:
    uint32_t movetype; // 0x0000
    uint32_t movecollide; // 0x0000
    uint32_t m_nRenderFX; // 0x008C
    uint32_t m_clrRender; // 0x0090
    uint32_t m_flAnimTime; // 0x00A0
    uint32_t m_flSimulationTime; // 0x00A8
    uint32_t m_ubInterpolationFrame; // 0x00B4
    uint32_t m_fEffects; // 0x00B8
    uint32_t m_nRenderMode; // 0x00BC
    uint32_t m_nModelIndex; // 0x00CC
    uint32_t m_iTeamNum; // 0x00D8
    uint32_t m_PredictableID; // 0x00DC
    uint32_t m_iParentAttachment; // 0x01F6
    uint32_t moveparent; // 0x020C
    fVector3 m_vecMinsPreScaled; // 0x0230
    fVector3 m_vecMaxsPreScaled; // 0x023C
    fVector3 m_vecMins; // 0x0248
    fVector3 m_vecMaxs; // 0x0254
    uint32_t m_usSolidFlags; // 0x0264
    uint32_t m_nSurroundType; // 0x0268
    uint32_t m_nSolidType; // 0x0269
    uint32_t m_triggerBloat; // 0x026A
    uint32_t m_bUniformTriggerBloat; // 0x026B
    fVector3 m_vecSpecifiedSurroundingMinsPreScaled; // 0x026C
    fVector3 m_vecSpecifiedSurroundingMaxsPreScaled; // 0x0278
    fVector3 m_vecSpecifiedSurroundingMins; // 0x0284
    fVector3 m_vecSpecifiedSurroundingMaxs; // 0x0290
    float m_flElasticity; // 0x02F0
    float m_flShadowCastDistance; // 0x02F4
    fVector3 m_vecOrigin; // 0x0428
    fVector3 m_angRotation; // 0x0434
    uint32_t m_CollisionGroup; // 0x0444
    uint32_t m_bIsPlayerSimulated; // 0x0724
    uint32_t m_bSimulatedEveryTick; // 0x0725
    uint32_t m_bAnimatedEveryTick; // 0x0726
    uint32_t m_bAlternateSorting; // 0x0727
    uint32_t m_iTextureFrameIndex; // 0x0728
    uint32_t m_hOwnerEntity; // 0x0734
    uint32_t m_hEffectEntity; // 0x0738
    uint32_t m_nSkin; // 0x0798
    uint32_t m_nBody; // 0x079C
    uint32_t m_nHitboxSet; // 0x07A0
    float m_flPlaybackRate; // 0x07D4
    fVector3 m_vecForce; // 0x07E8
    uint32_t m_nForceBone; // 0x07F4
    uint32_t m_bClientSideFrameReset; // 0x0834
    float m_fadeMinDist; // 0x0878
    float m_fadeMaxDist; // 0x087C
    float m_flFadeScale; // 0x0880
    float m_flModelWidthScale; // 0x08E4
    float m_flModelScale; // 0x08E4
    uintptr_t m_flPoseParameter[24]; // 0x08E8
    uintptr_t m_flEncodedController[4]; // 0x0A30
    uint32_t m_bClientSideAnimation; // 0x0AA0
    uint32_t m_nNewSequenceParity; // 0x0AA4
    uint32_t m_nResetEventsParity; // 0x0AA8
    uint32_t m_nSequence; // 0x0AD0
    float m_flCycle; // 0x0AD8
    uint32_t m_hLightingOrigin; // 0x0BA0
    uint32_t m_hLightingOriginRelative; // 0x0BA4
    uint32_t m_nMuzzleFlashParity; // 0x0BA8
    uint32_t m_bAwake; // 0x0BE0
};

class CPhysBox // parent CBaseEntity {
public:
    uint32_t movecollide; // 0x0000
    uint32_t movetype; // 0x0000
    uint32_t m_nRenderFX; // 0x008C
    uint32_t m_clrRender; // 0x0090
    uint32_t m_flAnimTime; // 0x00A0
    uint32_t m_flSimulationTime; // 0x00A8
    uint32_t m_ubInterpolationFrame; // 0x00B4
    uint32_t m_fEffects; // 0x00B8
    uint32_t m_nRenderMode; // 0x00BC
    uint32_t m_nModelIndex; // 0x00CC
    uint32_t m_iTeamNum; // 0x00D8
    uint32_t m_PredictableID; // 0x00DC
    uint32_t m_iParentAttachment; // 0x01F6
    uint32_t moveparent; // 0x020C
    fVector3 m_vecMinsPreScaled; // 0x0230
    fVector3 m_vecMaxsPreScaled; // 0x023C
    fVector3 m_vecMins; // 0x0248
    fVector3 m_vecMaxs; // 0x0254
    uint32_t m_usSolidFlags; // 0x0264
    uint32_t m_nSurroundType; // 0x0268
    uint32_t m_nSolidType; // 0x0269
    uint32_t m_triggerBloat; // 0x026A
    uint32_t m_bUniformTriggerBloat; // 0x026B
    fVector3 m_vecSpecifiedSurroundingMinsPreScaled; // 0x026C
    fVector3 m_vecSpecifiedSurroundingMaxsPreScaled; // 0x0278
    fVector3 m_vecSpecifiedSurroundingMins; // 0x0284
    fVector3 m_vecSpecifiedSurroundingMaxs; // 0x0290
    float m_flElasticity; // 0x02F0
    float m_flShadowCastDistance; // 0x02F4
    fVector3 m_vecOrigin; // 0x0428
    fVector3 m_angRotation; // 0x0434
    uint32_t m_CollisionGroup; // 0x0444
    uint32_t m_bIsPlayerSimulated; // 0x0724
    uint32_t m_bSimulatedEveryTick; // 0x0725
    uint32_t m_bAnimatedEveryTick; // 0x0726
    uint32_t m_bAlternateSorting; // 0x0727
    uint32_t m_iTextureFrameIndex; // 0x0728
    uint32_t m_hOwnerEntity; // 0x0734
    uint32_t m_hEffectEntity; // 0x0738
    float m_mass; // 0x0788
};

class CParticleSystem {
public:
    uint32_t m_iParentAttachment; // 0x01F6
    uint32_t moveparent; // 0x020C
    fVector3 m_vecOrigin; // 0x0428
    fVector3 m_angRotation; // 0x0434
    uint32_t m_hOwnerEntity; // 0x0734
    uint32_t m_iEffectIndex; // 0x0788
    uint32_t m_bActive; // 0x078C
    float m_flStartTime; // 0x0790
    uintptr_t m_hControlPointEnts[63]; // 0x0794
    uintptr_t m_iControlPointParents[63]; // 0x0890
    uint32_t m_bWeatherEffect; // 0x08CF
};

class CMaterialModifyControl // parent CBaseEntity {
public:
    uint32_t movetype; // 0x0000
    uint32_t movecollide; // 0x0000
    uint32_t m_nRenderFX; // 0x008C
    uint32_t m_clrRender; // 0x0090
    uint32_t m_flAnimTime; // 0x00A0
    uint32_t m_flSimulationTime; // 0x00A8
    uint32_t m_ubInterpolationFrame; // 0x00B4
    uint32_t m_fEffects; // 0x00B8
    uint32_t m_nRenderMode; // 0x00BC
    uint32_t m_nModelIndex; // 0x00CC
    uint32_t m_iTeamNum; // 0x00D8
    uint32_t m_PredictableID; // 0x00DC
    uint32_t m_iParentAttachment; // 0x01F6
    uint32_t moveparent; // 0x020C
    fVector3 m_vecMinsPreScaled; // 0x0230
    fVector3 m_vecMaxsPreScaled; // 0x023C
    fVector3 m_vecMins; // 0x0248
    fVector3 m_vecMaxs; // 0x0254
    uint32_t m_usSolidFlags; // 0x0264
    uint32_t m_nSurroundType; // 0x0268
    uint32_t m_nSolidType; // 0x0269
    uint32_t m_triggerBloat; // 0x026A
    uint32_t m_bUniformTriggerBloat; // 0x026B
    fVector3 m_vecSpecifiedSurroundingMinsPreScaled; // 0x026C
    fVector3 m_vecSpecifiedSurroundingMaxsPreScaled; // 0x0278
    fVector3 m_vecSpecifiedSurroundingMins; // 0x0284
    fVector3 m_vecSpecifiedSurroundingMaxs; // 0x0290
    float m_flElasticity; // 0x02F0
    float m_flShadowCastDistance; // 0x02F4
    fVector3 m_vecOrigin; // 0x0428
    fVector3 m_angRotation; // 0x0434
    uint32_t m_CollisionGroup; // 0x0444
    uint32_t m_bIsPlayerSimulated; // 0x0724
    uint32_t m_bSimulatedEveryTick; // 0x0725
    uint32_t m_bAnimatedEveryTick; // 0x0726
    uint32_t m_bAlternateSorting; // 0x0727
    uint32_t m_iTextureFrameIndex; // 0x0728
    uint32_t m_hOwnerEntity; // 0x0734
    uint32_t m_hEffectEntity; // 0x0738
    const char* m_szMaterialName; // 0x0788
    const char* m_szMaterialVar; // 0x0887
    const char* m_szMaterialVarValue; // 0x0986
    uint32_t m_iFrameStart; // 0x0A94
    uint32_t m_iFrameEnd; // 0x0A98
    uint32_t m_bWrap; // 0x0A9C
    float m_flFramerate; // 0x0AA0
    uint32_t m_bNewAnimCommandsSemaphore; // 0x0AA4
    float m_flFloatLerpStartValue; // 0x0AA8
    float m_flFloatLerpEndValue; // 0x0AAC
    float m_flFloatLerpTransitionTime; // 0x0AB0
    uint32_t m_bFloatLerpWrap; // 0x0AB4
    uint32_t m_nModifyMode; // 0x0ABC
};

class CLightGlow {
public:
    float HDRColorScale; // 0x0000
    uint32_t m_clrRender; // 0x0090
    uint32_t moveparent; // 0x020C
    fVector3 m_vecOrigin; // 0x0428
    fVector3 m_angRotation; // 0x0434
    uint32_t m_nHorizontalSize; // 0x0788
    uint32_t m_nVerticalSize; // 0x078C
    uint32_t m_nMinDist; // 0x0790
    uint32_t m_nMaxDist; // 0x0794
    uint32_t m_nOuterMaxDist; // 0x0798
    uint32_t m_spawnflags; // 0x079C
    float m_flGlowProxySize; // 0x0898
};

class CInfoOverlayAccessor {
public:
    uint32_t m_iTextureFrameIndex; // 0x0728
    uint32_t m_iOverlayID; // 0x0788
};

class CFuncRotating // parent CBaseEntity {
public:
    uint32_t movecollide; // 0x0000
    uint32_t movetype; // 0x0000
    uint32_t m_nRenderFX; // 0x008C
    uint32_t m_clrRender; // 0x0090
    uint32_t m_flAnimTime; // 0x00A0
    uint32_t m_flSimulationTime; // 0x00A8
    uint32_t m_ubInterpolationFrame; // 0x00B4
    uint32_t m_fEffects; // 0x00B8
    uint32_t m_nRenderMode; // 0x00BC
    uint32_t m_nModelIndex; // 0x00CC
    uint32_t m_iTeamNum; // 0x00D8
    uint32_t m_PredictableID; // 0x00DC
    uint32_t m_iParentAttachment; // 0x01F6
    uint32_t moveparent; // 0x020C
    fVector3 m_vecMinsPreScaled; // 0x0230
    fVector3 m_vecMaxsPreScaled; // 0x023C
    fVector3 m_vecMins; // 0x0248
    fVector3 m_vecMaxs; // 0x0254
    uint32_t m_usSolidFlags; // 0x0264
    uint32_t m_nSurroundType; // 0x0268
    uint32_t m_nSolidType; // 0x0269
    uint32_t m_triggerBloat; // 0x026A
    uint32_t m_bUniformTriggerBloat; // 0x026B
    fVector3 m_vecSpecifiedSurroundingMinsPreScaled; // 0x026C
    fVector3 m_vecSpecifiedSurroundingMaxsPreScaled; // 0x0278
    fVector3 m_vecSpecifiedSurroundingMins; // 0x0284
    fVector3 m_vecSpecifiedSurroundingMaxs; // 0x0290
    float m_flElasticity; // 0x02F0
    float m_flShadowCastDistance; // 0x02F4
    fVector3 m_vecOrigin; // 0x0428
    fVector3 m_angRotation; // 0x0434
    float m_angRotation[0]; // 0x0434
    float m_angRotation[1]; // 0x0438
    float m_angRotation[2]; // 0x043C
    uint32_t m_CollisionGroup; // 0x0444
    uint32_t m_bIsPlayerSimulated; // 0x0724
    uint32_t m_bSimulatedEveryTick; // 0x0725
    uint32_t m_bAnimatedEveryTick; // 0x0726
    uint32_t m_bAlternateSorting; // 0x0727
    uint32_t m_iTextureFrameIndex; // 0x0728
    uint32_t m_hOwnerEntity; // 0x0734
    uint32_t m_hEffectEntity; // 0x0738
};

class CFuncReflectiveGlass // parent CBaseEntity {
public:
    uint32_t movecollide; // 0x0000
    uint32_t movetype; // 0x0000
    uint32_t m_nRenderFX; // 0x008C
    uint32_t m_clrRender; // 0x0090
    uint32_t m_flAnimTime; // 0x00A0
    uint32_t m_flSimulationTime; // 0x00A8
    uint32_t m_ubInterpolationFrame; // 0x00B4
    uint32_t m_fEffects; // 0x00B8
    uint32_t m_nRenderMode; // 0x00BC
    uint32_t m_nModelIndex; // 0x00CC
    uint32_t m_iTeamNum; // 0x00D8
    uint32_t m_PredictableID; // 0x00DC
    uint32_t m_iParentAttachment; // 0x01F6
    uint32_t moveparent; // 0x020C
    fVector3 m_vecMinsPreScaled; // 0x0230
    fVector3 m_vecMaxsPreScaled; // 0x023C
    fVector3 m_vecMins; // 0x0248
    fVector3 m_vecMaxs; // 0x0254
    uint32_t m_usSolidFlags; // 0x0264
    uint32_t m_nSurroundType; // 0x0268
    uint32_t m_nSolidType; // 0x0269
    uint32_t m_triggerBloat; // 0x026A
    uint32_t m_bUniformTriggerBloat; // 0x026B
    fVector3 m_vecSpecifiedSurroundingMinsPreScaled; // 0x026C
    fVector3 m_vecSpecifiedSurroundingMaxsPreScaled; // 0x0278
    fVector3 m_vecSpecifiedSurroundingMins; // 0x0284
    fVector3 m_vecSpecifiedSurroundingMaxs; // 0x0290
    float m_flElasticity; // 0x02F0
    float m_flShadowCastDistance; // 0x02F4
    fVector3 m_vecOrigin; // 0x0428
    fVector3 m_angRotation; // 0x0434
    uint32_t m_CollisionGroup; // 0x0444
    uint32_t m_bIsPlayerSimulated; // 0x0724
    uint32_t m_bSimulatedEveryTick; // 0x0725
    uint32_t m_bAnimatedEveryTick; // 0x0726
    uint32_t m_bAlternateSorting; // 0x0727
    uint32_t m_iTextureFrameIndex; // 0x0728
    uint32_t m_hOwnerEntity; // 0x0734
    uint32_t m_hEffectEntity; // 0x0738
};

class CFuncOccluder // parent CBaseEntity {
public:
    uint32_t movetype; // 0x0000
    uint32_t movecollide; // 0x0000
    uint32_t m_nRenderFX; // 0x008C
    uint32_t m_clrRender; // 0x0090
    uint32_t m_flAnimTime; // 0x00A0
    uint32_t m_flSimulationTime; // 0x00A8
    uint32_t m_ubInterpolationFrame; // 0x00B4
    uint32_t m_fEffects; // 0x00B8
    uint32_t m_nRenderMode; // 0x00BC
    uint32_t m_nModelIndex; // 0x00CC
    uint32_t m_iTeamNum; // 0x00D8
    uint32_t m_PredictableID; // 0x00DC
    uint32_t m_iParentAttachment; // 0x01F6
    uint32_t moveparent; // 0x020C
    fVector3 m_vecMinsPreScaled; // 0x0230
    fVector3 m_vecMaxsPreScaled; // 0x023C
    fVector3 m_vecMins; // 0x0248
    fVector3 m_vecMaxs; // 0x0254
    uint32_t m_usSolidFlags; // 0x0264
    uint32_t m_nSurroundType; // 0x0268
    uint32_t m_nSolidType; // 0x0269
    uint32_t m_triggerBloat; // 0x026A
    uint32_t m_bUniformTriggerBloat; // 0x026B
    fVector3 m_vecSpecifiedSurroundingMinsPreScaled; // 0x026C
    fVector3 m_vecSpecifiedSurroundingMaxsPreScaled; // 0x0278
    fVector3 m_vecSpecifiedSurroundingMins; // 0x0284
    fVector3 m_vecSpecifiedSurroundingMaxs; // 0x0290
    float m_flElasticity; // 0x02F0
    float m_flShadowCastDistance; // 0x02F4
    fVector3 m_vecOrigin; // 0x0428
    fVector3 m_angRotation; // 0x0434
    uint32_t m_CollisionGroup; // 0x0444
    uint32_t m_bIsPlayerSimulated; // 0x0724
    uint32_t m_bSimulatedEveryTick; // 0x0725
    uint32_t m_bAnimatedEveryTick; // 0x0726
    uint32_t m_bAlternateSorting; // 0x0727
    uint32_t m_iTextureFrameIndex; // 0x0728
    uint32_t m_hOwnerEntity; // 0x0734
    uint32_t m_hEffectEntity; // 0x0738
    uint32_t m_nOccluderIndex; // 0x0788
    uint32_t m_bActive; // 0x078C
};

class CFuncMonitor // parent CBaseEntity {
public:
    uint32_t movecollide; // 0x0000
    uint32_t movetype; // 0x0000
    uint32_t m_nRenderFX; // 0x008C
    uint32_t m_clrRender; // 0x0090
    uint32_t m_flAnimTime; // 0x00A0
    uint32_t m_flSimulationTime; // 0x00A8
    uint32_t m_ubInterpolationFrame; // 0x00B4
    uint32_t m_fEffects; // 0x00B8
    uint32_t m_nRenderMode; // 0x00BC
    uint32_t m_nModelIndex; // 0x00CC
    uint32_t m_iTeamNum; // 0x00D8
    uint32_t m_PredictableID; // 0x00DC
    uint32_t m_iParentAttachment; // 0x01F6
    uint32_t moveparent; // 0x020C
    fVector3 m_vecMinsPreScaled; // 0x0230
    fVector3 m_vecMaxsPreScaled; // 0x023C
    fVector3 m_vecMins; // 0x0248
    fVector3 m_vecMaxs; // 0x0254
    uint32_t m_usSolidFlags; // 0x0264
    uint32_t m_nSurroundType; // 0x0268
    uint32_t m_nSolidType; // 0x0269
    uint32_t m_triggerBloat; // 0x026A
    uint32_t m_bUniformTriggerBloat; // 0x026B
    fVector3 m_vecSpecifiedSurroundingMinsPreScaled; // 0x026C
    fVector3 m_vecSpecifiedSurroundingMaxsPreScaled; // 0x0278
    fVector3 m_vecSpecifiedSurroundingMins; // 0x0284
    fVector3 m_vecSpecifiedSurroundingMaxs; // 0x0290
    float m_flElasticity; // 0x02F0
