// Generated by Voidie

class CWeaponAlyxGun // parent CBaseEntity {
public:
    void* m_OverrideSubMaterials; // 0x0000
    uint32_t movecollide; // 0x0000
    uint32_t movetype; // 0x0000
    uint32_t m_nRenderFX; // 0x0054
    uint32_t m_clrRender; // 0x0058
    uint32_t m_flAnimTime; // 0x0060
    uint32_t m_flSimulationTime; // 0x0068
    uint32_t m_ubInterpolationFrame; // 0x0074
    uint32_t m_fEffects; // 0x0078
    uint32_t m_nRenderMode; // 0x007C
    uint32_t m_nNextThinkTick; // 0x0084
    uint32_t m_nModelIndex; // 0x008C
    uint32_t m_takedamage; // 0x008E
    uint32_t m_iHealth; // 0x0090
    uint32_t m_iMaxHealth; // 0x0094
    uint32_t m_iTeamNum; // 0x009C
    uint32_t m_PredictableID; // 0x00A0
    float m_vecVelocity[0]; // 0x00F4
    float m_vecVelocity[1]; // 0x00F8
    float m_vecVelocity[2]; // 0x00FC
    uint32_t m_iParentAttachment; // 0x017A
    uint32_t moveparent; // 0x0190
    fVector3 m_vecMinsPreScaled; // 0x01A4
    fVector3 m_vecMaxsPreScaled; // 0x01B0
    fVector3 m_vecMins; // 0x01BC
    fVector3 m_vecMaxs; // 0x01C8
    uint32_t m_usSolidFlags; // 0x01D8
    uint32_t m_nSurroundType; // 0x01DC
    uint32_t m_nSolidType; // 0x01DD
    uint32_t m_triggerBloat; // 0x01DE
    fVector3 m_vecSpecifiedSurroundingMinsPreScaled; // 0x01E0
    fVector3 m_vecSpecifiedSurroundingMaxsPreScaled; // 0x01EC
    fVector3 m_vecSpecifiedSurroundingMins; // 0x01F8
    fVector3 m_vecSpecifiedSurroundingMaxs; // 0x0204
    float m_flElasticity; // 0x0248
    float m_flShadowCastDistance; // 0x024C
    fVector3 m_vecOrigin; // 0x0338
    fVector3 m_angRotation; // 0x0344
    uint32_t m_CollisionGroup; // 0x0354
    uint32_t m_bIsPlayerSimulated; // 0x04C8
    uint32_t m_bSimulatedEveryTick; // 0x04C9
    uint32_t m_bAnimatedEveryTick; // 0x04CA
    uint32_t m_bAlternateSorting; // 0x04CB
    uint32_t m_iTextureFrameIndex; // 0x04CC
    uint32_t m_hOwnerEntity; // 0x04D8
    uint32_t m_hEffectEntity; // 0x04DC
    uint32_t m_bOnFire; // 0x0515
    float m_CreationTime; // 0x0518
    uint32_t m_RealClassName; // 0x051C
    uint32_t m_OverrideMaterial; // 0x0520
    uint32_t m_OverrideSubMaterials[0]; // 0x0528
    uint32_t m_spawnflags; // 0x0640
    uint32_t m_iGModFlags; // 0x0644
    uintptr_t m_GMOD_bool[32]; // 0x06A0
    uintptr_t m_GMOD_float[32]; // 0x06C0
    uintptr_t m_GMOD_int[32]; // 0x0740
    uintptr_t m_GMOD_Vector[32]; // 0x07C0
    uintptr_t m_GMOD_QAngle[32]; // 0x0940
    uintptr_t m_GMOD_EHANDLE[32]; // 0x0AC0
    const char* m_GMOD_String0; // 0x0B40
    const char* m_GMOD_String1; // 0x0D40
    const char* m_GMOD_String2; // 0x0F40
    const char* m_GMOD_String3; // 0x1140
    int64_t m_GMOD_DataTable; // 0x1340
    uint32_t m_iCreationID; // 0x1388
    uint32_t m_iMapCreatedID; // 0x138C
    uint32_t m_nSkin; // 0x1398
    uint32_t m_nBody; // 0x139C
    uint32_t m_nHitboxSet; // 0x13A0
    float m_flPlaybackRate; // 0x13C0
    fVector3 m_vecForce; // 0x13CC
    uint32_t m_nForceBone; // 0x13D8
    uint32_t m_bClientSideFrameReset; // 0x140C
    float m_fadeMinDist; // 0x1444
    float m_fadeMaxDist; // 0x1448
    float m_flFadeScale; // 0x144C
    float m_flModelScale; // 0x149C
    float m_flModelWidthScale; // 0x149C
    uintptr_t m_flPoseParameter[24]; // 0x14A0
    uintptr_t m_flEncodedController[4]; // 0x15BC
    uint32_t m_bClientSideAnimation; // 0x160C
    uint32_t m_nNewSequenceParity; // 0x1610
    uint32_t m_nResetEventsParity; // 0x1614
    uint32_t m_nSequence; // 0x163C
    float m_flCycle; // 0x1644
    uint32_t m_hLightingOrigin; // 0x16C4
    uint32_t m_hLightingOriginRelative; // 0x16C8
    uint32_t m_nMuzzleFlashParity; // 0x16CC
    fVector3 m_OverrideViewTarget; // 0x16EC
    uint32_t m_pBoneManipulator; // 0x1778
    uint32_t m_pFlexManipulator; // 0x1780
    uint32_t m_hOwner; // 0x17D8
    uint32_t m_nViewModelIndex; // 0x17E0
    float m_flNextPrimaryAttack; // 0x17E4
    float m_flNextSecondaryAttack; // 0x17E8
    float m_flTimeWeaponIdle; // 0x17EC
    uint32_t m_iViewModelIndex; // 0x17F4
    uint32_t m_iWorldModelIndex; // 0x17F8
    uint32_t m_iState; // 0x1818
    uint32_t m_iPrimaryAmmoType; // 0x1820
    uint32_t m_iSecondaryAmmoType; // 0x1824
    uint32_t m_iClip1; // 0x1828
    uint32_t m_iClip2; // 0x182C
    uint32_t m_bFlipViewModel; // 0x1858
};

class CTESprite // parent CBaseTempEntity {
public:
    fVector3 m_vecOrigin; // 0x0010
    uint32_t m_nModelIndex; // 0x001C
    float m_fScale; // 0x0020
    uint32_t m_nBrightness; // 0x0024
};

class CTEWorldDecal // parent CBaseTempEntity {
public:
    fVector3 m_vecOrigin; // 0x0010
    uint32_t m_nIndex; // 0x001C
};

class CNPC_RollerMine // parent CBaseEntity {
public:
    uint32_t movecollide; // 0x0000
    uint32_t lengthprop15; // 0x0000
    void* m_OverrideSubMaterials; // 0x0000
    uint32_t m_nSequence; // 0x0000
    uint32_t movetype; // 0x0000
    float m_flPrevCycle; // 0x0004
    float m_flWeight; // 0x0008
    uint32_t m_nOrder; // 0x000C
    float m_flCycle; // 0x0014
    uint32_t m_nRenderFX; // 0x0054
    uint32_t m_clrRender; // 0x0058
    uint32_t m_flAnimTime; // 0x0060
    uint32_t m_flSimulationTime; // 0x0068
    uint32_t m_ubInterpolationFrame; // 0x0074
    uint32_t m_fEffects; // 0x0078
    uint32_t m_nRenderMode; // 0x007C
    uint32_t m_nModelIndex; // 0x008C
    uint32_t m_takedamage; // 0x008E
    uint32_t m_lifeState; // 0x008F
    uint32_t m_iHealth; // 0x0090
    uint32_t m_iMaxHealth; // 0x0094
    uint32_t m_iTeamNum; // 0x009C
    uint32_t m_PredictableID; // 0x00A0
    float m_vecViewOffset[0]; // 0x00E8
    float m_vecViewOffset[1]; // 0x00EC
    float m_vecViewOffset[2]; // 0x00F0
    float m_vecVelocity[0]; // 0x00F4
    float m_vecVelocity[1]; // 0x00F8
    float m_vecVelocity[2]; // 0x00FC
    uint32_t m_iParentAttachment; // 0x017A
    uint32_t moveparent; // 0x0190
    fVector3 m_vecMinsPreScaled; // 0x01A4
    fVector3 m_vecMaxsPreScaled; // 0x01B0
    fVector3 m_vecMins; // 0x01BC
    fVector3 m_vecMaxs; // 0x01C8
    uint32_t m_usSolidFlags; // 0x01D8
    uint32_t m_nSurroundType; // 0x01DC
    uint32_t m_nSolidType; // 0x01DD
    uint32_t m_triggerBloat; // 0x01DE
    fVector3 m_vecSpecifiedSurroundingMinsPreScaled; // 0x01E0
    fVector3 m_vecSpecifiedSurroundingMaxsPreScaled; // 0x01EC
    fVector3 m_vecSpecifiedSurroundingMins; // 0x01F8
    fVector3 m_vecSpecifiedSurroundingMaxs; // 0x0204
    float m_flElasticity; // 0x0248
    float m_flShadowCastDistance; // 0x024C
    fVector3 m_vecOrigin; // 0x0338
    fVector3 m_angRotation; // 0x0344
    uint32_t m_CollisionGroup; // 0x0354
    uint32_t m_bIsPlayerSimulated; // 0x04C8
    uint32_t m_bSimulatedEveryTick; // 0x04C9
    uint32_t m_bAnimatedEveryTick; // 0x04CA
    uint32_t m_bAlternateSorting; // 0x04CB
    uint32_t m_iTextureFrameIndex; // 0x04CC
    uint32_t m_hOwnerEntity; // 0x04D8
    uint32_t m_hEffectEntity; // 0x04DC
    uint32_t m_bOnFire; // 0x0515
    float m_CreationTime; // 0x0518
    uint32_t m_RealClassName; // 0x051C
    uint32_t m_OverrideMaterial; // 0x0520
    uint32_t m_OverrideSubMaterials[0]; // 0x0528
    uint32_t m_spawnflags; // 0x0640
    uint32_t m_iGModFlags; // 0x0644
    uintptr_t m_GMOD_bool[32]; // 0x06A0
    uintptr_t m_GMOD_float[32]; // 0x06C0
    uintptr_t m_GMOD_int[32]; // 0x0740
    uintptr_t m_GMOD_Vector[32]; // 0x07C0
    uintptr_t m_GMOD_QAngle[32]; // 0x0940
    uintptr_t m_GMOD_EHANDLE[32]; // 0x0AC0
    const char* m_GMOD_String0; // 0x0B40
    const char* m_GMOD_String1; // 0x0D40
    const char* m_GMOD_String2; // 0x0F40
    const char* m_GMOD_String3; // 0x1140
    int64_t m_GMOD_DataTable; // 0x1340
    uint32_t m_iCreationID; // 0x1388
    uint32_t m_iMapCreatedID; // 0x138C
    uint32_t m_nSkin; // 0x1398
    uint32_t m_nBody; // 0x139C
    uint32_t m_nHitboxSet; // 0x13A0
    float m_flPlaybackRate; // 0x13C0
    fVector3 m_vecForce; // 0x13CC
    uint32_t m_nForceBone; // 0x13D8
    uint32_t m_bClientSideFrameReset; // 0x140C
    float m_fadeMinDist; // 0x1444
    float m_fadeMaxDist; // 0x1448
    float m_flFadeScale; // 0x144C
    float m_flModelScale; // 0x149C
    float m_flModelWidthScale; // 0x149C
    uintptr_t m_flPoseParameter[24]; // 0x14A0
    uintptr_t m_flEncodedController[4]; // 0x15BC
    uint32_t m_bClientSideAnimation; // 0x160C
    uint32_t m_nNewSequenceParity; // 0x1610
    uint32_t m_nResetEventsParity; // 0x1614
    uint32_t m_hLightingOrigin; // 0x16C4
    uint32_t m_hLightingOriginRelative; // 0x16C8
    uint32_t m_nMuzzleFlashParity; // 0x16CC
    fVector3 m_OverrideViewTarget; // 0x16EC
    uint32_t m_pBoneManipulator; // 0x1778
    uint32_t m_pFlexManipulator; // 0x1780
    fVector3 m_viewtarget; // 0x1844
    uintptr_t m_flexWeight[96]; // 0x1880
    uint32_t m_blinktoggle; // 0x1A30
    fVector3 m_vecLean; // 0x1B9C
    fVector3 m_vecShift; // 0x1BD8
    float m_flNextAttack; // 0x1C18
    uint32_t m_bloodColor; // 0x1C1C
    uintptr_t m_hMyWeapons[256]; // 0x2020
    uint32_t m_hActiveWeapon; // 0x2420
    float m_flTimePingEffect; // 0x2428
    uint32_t m_iDeathPose; // 0x242C
    uint32_t m_iDeathFrame; // 0x2430
    uint32_t m_iSpeedModRadius; // 0x2434
    uint32_t m_iSpeedModSpeed; // 0x2438
    uint32_t m_bPerformAvoidance; // 0x243C
    uint32_t m_bIsMoving; // 0x243D
    uint32_t m_bFadeCorpse; // 0x243E
    uint32_t m_bSpeedModActive; // 0x243F
    uint32_t m_bImportanRagdoll; // 0x2440
    uint32_t m_bIsOpen; // 0x2448
    float m_flActiveTime; // 0x244C
    uint32_t m_bHackedByAlyx; // 0x2450
    uint32_t m_bPowerDown; // 0x2451
};

class CRotorWashEmitter // parent CBaseEntity {
public:
    uint32_t movecollide; // 0x0000
    uint32_t movetype; // 0x0000
    void* m_OverrideSubMaterials; // 0x0000
    uint32_t m_nRenderFX; // 0x0054
    uint32_t m_clrRender; // 0x0058
    uint32_t m_flAnimTime; // 0x0060
    uint32_t m_flSimulationTime; // 0x0068
    uint32_t m_ubInterpolationFrame; // 0x0074
    uint32_t m_fEffects; // 0x0078
    uint32_t m_nRenderMode; // 0x007C
    uint32_t m_nModelIndex; // 0x008C
    uint32_t m_takedamage; // 0x008E
    uint32_t m_iHealth; // 0x0090
    uint32_t m_iMaxHealth; // 0x0094
    uint32_t m_iTeamNum; // 0x009C
    uint32_t m_PredictableID; // 0x00A0
    float m_vecVelocity[0]; // 0x00F4
    float m_vecVelocity[1]; // 0x00F8
    float m_vecVelocity[2]; // 0x00FC
    uint32_t m_iParentAttachment; // 0x017A
    uint32_t moveparent; // 0x0190
    fVector3 m_vecMinsPreScaled; // 0x01A4
    fVector3 m_vecMaxsPreScaled; // 0x01B0
    fVector3 m_vecMins; // 0x01BC
    fVector3 m_vecMaxs; // 0x01C8
    uint32_t m_usSolidFlags; // 0x01D8
    uint32_t m_nSurroundType; // 0x01DC
    uint32_t m_nSolidType; // 0x01DD
    uint32_t m_triggerBloat; // 0x01DE
    fVector3 m_vecSpecifiedSurroundingMinsPreScaled; // 0x01E0
    fVector3 m_vecSpecifiedSurroundingMaxsPreScaled; // 0x01EC
    fVector3 m_vecSpecifiedSurroundingMins; // 0x01F8
    fVector3 m_vecSpecifiedSurroundingMaxs; // 0x0204
    float m_flElasticity; // 0x0248
    float m_flShadowCastDistance; // 0x024C
    fVector3 m_vecOrigin; // 0x0338
    fVector3 m_angRotation; // 0x0344
    uint32_t m_CollisionGroup; // 0x0354
    uint32_t m_bIsPlayerSimulated; // 0x04C8
    uint32_t m_bSimulatedEveryTick; // 0x04C9
    uint32_t m_bAnimatedEveryTick; // 0x04CA
    uint32_t m_bAlternateSorting; // 0x04CB
    uint32_t m_iTextureFrameIndex; // 0x04CC
    uint32_t m_hOwnerEntity; // 0x04D8
    uint32_t m_hEffectEntity; // 0x04DC
    uint32_t m_bOnFire; // 0x0515
    float m_CreationTime; // 0x0518
    uint32_t m_RealClassName; // 0x051C
    uint32_t m_OverrideMaterial; // 0x0520
    uint32_t m_OverrideSubMaterials[0]; // 0x0528
    uint32_t m_spawnflags; // 0x0640
    uint32_t m_iGModFlags; // 0x0644
    uintptr_t m_GMOD_bool[32]; // 0x06A0
    uintptr_t m_GMOD_float[32]; // 0x06C0
    uintptr_t m_GMOD_int[32]; // 0x0740
    uintptr_t m_GMOD_Vector[32]; // 0x07C0
    uintptr_t m_GMOD_QAngle[32]; // 0x0940
    uintptr_t m_GMOD_EHANDLE[32]; // 0x0AC0
    const char* m_GMOD_String0; // 0x0B40
    const char* m_GMOD_String1; // 0x0D40
    const char* m_GMOD_String2; // 0x0F40
    const char* m_GMOD_String3; // 0x1140
    int64_t m_GMOD_DataTable; // 0x1340
    uint32_t m_iCreationID; // 0x1388
    uint32_t m_iMapCreatedID; // 0x138C
    float m_flAltitude; // 0x1390
};

class CTESpriteSpray // parent CBaseTempEntity {
public:
    fVector3 m_vecOrigin; // 0x0010
    fVector3 m_vecDirection; // 0x001C
    uint32_t m_nModelIndex; // 0x0028
    uint32_t m_nSpeed; // 0x002C
    float m_fNoise; // 0x0030
    uint32_t m_nCount; // 0x0034
};

class CNPC_Manhack // parent CBaseEntity {
public:
    uint32_t movecollide; // 0x0000
    uint32_t lengthprop15; // 0x0000
    void* m_OverrideSubMaterials; // 0x0000
    uint32_t m_nSequence; // 0x0000
    uint32_t movetype; // 0x0000
    float m_flPrevCycle; // 0x0004
    float m_flWeight; // 0x0008
    uint32_t m_nOrder; // 0x000C
    float m_flCycle; // 0x0014
    uint32_t m_nRenderFX; // 0x0054
    uint32_t m_clrRender; // 0x0058
    uint32_t m_flAnimTime; // 0x0060
    uint32_t m_flSimulationTime; // 0x0068
    uint32_t m_ubInterpolationFrame; // 0x0074
    uint32_t m_fEffects; // 0x0078
    uint32_t m_nRenderMode; // 0x007C
    uint32_t m_nModelIndex; // 0x008C
    uint32_t m_takedamage; // 0x008E
    uint32_t m_lifeState; // 0x008F
    uint32_t m_iHealth; // 0x0090
    uint32_t m_iMaxHealth; // 0x0094
    uint32_t m_iTeamNum; // 0x009C
    uint32_t m_PredictableID; // 0x00A0
    float m_vecViewOffset[0]; // 0x00E8
    float m_vecViewOffset[1]; // 0x00EC
    float m_vecViewOffset[2]; // 0x00F0
    float m_vecVelocity[0]; // 0x00F4
    float m_vecVelocity[1]; // 0x00F8
    float m_vecVelocity[2]; // 0x00FC
    uint32_t m_iParentAttachment; // 0x017A
    uint32_t moveparent; // 0x0190
    fVector3 m_vecMinsPreScaled; // 0x01A4
    fVector3 m_vecMaxsPreScaled; // 0x01B0
    fVector3 m_vecMins; // 0x01BC
    fVector3 m_vecMaxs; // 0x01C8
    uint32_t m_usSolidFlags; // 0x01D8
    uint32_t m_nSurroundType; // 0x01DC
    uint32_t m_nSolidType; // 0x01DD
    uint32_t m_triggerBloat; // 0x01DE
    fVector3 m_vecSpecifiedSurroundingMinsPreScaled; // 0x01E0
    fVector3 m_vecSpecifiedSurroundingMaxsPreScaled; // 0x01EC
    fVector3 m_vecSpecifiedSurroundingMins; // 0x01F8
    fVector3 m_vecSpecifiedSurroundingMaxs; // 0x0204
    float m_flElasticity; // 0x0248
    float m_flShadowCastDistance; // 0x024C
    fVector3 m_vecOrigin; // 0x0338
    fVector3 m_angRotation; // 0x0344
    uint32_t m_CollisionGroup; // 0x0354
    uint32_t m_bIsPlayerSimulated; // 0x04C8
    uint32_t m_bSimulatedEveryTick; // 0x04C9
    uint32_t m_bAnimatedEveryTick; // 0x04CA
    uint32_t m_bAlternateSorting; // 0x04CB
    uint32_t m_iTextureFrameIndex; // 0x04CC
    uint32_t m_hOwnerEntity; // 0x04D8
    uint32_t m_hEffectEntity; // 0x04DC
    uint32_t m_bOnFire; // 0x0515
    float m_CreationTime; // 0x0518
    uint32_t m_RealClassName; // 0x051C
    uint32_t m_OverrideMaterial; // 0x0520
    uint32_t m_OverrideSubMaterials[0]; // 0x0528
    uint32_t m_spawnflags; // 0x0640
    uint32_t m_iGModFlags; // 0x0644
    uintptr_t m_GMOD_bool[32]; // 0x06A0
    uintptr_t m_GMOD_float[32]; // 0x06C0
    uintptr_t m_GMOD_int[32]; // 0x0740
    uintptr_t m_GMOD_Vector[32]; // 0x07C0
    uintptr_t m_GMOD_QAngle[32]; // 0x0940
    uintptr_t m_GMOD_EHANDLE[32]; // 0x0AC0
    const char* m_GMOD_String0; // 0x0B40
    const char* m_GMOD_String1; // 0x0D40
    const char* m_GMOD_String2; // 0x0F40
    const char* m_GMOD_String3; // 0x1140
    int64_t m_GMOD_DataTable; // 0x1340
    uint32_t m_iCreationID; // 0x1388
    uint32_t m_iMapCreatedID; // 0x138C
    uint32_t m_nSkin; // 0x1398
    uint32_t m_nBody; // 0x139C
    uint32_t m_nHitboxSet; // 0x13A0
    float m_flPlaybackRate; // 0x13C0
    fVector3 m_vecForce; // 0x13CC
    uint32_t m_nForceBone; // 0x13D8
    uint32_t m_bClientSideFrameReset; // 0x140C
    float m_fadeMinDist; // 0x1444
    float m_fadeMaxDist; // 0x1448
    float m_flFadeScale; // 0x144C
    float m_flModelScale; // 0x149C
    float m_flModelWidthScale; // 0x149C
    uintptr_t m_flPoseParameter[24]; // 0x14A0
    uintptr_t m_flEncodedController[4]; // 0x15BC
    uint32_t m_bClientSideAnimation; // 0x160C
    uint32_t m_nNewSequenceParity; // 0x1610
    uint32_t m_nResetEventsParity; // 0x1614
    uint32_t m_hLightingOrigin; // 0x16C4
    uint32_t m_hLightingOriginRelative; // 0x16C8
    uint32_t m_nMuzzleFlashParity; // 0x16CC
    fVector3 m_OverrideViewTarget; // 0x16EC
    uint32_t m_pBoneManipulator; // 0x1778
    uint32_t m_pFlexManipulator; // 0x1780
    fVector3 m_viewtarget; // 0x1844
    uintptr_t m_flexWeight[96]; // 0x1880
    uint32_t m_blinktoggle; // 0x1A30
    fVector3 m_vecLean; // 0x1B9C
    fVector3 m_vecShift; // 0x1BD8
    float m_flNextAttack; // 0x1C18
    uint32_t m_bloodColor; // 0x1C1C
    uintptr_t m_hMyWeapons[256]; // 0x2020
    uint32_t m_hActiveWeapon; // 0x2420
    float m_flTimePingEffect; // 0x2428
    uint32_t m_iDeathPose; // 0x242C
    uint32_t m_iDeathFrame; // 0x2430
    uint32_t m_iSpeedModRadius; // 0x2434
    uint32_t m_iSpeedModSpeed; // 0x2438
    uint32_t m_bPerformAvoidance; // 0x243C
    uint32_t m_bIsMoving; // 0x243D
    uint32_t m_bFadeCorpse; // 0x243E
    uint32_t m_bSpeedModActive; // 0x243F
    uint32_t m_bImportanRagdoll; // 0x2440
    uint32_t m_nEnginePitch1; // 0x2454
    uint32_t m_nEnginePitch2; // 0x2458
    float m_flEnginePitch1Time; // 0x245C
    float m_flEnginePitch2Time; // 0x2460
};

class CTEBeamSpline {
public:
    void* m_vecPoints; // 0x0000
    fVector3 m_vecPoints[0]; // 0x0010
    uint32_t m_nPoints; // 0x00D0
};

class CPoseController // parent CBaseEntity {
public:
    uint32_t movetype; // 0x0000
    uint32_t movecollide; // 0x0000
    void* m_OverrideSubMaterials; // 0x0000
    uint32_t m_nRenderFX; // 0x0054
    uint32_t m_clrRender; // 0x0058
    uint32_t m_flAnimTime; // 0x0060
    uint32_t m_flSimulationTime; // 0x0068
    uint32_t m_ubInterpolationFrame; // 0x0074
    uint32_t m_fEffects; // 0x0078
    uint32_t m_nRenderMode; // 0x007C
    uint32_t m_nModelIndex; // 0x008C
    uint32_t m_takedamage; // 0x008E
    uint32_t m_iHealth; // 0x0090
    uint32_t m_iMaxHealth; // 0x0094
    uint32_t m_iTeamNum; // 0x009C
    uint32_t m_PredictableID; // 0x00A0
    float m_vecVelocity[0]; // 0x00F4
    float m_vecVelocity[1]; // 0x00F8
    float m_vecVelocity[2]; // 0x00FC
    uint32_t m_iParentAttachment; // 0x017A
    uint32_t moveparent; // 0x0190
    fVector3 m_vecMinsPreScaled; // 0x01A4
    fVector3 m_vecMaxsPreScaled; // 0x01B0
    fVector3 m_vecMins; // 0x01BC
    fVector3 m_vecMaxs; // 0x01C8
    uint32_t m_usSolidFlags; // 0x01D8
    uint32_t m_nSurroundType; // 0x01DC
    uint32_t m_nSolidType; // 0x01DD
    uint32_t m_triggerBloat; // 0x01DE
    fVector3 m_vecSpecifiedSurroundingMinsPreScaled; // 0x01E0
    fVector3 m_vecSpecifiedSurroundingMaxsPreScaled; // 0x01EC
    fVector3 m_vecSpecifiedSurroundingMins; // 0x01F8
    fVector3 m_vecSpecifiedSurroundingMaxs; // 0x0204
    float m_flElasticity; // 0x0248
    float m_flShadowCastDistance; // 0x024C
    fVector3 m_vecOrigin; // 0x0338
    fVector3 m_angRotation; // 0x0344
    uint32_t m_CollisionGroup; // 0x0354
    uint32_t m_bIsPlayerSimulated; // 0x04C8
    uint32_t m_bSimulatedEveryTick; // 0x04C9
    uint32_t m_bAnimatedEveryTick; // 0x04CA
    uint32_t m_bAlternateSorting; // 0x04CB
    uint32_t m_iTextureFrameIndex; // 0x04CC
    uint32_t m_hOwnerEntity; // 0x04D8
    uint32_t m_hEffectEntity; // 0x04DC
    uint32_t m_bOnFire; // 0x0515
    float m_CreationTime; // 0x0518
    uint32_t m_RealClassName; // 0x051C
    uint32_t m_OverrideMaterial; // 0x0520
    uint32_t m_OverrideSubMaterials[0]; // 0x0528
    uint32_t m_spawnflags; // 0x0640
    uint32_t m_iGModFlags; // 0x0644
    uintptr_t m_GMOD_bool[32]; // 0x06A0
    uintptr_t m_GMOD_float[32]; // 0x06C0
    uintptr_t m_GMOD_int[32]; // 0x0740
    uintptr_t m_GMOD_Vector[32]; // 0x07C0
    uintptr_t m_GMOD_QAngle[32]; // 0x0940
    uintptr_t m_GMOD_EHANDLE[32]; // 0x0AC0
    const char* m_GMOD_String0; // 0x0B40
    const char* m_GMOD_String1; // 0x0D40
    const char* m_GMOD_String2; // 0x0F40
    const char* m_GMOD_String3; // 0x1140
    int64_t m_GMOD_DataTable; // 0x1340
    uint32_t m_iCreationID; // 0x1388
    uint32_t m_iMapCreatedID; // 0x138C
    uintptr_t m_hProps[4]; // 0x1390
    uintptr_t m_chPoseIndex[4]; // 0x13A0
    uint32_t m_bPoseValueParity; // 0x13A4
    float m_fPoseValue; // 0x13A8
    float m_fInterpolationTime; // 0x13AC
    uint32_t m_bInterpolationWrap; // 0x13B0
    float m_fCycleFrequency; // 0x13B4
    uint32_t m_nFModType; // 0x13B8
    float m_fFModTimeOffset; // 0x13BC
    float m_fFModRate; // 0x13C0
    float m_fFModAmplitude; // 0x13C4
};

class CTESparks // parent CBaseTempEntity {
public:
    float m_vecOrigin[0]; // 0x0010
    float m_vecOrigin[1]; // 0x0014
    float m_vecOrigin[2]; // 0x0018
    uint32_t m_nMagnitude; // 0x001C
    uint32_t m_nTrailLength; // 0x0020
    fVector3 m_vecDir; // 0x0024
};

class CTEShowLine // parent CBaseTempEntity {
public:
    float m_vecOrigin[0]; // 0x0010
    float m_vecOrigin[1]; // 0x0014
    float m_vecOrigin[2]; // 0x0018
    fVector3 m_vecEnd; // 0x001C
};

class CTEParticleSystem // parent CBaseTempEntity {
public:
    float m_vecOrigin[0]; // 0x0010
    float m_vecOrigin[1]; // 0x0014
    float m_vecOrigin[2]; // 0x0018
};

class CTEBeamRingPoint // parent CBaseBeam {
public:
    uint32_t m_nModelIndex; // 0x0010
    uint32_t m_nHaloIndex; // 0x0014
    uint32_t m_nStartFrame; // 0x0018
    uint32_t m_nFrameRate; // 0x001C
    float m_fLife; // 0x0020
    float m_fWidth; // 0x0024
    float m_fEndWidth; // 0x0028
    uint32_t m_nFadeLength; // 0x002C
    float m_fAmplitude; // 0x0030
    uint32_t r; // 0x0034
    uint32_t g; // 0x0038
    uint32_t b; // 0x003C
    uint32_t a; // 0x0040
    uint32_t m_nSpeed; // 0x0044
    uint32_t m_nFlags; // 0x0048
    fVector3 m_vecCenter; // 0x004C
    float m_flStartRadius; // 0x0058
    float m_flEndRadius; // 0x005C
};

class CMaterialModifyControl // parent CBaseEntity {
public:
    uint32_t movetype; // 0x0000
    void* m_OverrideSubMaterials; // 0x0000
    uint32_t movecollide; // 0x0000
    uint32_t m_nRenderFX; // 0x0054
    uint32_t m_clrRender; // 0x0058
    uint32_t m_flAnimTime; // 0x0060
    uint32_t m_flSimulationTime; // 0x0068
    uint32_t m_ubInterpolationFrame; // 0x0074
    uint32_t m_fEffects; // 0x0078
    uint32_t m_nRenderMode; // 0x007C
    uint32_t m_nModelIndex; // 0x008C
    uint32_t m_takedamage; // 0x008E
    uint32_t m_iHealth; // 0x0090
    uint32_t m_iMaxHealth; // 0x0094
    uint32_t m_iTeamNum; // 0x009C
    uint32_t m_PredictableID; // 0x00A0
    float m_vecVelocity[0]; // 0x00F4
    float m_vecVelocity[1]; // 0x00F8
    float m_vecVelocity[2]; // 0x00FC
    uint32_t m_iParentAttachment; // 0x017A
    uint32_t moveparent; // 0x0190
    fVector3 m_vecMinsPreScaled; // 0x01A4
    fVector3 m_vecMaxsPreScaled; // 0x01B0
    fVector3 m_vecMins; // 0x01BC
    fVector3 m_vecMaxs; // 0x01C8
    uint32_t m_usSolidFlags; // 0x01D8
    uint32_t m_nSurroundType; // 0x01DC
    uint32_t m_nSolidType; // 0x01DD
    uint32_t m_triggerBloat; // 0x01DE
    fVector3 m_vecSpecifiedSurroundingMinsPreScaled; // 0x01E0
    fVector3 m_vecSpecifiedSurroundingMaxsPreScaled; // 0x01EC
    fVector3 m_vecSpecifiedSurroundingMins; // 0x01F8
    fVector3 m_vecSpecifiedSurroundingMaxs; // 0x0204
    float m_flElasticity; // 0x0248
    float m_flShadowCastDistance; // 0x024C
    fVector3 m_vecOrigin; // 0x0338
    fVector3 m_angRotation; // 0x0344
    uint32_t m_CollisionGroup; // 0x0354
    uint32_t m_bIsPlayerSimulated; // 0x04C8
    uint32_t m_bSimulatedEveryTick; // 0x04C9
    uint32_t m_bAnimatedEveryTick; // 0x04CA
    uint32_t m_bAlternateSorting; // 0x04CB
    uint32_t m_iTextureFrameIndex; // 0x04CC
    uint32_t m_hOwnerEntity; // 0x04D8
    uint32_t m_hEffectEntity; // 0x04DC
    uint32_t m_bOnFire; // 0x0515
    float m_CreationTime; // 0x0518
    uint32_t m_RealClassName; // 0x051C
    uint32_t m_OverrideMaterial; // 0x0520
    uint32_t m_OverrideSubMaterials[0]; // 0x0528
    uint32_t m_spawnflags; // 0x0640
    uint32_t m_iGModFlags; // 0x0644
    uintptr_t m_GMOD_bool[32]; // 0x06A0
    uintptr_t m_GMOD_float[32]; // 0x06C0
    uintptr_t m_GMOD_int[32]; // 0x0740
    uintptr_t m_GMOD_Vector[32]; // 0x07C0
    uintptr_t m_GMOD_QAngle[32]; // 0x0940
    uintptr_t m_GMOD_EHANDLE[32]; // 0x0AC0
    const char* m_GMOD_String0; // 0x0B40
    const char* m_GMOD_String1; // 0x0D40
    const char* m_GMOD_String2; // 0x0F40
    const char* m_GMOD_String3; // 0x1140
    int64_t m_GMOD_DataTable; // 0x1340
    uint32_t m_iCreationID; // 0x1388
    uint32_t m_iMapCreatedID; // 0x138C
    const char* m_szMaterialName; // 0x1390
    const char* m_szMaterialVar; // 0x148F
    const char* m_szMaterialVarValue; // 0x158E
    uint32_t m_iFrameStart; // 0x1698
    uint32_t m_iFrameEnd; // 0x169C
    uint32_t m_bWrap; // 0x16A0
    float m_flFramerate; // 0x16A4
    uint32_t m_bNewAnimCommandsSemaphore; // 0x16A8
    float m_flFloatLerpStartValue; // 0x16AC
    float m_flFloatLerpEndValue; // 0x16B0
    float m_flFloatLerpTransitionTime; // 0x16B4
    uint32_t m_bFloatLerpWrap; // 0x16B8
    uint32_t m_nModifyMode; // 0x16C0
};

class CTEKillPlayerAttachments // parent CBaseTempEntity {
public:
    uint32_t m_nPlayer; // 0x0010
};

class CTESmoke // parent CBaseTempEntity {
public:
    fVector3 m_vecOrigin; // 0x0010
    uint32_t m_nModelIndex; // 0x001C
    float m_fScale; // 0x0020
    uint32_t m_nFrameRate; // 0x0024
};

class CTEProjectedDecal // parent CBaseTempEntity {
public:
    fVector3 m_vecOrigin; // 0x0010
    fVector3 m_angRotation; // 0x001C
    float m_flDistance; // 0x0028
    uint32_t m_nIndex; // 0x002C
};

class CNPC_RocketTurret // parent CBaseEntity {
public:
    uint32_t movecollide; // 0x0000
    uint32_t lengthprop15; // 0x0000
    void* m_OverrideSubMaterials; // 0x0000
    uint32_t m_nSequence; // 0x0000
    uint32_t movetype; // 0x0000
    float m_flPrevCycle; // 0x0004
    float m_flWeight; // 0x0008
    uint32_t m_nOrder; // 0x000C
    float m_flCycle; // 0x0014
    uint32_t m_nRenderFX; // 0x0054
    uint32_t m_clrRender; // 0x0058
    uint32_t m_flAnimTime; // 0x0060
    uint32_t m_flSimulationTime; // 0x0068
    uint32_t m_ubInterpolationFrame; // 0x0074
    uint32_t m_fEffects; // 0x0078
    uint32_t m_nRenderMode; // 0x007C
    uint32_t m_nModelIndex; // 0x008C
    uint32_t m_takedamage; // 0x008E
    uint32_t m_lifeState; // 0x008F
    uint32_t m_iHealth; // 0x0090
    uint32_t m_iMaxHealth; // 0x0094
    uint32_t m_iTeamNum; // 0x009C
    uint32_t m_PredictableID; // 0x00A0
    float m_vecViewOffset[0]; // 0x00E8
    float m_vecViewOffset[1]; // 0x00EC
    float m_vecViewOffset[2]; // 0x00F0
    float m_vecVelocity[0]; // 0x00F4
    float m_vecVelocity[1]; // 0x00F8
    float m_vecVelocity[2]; // 0x00FC
    uint32_t m_iParentAttachment; // 0x017A
    uint32_t moveparent; // 0x0190
    fVector3 m_vecMinsPreScaled; // 0x01A4
    fVector3 m_vecMaxsPreScaled; // 0x01B0
    fVector3 m_vecMins; // 0x01BC
    fVector3 m_vecMaxs; // 0x01C8
    uint32_t m_usSolidFlags; // 0x01D8
    uint32_t m_nSurroundType; // 0x01DC
    uint32_t m_nSolidType; // 0x01DD
    uint32_t m_triggerBloat; // 0x01DE
    fVector3 m_vecSpecifiedSurroundingMinsPreScaled; // 0x01E0
    fVector3 m_vecSpecifiedSurroundingMaxsPreScaled; // 0x01EC
    fVector3 m_vecSpecifiedSurroundingMins; // 0x01F8
    fVector3 m_vecSpecifiedSurroundingMaxs; // 0x0204
    float m_flElasticity; // 0x0248
    float m_flShadowCastDistance; // 0x024C
    fVector3 m_vecOrigin; // 0x0338
    fVector3 m_angRotation; // 0x0344
    uint32_t m_CollisionGroup; // 0x0354
    uint32_t m_bIsPlayerSimulated; // 0x04C8
    uint32_t m_bSimulatedEveryTick; // 0x04C9
    uint32_t m_bAnimatedEveryTick; // 0x04CA
    uint32_t m_bAlternateSorting; // 0x04CB
    uint32_t m_iTextureFrameIndex; // 0x04CC
    uint32_t m_hOwnerEntity; // 0x04D8
    uint32_t m_hEffectEntity; // 0x04DC
    uint32_t m_bOnFire; // 0x0515
    float m_CreationTime; // 0x0518
    uint32_t m_RealClassName; // 0x051C
    uint32_t m_OverrideMaterial; // 0x0520
    uint32_t m_OverrideSubMaterials[0]; // 0x0528
    uint32_t m_spawnflags; // 0x0640
    uint32_t m_iGModFlags; // 0x0644
    uintptr_t m_GMOD_bool[32]; // 0x06A0
    uintptr_t m_GMOD_float[32]; // 0x06C0
    uintptr_t m_GMOD_int[32]; // 0x0740
    uintptr_t m_GMOD_Vector[32]; // 0x07C0
    uintptr_t m_GMOD_QAngle[32]; // 0x0940
    uintptr_t m_GMOD_EHANDLE[32]; // 0x0AC0
    const char* m_GMOD_String0; // 0x0B40
    const char* m_GMOD_String1; // 0x0D40
    const char* m_GMOD_String2; // 0x0F40
    const char* m_GMOD_String3; // 0x1140
    int64_t m_GMOD_DataTable; // 0x1340
    uint32_t m_iCreationID; // 0x1388
    uint32_t m_iMapCreatedID; // 0x138C
    uint32_t m_nSkin; // 0x1398
    uint32_t m_nBody; // 0x139C
    uint32_t m_nHitboxSet; // 0x13A0
    float m_flPlaybackRate; // 0x13C0
    fVector3 m_vecForce; // 0x13CC
    uint32_t m_nForceBone; // 0x13D8
    uint32_t m_bClientSideFrameReset; // 0x140C
    float m_fadeMinDist; // 0x1444
    float m_fadeMaxDist; // 0x1448
    float m_flFadeScale; // 0x144C
    float m_flModelScale; // 0x149C
    float m_flModelWidthScale; // 0x149C
    uintptr_t m_flPoseParameter[24]; // 0x14A0
    uintptr_t m_flEncodedController[4]; // 0x15BC
    uint32_t m_bClientSideAnimation; // 0x160C
    uint32_t m_nNewSequenceParity; // 0x1610
    uint32_t m_nResetEventsParity; // 0x1614
    uint32_t m_hLightingOrigin; // 0x16C4
    uint32_t m_hLightingOriginRelative; // 0x16C8
    uint32_t m_nMuzzleFlashParity; // 0x16CC
    fVector3 m_OverrideViewTarget; // 0x16EC
    uint32_t m_pBoneManipulator; // 0x1778
    uint32_t m_pFlexManipulator; // 0x1780
    fVector3 m_viewtarget; // 0x1844
    uintptr_t m_flexWeight[96]; // 0x1880
    uint32_t m_blinktoggle; // 0x1A30
    fVector3 m_vecLean; // 0x1B9C
    fVector3 m_vecShift; // 0x1BD8
    float m_flNextAttack; // 0x1C18
    uint32_t m_bloodColor; // 0x1C1C
    uintptr_t m_hMyWeapons[256]; // 0x2020
    uint32_t m_hActiveWeapon; // 0x2420
    float m_flTimePingEffect; // 0x2428
    uint32_t m_iDeathPose; // 0x242C
    uint32_t m_iDeathFrame; // 0x2430
    uint32_t m_iSpeedModRadius; // 0x2434
    uint32_t m_iSpeedModSpeed; // 0x2438
    uint32_t m_bPerformAvoidance; // 0x243C
    uint32_t m_bIsMoving; // 0x243D
    uint32_t m_bFadeCorpse; // 0x243E
    uint32_t m_bSpeedModActive; // 0x243F
    uint32_t m_bImportanRagdoll; // 0x2440
    uint32_t m_iLaserState; // 0x244C
    uint32_t m_nSiteHalo; // 0x2450
    fVector3 m_vecCurrentAngles; // 0x2458
};

class CTEPlayerDecal // parent CBaseTempEntity {
public:
    uint32_t m_nPlayer; // 0x0010
    fVector3 m_vecOrigin; // 0x0014
    uint32_t m_nEntity; // 0x0020
};

class CTEPhysicsProp // parent CBaseTempEntity {
public:
    fVector3 m_vecOrigin; // 0x0010
    float m_angRotation[0]; // 0x001C
    float m_angRotation[1]; // 0x0020
    float m_angRotation[2]; // 0x0024
    fVector3 m_vecVelocity; // 0x0028
    uint32_t m_nModelIndex; // 0x0034
    uint32_t m_nSkin; // 0x0038
    uint32_t m_nFlags; // 0x003C
    uint32_t m_nEffects; // 0x0040
    uint32_t m_clrRender; // 0x0044
    float m_fModelScale; // 0x0048
};

class CTEMuzzleFlash // parent CBaseTempEntity {
public:
    fVector3 m_vecOrigin; // 0x0010
    fVector3 m_vecAngles; // 0x001C
    float m_flScale; // 0x0028
    uint32_t m_nType; // 0x002C
};

class CTEBloodSprite {
public:
    fVector3 m_vecOrigin; // 0x0010
    fVector3 m_vecDirection; // 0x001C
    uint32_t r; // 0x0028
    uint32_t g; // 0x002C
    uint32_t b; // 0x0030
    uint32_t a; // 0x0034
    uint32_t m_nDropModel; // 0x0038
    uint32_t m_nSprayModel; // 0x003C
    uint32_t m_nSize; // 0x0040
};

class CEntityDissolve // parent CBaseEntity {
public:
    void* m_OverrideSubMaterials; // 0x0000
    uint32_t movetype; // 0x0000
    uint32_t movecollide; // 0x0000
    uint32_t m_nRenderFX; // 0x0054
    uint32_t m_clrRender; // 0x0058
    uint32_t m_flAnimTime; // 0x0060
    uint32_t m_flSimulationTime; // 0x0068
    uint32_t m_ubInterpolationFrame; // 0x0074
    uint32_t m_fEffects; // 0x0078
    uint32_t m_nRenderMode; // 0x007C
    uint32_t m_nModelIndex; // 0x008C
    uint32_t m_takedamage; // 0x008E
    uint32_t m_iHealth; // 0x0090
    uint32_t m_iMaxHealth; // 0x0094
    uint32_t m_iTeamNum; // 0x009C
    uint32_t m_PredictableID; // 0x00A0
    float m_vecVelocity[0]; // 0x00F4
    float m_vecVelocity[1]; // 0x00F8
    float m_vecVelocity[2]; // 0x00FC
    uint32_t m_iParentAttachment; // 0x017A
    uint32_t moveparent; // 0x0190
    fVector3 m_vecMinsPreScaled; // 0x01A4
    fVector3 m_vecMaxsPreScaled; // 0x01B0
    fVector3 m_vecMins; // 0x01BC
    fVector3 m_vecMaxs; // 0x01C8
    uint32_t m_usSolidFlags; // 0x01D8
    uint32_t m_nSurroundType; // 0x01DC
    uint32_t m_nSolidType; // 0x01DD
    uint32_t m_triggerBloat; // 0x01DE
    fVector3 m_vecSpecifiedSurroundingMinsPreScaled; // 0x01E0
    fVector3 m_vecSpecifiedSurroundingMaxsPreScaled; // 0x01EC
    fVector3 m_vecSpecifiedSurroundingMins; // 0x01F8
    fVector3 m_vecSpecifiedSurroundingMaxs; // 0x0204
    float m_flElasticity; // 0x0248
    float m_flShadowCastDistance; // 0x024C
    fVector3 m_vecOrigin; // 0x0338
    fVector3 m_angRotation; // 0x0344
    uint32_t m_CollisionGroup; // 0x0354
    uint32_t m_bIsPlayerSimulated; // 0x04C8
    uint32_t m_bSimulatedEveryTick; // 0x04C9
    uint32_t m_bAnimatedEveryTick; // 0x04CA
    uint32_t m_bAlternateSorting; // 0x04CB
    uint32_t m_iTextureFrameIndex; // 0x04CC
    uint32_t m_hOwnerEntity; // 0x04D8
    uint32_t m_hEffectEntity; // 0x04DC
    uint32_t m_bOnFire; // 0x0515
    float m_CreationTime; // 0x0518
    uint32_t m_RealClassName; // 0x051C
    uint32_t m_OverrideMaterial; // 0x0520
    uint32_t m_OverrideSubMaterials[0]; // 0x0528
    uint32_t m_spawnflags; // 0x0640
    uint32_t m_iGModFlags; // 0x0644
    uintptr_t m_GMOD_bool[32]; // 0x06A0
    uintptr_t m_GMOD_float[32]; // 0x06C0
    uintptr_t m_GMOD_int[32]; // 0x0740
    uintptr_t m_GMOD_Vector[32]; // 0x07C0
    uintptr_t m_GMOD_QAngle[32]; // 0x0940
    uintptr_t m_GMOD_EHANDLE[32]; // 0x0AC0
    const char* m_GMOD_String0; // 0x0B40
    const char* m_GMOD_String1; // 0x0D40
    const char* m_GMOD_String2; // 0x0F40
    const char* m_GMOD_String3; // 0x1140
    int64_t m_GMOD_DataTable; // 0x1340
    uint32_t m_iCreationID; // 0x1388
    uint32_t m_iMapCreatedID; // 0x138C
    float m_flStartTime; // 0x1394
    float m_flFadeOutStart; // 0x1398
    float m_flFadeOutLength; // 0x139C
    float m_flFadeOutModelStart; // 0x13A0
    float m_flFadeOutModelLength; // 0x13A4
    float m_flFadeInStart; // 0x13A8
    float m_flFadeInLength; // 0x13AC
    uint32_t m_nDissolveType; // 0x13B0
    fVector3 m_vDissolverOrigin; // 0x13C4
    uint32_t m_nMagnitude; // 0x13D0
};

class CTEDecal // parent CBaseTempEntity {
public:
    fVector3 m_vecOrigin; // 0x0010
    fVector3 m_vecStart; // 0x001C
    uint32_t m_nEntity; // 0x0028
    uint32_t m_nHitbox; // 0x002C
    uint32_t m_nIndex; // 0x0030
};

class CTELargeFunnel // parent CBaseTempEntity {
public:
    float m_vecOrigin[0]; // 0x0010
    float m_vecOrigin[1]; // 0x0014
    float m_vecOrigin[2]; // 0x0018
    uint32_t m_nModelIndex; // 0x001C
    uint32_t m_nReversed; // 0x0020
};

class CTEExplosion // parent CBaseTempEntity {
public:
    float m_vecOrigin[0]; // 0x0010
    float m_vecOrigin[1]; // 0x0014
    float m_vecOrigin[2]; // 0x0018
    uint32_t m_nModelIndex; // 0x001C
    float m_fScale; // 0x0020
    uint32_t m_nFrameRate; // 0x0024
    uint32_t m_nFlags; // 0x0028
    fVector3 m_vecNormal; // 0x002C
    uint32_t m_chMaterialType; // 0x0038
    uint32_t m_nRadius; // 0x003C
    uint32_t m_nMagnitude; // 0x0040
};

class CSENT_AI // parent CBaseEntity {
public:
    uint32_t lengthprop15; // 0x0000
    uint32_t movetype; // 0x0000
    uint32_t movecollide; // 0x0000
    uint32_t m_nSequence; // 0x0000
    void* m_OverrideSubMaterials; // 0x0000
    float m_flPrevCycle; // 0x0004
    float m_flWeight; // 0x0008
    uint32_t m_nOrder; // 0x000C
    float m_flCycle; // 0x0014
    uint32_t m_nRenderFX; // 0x0054
    uint32_t m_clrRender; // 0x0058
    uint32_t m_flAnimTime; // 0x0060
    uint32_t m_flSimulationTime; // 0x0068
    uint32_t m_ubInterpolationFrame; // 0x0074
    uint32_t m_fEffects; // 0x0078
    uint32_t m_nRenderMode; // 0x007C
    uint32_t m_nModelIndex; // 0x008C
    uint32_t m_takedamage; // 0x008E
    uint32_t m_lifeState; // 0x008F
    uint32_t m_iHealth; // 0x0090
    uint32_t m_iMaxHealth; // 0x0094
    uint32_t m_iTeamNum; // 0x009C
    uint32_t m_PredictableID; // 0x00A0
    float m_vecViewOffset[0]; // 0x00E8
    float m_vecViewOffset[1]; // 0x00EC
    float m_vecViewOffset[2]; // 0x00F0
    float m_vecVelocity[0]; // 0x00F4
    float m_vecVelocity[1]; // 0x00F8
    float m_vecVelocity[2]; // 0x00FC
    uint32_t m_iParentAttachment; // 0x017A
    uint32_t moveparent; // 0x0190
    fVector3 m_vecMinsPreScaled; // 0x01A4
    fVector3 m_vecMaxsPreScaled; // 0x01B0
    fVector3 m_vecMins; // 0x01BC
    fVector3 m_vecMaxs; // 0x01C8
    uint32_t m_usSolidFlags; // 0x01D8
    uint32_t m_nSurroundType; // 0x01DC
    uint32_t m_nSolidType; // 0x01DD
    uint32_t m_triggerBloat; // 0x01DE
    fVector3 m_vecSpecifiedSurroundingMinsPreScaled; // 0x01E0
    fVector3 m_vecSpecifiedSurroundingMaxsPreScaled; // 0x01EC
    fVector3 m_vecSpecifiedSurroundingMins; // 0x01F8
    fVector3 m_vecSpecifiedSurroundingMaxs; // 0x0204
    float m_flElasticity; // 0x0248
    float m_flShadowCastDistance; // 0x024C
    fVector3 m_vecOrigin; // 0x0338
    fVector3 m_angRotation; // 0x0344
    uint32_t m_CollisionGroup; // 0x0354
    uint32_t m_bIsPlayerSimulated; // 0x04C8
    uint32_t m_bSimulatedEveryTick; // 0x04C9
    uint32_t m_bAnimatedEveryTick; // 0x04CA
    uint32_t m_bAlternateSorting; // 0x04CB
    uint32_t m_iTextureFrameIndex; // 0x04CC
    uint32_t m_hOwnerEntity; // 0x04D8
    uint32_t m_hEffectEntity; // 0x04DC
    uint32_t m_bOnFire; // 0x0515
    float m_CreationTime; // 0x0518
    uint32_t m_RealClassName; // 0x051C
    uint32_t m_OverrideMaterial; // 0x0520
    uint32_t m_OverrideSubMaterials[0]; // 0x0528
    uint32_t m_spawnflags; // 0x0640
    uint32_t m_iGModFlags; // 0x0644
    uintptr_t m_GMOD_bool[32]; // 0x06A0
    uintptr_t m_GMOD_float[32]; // 0x06C0
    uintptr_t m_GMOD_int[32]; // 0x0740
    uintptr_t m_GMOD_Vector[32]; // 0x07C0
    uintptr_t m_GMOD_QAngle[32]; // 0x0940
    uintptr_t m_GMOD_EHANDLE[32]; // 0x0AC0
    const char* m_GMOD_String0; // 0x0B40
    const char* m_GMOD_String1; // 0x0D40
    const char* m_GMOD_String2; // 0x0F40
    const char* m_GMOD_String3; // 0x1140
    int64_t m_GMOD_DataTable; // 0x1340
    uint32_t m_iCreationID; // 0x1388
    uint32_t m_iMapCreatedID; // 0x138C
    uint32_t m_nSkin; // 0x1398
    uint32_t m_nBody; // 0x139C
    uint32_t m_nHitboxSet; // 0x13A0
    float m_flPlaybackRate; // 0x13C0
    fVector3 m_vecForce; // 0x13CC
    uint32_t m_nForceBone; // 0x13D8
    uint32_t m_bClientSideFrameReset; // 0x140C
    float m_fadeMinDist; // 0x1444
    float m_fadeMaxDist; // 0x1448
    float m_flFadeScale; // 0x144C
    float m_flModelScale; // 0x149C
    float m_flModelWidthScale; // 0x149C
    uintptr_t m_flPoseParameter[24]; // 0x14A0
    uintptr_t m_flEncodedController[4]; // 0x15BC
    uint32_t m_bClientSideAnimation; // 0x160C
    uint32_t m_nNewSequenceParity; // 0x1610
    uint32_t m_nResetEventsParity; // 0x1614
    uint32_t m_hLightingOrigin; // 0x16C4
    uint32_t m_hLightingOriginRelative; // 0x16C8
    uint32_t m_nMuzzleFlashParity; // 0x16CC
    fVector3 m_OverrideViewTarget; // 0x16EC
    uint32_t m_pBoneManipulator; // 0x1778
    uint32_t m_pFlexManipulator; // 0x1780
    fVector3 m_viewtarget; // 0x1844
    uintptr_t m_flexWeight[96]; // 0x1880
    uint32_t m_blinktoggle; // 0x1A30
    fVector3 m_vecLean; // 0x1B9C
    fVector3 m_vecShift; // 0x1BD8
    float m_flNextAttack; // 0x1C18
    uint32_t m_bloodColor; // 0x1C1C
    uintptr_t m_hMyWeapons[256]; // 0x2020
    uint32_t m_hActiveWeapon; // 0x2420
    float m_flTimePingEffect; // 0x2428
    uint32_t m_iDeathPose; // 0x242C
    uint32_t m_iDeathFrame; // 0x2430
    uint32_t m_iSpeedModRadius; // 0x2434
    uint32_t m_iSpeedModSpeed; // 0x2438
    uint32_t m_bPerformAvoidance; // 0x243C
    uint32_t m_bIsMoving; // 0x243D
    uint32_t m_bFadeCorpse; // 0x243E
    uint32_t m_bSpeedModActive; // 0x243F
    uint32_t m_bImportanRagdoll; // 0x2440
    const char* m_strScriptName; // 0x2458
};

class CFuncSmokeVolume // parent CBaseEntity {
public:
    void* m_OverrideSubMaterials; // 0x0000
    uint32_t movetype; // 0x0000
    uint32_t movecollide; // 0x0000
    uint32_t m_nRenderFX; // 0x0054
    uint32_t m_clrRender; // 0x0058
    uint32_t m_flAnimTime; // 0x0060
    uint32_t m_flSimulationTime; // 0x0068
    uint32_t m_ubInterpolationFrame; // 0x0074
    uint32_t m_fEffects; // 0x0078
    uint32_t m_nRenderMode; // 0x007C
    uint32_t m_nModelIndex; // 0x008C
    uint32_t m_takedamage; // 0x008E
    uint32_t m_iHealth; // 0x0090
    uint32_t m_iMaxHealth; // 0x0094
    uint32_t m_iTeamNum; // 0x009C
    uint32_t m_PredictableID; // 0x00A0
    float m_vecVelocity[0]; // 0x00F4
    float m_vecVelocity[1]; // 0x00F8
    float m_vecVelocity[2]; // 0x00FC
    uint32_t m_iParentAttachment; // 0x017A
    uint32_t moveparent; // 0x0190
    fVector3 m_vecMinsPreScaled; // 0x01A4
    fVector3 m_vecMaxsPreScaled; // 0x01B0
    fVector3 m_vecMins; // 0x01BC
    fVector3 m_vecMaxs; // 0x01C8
    uint32_t m_usSolidFlags; // 0x01D8
    uint32_t m_nSurroundType; // 0x01DC
    uint32_t m_nSolidType; // 0x01DD
    uint32_t m_triggerBloat; // 0x01DE
    fVector3 m_vecSpecifiedSurroundingMinsPreScaled; // 0x01E0
    fVector3 m_vecSpecifiedSurroundingMaxsPreScaled; // 0x01EC
    fVector3 m_vecSpecifiedSurroundingMins; // 0x01F8
    fVector3 m_vecSpecifiedSurroundingMaxs; // 0x0204
    float m_flElasticity; // 0x0248
    float m_flShadowCastDistance; // 0x024C
    fVector3 m_vecOrigin; // 0x0338
    fVector3 m_angRotation; // 0x0344
    uint32_t m_CollisionGroup; // 0x0354
    uint32_t m_bIsPlayerSimulated; // 0x04C8
    uint32_t m_bSimulatedEveryTick; // 0x04C9
    uint32_t m_bAnimatedEveryTick; // 0x04CA
    uint32_t m_bAlternateSorting; // 0x04CB
    uint32_t m_iTextureFrameIndex; // 0x04CC
    uint32_t m_hOwnerEntity; // 0x04D8
    uint32_t m_hEffectEntity; // 0x04DC
    uint32_t m_bOnFire; // 0x0515
    float m_CreationTime; // 0x0518
    uint32_t m_RealClassName; // 0x051C
    uint32_t m_OverrideMaterial; // 0x0520
    uint32_t m_OverrideSubMaterials[0]; // 0x0528
    uint32_t m_iGModFlags; // 0x0644
    uintptr_t m_GMOD_bool[32]; // 0x06A0
    uintptr_t m_GMOD_float[32]; // 0x06C0
    uintptr_t m_GMOD_int[32]; // 0x0740
    uintptr_t m_GMOD_Vector[32]; // 0x07C0
    uintptr_t m_GMOD_QAngle[32]; // 0x0940
    uintptr_t m_GMOD_EHANDLE[32]; // 0x0AC0
    const char* m_GMOD_String0; // 0x0B40
    const char* m_GMOD_String1; // 0x0D40
    const char* m_GMOD_String2; // 0x0F40
    const char* m_GMOD_String3; // 0x1140
    int64_t m_GMOD_DataTable; // 0x1340
    uint32_t m_iCreationID; // 0x1388
    uint32_t m_iMapCreatedID; // 0x138C
    uint32_t m_Color1; // 0x147C
    uint32_t m_Color2; // 0x1480
    const char* m_MaterialName; // 0x1484
    float m_ParticleDrawWidth; // 0x1584
    float m_ParticleSpacingDistance; // 0x1588
    float m_DensityRampSpeed; // 0x158C
    float m_RotationSpeed; // 0x1590
    float m_MovementSpeed; // 0x1594
    float m_Density; // 0x1598
    uint32_t m_spawnflags; // 0x159C
};

class CTEBloodStream // parent CBaseTempEntity {
public:
    float m_vecOrigin[0]; // 0x0010
    float m_vecOrigin[1]; // 0x0014
    float m_vecOrigin[2]; // 0x0018
    fVector3 m_vecDirection; // 0x001C
    uint32_t r; // 0x0028
    uint32_t g; // 0x002C
    uint32_t b; // 0x0030
    uint32_t a; // 0x0034
    uint32_t m_nAmount; // 0x0038
};

class CTEImpact // parent CBaseTempEntity {
public:
    fVector3 m_vecOrigin; // 0x0010
    fVector3 m_vecNormal; // 0x001C
    uint32_t m_iType; // 0x0028
    uint32_t m_ucFlags; // 0x002C
};

class CTEGlowSprite // parent CBaseTempEntity {
public:
    fVector3 m_vecOrigin; // 0x0010
    uint32_t m_nModelIndex; // 0x001C
    float m_fScale; // 0x0020
    float m_fLife; // 0x0024
    uint32_t m_nBrightness; // 0x0028
};

class CInfoTeleporterCountdown // parent CBaseEntity {
public:
    uint32_t movecollide; // 0x0000
    uint32_t movetype; // 0x0000
    void* m_OverrideSubMaterials; // 0x0000
    uint32_t m_nRenderFX; // 0x0054
    uint32_t m_clrRender; // 0x0058
    uint32_t m_flAnimTime; // 0x0060
    uint32_t m_flSimulationTime; // 0x0068
    uint32_t m_ubInterpolationFrame; // 0x0074
    uint32_t m_fEffects; // 0x0078
    uint32_t m_nRenderMode; // 0x007C
    uint32_t m_nModelIndex; // 0x008C
    uint32_t m_takedamage; // 0x008E
    uint32_t m_iHealth; // 0x0090
    uint32_t m_iMaxHealth; // 0x0094
    uint32_t m_iTeamNum; // 0x009C
    uint32_t m_PredictableID; // 0x00A0
    float m_vecVelocity[0]; // 0x00F4
    float m_vecVelocity[1]; // 0x00F8
    float m_vecVelocity[2]; // 0x00FC
    uint32_t m_iParentAttachment; // 0x017A
    uint32_t moveparent; // 0x0190
    fVector3 m_vecMinsPreScaled; // 0x01A4
    fVector3 m_vecMaxsPreScaled; // 0x01B0
    fVector3 m_vecMins; // 0x01BC
    fVector3 m_vecMaxs; // 0x01C8
    uint32_t m_usSolidFlags; // 0x01D8
    uint32_t m_nSurroundType; // 0x01DC
    uint32_t m_nSolidType; // 0x01DD
    uint32_t m_triggerBloat; // 0x01DE
    fVector3 m_vecSpecifiedSurroundingMinsPreScaled; // 0x01E0
    fVector3 m_vecSpecifiedSurroundingMaxsPreScaled; // 0x01EC
    fVector3 m_vecSpecifiedSurroundingMins; // 0x01F8
    fVector3 m_vecSpecifiedSurroundingMaxs; // 0x0204
    float m_flElasticity; // 0x0248
    float m_flShadowCastDistance; // 0x024C
    fVector3 m_vecOrigin; // 0x0338
    fVector3 m_angRotation; // 0x0344
    uint32_t m_CollisionGroup; // 0x0354
    uint32_t m_bIsPlayerSimulated; // 0x04C8
    uint32_t m_bSimulatedEveryTick; // 0x04C9
    uint32_t m_bAnimatedEveryTick; // 0x04CA
    uint32_t m_bAlternateSorting; // 0x04CB
    uint32_t m_iTextureFrameIndex; // 0x04CC
    uint32_t m_hOwnerEntity; // 0x04D8
    uint32_t m_hEffectEntity; // 0x04DC
    uint32_t m_bOnFire; // 0x0515
    float m_CreationTime; // 0x0518
    uint32_t m_RealClassName; // 0x051C
    uint32_t m_OverrideMaterial; // 0x0520
    uint32_t m_OverrideSubMaterials[0]; // 0x0528
    uint32_t m_spawnflags; // 0x0640
    uint32_t m_iGModFlags; // 0x0644
    uintptr_t m_GMOD_bool[32]; // 0x06A0
    uintptr_t m_GMOD_float[32]; // 0x06C0
    uintptr_t m_GMOD_int[32]; // 0x0740
    uintptr_t m_GMOD_Vector[32]; // 0x07C0
    uintptr_t m_GMOD_QAngle[32]; // 0x0940
    uintptr_t m_GMOD_EHANDLE[32]; // 0x0AC0
    const char* m_GMOD_String0; // 0x0B40
    const char* m_GMOD_String1; // 0x0D40
    const char* m_GMOD_String2; // 0x0F40
    const char* m_GMOD_String3; // 0x1140
    int64_t m_GMOD_DataTable; // 0x1340
    uint32_t m_iCreationID; // 0x1388
    uint32_t m_iMapCreatedID; // 0x138C
    uint32_t m_bCountdownStarted; // 0x1390
    uint32_t m_bDisabled; // 0x1391
    float m_flStartTime; // 0x1394
    float m_flTimeRemaining; // 0x1398
};

class CTEShatterSurface // parent CBaseTempEntity {
public:
    fVector3 m_vecOrigin; // 0x0010
    fVector3 m_vecAngles; // 0x001C
    fVector3 m_vecForce; // 0x0028
    fVector3 m_vecForcePos; // 0x0034
    float m_flWidth; // 0x0040
    float m_flHeight; // 0x0044
    float m_flShardSize; // 0x0048
    uint32_t m_nSurfaceType; // 0x0050
    uint32_t m_uchFrontColor[0]; // 0x0054
    uint32_t m_uchFrontColor[1]; // 0x0055
    uint32_t m_uchFrontColor[2]; // 0x0056
    uint32_t m_uchBackColor[0]; // 0x0057
    uint32_t m_uchBackColor[1]; // 0x0058
    uint32_t m_uchBackColor[2]; // 0x0059
};

class CPrecipitation // parent CBaseEntity {
public:
    void* m_OverrideSubMaterials; // 0x0000
    uint32_t movetype; // 0x0000
    uint32_t movecollide; // 0x0000
    uint32_t m_nRenderFX; // 0x0054
    uint32_t m_clrRender; // 0x0058
    uint32_t m_flAnimTime; // 0x0060
    uint32_t m_flSimulationTime; // 0x0068
    uint32_t m_ubInterpolationFrame; // 0x0074
    uint32_t m_fEffects; // 0x0078
    uint32_t m_nRenderMode; // 0x007C
    uint32_t m_nModelIndex; // 0x008C
    uint32_t m_takedamage; // 0x008E
    uint32_t m_iHealth; // 0x0090
    uint32_t m_iMaxHealth; // 0x0094
    uint32_t m_iTeamNum; // 0x009C
    uint32_t m_PredictableID; // 0x00A0
    float m_vecVelocity[0]; // 0x00F4
    float m_vecVelocity[1]; // 0x00F8
    float m_vecVelocity[2]; // 0x00FC
    uint32_t m_iParentAttachment; // 0x017A
    uint32_t moveparent; // 0x0190
    fVector3 m_vecMinsPreScaled; // 0x01A4
    fVector3 m_vecMaxsPreScaled; // 0x01B0
    fVector3 m_vecMins; // 0x01BC
    fVector3 m_vecMaxs; // 0x01C8
    uint32_t m_usSolidFlags; // 0x01D8
    uint32_t m_nSurroundType; // 0x01DC
    uint32_t m_nSolidType; // 0x01DD
    uint32_t m_triggerBloat; // 0x01DE
    fVector3 m_vecSpecifiedSurroundingMinsPreScaled; // 0x01E0
    fVector3 m_vecSpecifiedSurroundingMaxsPreScaled; // 0x01EC
    fVector3 m_vecSpecifiedSurroundingMins; // 0x01F8
    fVector3 m_vecSpecifiedSurroundingMaxs; // 0x0204
    float m_flElasticity; // 0x0248
    float m_flShadowCastDistance; // 0x024C
    fVector3 m_vecOrigin; // 0x0338
    fVector3 m_angRotation; // 0x0344
    uint32_t m_CollisionGroup; // 0x0354
    uint32_t m_bIsPlayerSimulated; // 0x04C8
    uint32_t m_bSimulatedEveryTick; // 0x04C9
    uint32_t m_bAnimatedEveryTick; // 0x04CA
    uint32_t m_bAlternateSorting; // 0x04CB
    uint32_t m_iTextureFrameIndex; // 0x04CC
    uint32_t m_hOwnerEntity; // 0x04D8
    uint32_t m_hEffectEntity; // 0x04DC
    uint32_t m_bOnFire; // 0x0515
    float m_CreationTime; // 0x0518
    uint32_t m_RealClassName; // 0x051C
    uint32_t m_OverrideMaterial; // 0x0520
    uint32_t m_OverrideSubMaterials[0]; // 0x0528
    uint32_t m_spawnflags; // 0x0640
    uint32_t m_iGModFlags; // 0x0644
    uintptr_t m_GMOD_bool[32]; // 0x06A0
    uintptr_t m_GMOD_float[32]; // 0x06C0
    uintptr_t m_GMOD_int[32]; // 0x0740
    uintptr_t m_GMOD_Vector[32]; // 0x07C0
    uintptr_t m_GMOD_QAngle[32]; // 0x0940
    uintptr_t m_GMOD_EHANDLE[32]; // 0x0AC0
    const char* m_GMOD_String0; // 0x0B40
    const char* m_GMOD_String1; // 0x0D40
    const char* m_GMOD_String2; // 0x0F40
    const char* m_GMOD_String3; // 0x1140
    int64_t m_GMOD_DataTable; // 0x1340
    uint32_t m_iCreationID; // 0x1388
    uint32_t m_iMapCreatedID; // 0x138C
    uint32_t m_nPrecipType; // 0x13B8
    const char* m_sParticleNameClose; // 0x145A
    const char* m_sParticleNameInner; // 0x14DA
    const char* m_sParticleNameOuter; // 0x155A
    float m_flParticleDist; // 0x15DC
};

class CTEFootprintDecal // parent CBaseTempEntity {
public:
    fVector3 m_vecOrigin; // 0x0010
    fVector3 m_vecDirection; // 0x001C
    uint32_t m_nEntity; // 0x0034
    uint32_t m_nIndex; // 0x0038
    uint32_t m_chMaterialType; // 0x003C
};

class CPropScalable // parent CBaseEntity {
public:
    uint32_t movetype; // 0x0000
    uint32_t movecollide; // 0x0000
    void* m_OverrideSubMaterials; // 0x0000
    uint32_t m_nRenderFX; // 0x0054
    uint32_t m_clrRender; // 0x0058
    uint32_t m_flAnimTime; // 0x0060
    uint32_t m_flSimulationTime; // 0x0068
    uint32_t m_ubInterpolationFrame; // 0x0074
    uint32_t m_fEffects; // 0x0078
    uint32_t m_nRenderMode; // 0x007C
    uint32_t m_nModelIndex; // 0x008C
    uint32_t m_takedamage; // 0x008E
    uint32_t m_iHealth; // 0x0090
    uint32_t m_iMaxHealth; // 0x0094
    uint32_t m_iTeamNum; // 0x009C
    uint32_t m_PredictableID; // 0x00A0
    float m_vecVelocity[0]; // 0x00F4
    float m_vecVelocity[1]; // 0x00F8
    float m_vecVelocity[2]; // 0x00FC
    uint32_t m_iParentAttachment; // 0x017A
    uint32_t moveparent; // 0x0190
    fVector3 m_vecMinsPreScaled; // 0x01A4
    fVector3 m_vecMaxsPreScaled; // 0x01B0
    fVector3 m_vecMins; // 0x01BC
    fVector3 m_vecMaxs; // 0x01C8
    uint32_t m_usSolidFlags; // 0x01D8
    uint32_t m_nSurroundType; // 0x01DC
    uint32_t m_nSolidType; // 0x01DD
    uint32_t m_triggerBloat; // 0x01DE
    fVector3 m_vecSpecifiedSurroundingMinsPreScaled; // 0x01E0
    fVector3 m_vecSpecifiedSurroundingMaxsPreScaled; // 0x01EC
    fVector3 m_vecSpecifiedSurroundingMins; // 0x01F8
    fVector3 m_vecSpecifiedSurroundingMaxs; // 0x0204
    float m_flElasticity; // 0x0248
    float m_flShadowCastDistance; // 0x024C
    fVector3 m_vecOrigin; // 0x0338
    fVector3 m_angRotation; // 0x0344
    uint32_t m_CollisionGroup; // 0x0354
    uint32_t m_bIsPlayerSimulated; // 0x04C8
    uint32_t m_bSimulatedEveryTick; // 0x04C9
    uint32_t m_bAnimatedEveryTick; // 0x04CA
    uint32_t m_bAlternateSorting; // 0x04CB
    uint32_t m_iTextureFrameIndex; // 0x04CC
    uint32_t m_hOwnerEntity; // 0x04D8
    uint32_t m_hEffectEntity; // 0x04DC
    uint32_t m_bOnFire; // 0x0515
    float m_CreationTime; // 0x0518
    uint32_t m_RealClassName; // 0x051C
    uint32_t m_OverrideMaterial; // 0x0520
    uint32_t m_OverrideSubMaterials[0]; // 0x0528
    uint32_t m_spawnflags; // 0x0640
    uint32_t m_iGModFlags; // 0x0644
    uintptr_t m_GMOD_bool[32]; // 0x06A0
    uintptr_t m_GMOD_float[32]; // 0x06C0
    uintptr_t m_GMOD_int[32]; // 0x0740
    uintptr_t m_GMOD_Vector[32]; // 0x07C0
    uintptr_t m_GMOD_QAngle[32]; // 0x0940
    uintptr_t m_GMOD_EHANDLE[32]; // 0x0AC0
    const char* m_GMOD_String0; // 0x0B40
    const char* m_GMOD_String1; // 0x0D40
    const char* m_GMOD_String2; // 0x0F40
    const char* m_GMOD_String3; // 0x1140
    int64_t m_GMOD_DataTable; // 0x1340
    uint32_t m_iCreationID; // 0x1388
    uint32_t m_iMapCreatedID; // 0x138C
    uint32_t m_nSkin; // 0x1398
    uint32_t m_nBody; // 0x139C
    uint32_t m_nHitboxSet; // 0x13A0
    float m_flPlaybackRate; // 0x13C0
    fVector3 m_vecForce; // 0x13CC
    uint32_t m_nForceBone; // 0x13D8
    uint32_t m_bClientSideFrameReset; // 0x140C
    float m_fadeMinDist; // 0x1444
    float m_fadeMaxDist; // 0x1448
    float m_flFadeScale; // 0x144C
    float m_flModelScale; // 0x149C
    float m_flModelWidthScale; // 0x149C
    uintptr_t m_flPoseParameter[24]; // 0x14A0
    uintptr_t m_flEncodedController[4]; // 0x15BC
    uint32_t m_bClientSideAnimation; // 0x160C
    uint32_t m_nNewSequenceParity; // 0x1610
    uint32_t m_nResetEventsParity; // 0x1614
    uint32_t m_nSequence; // 0x163C
    float m_flCycle; // 0x1644
    uint32_t m_hLightingOrigin; // 0x16C4
    uint32_t m_hLightingOriginRelative; // 0x16C8
    uint32_t m_nMuzzleFlashParity; // 0x16CC
    fVector3 m_OverrideViewTarget; // 0x16EC
    uint32_t m_pBoneManipulator; // 0x1778
    uint32_t m_pFlexManipulator; // 0x1780
    float m_flScaleX; // 0x17D8
    float m_flScaleY; // 0x17DC
    float m_flScaleZ; // 0x17E0
    float m_flLerpTimeX; // 0x17E4
    float m_flLerpTimeY; // 0x17E8
    float m_flLerpTimeZ; // 0x17EC
    float m_flGoalTimeX; // 0x17F0
    float m_flGoalTimeY; // 0x17F4
    float m_flGoalTimeZ; // 0x17F8
};

class CTEFizz // parent CBaseTempEntity {
public:
    uint32_t m_nEntity; // 0x0010
    uint32_t m_nModelIndex; // 0x0014
    uint32_t m_nDensity; // 0x0018
    uint32_t m_nCurrent; // 0x001C
};

class CTEMetalSparks {
public:
    fVector3 m_vecPos; // 0x0010
    fVector3 m_vecDir; // 0x001C
};

class CTEEnergySplash {
public:
    fVector3 m_vecPos; // 0x0010
    fVector3 m_vecDir; // 0x001C
    uint32_t m_bExplosive; // 0x0028
};

class CTEEffectDispatch // parent CBaseTempEntity {
public:
    float m_vOrigin[0]; // 0x0010
    uint32_t entindex; // 0x0010
    float m_vOrigin[1]; // 0x0014
    float m_vOrigin[2]; // 0x0018
    float m_vStart[0]; // 0x001C
    float m_vStart[1]; // 0x0020
    float m_vStart[2]; // 0x0024
    fVector3 m_vNormal; // 0x0028
    fVector3 m_vAngles; // 0x0034
    uint32_t m_fFlags; // 0x0040
    float m_flScale; // 0x0048
    float m_flMagnitude; // 0x004C
    float m_flRadius; // 0x0050
    uint32_t m_nAttachmentIndex; // 0x0054
    uint32_t m_nSurfaceProp; // 0x0058
    uint32_t m_nMaterial; // 0x005C
    uint32_t m_nDamageType; // 0x0060
    uint32_t m_nHitBox; // 0x0064
    uint32_t m_nColor; // 0x0068
    uint32_t m_bCustomColors; // 0x0069
    fVector3 m_CustomColors.m_vecColor1; // 0x006C
    fVector3 m_CustomColors.m_vecColor2; // 0x0078
    uint32_t m_bControlPoint1; // 0x0084
    uint32_t m_ControlPoint1.m_eParticleAttachment; // 0x0088
    float m_ControlPoint1.m_vecOffset[0]; // 0x008C
    float m_ControlPoint1.m_vecOffset[1]; // 0x0090
    float m_ControlPoint1.m_vecOffset[2]; // 0x0094
    uint32_t m_bAllowOverride; // 0x0098
    uint32_t m_iEffectName; // 0x009C
};

class CGMODGameRulesProxy // parent CGameRulesProxy {
public:
    float m_fTimeScale; // 0x0048
    uint32_t m_iSkillLevel; // 0x004C
};

class CWeaponStunStick // parent CBaseEntity {
public:
    void* m_OverrideSubMaterials; // 0x0000
    uint32_t movecollide; // 0x0000
    uint32_t movetype; // 0x0000
    uint32_t m_nRenderFX; // 0x0054
    uint32_t m_clrRender; // 0x0058
    uint32_t m_flAnimTime; // 0x0060
    uint32_t m_flSimulationTime; // 0x0068
    uint32_t m_ubInterpolationFrame; // 0x0074
    uint32_t m_fEffects; // 0x0078
    uint32_t m_nRenderMode; // 0x007C
    uint32_t m_nNextThinkTick; // 0x0084
    uint32_t m_nModelIndex; // 0x008C
    uint32_t m_takedamage; // 0x008E
    uint32_t m_iHealth; // 0x0090
    uint32_t m_iMaxHealth; // 0x0094
    uint32_t m_iTeamNum; // 0x009C
    uint32_t m_PredictableID; // 0x00A0
    float m_vecVelocity[0]; // 0x00F4
    float m_vecVelocity[1]; // 0x00F8
    float m_vecVelocity[2]; // 0x00FC
    uint32_t m_iParentAttachment; // 0x017A
    uint32_t moveparent; // 0x0190
    fVector3 m_vecMinsPreScaled; // 0x01A4
    fVector3 m_vecMaxsPreScaled; // 0x01B0
    fVector3 m_vecMins; // 0x01BC
    fVector3 m_vecMaxs; // 0x01C8
    uint32_t m_usSolidFlags; // 0x01D8
    uint32_t m_nSurroundType; // 0x01DC
    uint32_t m_nSolidType; // 0x01DD
    uint32_t m_triggerBloat; // 0x01DE
    fVector3 m_vecSpecifiedSurroundingMinsPreScaled; // 0x01E0
    fVector3 m_vecSpecifiedSurroundingMaxsPreScaled; // 0x01EC
    fVector3 m_vecSpecifiedSurroundingMins; // 0x01F8
    fVector3 m_vecSpecifiedSurroundingMaxs; // 0x0204
    float m_flElasticity; // 0x0248
    float m_flShadowCastDistance; // 0x024C
    fVector3 m_vecOrigin; // 0x0338
    fVector3 m_angRotation; // 0x0344
    uint32_t m_CollisionGroup; // 0x0354
    uint32_t m_bIsPlayerSimulated; // 0x04C8
    uint32_t m_bSimulatedEveryTick; // 0x04C9
    uint32_t m_bAnimatedEveryTick; // 0x04CA
    uint32_t m_bAlternateSorting; // 0x04CB
    uint32_t m_iTextureFrameIndex; // 0x04CC
    uint32_t m_hOwnerEntity; // 0x04D8
    uint32_t m_hEffectEntity; // 0x04DC
    uint32_t m_bOnFire; // 0x0515
    float m_CreationTime; // 0x0518
    uint32_t m_RealClassName; // 0x051C
    uint32_t m_OverrideMaterial; // 0x0520
    uint32_t m_OverrideSubMaterials[0]; // 0x0528
    uint32_t m_spawnflags; // 0x0640
    uint32_t m_iGModFlags; // 0x0644
    uintptr_t m_GMOD_bool[32]; // 0x06A0
    uintptr_t m_GMOD_float[32]; // 0x06C0
    uintptr_t m_GMOD_int[32]; // 0x0740
    uintptr_t m_GMOD_Vector[32]; // 0x07C0
    uintptr_t m_GMOD_QAngle[32]; // 0x0940
    uintptr_t m_GMOD_EHANDLE[32]; // 0x0AC0
    const char* m_GMOD_String0; // 0x0B40
    const char* m_GMOD_String1; // 0x0D40
    const char* m_GMOD_String2; // 0x0F40
    const char* m_GMOD_String3; // 0x1140
    int64_t m_GMOD_DataTable; // 0x1340
    uint32_t m_iCreationID; // 0x1388
    uint32_t m_iMapCreatedID; // 0x138C
    uint32_t m_nSkin; // 0x1398
    uint32_t m_nBody; // 0x139C
    uint32_t m_nHitboxSet; // 0x13A0
    float m_flPlaybackRate; // 0x13C0
    fVector3 m_vecForce; // 0x13CC
    uint32_t m_nForceBone; // 0x13D8
    uint32_t m_bClientSideFrameReset; // 0x140C
    float m_fadeMinDist; // 0x1444
    float m_fadeMaxDist; // 0x1448
    float m_flFadeScale; // 0x144C
    float m_flModelScale; // 0x149C
    float m_flModelWidthScale; // 0x149C
    uintptr_t m_flPoseParameter[24]; // 0x14A0
    uintptr_t m_flEncodedController[4]; // 0x15BC
    uint32_t m_bClientSideAnimation; // 0x160C
    uint32_t m_nNewSequenceParity; // 0x1610
    uint32_t m_nResetEventsParity; // 0x1614
    uint32_t m_nSequence; // 0x163C
    float m_flCycle; // 0x1644
    uint32_t m_hLightingOrigin; // 0x16C4
    uint32_t m_hLightingOriginRelative; // 0x16C8
    uint32_t m_nMuzzleFlashParity; // 0x16CC
    fVector3 m_OverrideViewTarget; // 0x16EC
    uint32_t m_pBoneManipulator; // 0x1778
    uint32_t m_pFlexManipulator; // 0x1780
    uint32_t m_hOwner; // 0x17D8
    uint32_t m_nViewModelIndex; // 0x17E0
    float m_flNextPrimaryAttack; // 0x17E4
    float m_flNextSecondaryAttack; // 0x17E8
    float m_flTimeWeaponIdle; // 0x17EC
    uint32_t m_iViewModelIndex; // 0x17F4
    uint32_t m_iWorldModelIndex; // 0x17F8
    uint32_t m_iState; // 0x1818
    uint32_t m_iPrimaryAmmoType; // 0x1820
    uint32_t m_iSecondaryAmmoType; // 0x1824
    uint32_t m_iClip1; // 0x1828
    uint32_t m_iClip2; // 0x182C
    uint32_t m_bFlipViewModel; // 0x1858
    uint32_t m_bActive; // 0x190C
};

class CWeaponCrossbow_HL1 // parent CBaseEntity {
public:
    void* m_OverrideSubMaterials; // 0x0000
    uint32_t movecollide; // 0x0000
    uint32_t movetype; // 0x0000
    uint32_t m_nRenderFX; // 0x0054
    uint32_t m_clrRender; // 0x0058
    uint32_t m_flAnimTime; // 0x0060
    uint32_t m_flSimulationTime; // 0x0068
    uint32_t m_ubInterpolationFrame; // 0x0074
    uint32_t m_fEffects; // 0x0078
    uint32_t m_nRenderMode; // 0x007C
    uint32_t m_nNextThinkTick; // 0x0084
    uint32_t m_nModelIndex; // 0x008C
    uint32_t m_takedamage; // 0x008E
    uint32_t m_iHealth; // 0x0090
    uint32_t m_iMaxHealth; // 0x0094
    uint32_t m_iTeamNum; // 0x009C
    uint32_t m_PredictableID; // 0x00A0
    float m_vecVelocity[0]; // 0x00F4
    float m_vecVelocity[1]; // 0x00F8
    float m_vecVelocity[2]; // 0x00FC
    uint32_t m_iParentAttachment; // 0x017A
    uint32_t moveparent; // 0x0190
    fVector3 m_vecMinsPreScaled; // 0x01A4
    fVector3 m_vecMaxsPreScaled; // 0x01B0
    fVector3 m_vecMins; // 0x01BC
    fVector3 m_vecMaxs; // 0x01C8
    uint32_t m_usSolidFlags; // 0x01D8
    uint32_t m_nSurroundType; // 0x01DC
    uint32_t m_nSolidType; // 0x01DD
    uint32_t m_triggerBloat; // 0x01DE
    fVector3 m_vecSpecifiedSurroundingMinsPreScaled; // 0x01E0
    fVector3 m_vecSpecifiedSurroundingMaxsPreScaled; // 0x01EC
    fVector3 m_vecSpecifiedSurroundingMins; // 0x01F8
    fVector3 m_vecSpecifiedSurroundingMaxs; // 0x0204
    float m_flElasticity; // 0x0248
    float m_flShadowCastDistance; // 0x024C
    fVector3 m_vecOrigin; // 0x0338
    fVector3 m_angRotation; // 0x0344
    uint32_t m_CollisionGroup; // 0x0354
    uint32_t m_bIsPlayerSimulated; // 0x04C8
    uint32_t m_bSimulatedEveryTick; // 0x04C9
    uint32_t m_bAnimatedEveryTick; // 0x04CA
    uint32_t m_bAlternateSorting; // 0x04CB
    uint32_t m_iTextureFrameIndex; // 0x04CC
    uint32_t m_hOwnerEntity; // 0x04D8
    uint32_t m_hEffectEntity; // 0x04DC
    uint32_t m_bOnFire; // 0x0515
    float m_CreationTime; // 0x0518
    uint32_t m_RealClassName; // 0x051C
    uint32_t m_OverrideMaterial; // 0x0520
    uint32_t m_OverrideSubMaterials[0]; // 0x0528
    uint32_t m_spawnflags; // 0x0640
    uint32_t m_iGModFlags; // 0x0644
    uintptr_t m_GMOD_bool[32]; // 0x06A0
    uintptr_t m_GMOD_float[32]; // 0x06C0
    uintptr_t m_GMOD_int[32]; // 0x0740
    uintptr_t m_GMOD_Vector[32]; // 0x07C0
    uintptr_t m_GMOD_QAngle[32]; // 0x0940
    uintptr_t m_GMOD_EHANDLE[32]; // 0x0AC0
    const char* m_GMOD_String0; // 0x0B40
    const char* m_GMOD_String1; // 0x0D40
    const char* m_GMOD_String2; // 0x0F40
    const char* m_GMOD_String3; // 0x1140
    int64_t m_GMOD_DataTable; // 0x1340
    uint32_t m_iCreationID; // 0x1388
    uint32_t m_iMapCreatedID; // 0x138C
    uint32_t m_nSkin; // 0x1398
    uint32_t m_nBody; // 0x139C
    uint32_t m_nHitboxSet; // 0x13A0
    float m_flPlaybackRate; // 0x13C0
    fVector3 m_vecForce; // 0x13CC
    uint32_t m_nForceBone; // 0x13D8
    uint32_t m_bClientSideFrameReset; // 0x140C
    float m_fadeMinDist; // 0x1444
    float m_fadeMaxDist; // 0x1448
    float m_flFadeScale; // 0x144C
    float m_flModelScale; // 0x149C
    float m_flModelWidthScale; // 0x149C
    uintptr_t m_flPoseParameter[24]; // 0x14A0
    uintptr_t m_flEncodedController[4]; // 0x15BC
    uint32_t m_bClientSideAnimation; // 0x160C
    uint32_t m_nNewSequenceParity; // 0x1610
    uint32_t m_nResetEventsParity; // 0x1614
    uint32_t m_nSequence; // 0x163C
    float m_flCycle; // 0x1644
    uint32_t m_hLightingOrigin; // 0x16C4
    uint32_t m_hLightingOriginRelative; // 0x16C8
    uint32_t m_nMuzzleFlashParity; // 0x16CC
    fVector3 m_OverrideViewTarget; // 0x16EC
    uint32_t m_pBoneManipulator; // 0x1778
    uint32_t m_pFlexManipulator; // 0x1780
    uint32_t m_hOwner; // 0x17D8
    uint32_t m_nViewModelIndex; // 0x17E0
    float m_flNextPrimaryAttack; // 0x17E4
    float m_flNextSecondaryAttack; // 0x17E8
    float m_flTimeWeaponIdle; // 0x17EC
    uint32_t m_iViewModelIndex; // 0x17F4
    uint32_t m_iWorldModelIndex; // 0x17F8
    uint32_t m_iState; // 0x1818
    uint32_t m_iPrimaryAmmoType; // 0x1820
    uint32_t m_iSecondaryAmmoType; // 0x1824
    uint32_t m_iClip1; // 0x1828
    uint32_t m_iClip2; // 0x182C
    uint32_t m_bFlipViewModel; // 0x1858
    uint32_t m_fInZoom; // 0x1888
};

class SmokeTrail // parent CBaseEntity {
public:
    void* m_OverrideSubMaterials; // 0x0000
    uint32_t movecollide; // 0x0000
    uint32_t movetype; // 0x0000
    uint32_t m_nRenderFX; // 0x0054
    uint32_t m_clrRender; // 0x0058
    uint32_t m_flAnimTime; // 0x0060
    uint32_t m_flSimulationTime; // 0x0068
    uint32_t m_ubInterpolationFrame; // 0x0074
    uint32_t m_fEffects; // 0x0078
    uint32_t m_nRenderMode; // 0x007C
    uint32_t m_nModelIndex; // 0x008C
    uint32_t m_takedamage; // 0x008E
    uint32_t m_iHealth; // 0x0090
    uint32_t m_iMaxHealth; // 0x0094
    uint32_t m_iTeamNum; // 0x009C
    uint32_t m_PredictableID; // 0x00A0
    float m_vecVelocity[0]; // 0x00F4
    float m_vecVelocity[1]; // 0x00F8
    float m_vecVelocity[2]; // 0x00FC
    uint32_t m_iParentAttachment; // 0x017A
    uint32_t moveparent; // 0x0190
    fVector3 m_vecMinsPreScaled; // 0x01A4
    fVector3 m_vecMaxsPreScaled; // 0x01B0
    fVector3 m_vecMins; // 0x01BC
    fVector3 m_vecMaxs; // 0x01C8
    uint32_t m_usSolidFlags; // 0x01D8
    uint32_t m_nSurroundType; // 0x01DC
    uint32_t m_nSolidType; // 0x01DD
    uint32_t m_triggerBloat; // 0x01DE
    fVector3 m_vecSpecifiedSurroundingMinsPreScaled; // 0x01E0
    fVector3 m_vecSpecifiedSurroundingMaxsPreScaled; // 0x01EC
    fVector3 m_vecSpecifiedSurroundingMins; // 0x01F8
    fVector3 m_vecSpecifiedSurroundingMaxs; // 0x0204
    float m_flElasticity; // 0x0248
    float m_flShadowCastDistance; // 0x024C
    fVector3 m_vecOrigin; // 0x0338
    fVector3 m_angRotation; // 0x0344
    uint32_t m_CollisionGroup; // 0x0354
    uint32_t m_bIsPlayerSimulated; // 0x04C8
    uint32_t m_bSimulatedEveryTick; // 0x04C9
    uint32_t m_bAnimatedEveryTick; // 0x04CA
    uint32_t m_bAlternateSorting; // 0x04CB
    uint32_t m_iTextureFrameIndex; // 0x04CC
    uint32_t m_hOwnerEntity; // 0x04D8
    uint32_t m_hEffectEntity; // 0x04DC
    uint32_t m_bOnFire; // 0x0515
    float m_CreationTime; // 0x0518
    uint32_t m_RealClassName; // 0x051C
    uint32_t m_OverrideMaterial; // 0x0520
    uint32_t m_OverrideSubMaterials[0]; // 0x0528
    uint32_t m_spawnflags; // 0x0640
    uint32_t m_iGModFlags; // 0x0644
    uintptr_t m_GMOD_bool[32]; // 0x06A0
    uintptr_t m_GMOD_float[32]; // 0x06C0
    uintptr_t m_GMOD_int[32]; // 0x0740
    uintptr_t m_GMOD_Vector[32]; // 0x07C0
    uintptr_t m_GMOD_QAngle[32]; // 0x0940
    uintptr_t m_GMOD_EHANDLE[32]; // 0x0AC0
    const char* m_GMOD_String0; // 0x0B40
    const char* m_GMOD_String1; // 0x0D40
    const char* m_GMOD_String2; // 0x0F40
    const char* m_GMOD_String3; // 0x1140
    int64_t m_GMOD_DataTable; // 0x1340
    uint32_t m_iCreationID; // 0x1388
    uint32_t m_iMapCreatedID; // 0x138C
    float m_SpawnRate; // 0x147C
    fVector3 m_StartColor; // 0x1480
    fVector3 m_EndColor; // 0x148C
    float m_Opacity; // 0x1498
    float m_ParticleLifetime; // 0x149C
    float m_StopEmitTime; // 0x14A0
    float m_MinSpeed; // 0x14A4
    float m_MaxSpeed; // 0x14A8
    float m_MinDirectedSpeed; // 0x14AC
    float m_MaxDirectedSpeed; // 0x14B0
    float m_StartSize; // 0x14B4
    float m_EndSize; // 0x14B8
    float m_SpawnRadius; // 0x14BC
    uint32_t m_bEmit; // 0x14CC
    uint32_t m_nAttachment; // 0x14D0
};

class CFireTrail // parent CBaseEntity {
public:
    uint32_t movecollide; // 0x0000
    uint32_t movetype; // 0x0000
    void* m_OverrideSubMaterials; // 0x0000
    uint32_t m_nRenderFX; // 0x0054
    uint32_t m_clrRender; // 0x0058
    uint32_t m_flAnimTime; // 0x0060
    uint32_t m_flSimulationTime; // 0x0068
    uint32_t m_ubInterpolationFrame; // 0x0074
    uint32_t m_fEffects; // 0x0078
    uint32_t m_nRenderMode; // 0x007C
    uint32_t m_nModelIndex; // 0x008C
    uint32_t m_takedamage; // 0x008E
    uint32_t m_iHealth; // 0x0090
    uint32_t m_iMaxHealth; // 0x0094
    uint32_t m_iTeamNum; // 0x009C
    uint32_t m_PredictableID; // 0x00A0
    float m_vecVelocity[0]; // 0x00F4
    float m_vecVelocity[1]; // 0x00F8
    float m_vecVelocity[2]; // 0x00FC
    uint32_t m_iParentAttachment; // 0x017A
    uint32_t moveparent; // 0x0190
    fVector3 m_vecMinsPreScaled; // 0x01A4
    fVector3 m_vecMaxsPreScaled; // 0x01B0
    fVector3 m_vecMins; // 0x01BC
    fVector3 m_vecMaxs; // 0x01C8
    uint32_t m_usSolidFlags; // 0x01D8
    uint32_t m_nSurroundType; // 0x01DC
    uint32_t m_nSolidType; // 0x01DD
    uint32_t m_triggerBloat; // 0x01DE
    fVector3 m_vecSpecifiedSurroundingMinsPreScaled; // 0x01E0
    fVector3 m_vecSpecifiedSurroundingMaxsPreScaled; // 0x01EC
    fVector3 m_vecSpecifiedSurroundingMins; // 0x01F8
    fVector3 m_vecSpecifiedSurroundingMaxs; // 0x0204
    float m_flElasticity; // 0x0248
    float m_flShadowCastDistance; // 0x024C
    fVector3 m_vecOrigin; // 0x0338
    fVector3 m_angRotation; // 0x0344
    uint32_t m_CollisionGroup; // 0x0354
    uint32_t m_bIsPlayerSimulated; // 0x04C8
    uint32_t m_bSimulatedEveryTick; // 0x04C9
    uint32_t m_bAnimatedEveryTick; // 0x04CA
    uint32_t m_bAlternateSorting; // 0x04CB
    uint32_t m_iTextureFrameIndex; // 0x04CC
    uint32_t m_hOwnerEntity; // 0x04D8
    uint32_t m_hEffectEntity; // 0x04DC
    uint32_t m_bOnFire; // 0x0515
    float m_CreationTime; // 0x0518
    uint32_t m_RealClassName; // 0x051C
    uint32_t m_OverrideMaterial; // 0x0520
    uint32_t m_OverrideSubMaterials[0]; // 0x0528
    uint32_t m_spawnflags; // 0x0640
    uint32_t m_iGModFlags; // 0x0644
    uintptr_t m_GMOD_bool[32]; // 0x06A0
    uintptr_t m_GMOD_float[32]; // 0x06C0
    uintptr_t m_GMOD_int[32]; // 0x0740
    uintptr_t m_GMOD_Vector[32]; // 0x07C0
    uintptr_t m_GMOD_QAngle[32]; // 0x0940
    uintptr_t m_GMOD_EHANDLE[32]; // 0x0AC0
    const char* m_GMOD_String0; // 0x0B40
    const char* m_GMOD_String1; // 0x0D40
    const char* m_GMOD_String2; // 0x0F40
    const char* m_GMOD_String3; // 0x1140
    int64_t m_GMOD_DataTable; // 0x1340
    uint32_t m_iCreationID; // 0x1388
    uint32_t m_iMapCreatedID; // 0x138C
    uint32_t m_nAttachment; // 0x147C
    float m_flLifetime; // 0x1480
};

class CTEDynamicLight // parent CBaseTempEntity {
public:
    fVector3 m_vecOrigin; // 0x0010
    float m_fRadius; // 0x001C
    uint32_t r; // 0x0020
    uint32_t g; // 0x0024
    uint32_t b; // 0x0028
    uint32_t exponent; // 0x002C
    float m_fTime; // 0x0030
    float m_fDecay; // 0x0034
};

class CTEBubbleTrail // parent CBaseTempEntity {
public:
    fVector3 m_vecMins; // 0x0010
    fVector3 m_vecMaxs; // 0x001C
    float m_flWaterZ; // 0x0028
    uint32_t m_nModelIndex; // 0x002C
    uint32_t m_nCount; // 0x0030
    float m_fSpeed; // 0x0034
};

class CTEClientProjectile // parent CBaseTempEntity {
public:
    fVector3 m_vecOrigin; // 0x0010
    fVector3 m_vecVelocity; // 0x001C
    uint32_t m_nModelIndex; // 0x0028
    uint32_t m_nLifeTime; // 0x002C
    uint32_t m_hOwner; // 0x0030
};

class CTEBubbles // parent CBaseTempEntity {
public:
    fVector3 m_vecMins; // 0x0010
    fVector3 m_vecMaxs; // 0x001C
    float m_fHeight; // 0x0028
    uint32_t m_nModelIndex; // 0x002C
    uint32_t m_nCount; // 0x0030
    float m_fSpeed; // 0x0034
};

class CTeam {
public:
    uint32_t player_array_element; // 0x0000
    void* "player_array"; // 0x0000
    const char* m_szTeamname; // 0x13A4
    uint32_t m_iScore; // 0x13C4
    uint32_t m_iRoundsWon; // 0x13C8
    uint32_t m_iTeamNum; // 0x13D8
};

class DustTrail // parent CBaseEntity {
public:
    uint32_t movetype; // 0x0000
    void* m_OverrideSubMaterials; // 0x0000
    uint32_t movecollide; // 0x0000
    uint32_t m_nRenderFX; // 0x0054
    uint32_t m_clrRender; // 0x0058
    uint32_t m_flAnimTime; // 0x0060
    uint32_t m_flSimulationTime; // 0x0068
    uint32_t m_ubInterpolationFrame; // 0x0074
    uint32_t m_fEffects; // 0x0078
    uint32_t m_nRenderMode; // 0x007C
    uint32_t m_nModelIndex; // 0x008C
    uint32_t m_takedamage; // 0x008E
    uint32_t m_iHealth; // 0x0090
    uint32_t m_iMaxHealth; // 0x0094
    uint32_t m_iTeamNum; // 0x009C
    uint32_t m_PredictableID; // 0x00A0
    float m_vecVelocity[0]; // 0x00F4
    float m_vecVelocity[1]; // 0x00F8
    float m_vecVelocity[2]; // 0x00FC
    uint32_t m_iParentAttachment; // 0x017A
    uint32_t moveparent; // 0x0190
    fVector3 m_vecMinsPreScaled; // 0x01A4
    fVector3 m_vecMaxsPreScaled; // 0x01B0
    fVector3 m_vecMins; // 0x01BC
    fVector3 m_vecMaxs; // 0x01C8
    uint32_t m_usSolidFlags; // 0x01D8
    uint32_t m_nSurroundType; // 0x01DC
    uint32_t m_nSolidType; // 0x01DD
    uint32_t m_triggerBloat; // 0x01DE
    fVector3 m_vecSpecifiedSurroundingMinsPreScaled; // 0x01E0
    fVector3 m_vecSpecifiedSurroundingMaxsPreScaled; // 0x01EC
    fVector3 m_vecSpecifiedSurroundingMins; // 0x01F8
    fVector3 m_vecSpecifiedSurroundingMaxs; // 0x0204
    float m_flElasticity; // 0x0248
    float m_flShadowCastDistance; // 0x024C
    fVector3 m_vecOrigin; // 0x0338
    fVector3 m_angRotation; // 0x0344
    uint32_t m_CollisionGroup; // 0x0354
    uint32_t m_bIsPlayerSimulated; // 0x04C8
    uint32_t m_bSimulatedEveryTick; // 0x04C9
    uint32_t m_bAnimatedEveryTick; // 0x04CA
    uint32_t m_bAlternateSorting; // 0x04CB
    uint32_t m_iTextureFrameIndex; // 0x04CC
    uint32_t m_hOwnerEntity; // 0x04D8
    uint32_t m_hEffectEntity; // 0x04DC
    uint32_t m_bOnFire; // 0x0515
    float m_CreationTime; // 0x0518
    uint32_t m_RealClassName; // 0x051C
    uint32_t m_OverrideMaterial; // 0x0520
    uint32_t m_OverrideSubMaterials[0]; // 0x0528
    uint32_t m_spawnflags; // 0x0640
    uint32_t m_iGModFlags; // 0x0644
    uintptr_t m_GMOD_bool[32]; // 0x06A0
    uintptr_t m_GMOD_float[32]; // 0x06C0
    uintptr_t m_GMOD_int[32]; // 0x0740
    uintptr_t m_GMOD_Vector[32]; // 0x07C0
    uintptr_t m_GMOD_QAngle[32]; // 0x0940
    uintptr_t m_GMOD_EHANDLE[32]; // 0x0AC0
    const char* m_GMOD_String0; // 0x0B40
    const char* m_GMOD_String1; // 0x0D40
    const char* m_GMOD_String2; // 0x0F40
    const char* m_GMOD_String3; // 0x1140
    int64_t m_GMOD_DataTable; // 0x1340
    uint32_t m_iCreationID; // 0x1388
    uint32_t m_iMapCreatedID; // 0x138C
    float m_SpawnRate; // 0x147C
    fVector3 m_Color; // 0x1480
    float m_Opacity; // 0x148C
    float m_ParticleLifetime; // 0x1490
    float m_StopEmitTime; // 0x1498
    float m_MinSpeed; // 0x149C
    float m_MaxSpeed; // 0x14A0
    float m_MinDirectedSpeed; // 0x14A4
    float m_MaxDirectedSpeed; // 0x14A8
    float m_StartSize; // 0x14AC
    float m_EndSize; // 0x14B0
    float m_SpawnRadius; // 0x14B4
    uint32_t m_bEmit; // 0x14C4
};

class CTEBSPDecal // parent CBaseTempEntity {
public:
    fVector3 m_vecOrigin; // 0x0010
    uint32_t m_nEntity; // 0x001C
    uint32_t m_nIndex; // 0x0020
};

class CPropJeepEpisodic // parent CBaseEntity {
public:
    uint32_t movetype; // 0x0000
    void* m_iRadarContactType; // 0x0000
    void* m_vecRadarContactPos; // 0x0000
    uint32_t movecollide; // 0x0000
    void* m_OverrideSubMaterials; // 0x0000
    uint32_t m_nRenderFX; // 0x0054
    uint32_t m_clrRender; // 0x0058
    uint32_t m_flAnimTime; // 0x0060
    uint32_t m_flSimulationTime; // 0x0068
    uint32_t m_ubInterpolationFrame; // 0x0074
    uint32_t m_fEffects; // 0x0078
    uint32_t m_nRenderMode; // 0x007C
    uint32_t m_nModelIndex; // 0x008C
    uint32_t m_takedamage; // 0x008E
    uint32_t m_iHealth; // 0x0090
    uint32_t m_iMaxHealth; // 0x0094
    uint32_t m_iTeamNum; // 0x009C
    uint32_t m_PredictableID; // 0x00A0
    float m_vecVelocity[0]; // 0x00F4
    float m_vecVelocity[1]; // 0x00F8
    float m_vecVelocity[2]; // 0x00FC
    uint32_t m_iParentAttachment; // 0x017A
    uint32_t moveparent; // 0x0190
    fVector3 m_vecMinsPreScaled; // 0x01A4
    fVector3 m_vecMaxsPreScaled; // 0x01B0
    fVector3 m_vecMins; // 0x01BC
    fVector3 m_vecMaxs; // 0x01C8
    uint32_t m_usSolidFlags; // 0x01D8
    uint32_t m_nSurroundType; // 0x01DC
    uint32_t m_nSolidType; // 0x01DD
    uint32_t m_triggerBloat; // 0x01DE
    fVector3 m_vecSpecifiedSurroundingMinsPreScaled; // 0x01E0
    fVector3 m_vecSpecifiedSurroundingMaxsPreScaled; // 0x01EC
    fVector3 m_vecSpecifiedSurroundingMins; // 0x01F8
    fVector3 m_vecSpecifiedSurroundingMaxs; // 0x0204
    float m_flElasticity; // 0x0248
    float m_flShadowCastDistance; // 0x024C
    fVector3 m_vecOrigin; // 0x0338
    fVector3 m_angRotation; // 0x0344
    uint32_t m_CollisionGroup; // 0x0354
    uint32_t m_bIsPlayerSimulated; // 0x04C8
    uint32_t m_bSimulatedEveryTick; // 0x04C9
    uint32_t m_bAnimatedEveryTick; // 0x04CA
    uint32_t m_bAlternateSorting; // 0x04CB
    uint32_t m_iTextureFrameIndex; // 0x04CC
    uint32_t m_hOwnerEntity; // 0x04D8
    uint32_t m_hEffectEntity; // 0x04DC
    uint32_t m_bOnFire; // 0x0515
    float m_CreationTime; // 0x0518
    uint32_t m_RealClassName; // 0x051C
    uint32_t m_OverrideMaterial; // 0x0520
    uint32_t m_OverrideSubMaterials[0]; // 0x0528
    uint32_t m_spawnflags; // 0x0640
    uint32_t m_iGModFlags; // 0x0644
    uintptr_t m_GMOD_bool[32]; // 0x06A0
    uintptr_t m_GMOD_float[32]; // 0x06C0
    uintptr_t m_GMOD_int[32]; // 0x0740
    uintptr_t m_GMOD_Vector[32]; // 0x07C0
    uintptr_t m_GMOD_QAngle[32]; // 0x0940
    uintptr_t m_GMOD_EHANDLE[32]; // 0x0AC0
    const char* m_GMOD_String0; // 0x0B40
    const char* m_GMOD_String1; // 0x0D40
    const char* m_GMOD_String2; // 0x0F40
    const char* m_GMOD_String3; // 0x1140
    int64_t m_GMOD_DataTable; // 0x1340
    uint32_t m_iCreationID; // 0x1388
    uint32_t m_iMapCreatedID; // 0x138C
    uint32_t m_nSkin; // 0x1398
    uint32_t m_nBody; // 0x139C
    uint32_t m_nHitboxSet; // 0x13A0
    float m_flPlaybackRate; // 0x13C0
    fVector3 m_vecForce; // 0x13CC
    uint32_t m_nForceBone; // 0x13D8
    uint32_t m_bClientSideFrameReset; // 0x140C
    float m_fadeMinDist; // 0x1444
    float m_fadeMaxDist; // 0x1448
    float m_flFadeScale; // 0x144C
    float m_flModelScale; // 0x149C
    float m_flModelWidthScale; // 0x149C
    uintptr_t m_flPoseParameter[24]; // 0x14A0
    uintptr_t m_flEncodedController[4]; // 0x15BC
    uint32_t m_bClientSideAnimation; // 0x160C
    uint32_t m_nNewSequenceParity; // 0x1610
    uint32_t m_nResetEventsParity; // 0x1614
    uint32_t m_nSequence; // 0x163C
    float m_flCycle; // 0x1644
    uint32_t m_hLightingOrigin; // 0x16C4
    uint32_t m_hLightingOriginRelative; // 0x16C8
    uint32_t m_nMuzzleFlashParity; // 0x16CC
    fVector3 m_OverrideViewTarget; // 0x16EC
    uint32_t m_pBoneManipulator; // 0x1778
    uint32_t m_pFlexManipulator; // 0x1780
    uint32_t m_hPlayer; // 0x17DC
    uint32_t m_nSpeed; // 0x17E0
    uint32_t m_nRPM; // 0x17E4
    float m_flThrottle; // 0x17E8
    uint32_t m_nBoostTimeLeft; // 0x17EC
    uint32_t m_nHasBoost; // 0x17F0
    uint32_t m_nScannerDisabledWeapons; // 0x17F4
    uint32_t m_nScannerDisabledVehicle; // 0x17F8
    uint32_t m_bEnterAnimOn; // 0x1818
    uint32_t m_bExitAnimOn; // 0x1819
    fVector3 m_vecGunCrosshair; // 0x1820
    fVector3 m_vecEyeExitEndpoint; // 0x185C
    uint32_t m_bHasGun; // 0x1868
    uint32_t m_bUnableToFire; // 0x1869
    uint32_t m_bHeadlightIsOn; // 0x1924
    uint32_t m_iNumRadarContacts; // 0x1928
    fVector3 m_vecRadarContactPos[0]; // 0x192C
    uint32_t m_iRadarContactType[0]; // 0x1A4C
};

class CTEBreakModel // parent CBaseTempEntity {
public:
    fVector3 m_vecOrigin; // 0x0010
    float m_angRotation[0]; // 0x001C
    float m_angRotation[1]; // 0x0020
    float m_angRotation[2]; // 0x0024
    fVector3 m_vecSize; // 0x0028
    fVector3 m_vecVelocity; // 0x0034
    uint32_t m_nRandomization; // 0x0040
    uint32_t m_nModelIndex; // 0x0044
    uint32_t m_nCount; // 0x0048
    float m_fTime; // 0x004C
    uint32_t m_nFlags; // 0x0050
};

class CTEBeamRing // parent CBaseBeam {
public:
    uint32_t m_nModelIndex; // 0x0010
    uint32_t m_nHaloIndex; // 0x0014
    uint32_t m_nStartFrame; // 0x0018
    uint32_t m_nFrameRate; // 0x001C
    float m_fLife; // 0x0020
    float m_fWidth; // 0x0024
    float m_fEndWidth; // 0x0028
    uint32_t m_nFadeLength; // 0x002C
    float m_fAmplitude; // 0x0030
    uint32_t r; // 0x0034
    uint32_t g; // 0x0038
    uint32_t b; // 0x003C
    uint32_t a; // 0x0040
    uint32_t m_nSpeed; // 0x0044
    uint32_t m_nFlags; // 0x0048
    uint32_t m_nStartEntity; // 0x004C
    uint32_t m_nEndEntity; // 0x0050
};

class SporeExplosion // parent CBaseEntity {
public:
    void* m_OverrideSubMaterials; // 0x0000
    uint32_t movecollide; // 0x0000
    uint32_t movetype; // 0x0000
    uint32_t m_nRenderFX; // 0x0054
    uint32_t m_clrRender; // 0x0058
    uint32_t m_flAnimTime; // 0x0060
    uint32_t m_flSimulationTime; // 0x0068
    uint32_t m_ubInterpolationFrame; // 0x0074
    uint32_t m_fEffects; // 0x0078
    uint32_t m_nRenderMode; // 0x007C
    uint32_t m_nModelIndex; // 0x008C
    uint32_t m_takedamage; // 0x008E
    uint32_t m_iHealth; // 0x0090
    uint32_t m_iMaxHealth; // 0x0094
    uint32_t m_iTeamNum; // 0x009C
    uint32_t m_PredictableID; // 0x00A0
    float m_vecVelocity[0]; // 0x00F4
    float m_vecVelocity[1]; // 0x00F8
    float m_vecVelocity[2]; // 0x00FC
    uint32_t m_iParentAttachment; // 0x017A
    uint32_t moveparent; // 0x0190
    fVector3 m_vecMinsPreScaled; // 0x01A4
    fVector3 m_vecMaxsPreScaled; // 0x01B0
    fVector3 m_vecMins; // 0x01BC
    fVector3 m_vecMaxs; // 0x01C8
    uint32_t m_usSolidFlags; // 0x01D8
    uint32_t m_nSurroundType; // 0x01DC
    uint32_t m_nSolidType; // 0x01DD
    uint32_t m_triggerBloat; // 0x01DE
    fVector3 m_vecSpecifiedSurroundingMinsPreScaled; // 0x01E0
    fVector3 m_vecSpecifiedSurroundingMaxsPreScaled; // 0x01EC
    fVector3 m_vecSpecifiedSurroundingMins; // 0x01F8
    fVector3 m_vecSpecifiedSurroundingMaxs; // 0x0204
    float m_flElasticity; // 0x0248
    float m_flShadowCastDistance; // 0x024C
    fVector3 m_vecOrigin; // 0x0338
    fVector3 m_angRotation; // 0x0344
    uint32_t m_CollisionGroup; // 0x0354
    uint32_t m_bIsPlayerSimulated; // 0x04C8
    uint32_t m_bSimulatedEveryTick; // 0x04C9
    uint32_t m_bAnimatedEveryTick; // 0x04CA
    uint32_t m_bAlternateSorting; // 0x04CB
    uint32_t m_iTextureFrameIndex; // 0x04CC
    uint32_t m_hOwnerEntity; // 0x04D8
    uint32_t m_hEffectEntity; // 0x04DC
    uint32_t m_bOnFire; // 0x0515
    float m_CreationTime; // 0x0518
    uint32_t m_RealClassName; // 0x051C
    uint32_t m_OverrideMaterial; // 0x0520
    uint32_t m_OverrideSubMaterials[0]; // 0x0528
    uint32_t m_spawnflags; // 0x0640
    uint32_t m_iGModFlags; // 0x0644
    uintptr_t m_GMOD_bool[32]; // 0x06A0
    uintptr_t m_GMOD_float[32]; // 0x06C0
    uintptr_t m_GMOD_int[32]; // 0x0740
    uintptr_t m_GMOD_Vector[32]; // 0x07C0
    uintptr_t m_GMOD_QAngle[32]; // 0x0940
    uintptr_t m_GMOD_EHANDLE[32]; // 0x0AC0
    const char* m_GMOD_String0; // 0x0B40
    const char* m_GMOD_String1; // 0x0D40
    const char* m_GMOD_String2; // 0x0F40
    const char* m_GMOD_String3; // 0x1140
    int64_t m_GMOD_DataTable; // 0x1340
    uint32_t m_iCreationID; // 0x1388
    uint32_t m_iMapCreatedID; // 0x138C
    float m_flSpawnRate; // 0x147C
    float m_flParticleLifetime; // 0x1480
    float m_flStartSize; // 0x1484
    float m_flEndSize; // 0x1488
    float m_flSpawnRadius; // 0x148C
    uint32_t m_bEmit; // 0x1494
    uint32_t m_bDontRemove; // 0x1495
};

class CTEBeamPoints // parent CBaseBeam {
public:
    uint32_t m_nModelIndex; // 0x0010
    uint32_t m_nHaloIndex; // 0x0014
    uint32_t m_nStartFrame; // 0x0018
    uint32_t m_nFrameRate; // 0x001C
    float m_fLife; // 0x0020
    float m_fWidth; // 0x0024
    float m_fEndWidth; // 0x0028
    uint32_t m_nFadeLength; // 0x002C
    float m_fAmplitude; // 0x0030
    uint32_t r; // 0x0034
    uint32_t g; // 0x0038
    uint32_t b; // 0x003C
    uint32_t a; // 0x0040
    uint32_t m_nSpeed; // 0x0044
    uint32_t m_nFlags; // 0x0048
    fVector3 m_vecStartPoint; // 0x004C
    fVector3 m_vecEndPoint; // 0x0058
};

class CSmokeStack // parent CBaseEntity {
public:
    void* m_OverrideSubMaterials; // 0x0000
    uint32_t movecollide; // 0x0000
    uint32_t movetype; // 0x0000
    uint32_t m_nRenderFX; // 0x0054
    uint32_t m_clrRender; // 0x0058
    uint32_t m_flAnimTime; // 0x0060
    uint32_t m_flSimulationTime; // 0x0068
    uint32_t m_ubInterpolationFrame; // 0x0074
    uint32_t m_fEffects; // 0x0078
    uint32_t m_nRenderMode; // 0x007C
    uint32_t m_nModelIndex; // 0x008C
    uint32_t m_takedamage; // 0x008E
    uint32_t m_iHealth; // 0x0090
    uint32_t m_iMaxHealth; // 0x0094
    uint32_t m_iTeamNum; // 0x009C
    uint32_t m_PredictableID; // 0x00A0
    float m_vecVelocity[0]; // 0x00F4
    float m_vecVelocity[1]; // 0x00F8
    float m_vecVelocity[2]; // 0x00FC
    uint32_t m_iParentAttachment; // 0x017A
    uint32_t moveparent; // 0x0190
    fVector3 m_vecMinsPreScaled; // 0x01A4
    fVector3 m_vecMaxsPreScaled; // 0x01B0
    fVector3 m_vecMins; // 0x01BC
    fVector3 m_vecMaxs; // 0x01C8
    uint32_t m_usSolidFlags; // 0x01D8
    uint32_t m_nSurroundType; // 0x01DC
    uint32_t m_nSolidType; // 0x01DD
    uint32_t m_triggerBloat; // 0x01DE
    fVector3 m_vecSpecifiedSurroundingMinsPreScaled; // 0x01E0
    fVector3 m_vecSpecifiedSurroundingMaxsPreScaled; // 0x01EC
    fVector3 m_vecSpecifiedSurroundingMins; // 0x01F8
    fVector3 m_vecSpecifiedSurroundingMaxs; // 0x0204
    float m_flElasticity; // 0x0248
    float m_flShadowCastDistance; // 0x024C
    fVector3 m_vecOrigin; // 0x0338
    fVector3 m_angRotation; // 0x0344
    uint32_t m_CollisionGroup; // 0x0354
    uint32_t m_bIsPlayerSimulated; // 0x04C8
    uint32_t m_bSimulatedEveryTick; // 0x04C9
    uint32_t m_bAnimatedEveryTick; // 0x04CA
    uint32_t m_bAlternateSorting; // 0x04CB
    uint32_t m_iTextureFrameIndex; // 0x04CC
    uint32_t m_hOwnerEntity; // 0x04D8
    uint32_t m_hEffectEntity; // 0x04DC
    uint32_t m_bOnFire; // 0x0515
    float m_CreationTime; // 0x0518
    uint32_t m_RealClassName; // 0x051C
    uint32_t m_OverrideMaterial; // 0x0520
    uint32_t m_OverrideSubMaterials[0]; // 0x0528
    uint32_t m_spawnflags; // 0x0640
    uint32_t m_iGModFlags; // 0x0644
    uintptr_t m_GMOD_bool[32]; // 0x06A0
    uintptr_t m_GMOD_float[32]; // 0x06C0
    uintptr_t m_GMOD_int[32]; // 0x0740
    uintptr_t m_GMOD_Vector[32]; // 0x07C0
    uintptr_t m_GMOD_QAngle[32]; // 0x0940
    uintptr_t m_GMOD_EHANDLE[32]; // 0x0AC0
    const char* m_GMOD_String0; // 0x0B40
    const char* m_GMOD_String1; // 0x0D40
    const char* m_GMOD_String2; // 0x0F40
    const char* m_GMOD_String3; // 0x1140
    int64_t m_GMOD_DataTable; // 0x1340
    uint32_t m_iCreationID; // 0x1388
    uint32_t m_iMapCreatedID; // 0x138C
    float m_SpreadSpeed; // 0x14CC
    float m_Speed; // 0x14D0
    float m_StartSize; // 0x14D4
    float m_EndSize; // 0x14D8
    float m_Rate; // 0x14DC
    float m_JetLength; // 0x14E0
    uint32_t m_bEmit; // 0x14E4
    float m_flBaseSpread; // 0x14E8
    fVector3 m_AmbientLight.m_vPos; // 0x14EC
    fVector3 m_AmbientLight.m_vColor; // 0x14F8
    float m_AmbientLight.m_flIntensity; // 0x1504
    fVector3 m_DirLight.m_vPos; // 0x1508
    fVector3 m_DirLight.m_vColor; // 0x1514
    float m_DirLight.m_flIntensity; // 0x1520
    fVector3 m_vWind; // 0x1530
    float m_flTwist; // 0x153C
    uint32_t m_iMaterialModel; // 0x1540
    float m_flRollSpeed; // 0x1578
};

class CTEBeamLaser // parent CBaseBeam {
public:
    uint32_t m_nModelIndex; // 0x0010
    uint32_t m_nHaloIndex; // 0x0014
    uint32_t m_nStartFrame; // 0x0018
    uint32_t m_nFrameRate; // 0x001C
    float m_fLife; // 0x0020
    float m_fWidth; // 0x0024
    float m_fEndWidth; // 0x0028
    uint32_t m_nFadeLength; // 0x002C
    float m_fAmplitude; // 0x0030
    uint32_t r; // 0x0034
    uint32_t g; // 0x0038
    uint32_t b; // 0x003C
    uint32_t a; // 0x0040
    uint32_t m_nSpeed; // 0x0044
    uint32_t m_nFlags; // 0x0048
    uint32_t m_nStartEntity; // 0x004C
    uint32_t m_nEndEntity; // 0x0050
};

class CPrecipitationBlocker // parent CBaseEntity {
public:
    void* m_OverrideSubMaterials; // 0x0000
    uint32_t movecollide; // 0x0000
    uint32_t movetype; // 0x0000
    uint32_t m_nRenderFX; // 0x0054
    uint32_t m_clrRender; // 0x0058
    uint32_t m_flAnimTime; // 0x0060
    uint32_t m_flSimulationTime; // 0x0068
    uint32_t m_ubInterpolationFrame; // 0x0074
    uint32_t m_fEffects; // 0x0078
    uint32_t m_nRenderMode; // 0x007C
    uint32_t m_nModelIndex; // 0x008C
    uint32_t m_takedamage; // 0x008E
    uint32_t m_iHealth; // 0x0090
    uint32_t m_iMaxHealth; // 0x0094
    uint32_t m_iTeamNum; // 0x009C
    uint32_t m_PredictableID; // 0x00A0
    float m_vecVelocity[0]; // 0x00F4
    float m_vecVelocity[1]; // 0x00F8
    float m_vecVelocity[2]; // 0x00FC
    uint32_t m_iParentAttachment; // 0x017A
    uint32_t moveparent; // 0x0190
    fVector3 m_vecMinsPreScaled; // 0x01A4
    fVector3 m_vecMaxsPreScaled; // 0x01B0
    fVector3 m_vecMins; // 0x01BC
    fVector3 m_vecMaxs; // 0x01C8
    uint32_t m_usSolidFlags; // 0x01D8
    uint32_t m_nSurroundType; // 0x01DC
    uint32_t m_nSolidType; // 0x01DD
    uint32_t m_triggerBloat; // 0x01DE
    fVector3 m_vecSpecifiedSurroundingMinsPreScaled; // 0x01E0
    fVector3 m_vecSpecifiedSurroundingMaxsPreScaled; // 0x01EC
    fVector3 m_vecSpecifiedSurroundingMins; // 0x01F8
    fVector3 m_vecSpecifiedSurroundingMaxs; // 0x0204
    float m_flElasticity; // 0x0248
    float m_flShadowCastDistance; // 0x024C
    fVector3 m_vecOrigin; // 0x0338
    fVector3 m_angRotation; // 0x0344
    uint32_t m_CollisionGroup; // 0x0354
    uint32_t m_bIsPlayerSimulated; // 0x04C8
    uint32_t m_bSimulatedEveryTick; // 0x04C9
    uint32_t m_bAnimatedEveryTick; // 0x04CA
    uint32_t m_bAlternateSorting; // 0x04CB
    uint32_t m_iTextureFrameIndex; // 0x04CC
    uint32_t m_hOwnerEntity; // 0x04D8
    uint32_t m_hEffectEntity; // 0x04DC
    uint32_t m_bOnFire; // 0x0515
    float m_CreationTime; // 0x0518
    uint32_t m_RealClassName; // 0x051C
    uint32_t m_OverrideMaterial; // 0x0520
    uint32_t m_OverrideSubMaterials[0]; // 0x0528
    uint32_t m_spawnflags; // 0x0640
    uint32_t m_iGModFlags; // 0x0644
    uintptr_t m_GMOD_bool[32]; // 0x06A0
    uintptr_t m_GMOD_float[32]; // 0x06C0
    uintptr_t m_GMOD_int[32]; // 0x0740
    uintptr_t m_GMOD_Vector[32]; // 0x07C0
    uintptr_t m_GMOD_QAngle[32]; // 0x0940
    uintptr_t m_GMOD_EHANDLE[32]; // 0x0AC0
    const char* m_GMOD_String0; // 0x0B40
    const char* m_GMOD_String1; // 0x0D40
    const char* m_GMOD_String2; // 0x0F40
    const char* m_GMOD_String3; // 0x1140
    int64_t m_GMOD_DataTable; // 0x1340
    uint32_t m_iCreationID; // 0x1388
    uint32_t m_iMapCreatedID; // 0x138C
};

class CWeaponPhysCannon // parent CBaseEntity {
public:
    uint32_t movecollide; // 0x0000
    uint32_t movetype; // 0x0000
    void* m_OverrideSubMaterials; // 0x0000
    uint32_t m_nRenderFX; // 0x0054
    uint32_t m_clrRender; // 0x0058
    uint32_t m_flAnimTime; // 0x0060
    uint32_t m_flSimulationTime; // 0x0068
    uint32_t m_ubInterpolationFrame; // 0x0074
    uint32_t m_fEffects; // 0x0078
    uint32_t m_nRenderMode; // 0x007C
    uint32_t m_nNextThinkTick; // 0x0084
    uint32_t m_nModelIndex; // 0x008C
    uint32_t m_takedamage; // 0x008E
    uint32_t m_iHealth; // 0x0090
    uint32_t m_iMaxHealth; // 0x0094
    uint32_t m_iTeamNum; // 0x009C
    uint32_t m_PredictableID; // 0x00A0
    float m_vecVelocity[0]; // 0x00F4
    float m_vecVelocity[1]; // 0x00F8
    float m_vecVelocity[2]; // 0x00FC
    uint32_t m_iParentAttachment; // 0x017A
    uint32_t moveparent; // 0x0190
    fVector3 m_vecMinsPreScaled; // 0x01A4
    fVector3 m_vecMaxsPreScaled; // 0x01B0
    fVector3 m_vecMins; // 0x01BC
    fVector3 m_vecMaxs; // 0x01C8
    uint32_t m_usSolidFlags; // 0x01D8
    uint32_t m_nSurroundType; // 0x01DC
    uint32_t m_nSolidType; // 0x01DD
    uint32_t m_triggerBloat; // 0x01DE
    fVector3 m_vecSpecifiedSurroundingMinsPreScaled; // 0x01E0
    fVector3 m_vecSpecifiedSurroundingMaxsPreScaled; // 0x01EC
    fVector3 m_vecSpecifiedSurroundingMins; // 0x01F8
    fVector3 m_vecSpecifiedSurroundingMaxs; // 0x0204
    float m_flElasticity; // 0x0248
    float m_flShadowCastDistance; // 0x024C
    fVector3 m_vecOrigin; // 0x0338
    fVector3 m_angRotation; // 0x0344
    uint32_t m_CollisionGroup; // 0x0354
    uint32_t m_bIsPlayerSimulated; // 0x04C8
    uint32_t m_bSimulatedEveryTick; // 0x04C9
    uint32_t m_bAnimatedEveryTick; // 0x04CA
    uint32_t m_bAlternateSorting; // 0x04CB
    uint32_t m_iTextureFrameIndex; // 0x04CC
    uint32_t m_hOwnerEntity; // 0x04D8
    uint32_t m_hEffectEntity; // 0x04DC
    uint32_t m_bOnFire; // 0x0515
    float m_CreationTime; // 0x0518
    uint32_t m_RealClassName; // 0x051C
    uint32_t m_OverrideMaterial; // 0x0520
    uint32_t m_OverrideSubMaterials[0]; // 0x0528
    uint32_t m_spawnflags; // 0x0640
    uint32_t m_iGModFlags; // 0x0644
    uintptr_t m_GMOD_bool[32]; // 0x06A0
    uintptr_t m_GMOD_float[32]; // 0x06C0
    uintptr_t m_GMOD_int[32]; // 0x0740
    uintptr_t m_GMOD_Vector[32]; // 0x07C0
    uintptr_t m_GMOD_QAngle[32]; // 0x0940
    uintptr_t m_GMOD_EHANDLE[32]; // 0x0AC0
    const char* m_GMOD_String0; // 0x0B40
    const char* m_GMOD_String1; // 0x0D40
    const char* m_GMOD_String2; // 0x0F40
    const char* m_GMOD_String3; // 0x1140
    int64_t m_GMOD_DataTable; // 0x1340
    uint32_t m_iCreationID; // 0x1388
    uint32_t m_iMapCreatedID; // 0x138C
    uint32_t m_nSkin; // 0x1398
    uint32_t m_nBody; // 0x139C
    uint32_t m_nHitboxSet; // 0x13A0
    float m_flPlaybackRate; // 0x13C0
    fVector3 m_vecForce; // 0x13CC
    uint32_t m_nForceBone; // 0x13D8
    uint32_t m_bClientSideFrameReset; // 0x140C
    float m_fadeMinDist; // 0x1444
    float m_fadeMaxDist; // 0x1448
    float m_flFadeScale; // 0x144C
    float m_flModelScale; // 0x149C
    float m_flModelWidthScale; // 0x149C
    uintptr_t m_flPoseParameter[24]; // 0x14A0
    uintptr_t m_flEncodedController[4]; // 0x15BC
    uint32_t m_bClientSideAnimation; // 0x160C
    uint32_t m_nNewSequenceParity; // 0x1610
    uint32_t m_nResetEventsParity; // 0x1614
    uint32_t m_nSequence; // 0x163C
    float m_flCycle; // 0x1644
    uint32_t m_hLightingOrigin; // 0x16C4
    uint32_t m_hLightingOriginRelative; // 0x16C8
    uint32_t m_nMuzzleFlashParity; // 0x16CC
    fVector3 m_OverrideViewTarget; // 0x16EC
    uint32_t m_pBoneManipulator; // 0x1778
    uint32_t m_pFlexManipulator; // 0x1780
    uint32_t m_hOwner; // 0x17D8
    uint32_t m_nViewModelIndex; // 0x17E0
    float m_flNextPrimaryAttack; // 0x17E4
    float m_flNextSecondaryAttack; // 0x17E8
    float m_flTimeWeaponIdle; // 0x17EC
    uint32_t m_iViewModelIndex; // 0x17F4
    uint32_t m_iWorldModelIndex; // 0x17F8
    uint32_t m_iState; // 0x1818
    uint32_t m_iPrimaryAmmoType; // 0x1820
    uint32_t m_iSecondaryAmmoType; // 0x1824
    uint32_t m_iClip1; // 0x1828
    uint32_t m_iClip2; // 0x182C
    uint32_t m_bFlipViewModel; // 0x1858
    float m_attachedAnglesPlayerSpace[0]; // 0x18B8
    float m_attachedAnglesPlayerSpace[1]; // 0x18BC
    float m_attachedAnglesPlayerSpace[2]; // 0x18C0
    fVector3 m_attachedPositionObjectSpace; // 0x18C4
    uint32_t m_hAttachedObject; // 0x18D0
    uint32_t m_bActive; // 0x1BD4
    uint32_t m_EffectState; // 0x1BD8
    uint32_t m_bOpen; // 0x1BDC
    uint32_t m_bPhyscannonState; // 0x1BDD
};

class CEnvWind // parent CBaseEntity {
public:
    void* m_OverrideSubMaterials; // 0x0000
    uint32_t movecollide; // 0x0000
    uint32_t movetype; // 0x0000
    uint32_t m_nRenderFX; // 0x0054
    uint32_t m_clrRender; // 0x0058
    uint32_t m_flAnimTime; // 0x0060
    uint32_t m_flSimulationTime; // 0x0068
    uint32_t m_ubInterpolationFrame; // 0x0074
    uint32_t m_fEffects; // 0x0078
    uint32_t m_nRenderMode; // 0x007C
    uint32_t m_nModelIndex; // 0x008C
    uint32_t m_takedamage; // 0x008E
    uint32_t m_iHealth; // 0x0090
    uint32_t m_iMaxHealth; // 0x0094
    uint32_t m_iTeamNum; // 0x009C
    uint32_t m_PredictableID; // 0x00A0
    float m_vecVelocity[0]; // 0x00F4
    float m_vecVelocity[1]; // 0x00F8
    float m_vecVelocity[2]; // 0x00FC
    uint32_t m_iParentAttachment; // 0x017A
    uint32_t moveparent; // 0x0190
    fVector3 m_vecMinsPreScaled; // 0x01A4
    fVector3 m_vecMaxsPreScaled; // 0x01B0
    fVector3 m_vecMins; // 0x01BC
    fVector3 m_vecMaxs; // 0x01C8
    uint32_t m_usSolidFlags; // 0x01D8
    uint32_t m_nSurroundType; // 0x01DC
    uint32_t m_nSolidType; // 0x01DD
    uint32_t m_triggerBloat; // 0x01DE
    fVector3 m_vecSpecifiedSurroundingMinsPreScaled; // 0x01E0
    fVector3 m_vecSpecifiedSurroundingMaxsPreScaled; // 0x01EC
    fVector3 m_vecSpecifiedSurroundingMins; // 0x01F8
    fVector3 m_vecSpecifiedSurroundingMaxs; // 0x0204
    float m_flElasticity; // 0x0248
    float m_flShadowCastDistance; // 0x024C
    fVector3 m_vecOrigin; // 0x0338
    fVector3 m_angRotation; // 0x0344
    uint32_t m_CollisionGroup; // 0x0354
    uint32_t m_bIsPlayerSimulated; // 0x04C8
    uint32_t m_bSimulatedEveryTick; // 0x04C9
    uint32_t m_bAnimatedEveryTick; // 0x04CA
    uint32_t m_bAlternateSorting; // 0x04CB
    uint32_t m_iTextureFrameIndex; // 0x04CC
    uint32_t m_hOwnerEntity; // 0x04D8
    uint32_t m_hEffectEntity; // 0x04DC
    uint32_t m_bOnFire; // 0x0515
    float m_CreationTime; // 0x0518
    uint32_t m_RealClassName; // 0x051C
    uint32_t m_OverrideMaterial; // 0x0520
    uint32_t m_OverrideSubMaterials[0]; // 0x0528
    uint32_t m_spawnflags; // 0x0640
    uint32_t m_iGModFlags; // 0x0644
    uintptr_t m_GMOD_bool[32]; // 0x06A0
    uintptr_t m_GMOD_float[32]; // 0x06C0
    uintptr_t m_GMOD_int[32]; // 0x0740
    uintptr_t m_GMOD_Vector[32]; // 0x07C0
    uintptr_t m_GMOD_QAngle[32]; // 0x0940
    uintptr_t m_GMOD_EHANDLE[32]; // 0x0AC0
    const char* m_GMOD_String0; // 0x0B40
    const char* m_GMOD_String1; // 0x0D40
    const char* m_GMOD_String2; // 0x0F40
    const char* m_GMOD_String3; // 0x1140
    int64_t m_GMOD_DataTable; // 0x1340
    uint32_t m_iCreationID; // 0x1388
    uint32_t m_iMapCreatedID; // 0x138C
    float m_flStartTime; // 0x1394
    uint32_t m_iWindSeed; // 0x1398
    uint32_t m_iMinWind; // 0x139C
    uint32_t m_iMaxWind; // 0x13A0
    uint32_t m_windRadius; // 0x13A4
    uint32_t m_iMinGust; // 0x13A8
    uint32_t m_iMaxGust; // 0x13AC
    float m_flMinGustDelay; // 0x13B0
    float m_flMaxGustDelay; // 0x13B4
    float m_flGustDuration; // 0x13B8
    uint32_t m_iGustDirChange; // 0x13BC
    uint32_t m_iInitialWindDir; // 0x13FC
    float m_flInitialWindSpeed; // 0x1400
};

class CBaseViewModel {
public:
    void* m_flPoseParameter; // 0x0000
    uint32_t m_fEffects; // 0x0078
    uint32_t m_nModelIndex; // 0x008C
    uint32_t m_nSkin; // 0x1398
    uint32_t m_nBody; // 0x139C
    float m_flPlaybackRate; // 0x13C0
    float m_flPoseParameter[0]; // 0x14A0
    uint32_t m_nNewSequenceParity; // 0x1610
    uint32_t m_nResetEventsParity; // 0x1614
    uint32_t m_nSequence; // 0x163C
    uint32_t m_nMuzzleFlashParity; // 0x16CC
    uint32_t m_nViewModelIndex; // 0x17E8
    uint32_t m_hOwner; // 0x17EC
    uint32_t m_nAnimationParity; // 0x17F8
    uint32_t m_hWeapon; // 0x1808
};

class CTEBaseBeam {
public:
    uint32_t m_nModelIndex; // 0x0010
    uint32_t m_nHaloIndex; // 0x0014
    uint32_t m_nStartFrame; // 0x0018
    uint32_t m_nFrameRate; // 0x001C
    float m_fLife; // 0x0020
    float m_fWidth; // 0x0024
    float m_fEndWidth; // 0x0028
    uint32_t m_nFadeLength; // 0x002C
    float m_fAmplitude; // 0x0030
    uint32_t r; // 0x0034
    uint32_t g; // 0x0038
    uint32_t b; // 0x003C
    uint32_t a; // 0x0040
    uint32_t m_nSpeed; // 0x0044
    uint32_t m_nFlags; // 0x0048
};

class CWeaponHandGrenade // parent CBaseEntity {
public:
    uint32_t movetype; // 0x0000
    void* m_OverrideSubMaterials; // 0x0000
    uint32_t movecollide; // 0x0000
    uint32_t m_nRenderFX; // 0x0054
    uint32_t m_clrRender; // 0x0058
    uint32_t m_flAnimTime; // 0x0060
    uint32_t m_flSimulationTime; // 0x0068
    uint32_t m_ubInterpolationFrame; // 0x0074
    uint32_t m_fEffects; // 0x0078
    uint32_t m_nRenderMode; // 0x007C
    uint32_t m_nNextThinkTick; // 0x0084
    uint32_t m_nModelIndex; // 0x008C
    uint32_t m_takedamage; // 0x008E
    uint32_t m_iHealth; // 0x0090
    uint32_t m_iMaxHealth; // 0x0094
    uint32_t m_iTeamNum; // 0x009C
    uint32_t m_PredictableID; // 0x00A0
    float m_vecVelocity[0]; // 0x00F4
    float m_vecVelocity[1]; // 0x00F8
    float m_vecVelocity[2]; // 0x00FC
    uint32_t m_iParentAttachment; // 0x017A
    uint32_t moveparent; // 0x0190
    fVector3 m_vecMinsPreScaled; // 0x01A4
    fVector3 m_vecMaxsPreScaled; // 0x01B0
    fVector3 m_vecMins; // 0x01BC
    fVector3 m_vecMaxs; // 0x01C8
    uint32_t m_usSolidFlags; // 0x01D8
    uint32_t m_nSurroundType; // 0x01DC
    uint32_t m_nSolidType; // 0x01DD
    uint32_t m_triggerBloat; // 0x01DE
    fVector3 m_vecSpecifiedSurroundingMinsPreScaled; // 0x01E0
    fVector3 m_vecSpecifiedSurroundingMaxsPreScaled; // 0x01EC
    fVector3 m_vecSpecifiedSurroundingMins; // 0x01F8
    fVector3 m_vecSpecifiedSurroundingMaxs; // 0x0204
    float m_flElasticity; // 0x0248
    float m_flShadowCastDistance; // 0x024C
    fVector3 m_vecOrigin; // 0x0338
    fVector3 m_angRotation; // 0x0344
    uint32_t m_CollisionGroup; // 0x0354
    uint32_t m_bIsPlayerSimulated; // 0x04C8
    uint32_t m_bSimulatedEveryTick; // 0x04C9
    uint32_t m_bAnimatedEveryTick; // 0x04CA
    uint32_t m_bAlternateSorting; // 0x04CB
    uint32_t m_iTextureFrameIndex; // 0x04CC
    uint32_t m_hOwnerEntity; // 0x04D8
    uint32_t m_hEffectEntity; // 0x04DC
    uint32_t m_bOnFire; // 0x0515
    float m_CreationTime; // 0x0518
    uint32_t m_RealClassName; // 0x051C
    uint32_t m_OverrideMaterial; // 0x0520
    uint32_t m_OverrideSubMaterials[0]; // 0x0528
    uint32_t m_spawnflags; // 0x0640
    uint32_t m_iGModFlags; // 0x0644
    uintptr_t m_GMOD_bool[32]; // 0x06A0
    uintptr_t m_GMOD_float[32]; // 0x06C0
    uintptr_t m_GMOD_int[32]; // 0x0740
    uintptr_t m_GMOD_Vector[32]; // 0x07C0
    uintptr_t m_GMOD_QAngle[32]; // 0x0940
    uintptr_t m_GMOD_EHANDLE[32]; // 0x0AC0
    const char* m_GMOD_String0; // 0x0B40
    const char* m_GMOD_String1; // 0x0D40
    const char* m_GMOD_String2; // 0x0F40
    const char* m_GMOD_String3; // 0x1140
    int64_t m_GMOD_DataTable; // 0x1340
    uint32_t m_iCreationID; // 0x1388
    uint32_t m_iMapCreatedID; // 0x138C
    uint32_t m_nSkin; // 0x1398
    uint32_t m_nBody; // 0x139C
    uint32_t m_nHitboxSet; // 0x13A0
    float m_flPlaybackRate; // 0x13C0
    fVector3 m_vecForce; // 0x13CC
    uint32_t m_nForceBone; // 0x13D8
    uint32_t m_bClientSideFrameReset; // 0x140C
    float m_fadeMinDist; // 0x1444
    float m_fadeMaxDist; // 0x1448
    float m_flFadeScale; // 0x144C
    float m_flModelScale; // 0x149C
    float m_flModelWidthScale; // 0x149C
    uintptr_t m_flPoseParameter[24]; // 0x14A0
    uintptr_t m_flEncodedController[4]; // 0x15BC
    uint32_t m_bClientSideAnimation; // 0x160C
    uint32_t m_nNewSequenceParity; // 0x1610
    uint32_t m_nResetEventsParity; // 0x1614
    uint32_t m_nSequence; // 0x163C
    float m_flCycle; // 0x1644
    uint32_t m_hLightingOrigin; // 0x16C4
    uint32_t m_hLightingOriginRelative; // 0x16C8
    uint32_t m_nMuzzleFlashParity; // 0x16CC
    fVector3 m_OverrideViewTarget; // 0x16EC
    uint32_t m_pBoneManipulator; // 0x1778
    uint32_t m_pFlexManipulator; // 0x1780
    uint32_t m_hOwner; // 0x17D8
    uint32_t m_nViewModelIndex; // 0x17E0
    float m_flNextPrimaryAttack; // 0x17E4
    float m_flNextSecondaryAttack; // 0x17E8
    float m_flTimeWeaponIdle; // 0x17EC
    uint32_t m_iViewModelIndex; // 0x17F4
    uint32_t m_iWorldModelIndex; // 0x17F8
    uint32_t m_iState; // 0x1818
    uint32_t m_iPrimaryAmmoType; // 0x1820
    uint32_t m_iSecondaryAmmoType; // 0x1824
    uint32_t m_iClip1; // 0x1828
    uint32_t m_iClip2; // 0x182C
    uint32_t m_bFlipViewModel; // 0x1858
    float m_flStartThrow; // 0x1888
    float m_flReleaseThrow; // 0x188C
};

class CTEBeamFollow // parent CBaseBeam {
public:
    uint32_t m_nModelIndex; // 0x0010
    uint32_t m_nHaloIndex; // 0x0014
    uint32_t m_nStartFrame; // 0x0018
    uint32_t m_nFrameRate; // 0x001C
    float m_fLife; // 0x0020
    float m_fWidth; // 0x0024
    float m_fEndWidth; // 0x0028
    uint32_t m_nFadeLength; // 0x002C
    float m_fAmplitude; // 0x0030
    uint32_t r; // 0x0034
    uint32_t g; // 0x0038
    uint32_t b; // 0x003C
    uint32_t a; // 0x0040
    uint32_t m_nSpeed; // 0x0044
    uint32_t m_nFlags; // 0x0048
    uint32_t m_iEntIndex; // 0x004C
};

class CWeaponHgun // parent CBaseEntity {
public:
    uint32_t movetype; // 0x0000
    void* m_OverrideSubMaterials; // 0x0000
    uint32_t movecollide; // 0x0000
    uint32_t m_nRenderFX; // 0x0054
    uint32_t m_clrRender; // 0x0058
    uint32_t m_flAnimTime; // 0x0060
    uint32_t m_flSimulationTime; // 0x0068
    uint32_t m_ubInterpolationFrame; // 0x0074
    uint32_t m_fEffects; // 0x0078
    uint32_t m_nRenderMode; // 0x007C
    uint32_t m_nNextThinkTick; // 0x0084
    uint32_t m_nModelIndex; // 0x008C
    uint32_t m_takedamage; // 0x008E
    uint32_t m_iHealth; // 0x0090
    uint32_t m_iMaxHealth; // 0x0094
    uint32_t m_iTeamNum; // 0x009C
    uint32_t m_PredictableID; // 0x00A0
    float m_vecVelocity[0]; // 0x00F4
    float m_vecVelocity[1]; // 0x00F8
    float m_vecVelocity[2]; // 0x00FC
    uint32_t m_iParentAttachment; // 0x017A
    uint32_t moveparent; // 0x0190
    fVector3 m_vecMinsPreScaled; // 0x01A4
    fVector3 m_vecMaxsPreScaled; // 0x01B0
    fVector3 m_vecMins; // 0x01BC
    fVector3 m_vecMaxs; // 0x01C8
    uint32_t m_usSolidFlags; // 0x01D8
    uint32_t m_nSurroundType; // 0x01DC
    uint32_t m_nSolidType; // 0x01DD
    uint32_t m_triggerBloat; // 0x01DE
    fVector3 m_vecSpecifiedSurroundingMinsPreScaled; // 0x01E0
    fVector3 m_vecSpecifiedSurroundingMaxsPreScaled; // 0x01EC
    fVector3 m_vecSpecifiedSurroundingMins; // 0x01F8
    fVector3 m_vecSpecifiedSurroundingMaxs; // 0x0204
    float m_flElasticity; // 0x0248
    float m_flShadowCastDistance; // 0x024C
    fVector3 m_vecOrigin; // 0x0338
    fVector3 m_angRotation; // 0x0344
    uint32_t m_CollisionGroup; // 0x0354
    uint32_t m_bIsPlayerSimulated; // 0x04C8
    uint32_t m_bSimulatedEveryTick; // 0x04C9
    uint32_t m_bAnimatedEveryTick; // 0x04CA
    uint32_t m_bAlternateSorting; // 0x04CB
    uint32_t m_iTextureFrameIndex; // 0x04CC
    uint32_t m_hOwnerEntity; // 0x04D8
    uint32_t m_hEffectEntity; // 0x04DC
    uint32_t m_bOnFire; // 0x0515
    float m_CreationTime; // 0x0518
    uint32_t m_RealClassName; // 0x051C
    uint32_t m_OverrideMaterial; // 0x0520
    uint32_t m_OverrideSubMaterials[0]; // 0x0528
    uint32_t m_spawnflags; // 0x0640
    uint32_t m_iGModFlags; // 0x0644
    uintptr_t m_GMOD_bool[32]; // 0x06A0
    uintptr_t m_GMOD_float[32]; // 0x06C0
    uintptr_t m_GMOD_int[32]; // 0x0740
    uintptr_t m_GMOD_Vector[32]; // 0x07C0
    uintptr_t m_GMOD_QAngle[32]; // 0x0940
    uintptr_t m_GMOD_EHANDLE[32]; // 0x0AC0
    const char* m_GMOD_String0; // 0x0B40
    const char* m_GMOD_String1; // 0x0D40
    const char* m_GMOD_String2; // 0x0F40
    const char* m_GMOD_String3; // 0x1140
    int64_t m_GMOD_DataTable; // 0x1340
    uint32_t m_iCreationID; // 0x1388
    uint32_t m_iMapCreatedID; // 0x138C
    uint32_t m_nSkin; // 0x1398
    uint32_t m_nBody; // 0x139C
    uint32_t m_nHitboxSet; // 0x13A0
    float m_flPlaybackRate; // 0x13C0
    fVector3 m_vecForce; // 0x13CC
    uint32_t m_nForceBone; // 0x13D8
    uint32_t m_bClientSideFrameReset; // 0x140C
    float m_fadeMinDist; // 0x1444
    float m_fadeMaxDist; // 0x1448
    float m_flFadeScale; // 0x144C
    float m_flModelScale; // 0x149C
    float m_flModelWidthScale; // 0x149C
    uintptr_t m_flPoseParameter[24]; // 0x14A0
    uintptr_t m_flEncodedController[4]; // 0x15BC
    uint32_t m_bClientSideAnimation; // 0x160C
    uint32_t m_nNewSequenceParity; // 0x1610
    uint32_t m_nResetEventsParity; // 0x1614
    uint32_t m_nSequence; // 0x163C
    float m_flCycle; // 0x1644
    uint32_t m_hLightingOrigin; // 0x16C4
    uint32_t m_hLightingOriginRelative; // 0x16C8
    uint32_t m_nMuzzleFlashParity; // 0x16CC
    fVector3 m_OverrideViewTarget; // 0x16EC
    uint32_t m_pBoneManipulator; // 0x1778
    uint32_t m_pFlexManipulator; // 0x1780
    uint32_t m_hOwner; // 0x17D8
    uint32_t m_nViewModelIndex; // 0x17E0
    float m_flNextPrimaryAttack; // 0x17E4
    float m_flNextSecondaryAttack; // 0x17E8
    float m_flTimeWeaponIdle; // 0x17EC
    uint32_t m_iViewModelIndex; // 0x17F4
    uint32_t m_iWorldModelIndex; // 0x17F8
    uint32_t m_iState; // 0x1818
    uint32_t m_iPrimaryAmmoType; // 0x1820
    uint32_t m_iSecondaryAmmoType; // 0x1824
    uint32_t m_iClip1; // 0x1828
    uint32_t m_iClip2; // 0x182C
    uint32_t m_bFlipViewModel; // 0x1858
    float m_flRechargeTime; // 0x1888
    uint32_t m_iFirePhase; // 0x188C
};

class CTEBeamEnts // parent CBaseBeam {
public:
    uint32_t m_nModelIndex; // 0x0010
    uint32_t m_nHaloIndex; // 0x0014
    uint32_t m_nStartFrame; // 0x0018
    uint32_t m_nFrameRate; // 0x001C
    float m_fLife; // 0x0020
    float m_fWidth; // 0x0024
    float m_fEndWidth; // 0x0028
    uint32_t m_nFadeLength; // 0x002C
    float m_fAmplitude; // 0x0030
    uint32_t r; // 0x0034
    uint32_t g; // 0x0038
    uint32_t b; // 0x003C
    uint32_t a; // 0x0040
    uint32_t m_nSpeed; // 0x0044
    uint32_t m_nFlags; // 0x0048
    uint32_t m_nStartEntity; // 0x004C
    uint32_t m_nEndEntity; // 0x0050
};

class CPropJeep // parent CBaseEntity {
public:
    uint32_t movetype; // 0x0000
    uint32_t movecollide; // 0x0000
    void* m_OverrideSubMaterials; // 0x0000
    uint32_t m_nRenderFX; // 0x0054
    uint32_t m_clrRender; // 0x0058
    uint32_t m_flAnimTime; // 0x0060
    uint32_t m_flSimulationTime; // 0x0068
    uint32_t m_ubInterpolationFrame; // 0x0074
    uint32_t m_fEffects; // 0x0078
    uint32_t m_nRenderMode; // 0x007C
    uint32_t m_nModelIndex; // 0x008C
    uint32_t m_takedamage; // 0x008E
    uint32_t m_iHealth; // 0x0090
    uint32_t m_iMaxHealth; // 0x0094
    uint32_t m_iTeamNum; // 0x009C
    uint32_t m_PredictableID; // 0x00A0
    float m_vecVelocity[0]; // 0x00F4
    float m_vecVelocity[1]; // 0x00F8
    float m_vecVelocity[2]; // 0x00FC
    uint32_t m_iParentAttachment; // 0x017A
    uint32_t moveparent; // 0x0190
    fVector3 m_vecMinsPreScaled; // 0x01A4
    fVector3 m_vecMaxsPreScaled; // 0x01B0
    fVector3 m_vecMins; // 0x01BC
    fVector3 m_vecMaxs; // 0x01C8
    uint32_t m_usSolidFlags; // 0x01D8
    uint32_t m_nSurroundType; // 0x01DC
    uint32_t m_nSolidType; // 0x01DD
    uint32_t m_triggerBloat; // 0x01DE
    fVector3 m_vecSpecifiedSurroundingMinsPreScaled; // 0x01E0
    fVector3 m_vecSpecifiedSurroundingMaxsPreScaled; // 0x01EC
    fVector3 m_vecSpecifiedSurroundingMins; // 0x01F8
    fVector3 m_vecSpecifiedSurroundingMaxs; // 0x0204
    float m_flElasticity; // 0x0248
    float m_flShadowCastDistance; // 0x024C
    fVector3 m_vecOrigin; // 0x0338
    fVector3 m_angRotation; // 0x0344
    uint32_t m_CollisionGroup; // 0x0354
    uint32_t m_bIsPlayerSimulated; // 0x04C8
    uint32_t m_bSimulatedEveryTick; // 0x04C9
    uint32_t m_bAnimatedEveryTick; // 0x04CA
    uint32_t m_bAlternateSorting; // 0x04CB
    uint32_t m_iTextureFrameIndex; // 0x04CC
    uint32_t m_hOwnerEntity; // 0x04D8
    uint32_t m_hEffectEntity; // 0x04DC
    uint32_t m_bOnFire; // 0x0515
    float m_CreationTime; // 0x0518
    uint32_t m_RealClassName; // 0x051C
    uint32_t m_OverrideMaterial; // 0x0520
    uint32_t m_OverrideSubMaterials[0]; // 0x0528
    uint32_t m_spawnflags; // 0x0640
    uint32_t m_iGModFlags; // 0x0644
    uintptr_t m_GMOD_bool[32]; // 0x06A0
    uintptr_t m_GMOD_float[32]; // 0x06C0
    uintptr_t m_GMOD_int[32]; // 0x0740
    uintptr_t m_GMOD_Vector[32]; // 0x07C0
    uintptr_t m_GMOD_QAngle[32]; // 0x0940
    uintptr_t m_GMOD_EHANDLE[32]; // 0x0AC0
    const char* m_GMOD_String0; // 0x0B40
    const char* m_GMOD_String1; // 0x0D40
    const char* m_GMOD_String2; // 0x0F40
    const char* m_GMOD_String3; // 0x1140
    int64_t m_GMOD_DataTable; // 0x1340
    uint32_t m_iCreationID; // 0x1388
    uint32_t m_iMapCreatedID; // 0x138C
    uint32_t m_nSkin; // 0x1398
    uint32_t m_nBody; // 0x139C
    uint32_t m_nHitboxSet; // 0x13A0
    float m_flPlaybackRate; // 0x13C0
    fVector3 m_vecForce; // 0x13CC
    uint32_t m_nForceBone; // 0x13D8
    uint32_t m_bClientSideFrameReset; // 0x140C
    float m_fadeMinDist; // 0x1444
    float m_fadeMaxDist; // 0x1448
    float m_flFadeScale; // 0x144C
    float m_flModelScale; // 0x149C
    float m_flModelWidthScale; // 0x149C
    uintptr_t m_flPoseParameter[24]; // 0x14A0
    uintptr_t m_flEncodedController[4]; // 0x15BC
    uint32_t m_bClientSideAnimation; // 0x160C
    uint32_t m_nNewSequenceParity; // 0x1610
    uint32_t m_nResetEventsParity; // 0x1614
    uint32_t m_nSequence; // 0x163C
    float m_flCycle; // 0x1644
    uint32_t m_hLightingOrigin; // 0x16C4
    uint32_t m_hLightingOriginRelative; // 0x16C8
    uint32_t m_nMuzzleFlashParity; // 0x16CC
    fVector3 m_OverrideViewTarget; // 0x16EC
    uint32_t m_pBoneManipulator; // 0x1778
    uint32_t m_pFlexManipulator; // 0x1780
    uint32_t m_hPlayer; // 0x17DC
    uint32_t m_nSpeed; // 0x17E0
    uint32_t m_nRPM; // 0x17E4
    float m_flThrottle; // 0x17E8
    uint32_t m_nBoostTimeLeft; // 0x17EC
    uint32_t m_nHasBoost; // 0x17F0
    uint32_t m_nScannerDisabledWeapons; // 0x17F4
    uint32_t m_nScannerDisabledVehicle; // 0x17F8
    uint32_t m_bEnterAnimOn; // 0x1818
    uint32_t m_bExitAnimOn; // 0x1819
    fVector3 m_vecGunCrosshair; // 0x1820
    fVector3 m_vecEyeExitEndpoint; // 0x185C
    uint32_t m_bHasGun; // 0x1868
    uint32_t m_bUnableToFire; // 0x1869
    uint32_t m_bHeadlightIsOn; // 0x1924
};

class CMortarShell // parent CBaseEntity {
public:
    void* m_OverrideSubMaterials; // 0x0000
    uint32_t movecollide; // 0x0000
    uint32_t movetype; // 0x0000
    uint32_t m_nRenderFX; // 0x0054
    uint32_t m_clrRender; // 0x0058
    uint32_t m_flAnimTime; // 0x0060
    uint32_t m_flSimulationTime; // 0x0068
    uint32_t m_ubInterpolationFrame; // 0x0074
    uint32_t m_fEffects; // 0x0078
    uint32_t m_nRenderMode; // 0x007C
    uint32_t m_nModelIndex; // 0x008C
    uint32_t m_takedamage; // 0x008E
    uint32_t m_iHealth; // 0x0090
    uint32_t m_iMaxHealth; // 0x0094
    uint32_t m_iTeamNum; // 0x009C
    uint32_t m_PredictableID; // 0x00A0
    float m_vecVelocity[0]; // 0x00F4
    float m_vecVelocity[1]; // 0x00F8
    float m_vecVelocity[2]; // 0x00FC
    uint32_t m_iParentAttachment; // 0x017A
    uint32_t moveparent; // 0x0190
    fVector3 m_vecMinsPreScaled; // 0x01A4
    fVector3 m_vecMaxsPreScaled; // 0x01B0
    fVector3 m_vecMins; // 0x01BC
    fVector3 m_vecMaxs; // 0x01C8
    uint32_t m_usSolidFlags; // 0x01D8
    uint32_t m_nSurroundType; // 0x01DC
    uint32_t m_nSolidType; // 0x01DD
    uint32_t m_triggerBloat; // 0x01DE
    fVector3 m_vecSpecifiedSurroundingMinsPreScaled; // 0x01E0
    fVector3 m_vecSpecifiedSurroundingMaxsPreScaled; // 0x01EC
    fVector3 m_vecSpecifiedSurroundingMins; // 0x01F8
    fVector3 m_vecSpecifiedSurroundingMaxs; // 0x0204
    float m_flElasticity; // 0x0248
    float m_flShadowCastDistance; // 0x024C
    fVector3 m_vecOrigin; // 0x0338
    fVector3 m_angRotation; // 0x0344
    uint32_t m_CollisionGroup; // 0x0354
    uint32_t m_bIsPlayerSimulated; // 0x04C8
    uint32_t m_bSimulatedEveryTick; // 0x04C9
    uint32_t m_bAnimatedEveryTick; // 0x04CA
    uint32_t m_bAlternateSorting; // 0x04CB
    uint32_t m_iTextureFrameIndex; // 0x04CC
    uint32_t m_hOwnerEntity; // 0x04D8
    uint32_t m_hEffectEntity; // 0x04DC
    uint32_t m_bOnFire; // 0x0515
    float m_CreationTime; // 0x0518
    uint32_t m_RealClassName; // 0x051C
    uint32_t m_OverrideMaterial; // 0x0520
    uint32_t m_OverrideSubMaterials[0]; // 0x0528
    uint32_t m_spawnflags; // 0x0640
    uint32_t m_iGModFlags; // 0x0644
    uintptr_t m_GMOD_bool[32]; // 0x06A0
    uintptr_t m_GMOD_float[32]; // 0x06C0
    uintptr_t m_GMOD_int[32]; // 0x0740
    uintptr_t m_GMOD_Vector[32]; // 0x07C0
    uintptr_t m_GMOD_QAngle[32]; // 0x0940
    uintptr_t m_GMOD_EHANDLE[32]; // 0x0AC0
    const char* m_GMOD_String0; // 0x0B40
    const char* m_GMOD_String1; // 0x0D40
    const char* m_GMOD_String2; // 0x0F40
    const char* m_GMOD_String3; // 0x1140
    int64_t m_GMOD_DataTable; // 0x1340
    uint32_t m_iCreationID; // 0x1388
    uint32_t m_iMapCreatedID; // 0x138C
    float m_flLifespan; // 0x139C
    float m_flRadius; // 0x13A0
    fVector3 m_vecSurfaceNormal; // 0x13A8
};

class CTEBeamEntPoint // parent CBaseBeam {
public:
    uint32_t m_nModelIndex; // 0x0010
    uint32_t m_nHaloIndex; // 0x0014
    uint32_t m_nStartFrame; // 0x0018
    uint32_t m_nFrameRate; // 0x001C
    float m_fLife; // 0x0020
    float m_fWidth; // 0x0024
    float m_fEndWidth; // 0x0028
    uint32_t m_nFadeLength; // 0x002C
    float m_fAmplitude; // 0x0030
    uint32_t r; // 0x0034
    uint32_t g; // 0x0038
    uint32_t b; // 0x003C
    uint32_t a; // 0x0040
    uint32_t m_nSpeed; // 0x0044
    uint32_t m_nFlags; // 0x0048
    uint32_t m_nStartEntity; // 0x004C
    uint32_t m_nEndEntity; // 0x0050
    fVector3 m_vecStartPoint; // 0x0054
    fVector3 m_vecEndPoint; // 0x0060
};

class CTEArmorRicochet // parent CTEMetalSparks {
public:
    fVector3 m_vecPos; // 0x0010
    fVector3 m_vecDir; // 0x001C
};

class CTEGaussExplosion // parent CBaseTempEntity {
public:
    float m_vecOrigin[0]; // 0x0010
    float m_vecOrigin[1]; // 0x0014
    float m_vecOrigin[2]; // 0x0018
    uint32_t m_nType; // 0x001C
    fVector3 m_vecDirection; // 0x0020
};

class CSteamJet // parent CBaseEntity {
public:
    void* m_OverrideSubMaterials; // 0x0000
    uint32_t movetype; // 0x0000
    uint32_t movecollide; // 0x0000
    uint32_t m_nRenderFX; // 0x0054
    uint32_t m_clrRender; // 0x0058
    uint32_t m_flAnimTime; // 0x0060
    uint32_t m_flSimulationTime; // 0x0068
    uint32_t m_ubInterpolationFrame; // 0x0074
    uint32_t m_fEffects; // 0x0078
    uint32_t m_nRenderMode; // 0x007C
    uint32_t m_nModelIndex; // 0x008C
    uint32_t m_takedamage; // 0x008E
    uint32_t m_iHealth; // 0x0090
    uint32_t m_iMaxHealth; // 0x0094
    uint32_t m_iTeamNum; // 0x009C
    uint32_t m_PredictableID; // 0x00A0
    float m_vecVelocity[0]; // 0x00F4
    float m_vecVelocity[1]; // 0x00F8
    float m_vecVelocity[2]; // 0x00FC
    uint32_t m_iParentAttachment; // 0x017A
    uint32_t moveparent; // 0x0190
    fVector3 m_vecMinsPreScaled; // 0x01A4
    fVector3 m_vecMaxsPreScaled; // 0x01B0
    fVector3 m_vecMins; // 0x01BC
    fVector3 m_vecMaxs; // 0x01C8
    uint32_t m_usSolidFlags; // 0x01D8
    uint32_t m_nSurroundType; // 0x01DC
    uint32_t m_nSolidType; // 0x01DD
    uint32_t m_triggerBloat; // 0x01DE
    fVector3 m_vecSpecifiedSurroundingMinsPreScaled; // 0x01E0
    fVector3 m_vecSpecifiedSurroundingMaxsPreScaled; // 0x01EC
    fVector3 m_vecSpecifiedSurroundingMins; // 0x01F8
    fVector3 m_vecSpecifiedSurroundingMaxs; // 0x0204
    float m_flElasticity; // 0x0248
    float m_flShadowCastDistance; // 0x024C
    fVector3 m_vecOrigin; // 0x0338
    fVector3 m_angRotation; // 0x0344
    uint32_t m_CollisionGroup; // 0x0354
    uint32_t m_bIsPlayerSimulated; // 0x04C8
    uint32_t m_bSimulatedEveryTick; // 0x04C9
    uint32_t m_bAnimatedEveryTick; // 0x04CA
    uint32_t m_bAlternateSorting; // 0x04CB
    uint32_t m_iTextureFrameIndex; // 0x04CC
    uint32_t m_hOwnerEntity; // 0x04D8
    uint32_t m_hEffectEntity; // 0x04DC
    uint32_t m_bOnFire; // 0x0515
    float m_CreationTime; // 0x0518
    uint32_t m_RealClassName; // 0x051C
    uint32_t m_OverrideMaterial; // 0x0520
    uint32_t m_OverrideSubMaterials[0]; // 0x0528
    uint32_t m_iGModFlags; // 0x0644
    uintptr_t m_GMOD_bool[32]; // 0x06A0
    uintptr_t m_GMOD_float[32]; // 0x06C0
    uintptr_t m_GMOD_int[32]; // 0x0740
    uintptr_t m_GMOD_Vector[32]; // 0x07C0
    uintptr_t m_GMOD_QAngle[32]; // 0x0940
    uintptr_t m_GMOD_EHANDLE[32]; // 0x0AC0
    const char* m_GMOD_String0; // 0x0B40
    const char* m_GMOD_String1; // 0x0D40
    const char* m_GMOD_String2; // 0x0F40
    const char* m_GMOD_String3; // 0x1140
    int64_t m_GMOD_DataTable; // 0x1340
    uint32_t m_iCreationID; // 0x1388
    uint32_t m_iMapCreatedID; // 0x138C
    float m_SpreadSpeed; // 0x147C
    float m_Speed; // 0x1480
    float m_StartSize; // 0x1484
    float m_EndSize; // 0x1488
    float m_Rate; // 0x148C
    float m_JetLength; // 0x1490
    uint32_t m_bEmit; // 0x1494
    uint32_t m_nType; // 0x1498
    uint32_t m_bFaceLeft; // 0x149C
    uint32_t m_spawnflags; // 0x14A0
    float m_flRollSpeed; // 0x14A4
};

class CBasePlayer // parent CBaseEntity {
public:
    uint32_t movecollide; // 0x0000
    void* m_hViewModel; // 0x0000
    void* m_OverrideSubMaterials; // 0x0000
    uint32_t movetype; // 0x0000
    uint32_t lengthprop15; // 0x0000
    uint32_t m_nSequence; // 0x0000
    float m_flPrevCycle; // 0x0004
    float m_flWeight; // 0x0008
    uint32_t m_nOrder; // 0x000C
    float m_flCycle; // 0x0014
    uint32_t m_nRenderFX; // 0x0054
    uint32_t m_clrRender; // 0x0058
    uint32_t m_flAnimTime; // 0x0060
    uint32_t m_flSimulationTime; // 0x0068
    uint32_t m_ubInterpolationFrame; // 0x0074
    uint32_t m_fEffects; // 0x0078
    uint32_t m_nRenderMode; // 0x007C
    uint32_t m_nNextThinkTick; // 0x0084
    uint32_t m_nModelIndex; // 0x008C
    uint32_t m_takedamage; // 0x008E
    uint32_t m_lifeState; // 0x008F
    uint32_t m_iHealth; // 0x0090
    uint32_t m_iMaxHealth; // 0x0094
    uint32_t m_iTeamNum; // 0x009C
    uint32_t m_PredictableID; // 0x00A0
    float m_vecViewOffset[0]; // 0x00E8
    float m_vecViewOffset[1]; // 0x00EC
    float m_vecViewOffset[2]; // 0x00F0
    float m_vecVelocity[0]; // 0x00F4
    float m_vecVelocity[1]; // 0x00F8
    float m_vecVelocity[2]; // 0x00FC
    fVector3 m_vecBaseVelocity; // 0x0158
    uint32_t m_iParentAttachment; // 0x017A
    uint32_t moveparent; // 0x0190
    fVector3 m_vecMinsPreScaled; // 0x01A4
    fVector3 m_vecMaxsPreScaled; // 0x01B0
    fVector3 m_vecMins; // 0x01BC
    fVector3 m_vecMaxs; // 0x01C8
    uint32_t m_usSolidFlags; // 0x01D8
    uint32_t m_nSurroundType; // 0x01DC
    uint32_t m_nSolidType; // 0x01DD
    uint32_t m_triggerBloat; // 0x01DE
    fVector3 m_vecSpecifiedSurroundingMinsPreScaled; // 0x01E0
    fVector3 m_vecSpecifiedSurroundingMaxsPreScaled; // 0x01EC
    fVector3 m_vecSpecifiedSurroundingMins; // 0x01F8
    fVector3 m_vecSpecifiedSurroundingMaxs; // 0x0204
    float m_flElasticity; // 0x0248
    float m_flShadowCastDistance; // 0x024C
    uint32_t m_hGroundEntity; // 0x0254
    float m_flFriction; // 0x025C
    fVector3 m_vecOrigin; // 0x0338
    fVector3 m_angRotation; // 0x0344
    uint32_t m_fFlags; // 0x0350
    uint32_t m_CollisionGroup; // 0x0354
    uint32_t m_bIsPlayerSimulated; // 0x04C8
    uint32_t m_bSimulatedEveryTick; // 0x04C9
    uint32_t m_bAnimatedEveryTick; // 0x04CA
    uint32_t m_bAlternateSorting; // 0x04CB
    uint32_t m_iTextureFrameIndex; // 0x04CC
    uint32_t m_hOwnerEntity; // 0x04D8
    uint32_t m_hEffectEntity; // 0x04DC
    uint32_t m_bOnFire; // 0x0515
    float m_CreationTime; // 0x0518
    uint32_t m_RealClassName; // 0x051C
    uint32_t m_OverrideMaterial; // 0x0520
    uint32_t m_OverrideSubMaterials[0]; // 0x0528
    uint32_t m_spawnflags; // 0x0640
    uint32_t m_iGModFlags; // 0x0644
    uintptr_t m_GMOD_bool[32]; // 0x06A0
    uintptr_t m_GMOD_float[32]; // 0x06C0
    uintptr_t m_GMOD_int[32]; // 0x0740
    uintptr_t m_GMOD_Vector[32]; // 0x07C0
    uintptr_t m_GMOD_QAngle[32]; // 0x0940
    uintptr_t m_GMOD_EHANDLE[32]; // 0x0AC0
    const char* m_GMOD_String0; // 0x0B40
    const char* m_GMOD_String1; // 0x0D40
    const char* m_GMOD_String2; // 0x0F40
    const char* m_GMOD_String3; // 0x1140
    int64_t m_GMOD_DataTable; // 0x1340
    uint32_t m_iCreationID; // 0x1388
    uint32_t m_iMapCreatedID; // 0x138C
    uint32_t m_nSkin; // 0x1398
    uint32_t m_nBody; // 0x139C
    uint32_t m_nHitboxSet; // 0x13A0
    float m_flPlaybackRate; // 0x13C0
    fVector3 m_vecForce; // 0x13CC
    uint32_t m_nForceBone; // 0x13D8
    uint32_t m_bClientSideFrameReset; // 0x140C
    float m_fadeMinDist; // 0x1444
    float m_fadeMaxDist; // 0x1448
    float m_flFadeScale; // 0x144C
    float m_flModelWidthScale; // 0x149C
    float m_flModelScale; // 0x149C
    uintptr_t m_flPoseParameter[24]; // 0x14A0
    uintptr_t m_flEncodedController[4]; // 0x15BC
    uint32_t m_bClientSideAnimation; // 0x160C
    uint32_t m_nNewSequenceParity; // 0x1610
    uint32_t m_nResetEventsParity; // 0x1614
    uint32_t m_hLightingOrigin; // 0x16C4
    uint32_t m_hLightingOriginRelative; // 0x16C8
    uint32_t m_nMuzzleFlashParity; // 0x16CC
    fVector3 m_OverrideViewTarget; // 0x16EC
    uint32_t m_pBoneManipulator; // 0x1778
    uint32_t m_pFlexManipulator; // 0x1780
    fVector3 m_viewtarget; // 0x1844
    uintptr_t m_flexWeight[96]; // 0x1880
    uint32_t m_blinktoggle; // 0x1A30
    fVector3 m_vecLean; // 0x1B9C
    fVector3 m_vecShift; // 0x1BD8
    float m_flNextAttack; // 0x1C18
    uint32_t m_bloodColor; // 0x1C1C
    uintptr_t m_iAmmo[256]; // 0x1C20
    uintptr_t m_hMyWeapons[256]; // 0x2020
    uint32_t m_hActiveWeapon; // 0x2420
    uintptr_t m_chAreaBits[32]; // 0x2490
    uintptr_t m_chAreaPortalBits[24]; // 0x24B0
    uint32_t m_iHideHUD; // 0x24C8
    float m_flFOVRate; // 0x24CC
    uint32_t m_bDucked; // 0x24D0
    uint32_t m_bDucking; // 0x24D1
    uint32_t m_bInDuckJump; // 0x24D2
    float m_flDucktime; // 0x24D4
    float m_flDuckJumpTime; // 0x24D8
    float m_flJumpTime; // 0x24DC
    float m_flFallVelocity; // 0x24E4
    fVector3 m_vecPunchAngle; // 0x24F8
    fVector3 m_vecPunchAngleVel; // 0x2534
    uint32_t m_bDrawViewmodel; // 0x2570
    uint32_t m_bWearingSuit; // 0x2571
    uint32_t m_bPoisoned; // 0x2572
    float m_flStepSize; // 0x2574
    uint32_t m_bAllowAutoMovement; // 0x2578
    uint32_t m_skybox3d.scale; // 0x2580
    fVector3 m_skybox3d.origin; // 0x2584
    uint32_t m_skybox3d.area; // 0x2590
    fVector3 m_skybox3d.fog.dirPrimary; // 0x2598
    uint32_t m_skybox3d.fog.colorPrimary; // 0x25A4
    uint32_t m_skybox3d.fog.colorSecondary; // 0x25A8
    uint32_t m_skybox3d.fog.colorPrimaryHDR; // 0x25AC
    uint32_t m_skybox3d.fog.colorSecondaryHDR; // 0x25B0
    float m_skybox3d.fog.start; // 0x25BC
    float m_skybox3d.fog.end; // 0x25C0
    float m_skybox3d.fog.maxdensity; // 0x25C8
    uint32_t m_skybox3d.fog.enable; // 0x25E0
    uint32_t m_skybox3d.fog.blend; // 0x25E1
    uint32_t m_skybox3d.fog.radial; // 0x25E2
    float m_skybox3d.fog.HDRColorScale; // 0x25E4
    uint32_t m_PlayerFog.m_hCtrl; // 0x25EC
    fVector3 m_audio.localSound[0]; // 0x2610
    fVector3 m_audio.localSound[1]; // 0x261C
    fVector3 m_audio.localSound[2]; // 0x2628
    fVector3 m_audio.localSound[3]; // 0x2634
    fVector3 m_audio.localSound[4]; // 0x2640
    fVector3 m_audio.localSound[5]; // 0x264C
    fVector3 m_audio.localSound[6]; // 0x2658
    fVector3 m_audio.localSound[7]; // 0x2664
    uint32_t m_audio.soundscapeIndex; // 0x2670
    uint32_t m_audio.localBits; // 0x2674
    uint32_t m_audio.ent; // 0x2678
    float m_fSprintSpeed; // 0x2680
    float m_fWalkSpeed; // 0x2684
    float m_fSlowWalkSpeed; // 0x2688
    float m_fLadderSpeed; // 0x268C
    float m_fCrouchedWalkSpeed; // 0x2690
    float m_fDuckSpeed; // 0x2694
    float m_fUnDuckSpeed; // 0x2698
    uint32_t m_bDuckToggled; // 0x269C
    uint32_t m_hTonemapController; // 0x26A0
    uint32_t deadflag; // 0x26A8
    float m_iFOV; // 0x26B8
    float m_iFOVStart; // 0x26BC
    float m_flFOVTime; // 0x26C0
    float m_iDefaultFOV; // 0x26C4
    uint32_t m_hZoomOwner; // 0x26C8
    uint32_t m_fOnTarget; // 0x26D4
    uint32_t m_hConstraintEntity; // 0x270C
    fVector3 m_vecConstraintCenter; // 0x2710
    float m_flConstraintRadius; // 0x271C
    float m_flConstraintWidth; // 0x2720
    float m_flConstraintSpeedFactor; // 0x2724
    uint32_t m_iObserverMode; // 0x2728
    uint32_t m_hObserverTarget; // 0x272C
    float m_flDeathTime; // 0x274C
    uint32_t m_hVehicle; // 0x2758
    uint32_t m_hUseEntity; // 0x2760
    float m_flMaxspeed; // 0x2764
    uint32_t m_nTickBase; // 0x27D0
    uint32_t m_bUseWeaponsInVehicle; // 0x27E2
    uint32_t m_hLastWeapon; // 0x27E8
    uint32_t m_hViewModel[0]; // 0x2800
    float m_flLaggedMovementValue; // 0x2DAC
    const char* m_szLastPlaceName; // 0x2DCC
    uint32_t m_hColorCorrectionCtrl; // 0x2F4C
    uint32_t m_hViewEntity; // 0x2F74
    uint32_t m_bDisableWorldClicking; // 0x2FA8
};

class CEmbers // parent CBaseEntity {
public:
    void* m_OverrideSubMaterials; // 0x0000
    uint32_t movecollide; // 0x0000
    uint32_t movetype; // 0x0000
    uint32_t m_nRenderFX; // 0x0054
    uint32_t m_clrRender; // 0x0058
    uint32_t m_flAnimTime; // 0x0060
    uint32_t m_flSimulationTime; // 0x0068
    uint32_t m_ubInterpolationFrame; // 0x0074
    uint32_t m_fEffects; // 0x0078
    uint32_t m_nRenderMode; // 0x007C
    uint32_t m_nModelIndex; // 0x008C
    uint32_t m_takedamage; // 0x008E
    uint32_t m_iHealth; // 0x0090
    uint32_t m_iMaxHealth; // 0x0094
    uint32_t m_iTeamNum; // 0x009C
    uint32_t m_PredictableID; // 0x00A0
    float m_vecVelocity[0]; // 0x00F4
    float m_vecVelocity[1]; // 0x00F8
    float m_vecVelocity[2]; // 0x00FC
    uint32_t m_iParentAttachment; // 0x017A
    uint32_t moveparent; // 0x0190
    fVector3 m_vecMinsPreScaled; // 0x01A4
    fVector3 m_vecMaxsPreScaled; // 0x01B0
    fVector3 m_vecMins; // 0x01BC
    fVector3 m_vecMaxs; // 0x01C8
    uint32_t m_usSolidFlags; // 0x01D8
    uint32_t m_nSurroundType; // 0x01DC
    uint32_t m_nSolidType; // 0x01DD
    uint32_t m_triggerBloat; // 0x01DE
    fVector3 m_vecSpecifiedSurroundingMinsPreScaled; // 0x01E0
    fVector3 m_vecSpecifiedSurroundingMaxsPreScaled; // 0x01EC
    fVector3 m_vecSpecifiedSurroundingMins; // 0x01F8
    fVector3 m_vecSpecifiedSurroundingMaxs; // 0x0204
    float m_flElasticity; // 0x0248
    float m_flShadowCastDistance; // 0x024C
    fVector3 m_vecOrigin; // 0x0338
    fVector3 m_angRotation; // 0x0344
    uint32_t m_CollisionGroup; // 0x0354
    uint32_t m_bIsPlayerSimulated; // 0x04C8
    uint32_t m_bSimulatedEveryTick; // 0x04C9
    uint32_t m_bAnimatedEveryTick; // 0x04CA
    uint32_t m_bAlternateSorting; // 0x04CB
    uint32_t m_iTextureFrameIndex; // 0x04CC
    uint32_t m_hOwnerEntity; // 0x04D8
    uint32_t m_hEffectEntity; // 0x04DC
    uint32_t m_bOnFire; // 0x0515
    float m_CreationTime; // 0x0518
    uint32_t m_RealClassName; // 0x051C
    uint32_t m_OverrideMaterial; // 0x0520
    uint32_t m_OverrideSubMaterials[0]; // 0x0528
    uint32_t m_spawnflags; // 0x0640
    uint32_t m_iGModFlags; // 0x0644
    uintptr_t m_GMOD_bool[32]; // 0x06A0
    uintptr_t m_GMOD_float[32]; // 0x06C0
    uintptr_t m_GMOD_int[32]; // 0x0740
    uintptr_t m_GMOD_Vector[32]; // 0x07C0
    uintptr_t m_GMOD_QAngle[32]; // 0x0940
    uintptr_t m_GMOD_EHANDLE[32]; // 0x0AC0
    const char* m_GMOD_String0; // 0x0B40
    const char* m_GMOD_String1; // 0x0D40
    const char* m_GMOD_String2; // 0x0F40
    const char* m_GMOD_String3; // 0x1140
    int64_t m_GMOD_DataTable; // 0x1340
    uint32_t m_iCreationID; // 0x1388
    uint32_t m_iMapCreatedID; // 0x138C
    uint32_t m_nDensity; // 0x1390
    uint32_t m_nLifetime; // 0x1394
    uint32_t m_nSpeed; // 0x1398
    uint32_t m_bEmit; // 0x139C
};

class ParticleSmokeGrenade // parent CBaseEntity {
public:
    void* m_OverrideSubMaterials; // 0x0000
    uint32_t movecollide; // 0x0000
    uint32_t movetype; // 0x0000
    uint32_t m_nRenderFX; // 0x0054
    uint32_t m_clrRender; // 0x0058
    uint32_t m_flAnimTime; // 0x0060
    uint32_t m_flSimulationTime; // 0x0068
    uint32_t m_ubInterpolationFrame; // 0x0074
    uint32_t m_fEffects; // 0x0078
    uint32_t m_nRenderMode; // 0x007C
    uint32_t m_nModelIndex; // 0x008C
    uint32_t m_takedamage; // 0x008E
    uint32_t m_iHealth; // 0x0090
    uint32_t m_iMaxHealth; // 0x0094
    uint32_t m_iTeamNum; // 0x009C
    uint32_t m_PredictableID; // 0x00A0
    float m_vecVelocity[0]; // 0x00F4
    float m_vecVelocity[1]; // 0x00F8
    float m_vecVelocity[2]; // 0x00FC
    uint32_t m_iParentAttachment; // 0x017A
    uint32_t moveparent; // 0x0190
    fVector3 m_vecMinsPreScaled; // 0x01A4
    fVector3 m_vecMaxsPreScaled; // 0x01B0
    fVector3 m_vecMins; // 0x01BC
    fVector3 m_vecMaxs; // 0x01C8
    uint32_t m_usSolidFlags; // 0x01D8
    uint32_t m_nSurroundType; // 0x01DC
    uint32_t m_nSolidType; // 0x01DD
    uint32_t m_triggerBloat; // 0x01DE
    fVector3 m_vecSpecifiedSurroundingMinsPreScaled; // 0x01E0
    fVector3 m_vecSpecifiedSurroundingMaxsPreScaled; // 0x01EC
    fVector3 m_vecSpecifiedSurroundingMins; // 0x01F8
    fVector3 m_vecSpecifiedSurroundingMaxs; // 0x0204
    float m_flElasticity; // 0x0248
    float m_flShadowCastDistance; // 0x024C
    fVector3 m_vecOrigin; // 0x0338
    fVector3 m_angRotation; // 0x0344
    uint32_t m_CollisionGroup; // 0x0354
    uint32_t m_bIsPlayerSimulated; // 0x04C8
    uint32_t m_bSimulatedEveryTick; // 0x04C9
    uint32_t m_bAnimatedEveryTick; // 0x04CA
    uint32_t m_bAlternateSorting; // 0x04CB
    uint32_t m_iTextureFrameIndex; // 0x04CC
    uint32_t m_hOwnerEntity; // 0x04D8
    uint32_t m_hEffectEntity; // 0x04DC
    uint32_t m_bOnFire; // 0x0515
    float m_CreationTime; // 0x0518
    uint32_t m_RealClassName; // 0x051C
    uint32_t m_OverrideMaterial; // 0x0520
    uint32_t m_OverrideSubMaterials[0]; // 0x0528
    uint32_t m_spawnflags; // 0x0640
    uint32_t m_iGModFlags; // 0x0644
    uintptr_t m_GMOD_bool[32]; // 0x06A0
    uintptr_t m_GMOD_float[32]; // 0x06C0
    uintptr_t m_GMOD_int[32]; // 0x0740
    uintptr_t m_GMOD_Vector[32]; // 0x07C0
    uintptr_t m_GMOD_QAngle[32]; // 0x0940
    uintptr_t m_GMOD_EHANDLE[32]; // 0x0AC0
    const char* m_GMOD_String0; // 0x0B40
    const char* m_GMOD_String1; // 0x0D40
    const char* m_GMOD_String2; // 0x0F40
    const char* m_GMOD_String3; // 0x1140
    int64_t m_GMOD_DataTable; // 0x1340
    uint32_t m_iCreationID; // 0x1388
    uint32_t m_iMapCreatedID; // 0x138C
    uint32_t m_CurrentStage; // 0x147C
    float m_flSpawnTime; // 0x148C
    float m_FadeStartTime; // 0x1490
    float m_FadeEndTime; // 0x1494
};

class CBaseHelicopter // parent CBaseEntity {
public:
    uint32_t m_nSequence; // 0x0000
    uint32_t movecollide; // 0x0000
    void* m_OverrideSubMaterials; // 0x0000
    uint32_t lengthprop15; // 0x0000
    uint32_t movetype; // 0x0000
    float m_flPrevCycle; // 0x0004
    float m_flWeight; // 0x0008
    uint32_t m_nOrder; // 0x000C
    float m_flCycle; // 0x0014
    uint32_t m_nRenderFX; // 0x0054
    uint32_t m_clrRender; // 0x0058
    uint32_t m_flAnimTime; // 0x0060
    uint32_t m_flSimulationTime; // 0x0068
    uint32_t m_ubInterpolationFrame; // 0x0074
    uint32_t m_fEffects; // 0x0078
    uint32_t m_nRenderMode; // 0x007C
    uint32_t m_nModelIndex; // 0x008C
    uint32_t m_takedamage; // 0x008E
    uint32_t m_lifeState; // 0x008F
    uint32_t m_iHealth; // 0x0090
    uint32_t m_iMaxHealth; // 0x0094
    uint32_t m_iTeamNum; // 0x009C
    uint32_t m_PredictableID; // 0x00A0
    float m_vecViewOffset[0]; // 0x00E8
    float m_vecViewOffset[1]; // 0x00EC
    float m_vecViewOffset[2]; // 0x00F0
    float m_vecVelocity[0]; // 0x00F4
    float m_vecVelocity[1]; // 0x00F8
    float m_vecVelocity[2]; // 0x00FC
    uint32_t m_iParentAttachment; // 0x017A
    uint32_t moveparent; // 0x0190
    fVector3 m_vecMinsPreScaled; // 0x01A4
    fVector3 m_vecMaxsPreScaled; // 0x01B0
    fVector3 m_vecMins; // 0x01BC
    fVector3 m_vecMaxs; // 0x01C8
    uint32_t m_usSolidFlags; // 0x01D8
    uint32_t m_nSurroundType; // 0x01DC
    uint32_t m_nSolidType; // 0x01DD
    uint32_t m_triggerBloat; // 0x01DE
    fVector3 m_vecSpecifiedSurroundingMinsPreScaled; // 0x01E0
    fVector3 m_vecSpecifiedSurroundingMaxsPreScaled; // 0x01EC
    fVector3 m_vecSpecifiedSurroundingMins; // 0x01F8
    fVector3 m_vecSpecifiedSurroundingMaxs; // 0x0204
    float m_flElasticity; // 0x0248
    float m_flShadowCastDistance; // 0x024C
    fVector3 m_vecOrigin; // 0x0338
    fVector3 m_angRotation; // 0x0344
    uint32_t m_CollisionGroup; // 0x0354
    uint32_t m_bIsPlayerSimulated; // 0x04C8
    uint32_t m_bSimulatedEveryTick; // 0x04C9
    uint32_t m_bAnimatedEveryTick; // 0x04CA
    uint32_t m_bAlternateSorting; // 0x04CB
    uint32_t m_iTextureFrameIndex; // 0x04CC
    uint32_t m_hOwnerEntity; // 0x04D8
    uint32_t m_hEffectEntity; // 0x04DC
    uint32_t m_bOnFire; // 0x0515
    float m_CreationTime; // 0x0518
    uint32_t m_RealClassName; // 0x051C
    uint32_t m_OverrideMaterial; // 0x0520
    uint32_t m_OverrideSubMaterials[0]; // 0x0528
    uint32_t m_spawnflags; // 0x0640
    uint32_t m_iGModFlags; // 0x0644
    uintptr_t m_GMOD_bool[32]; // 0x06A0
    uintptr_t m_GMOD_float[32]; // 0x06C0
    uintptr_t m_GMOD_int[32]; // 0x0740
    uintptr_t m_GMOD_Vector[32]; // 0x07C0
    uintptr_t m_GMOD_QAngle[32]; // 0x0940
    uintptr_t m_GMOD_EHANDLE[32]; // 0x0AC0
    const char* m_GMOD_String0; // 0x0B40
    const char* m_GMOD_String1; // 0x0D40
    const char* m_GMOD_String2; // 0x0F40
    const char* m_GMOD_String3; // 0x1140
    int64_t m_GMOD_DataTable; // 0x1340
    uint32_t m_iCreationID; // 0x1388
    uint32_t m_iMapCreatedID; // 0x138C
    uint32_t m_nSkin; // 0x1398
    uint32_t m_nBody; // 0x139C
    uint32_t m_nHitboxSet; // 0x13A0
    float m_flPlaybackRate; // 0x13C0
    fVector3 m_vecForce; // 0x13CC
    uint32_t m_nForceBone; // 0x13D8
    uint32_t m_bClientSideFrameReset; // 0x140C
    float m_fadeMinDist; // 0x1444
    float m_fadeMaxDist; // 0x1448
    float m_flFadeScale; // 0x144C
    float m_flModelWidthScale; // 0x149C
    float m_flModelScale; // 0x149C
    uintptr_t m_flPoseParameter[24]; // 0x14A0
    uintptr_t m_flEncodedController[4]; // 0x15BC
    uint32_t m_bClientSideAnimation; // 0x160C
    uint32_t m_nNewSequenceParity; // 0x1610
    uint32_t m_nResetEventsParity; // 0x1614
    uint32_t m_hLightingOrigin; // 0x16C4
    uint32_t m_hLightingOriginRelative; // 0x16C8
    uint32_t m_nMuzzleFlashParity; // 0x16CC
    fVector3 m_OverrideViewTarget; // 0x16EC
    uint32_t m_pBoneManipulator; // 0x1778
    uint32_t m_pFlexManipulator; // 0x1780
    fVector3 m_viewtarget; // 0x1844
    uintptr_t m_flexWeight[96]; // 0x1880
    uint32_t m_blinktoggle; // 0x1A30
    fVector3 m_vecLean; // 0x1B9C
    fVector3 m_vecShift; // 0x1BD8
    float m_flNextAttack; // 0x1C18
    uint32_t m_bloodColor; // 0x1C1C
    uintptr_t m_hMyWeapons[256]; // 0x2020
    uint32_t m_hActiveWeapon; // 0x2420
    float m_flTimePingEffect; // 0x2428
    uint32_t m_iDeathPose; // 0x242C
    uint32_t m_iDeathFrame; // 0x2430
    uint32_t m_iSpeedModRadius; // 0x2434
    uint32_t m_iSpeedModSpeed; // 0x2438
    uint32_t m_bPerformAvoidance; // 0x243C
    uint32_t m_bIsMoving; // 0x243D
    uint32_t m_bFadeCorpse; // 0x243E
    uint32_t m_bSpeedModActive; // 0x243F
    uint32_t m_bImportanRagdoll; // 0x2440
    float m_flStartupTime; // 0x2448
};

class SporeTrail // parent CBaseEntity {
public:
    void* m_OverrideSubMaterials; // 0x0000
    uint32_t movecollide; // 0x0000
    uint32_t movetype; // 0x0000
    uint32_t m_nRenderFX; // 0x0054
    uint32_t m_clrRender; // 0x0058
    uint32_t m_flAnimTime; // 0x0060
    uint32_t m_flSimulationTime; // 0x0068
    uint32_t m_ubInterpolationFrame; // 0x0074
    uint32_t m_fEffects; // 0x0078
    uint32_t m_nRenderMode; // 0x007C
    uint32_t m_nModelIndex; // 0x008C
    uint32_t m_takedamage; // 0x008E
    uint32_t m_iHealth; // 0x0090
    uint32_t m_iMaxHealth; // 0x0094
    uint32_t m_iTeamNum; // 0x009C
    uint32_t m_PredictableID; // 0x00A0
    float m_vecVelocity[0]; // 0x00F4
    float m_vecVelocity[1]; // 0x00F8
    float m_vecVelocity[2]; // 0x00FC
    uint32_t m_iParentAttachment; // 0x017A
    uint32_t moveparent; // 0x0190
    fVector3 m_vecMinsPreScaled; // 0x01A4
    fVector3 m_vecMaxsPreScaled; // 0x01B0
    fVector3 m_vecMins; // 0x01BC
    fVector3 m_vecMaxs; // 0x01C8
    uint32_t m_usSolidFlags; // 0x01D8
    uint32_t m_nSurroundType; // 0x01DC
    uint32_t m_nSolidType; // 0x01DD
    uint32_t m_triggerBloat; // 0x01DE
    fVector3 m_vecSpecifiedSurroundingMinsPreScaled; // 0x01E0
    fVector3 m_vecSpecifiedSurroundingMaxsPreScaled; // 0x01EC
    fVector3 m_vecSpecifiedSurroundingMins; // 0x01F8
    fVector3 m_vecSpecifiedSurroundingMaxs; // 0x0204
    float m_flElasticity; // 0x0248
    float m_flShadowCastDistance; // 0x024C
    fVector3 m_vecOrigin; // 0x0338
    fVector3 m_angRotation; // 0x0344
    uint32_t m_CollisionGroup; // 0x0354
    uint32_t m_bIsPlayerSimulated; // 0x04C8
    uint32_t m_bSimulatedEveryTick; // 0x04C9
    uint32_t m_bAnimatedEveryTick; // 0x04CA
    uint32_t m_bAlternateSorting; // 0x04CB
    uint32_t m_iTextureFrameIndex; // 0x04CC
    uint32_t m_hOwnerEntity; // 0x04D8
    uint32_t m_hEffectEntity; // 0x04DC
    uint32_t m_bOnFire; // 0x0515
    float m_CreationTime; // 0x0518
    uint32_t m_RealClassName; // 0x051C
    uint32_t m_OverrideMaterial; // 0x0520
    uint32_t m_OverrideSubMaterials[0]; // 0x0528
    uint32_t m_spawnflags; // 0x0640
    uint32_t m_iGModFlags; // 0x0644
    uintptr_t m_GMOD_bool[32]; // 0x06A0
    uintptr_t m_GMOD_float[32]; // 0x06C0
    uintptr_t m_GMOD_int[32]; // 0x0740
    uintptr_t m_GMOD_Vector[32]; // 0x07C0
    uintptr_t m_GMOD_QAngle[32]; // 0x0940
    uintptr_t m_GMOD_EHANDLE[32]; // 0x0AC0
    const char* m_GMOD_String0; // 0x0B40
    const char* m_GMOD_String1; // 0x0D40
    const char* m_GMOD_String2; // 0x0F40
    const char* m_GMOD_String3; // 0x1140
    int64_t m_GMOD_DataTable; // 0x1340
    uint32_t m_iCreationID; // 0x1388
    uint32_t m_iMapCreatedID; // 0x138C
    fVector3 m_vecEndColor; // 0x1478
    float m_flSpawnRate; // 0x1484
    float m_flParticleLifetime; // 0x1488
    float m_flStartSize; // 0x148C
    float m_flEndSize; // 0x1490
    float m_flSpawnRadius; // 0x1494
    uint32_t m_bEmit; // 0x14A4
};

class CNPC_Portal_FloorTurret // parent CBaseEntity {
public:
    uint32_t movecollide; // 0x0000
    uint32_t lengthprop15; // 0x0000
    void* m_OverrideSubMaterials; // 0x0000
    uint32_t m_nSequence; // 0x0000
    uint32_t movetype; // 0x0000
    float m_flPrevCycle; // 0x0004
    float m_flWeight; // 0x0008
    uint32_t m_nOrder; // 0x000C
    float m_flCycle; // 0x0014
    uint32_t m_nRenderFX; // 0x0054
    uint32_t m_clrRender; // 0x0058
    uint32_t m_flAnimTime; // 0x0060
    uint32_t m_flSimulationTime; // 0x0068
    uint32_t m_ubInterpolationFrame; // 0x0074
    uint32_t m_fEffects; // 0x0078
    uint32_t m_nRenderMode; // 0x007C
    uint32_t m_nModelIndex; // 0x008C
    uint32_t m_takedamage; // 0x008E
    uint32_t m_lifeState; // 0x008F
    uint32_t m_iHealth; // 0x0090
    uint32_t m_iMaxHealth; // 0x0094
    uint32_t m_iTeamNum; // 0x009C
    uint32_t m_PredictableID; // 0x00A0
    float m_vecViewOffset[0]; // 0x00E8
    float m_vecViewOffset[1]; // 0x00EC
    float m_vecViewOffset[2]; // 0x00F0
    float m_vecVelocity[0]; // 0x00F4
    float m_vecVelocity[1]; // 0x00F8
    float m_vecVelocity[2]; // 0x00FC
    uint32_t m_iParentAttachment; // 0x017A
    uint32_t moveparent; // 0x0190
    fVector3 m_vecMinsPreScaled; // 0x01A4
    fVector3 m_vecMaxsPreScaled; // 0x01B0
    fVector3 m_vecMins; // 0x01BC
    fVector3 m_vecMaxs; // 0x01C8
    uint32_t m_usSolidFlags; // 0x01D8
    uint32_t m_nSurroundType; // 0x01DC
    uint32_t m_nSolidType; // 0x01DD
    uint32_t m_triggerBloat; // 0x01DE
    fVector3 m_vecSpecifiedSurroundingMinsPreScaled; // 0x01E0
    fVector3 m_vecSpecifiedSurroundingMaxsPreScaled; // 0x01EC
    fVector3 m_vecSpecifiedSurroundingMins; // 0x01F8
    fVector3 m_vecSpecifiedSurroundingMaxs; // 0x0204
    float m_flElasticity; // 0x0248
    float m_flShadowCastDistance; // 0x024C
    fVector3 m_vecOrigin; // 0x0338
    fVector3 m_angRotation; // 0x0344
    uint32_t m_CollisionGroup; // 0x0354
    uint32_t m_bIsPlayerSimulated; // 0x04C8
    uint32_t m_bSimulatedEveryTick; // 0x04C9
    uint32_t m_bAnimatedEveryTick; // 0x04CA
    uint32_t m_bAlternateSorting; // 0x04CB
    uint32_t m_iTextureFrameIndex; // 0x04CC
    uint32_t m_hOwnerEntity; // 0x04D8
    uint32_t m_hEffectEntity; // 0x04DC
    uint32_t m_bOnFire; // 0x0515
    float m_CreationTime; // 0x0518
    uint32_t m_RealClassName; // 0x051C
    uint32_t m_OverrideMaterial; // 0x0520
    uint32_t m_OverrideSubMaterials[0]; // 0x0528
    uint32_t m_spawnflags; // 0x0640
    uint32_t m_iGModFlags; // 0x0644
    uintptr_t m_GMOD_bool[32]; // 0x06A0
    uintptr_t m_GMOD_float[32]; // 0x06C0
    uintptr_t m_GMOD_int[32]; // 0x0740
    uintptr_t m_GMOD_Vector[32]; // 0x07C0
    uintptr_t m_GMOD_QAngle[32]; // 0x0940
    uintptr_t m_GMOD_EHANDLE[32]; // 0x0AC0
    const char* m_GMOD_String0; // 0x0B40
    const char* m_GMOD_String1; // 0x0D40
    const char* m_GMOD_String2; // 0x0F40
    const char* m_GMOD_String3; // 0x1140
    int64_t m_GMOD_DataTable; // 0x1340
    uint32_t m_iCreationID; // 0x1388
    uint32_t m_iMapCreatedID; // 0x138C
    uint32_t m_nSkin; // 0x1398
    uint32_t m_nBody; // 0x139C
    uint32_t m_nHitboxSet; // 0x13A0
    float m_flPlaybackRate; // 0x13C0
    fVector3 m_vecForce; // 0x13CC
    uint32_t m_nForceBone; // 0x13D8
    uint32_t m_bClientSideFrameReset; // 0x140C
    float m_fadeMinDist; // 0x1444
    float m_fadeMaxDist; // 0x1448
    float m_flFadeScale; // 0x144C
    float m_flModelScale; // 0x149C
    float m_flModelWidthScale; // 0x149C
    uintptr_t m_flPoseParameter[24]; // 0x14A0
    uintptr_t m_flEncodedController[4]; // 0x15BC
    uint32_t m_bClientSideAnimation; // 0x160C
    uint32_t m_nNewSequenceParity; // 0x1610
    uint32_t m_nResetEventsParity; // 0x1614
    uint32_t m_hLightingOrigin; // 0x16C4
    uint32_t m_hLightingOriginRelative; // 0x16C8
    uint32_t m_nMuzzleFlashParity; // 0x16CC
    fVector3 m_OverrideViewTarget; // 0x16EC
    uint32_t m_pBoneManipulator; // 0x1778
    uint32_t m_pFlexManipulator; // 0x1780
    fVector3 m_viewtarget; // 0x1844
    uintptr_t m_flexWeight[96]; // 0x1880
    uint32_t m_blinktoggle; // 0x1A30
    fVector3 m_vecLean; // 0x1B9C
    fVector3 m_vecShift; // 0x1BD8
    float m_flNextAttack; // 0x1C18
    uint32_t m_bloodColor; // 0x1C1C
    uintptr_t m_hMyWeapons[256]; // 0x2020
    uint32_t m_hActiveWeapon; // 0x2420
    float m_flTimePingEffect; // 0x2428
    uint32_t m_iDeathPose; // 0x242C
    uint32_t m_iDeathFrame; // 0x2430
    uint32_t m_iSpeedModRadius; // 0x2434
    uint32_t m_iSpeedModSpeed; // 0x2438
    uint32_t m_bPerformAvoidance; // 0x243C
    uint32_t m_bIsMoving; // 0x243D
    uint32_t m_bFadeCorpse; // 0x243E
    uint32_t m_bSpeedModActive; // 0x243F
    uint32_t m_bImportanRagdoll; // 0x2440
    uint32_t m_bOutOfAmmo; // 0x244C
    uint32_t m_bLaserOn; // 0x244D
    uint32_t m_sLaserHaloSprite; // 0x2450
};

class RocketTrail // parent CBaseEntity {
public:
    void* m_OverrideSubMaterials; // 0x0000
    uint32_t movecollide; // 0x0000
    uint32_t movetype; // 0x0000
    uint32_t m_nRenderFX; // 0x0054
    uint32_t m_clrRender; // 0x0058
    uint32_t m_flAnimTime; // 0x0060
    uint32_t m_flSimulationTime; // 0x0068
    uint32_t m_ubInterpolationFrame; // 0x0074
    uint32_t m_fEffects; // 0x0078
    uint32_t m_nRenderMode; // 0x007C
    uint32_t m_nModelIndex; // 0x008C
    uint32_t m_takedamage; // 0x008E
    uint32_t m_iHealth; // 0x0090
    uint32_t m_iMaxHealth; // 0x0094
    uint32_t m_iTeamNum; // 0x009C
    uint32_t m_PredictableID; // 0x00A0
    float m_vecVelocity[0]; // 0x00F4
    float m_vecVelocity[1]; // 0x00F8
    float m_vecVelocity[2]; // 0x00FC
    uint32_t m_iParentAttachment; // 0x017A
    uint32_t moveparent; // 0x0190
    fVector3 m_vecMinsPreScaled; // 0x01A4
    fVector3 m_vecMaxsPreScaled; // 0x01B0
    fVector3 m_vecMins; // 0x01BC
    fVector3 m_vecMaxs; // 0x01C8
    uint32_t m_usSolidFlags; // 0x01D8
    uint32_t m_nSurroundType; // 0x01DC
    uint32_t m_nSolidType; // 0x01DD
    uint32_t m_triggerBloat; // 0x01DE
    fVector3 m_vecSpecifiedSurroundingMinsPreScaled; // 0x01E0
    fVector3 m_vecSpecifiedSurroundingMaxsPreScaled; // 0x01EC
    fVector3 m_vecSpecifiedSurroundingMins; // 0x01F8
    fVector3 m_vecSpecifiedSurroundingMaxs; // 0x0204
    float m_flElasticity; // 0x0248
    float m_flShadowCastDistance; // 0x024C
    fVector3 m_vecOrigin; // 0x0338
    fVector3 m_angRotation; // 0x0344
    uint32_t m_CollisionGroup; // 0x0354
    uint32_t m_bIsPlayerSimulated; // 0x04C8
    uint32_t m_bSimulatedEveryTick; // 0x04C9
    uint32_t m_bAnimatedEveryTick; // 0x04CA
    uint32_t m_bAlternateSorting; // 0x04CB
    uint32_t m_iTextureFrameIndex; // 0x04CC
    uint32_t m_hOwnerEntity; // 0x04D8
    uint32_t m_hEffectEntity; // 0x04DC
    uint32_t m_bOnFire; // 0x0515
    float m_CreationTime; // 0x0518
    uint32_t m_RealClassName; // 0x051C
    uint32_t m_OverrideMaterial; // 0x0520
    uint32_t m_OverrideSubMaterials[0]; // 0x0528
    uint32_t m_spawnflags; // 0x0640
    uint32_t m_iGModFlags; // 0x0644
    uintptr_t m_GMOD_bool[32]; // 0x06A0
    uintptr_t m_GMOD_float[32]; // 0x06C0
    uintptr_t m_GMOD_int[32]; // 0x0740
    uintptr_t m_GMOD_Vector[32]; // 0x07C0
    uintptr_t m_GMOD_QAngle[32]; // 0x0940
    uintptr_t m_GMOD_EHANDLE[32]; // 0x0AC0
    const char* m_GMOD_String0; // 0x0B40
    const char* m_GMOD_String1; // 0x0D40
    const char* m_GMOD_String2; // 0x0F40
    const char* m_GMOD_String3; // 0x1140
    int64_t m_GMOD_DataTable; // 0x1340
    uint32_t m_iCreationID; // 0x1388
    uint32_t m_iMapCreatedID; // 0x138C
    float m_SpawnRate; // 0x147C
    fVector3 m_StartColor; // 0x1480
    fVector3 m_EndColor; // 0x148C
    float m_Opacity; // 0x1498
    float m_ParticleLifetime; // 0x149C
    float m_StopEmitTime; // 0x14A0
    float m_MinSpeed; // 0x14A4
    float m_MaxSpeed; // 0x14A8
    float m_StartSize; // 0x14AC
    float m_EndSize; // 0x14B0
    float m_SpawnRadius; // 0x14B4
    uint32_t m_bEmit; // 0x14C4
    uint32_t m_bDamaged; // 0x14C5
    uint32_t m_nAttachment; // 0x14C8
    float m_flFlareScale; // 0x14D8
};

class CPropVehicleDriveable // parent CBaseEntity {
public:
    uint32_t movecollide; // 0x0000
    uint32_t movetype; // 0x0000
    void* m_OverrideSubMaterials; // 0x0000
    uint32_t m_nRenderFX; // 0x0054
    uint32_t m_clrRender; // 0x0058
    uint32_t m_flAnimTime; // 0x0060
    uint32_t m_flSimulationTime; // 0x0068
    uint32_t m_ubInterpolationFrame; // 0x0074
    uint32_t m_fEffects; // 0x0078
    uint32_t m_nRenderMode; // 0x007C
    uint32_t m_nModelIndex; // 0x008C
    uint32_t m_takedamage; // 0x008E
    uint32_t m_iHealth; // 0x0090
    uint32_t m_iMaxHealth; // 0x0094
    uint32_t m_iTeamNum; // 0x009C
    uint32_t m_PredictableID; // 0x00A0
    float m_vecVelocity[0]; // 0x00F4
    float m_vecVelocity[1]; // 0x00F8
    float m_vecVelocity[2]; // 0x00FC
    uint32_t m_iParentAttachment; // 0x017A
    uint32_t moveparent; // 0x0190
    fVector3 m_vecMinsPreScaled; // 0x01A4
    fVector3 m_vecMaxsPreScaled; // 0x01B0
    fVector3 m_vecMins; // 0x01BC
    fVector3 m_vecMaxs; // 0x01C8
    uint32_t m_usSolidFlags; // 0x01D8
    uint32_t m_nSurroundType; // 0x01DC
    uint32_t m_nSolidType; // 0x01DD
    uint32_t m_triggerBloat; // 0x01DE
    fVector3 m_vecSpecifiedSurroundingMinsPreScaled; // 0x01E0
    fVector3 m_vecSpecifiedSurroundingMaxsPreScaled; // 0x01EC
    fVector3 m_vecSpecifiedSurroundingMins; // 0x01F8
    fVector3 m_vecSpecifiedSurroundingMaxs; // 0x0204
    float m_flElasticity; // 0x0248
    float m_flShadowCastDistance; // 0x024C
    fVector3 m_vecOrigin; // 0x0338
    fVector3 m_angRotation; // 0x0344
    uint32_t m_CollisionGroup; // 0x0354
    uint32_t m_bIsPlayerSimulated; // 0x04C8
    uint32_t m_bSimulatedEveryTick; // 0x04C9
    uint32_t m_bAnimatedEveryTick; // 0x04CA
    uint32_t m_bAlternateSorting; // 0x04CB
    uint32_t m_iTextureFrameIndex; // 0x04CC
    uint32_t m_hOwnerEntity; // 0x04D8
    uint32_t m_hEffectEntity; // 0x04DC
    uint32_t m_bOnFire; // 0x0515
    float m_CreationTime; // 0x0518
    uint32_t m_RealClassName; // 0x051C
    uint32_t m_OverrideMaterial; // 0x0520
    uint32_t m_OverrideSubMaterials[0]; // 0x0528
    uint32_t m_spawnflags; // 0x0640
    uint32_t m_iGModFlags; // 0x0644
    uintptr_t m_GMOD_bool[32]; // 0x06A0
    uintptr_t m_GMOD_float[32]; // 0x06C0
    uintptr_t m_GMOD_int[32]; // 0x0740
    uintptr_t m_GMOD_Vector[32]; // 0x07C0
    uintptr_t m_GMOD_QAngle[32]; // 0x0940
    uintptr_t m_GMOD_EHANDLE[32]; // 0x0AC0
    const char* m_GMOD_String0; // 0x0B40
    const char* m_GMOD_String1; // 0x0D40
    const char* m_GMOD_String2; // 0x0F40
    const char* m_GMOD_String3; // 0x1140
    int64_t m_GMOD_DataTable; // 0x1340
    uint32_t m_iCreationID; // 0x1388
    uint32_t m_iMapCreatedID; // 0x138C
    uint32_t m_nSkin; // 0x1398
    uint32_t m_nBody; // 0x139C
    uint32_t m_nHitboxSet; // 0x13A0
    float m_flPlaybackRate; // 0x13C0
    fVector3 m_vecForce; // 0x13CC
    uint32_t m_nForceBone; // 0x13D8
    uint32_t m_bClientSideFrameReset; // 0x140C
    float m_fadeMinDist; // 0x1444
    float m_fadeMaxDist; // 0x1448
    float m_flFadeScale; // 0x144C
    float m_flModelWidthScale; // 0x149C
    float m_flModelScale; // 0x149C
    uintptr_t m_flPoseParameter[24]; // 0x14A0
    uintptr_t m_flEncodedController[4]; // 0x15BC
    uint32_t m_bClientSideAnimation; // 0x160C
    uint32_t m_nNewSequenceParity; // 0x1610
    uint32_t m_nResetEventsParity; // 0x1614
    uint32_t m_nSequence; // 0x163C
    float m_flCycle; // 0x1644
    uint32_t m_hLightingOrigin; // 0x16C4
    uint32_t m_hLightingOriginRelative; // 0x16C8
    uint32_t m_nMuzzleFlashParity; // 0x16CC
    fVector3 m_OverrideViewTarget; // 0x16EC
    uint32_t m_pBoneManipulator; // 0x1778
    uint32_t m_pFlexManipulator; // 0x1780
    uint32_t m_hPlayer; // 0x17DC
    uint32_t m_nSpeed; // 0x17E0
    uint32_t m_nRPM; // 0x17E4
    float m_flThrottle; // 0x17E8
    uint32_t m_nBoostTimeLeft; // 0x17EC
    uint32_t m_nHasBoost; // 0x17F0
    uint32_t m_nScannerDisabledWeapons; // 0x17F4
    uint32_t m_nScannerDisabledVehicle; // 0x17F8
    uint32_t m_bEnterAnimOn; // 0x1818
    uint32_t m_bExitAnimOn; // 0x1819
    fVector3 m_vecGunCrosshair; // 0x1820
    fVector3 m_vecEyeExitEndpoint; // 0x185C
    uint32_t m_bHasGun; // 0x1868
    uint32_t m_bUnableToFire; // 0x1869
};

class CParticleFire {
public:
    fVector3 m_vOrigin; // 0x1484
    fVector3 m_vDirection; // 0x1490
};

class CEnvQuadraticBeam // parent CBaseEntity {
public:
    uint32_t movecollide; // 0x0000
    uint32_t movetype; // 0x0000
    void* m_OverrideSubMaterials; // 0x0000
    uint32_t m_nRenderFX; // 0x0054
    uint32_t m_clrRender; // 0x0058
    uint32_t m_flAnimTime; // 0x0060
    uint32_t m_flSimulationTime; // 0x0068
    uint32_t m_ubInterpolationFrame; // 0x0074
    uint32_t m_fEffects; // 0x0078
    uint32_t m_nRenderMode; // 0x007C
    uint32_t m_nModelIndex; // 0x008C
    uint32_t m_takedamage; // 0x008E
    uint32_t m_iHealth; // 0x0090
    uint32_t m_iMaxHealth; // 0x0094
    uint32_t m_iTeamNum; // 0x009C
    uint32_t m_PredictableID; // 0x00A0
    float m_vecVelocity[0]; // 0x00F4
    float m_vecVelocity[1]; // 0x00F8
    float m_vecVelocity[2]; // 0x00FC
    uint32_t m_iParentAttachment; // 0x017A
    uint32_t moveparent; // 0x0190
    fVector3 m_vecMinsPreScaled; // 0x01A4
    fVector3 m_vecMaxsPreScaled; // 0x01B0
    fVector3 m_vecMins; // 0x01BC
    fVector3 m_vecMaxs; // 0x01C8
    uint32_t m_usSolidFlags; // 0x01D8
    uint32_t m_nSurroundType; // 0x01DC
    uint32_t m_nSolidType; // 0x01DD
    uint32_t m_triggerBloat; // 0x01DE
    fVector3 m_vecSpecifiedSurroundingMinsPreScaled; // 0x01E0
    fVector3 m_vecSpecifiedSurroundingMaxsPreScaled; // 0x01EC
    fVector3 m_vecSpecifiedSurroundingMins; // 0x01F8
    fVector3 m_vecSpecifiedSurroundingMaxs; // 0x0204
    float m_flElasticity; // 0x0248
    float m_flShadowCastDistance; // 0x024C
    fVector3 m_vecOrigin; // 0x0338
    fVector3 m_angRotation; // 0x0344
    uint32_t m_CollisionGroup; // 0x0354
    uint32_t m_bIsPlayerSimulated; // 0x04C8
    uint32_t m_bSimulatedEveryTick; // 0x04C9
    uint32_t m_bAnimatedEveryTick; // 0x04CA
    uint32_t m_bAlternateSorting; // 0x04CB
    uint32_t m_iTextureFrameIndex; // 0x04CC
    uint32_t m_hOwnerEntity; // 0x04D8
    uint32_t m_hEffectEntity; // 0x04DC
    uint32_t m_bOnFire; // 0x0515
    float m_CreationTime; // 0x0518
    uint32_t m_RealClassName; // 0x051C
    uint32_t m_OverrideMaterial; // 0x0520
    uint32_t m_OverrideSubMaterials[0]; // 0x0528
    uint32_t m_spawnflags; // 0x0640
    uint32_t m_iGModFlags; // 0x0644
    uintptr_t m_GMOD_bool[32]; // 0x06A0
    uintptr_t m_GMOD_float[32]; // 0x06C0
    uintptr_t m_GMOD_int[32]; // 0x0740
    uintptr_t m_GMOD_Vector[32]; // 0x07C0
    uintptr_t m_GMOD_QAngle[32]; // 0x0940
    uintptr_t m_GMOD_EHANDLE[32]; // 0x0AC0
    const char* m_GMOD_String0; // 0x0B40
    const char* m_GMOD_String1; // 0x0D40
    const char* m_GMOD_String2; // 0x0F40
    const char* m_GMOD_String3; // 0x1140
    int64_t m_GMOD_DataTable; // 0x1340
    uint32_t m_iCreationID; // 0x1388
    uint32_t m_iMapCreatedID; // 0x138C
    fVector3 m_targetPosition; // 0x1390
    fVector3 m_controlPosition; // 0x139C
    float m_scrollRate; // 0x13A8
    float m_flWidth; // 0x13AC
};

class MovieExplosion // parent CBaseEntity {
public:
    void* m_OverrideSubMaterials; // 0x0000
    uint32_t movecollide; // 0x0000
    uint32_t movetype; // 0x0000
    uint32_t m_nRenderFX; // 0x0054
    uint32_t m_clrRender; // 0x0058
    uint32_t m_flAnimTime; // 0x0060
    uint32_t m_flSimulationTime; // 0x0068
    uint32_t m_ubInterpolationFrame; // 0x0074
    uint32_t m_fEffects; // 0x0078
    uint32_t m_nRenderMode; // 0x007C
    uint32_t m_nModelIndex; // 0x008C
    uint32_t m_takedamage; // 0x008E
    uint32_t m_iHealth; // 0x0090
    uint32_t m_iMaxHealth; // 0x0094
    uint32_t m_iTeamNum; // 0x009C
    uint32_t m_PredictableID; // 0x00A0
    float m_vecVelocity[0]; // 0x00F4
    float m_vecVelocity[1]; // 0x00F8
    float m_vecVelocity[2]; // 0x00FC
    uint32_t m_iParentAttachment; // 0x017A
    uint32_t moveparent; // 0x0190
    fVector3 m_vecMinsPreScaled; // 0x01A4
    fVector3 m_vecMaxsPreScaled; // 0x01B0
    fVector3 m_vecMins; // 0x01BC
    fVector3 m_vecMaxs; // 0x01C8
    uint32_t m_usSolidFlags; // 0x01D8
    uint32_t m_nSurroundType; // 0x01DC
    uint32_t m_nSolidType; // 0x01DD
    uint32_t m_triggerBloat; // 0x01DE
    fVector3 m_vecSpecifiedSurroundingMinsPreScaled; // 0x01E0
    fVector3 m_vecSpecifiedSurroundingMaxsPreScaled; // 0x01EC
    fVector3 m_vecSpecifiedSurroundingMins; // 0x01F8
    fVector3 m_vecSpecifiedSurroundingMaxs; // 0x0204
    float m_flElasticity; // 0x0248
    float m_flShadowCastDistance; // 0x024C
    fVector3 m_vecOrigin; // 0x0338
    fVector3 m_angRotation; // 0x0344
    uint32_t m_CollisionGroup; // 0x0354
    uint32_t m_bIsPlayerSimulated; // 0x04C8
    uint32_t m_bSimulatedEveryTick; // 0x04C9
    uint32_t m_bAnimatedEveryTick; // 0x04CA
    uint32_t m_bAlternateSorting; // 0x04CB
    uint32_t m_iTextureFrameIndex; // 0x04CC
    uint32_t m_hOwnerEntity; // 0x04D8
    uint32_t m_hEffectEntity; // 0x04DC
    uint32_t m_bOnFire; // 0x0515
    float m_CreationTime; // 0x0518
    uint32_t m_RealClassName; // 0x051C
    uint32_t m_OverrideMaterial; // 0x0520
    uint32_t m_OverrideSubMaterials[0]; // 0x0528
    uint32_t m_spawnflags; // 0x0640
    uint32_t m_iGModFlags; // 0x0644
    uintptr_t m_GMOD_bool[32]; // 0x06A0
    uintptr_t m_GMOD_float[32]; // 0x06C0
    uintptr_t m_GMOD_int[32]; // 0x0740
    uintptr_t m_GMOD_Vector[32]; // 0x07C0
    uintptr_t m_GMOD_QAngle[32]; // 0x0940
    uintptr_t m_GMOD_EHANDLE[32]; // 0x0AC0
    const char* m_GMOD_String0; // 0x0B40
    const char* m_GMOD_String1; // 0x0D40
    const char* m_GMOD_String2; // 0x0F40
    const char* m_GMOD_String3; // 0x1140
    int64_t m_GMOD_DataTable; // 0x1340
    uint32_t m_iCreationID; // 0x1388
    uint32_t m_iMapCreatedID; // 0x138C
};

class CPropEnergyBall // parent CBaseEntity {
public:
    uint32_t movecollide; // 0x0000
    uint32_t movetype; // 0x0000
    void* m_OverrideSubMaterials; // 0x0000
    uint32_t m_nRenderFX; // 0x0054
    uint32_t m_clrRender; // 0x0058
    uint32_t m_flAnimTime; // 0x0060
    uint32_t m_flSimulationTime; // 0x0068
    uint32_t m_ubInterpolationFrame; // 0x0074
    uint32_t m_fEffects; // 0x0078
    uint32_t m_nRenderMode; // 0x007C
    uint32_t m_nModelIndex; // 0x008C
    uint32_t m_takedamage; // 0x008E
    uint32_t m_iHealth; // 0x0090
    uint32_t m_iMaxHealth; // 0x0094
    uint32_t m_iTeamNum; // 0x009C
    uint32_t m_PredictableID; // 0x00A0
    float m_vecVelocity[0]; // 0x00F4
    float m_vecVelocity[1]; // 0x00F8
    float m_vecVelocity[2]; // 0x00FC
    uint32_t m_iParentAttachment; // 0x017A
    uint32_t moveparent; // 0x0190
    fVector3 m_vecMinsPreScaled; // 0x01A4
    fVector3 m_vecMaxsPreScaled; // 0x01B0
    fVector3 m_vecMins; // 0x01BC
    fVector3 m_vecMaxs; // 0x01C8
    uint32_t m_usSolidFlags; // 0x01D8
    uint32_t m_nSurroundType; // 0x01DC
    uint32_t m_nSolidType; // 0x01DD
    uint32_t m_triggerBloat; // 0x01DE
    fVector3 m_vecSpecifiedSurroundingMinsPreScaled; // 0x01E0
    fVector3 m_vecSpecifiedSurroundingMaxsPreScaled; // 0x01EC
    fVector3 m_vecSpecifiedSurroundingMins; // 0x01F8
    fVector3 m_vecSpecifiedSurroundingMaxs; // 0x0204
    float m_flElasticity; // 0x0248
    float m_flShadowCastDistance; // 0x024C
    fVector3 m_vecOrigin; // 0x0338
    fVector3 m_angRotation; // 0x0344
    uint32_t m_CollisionGroup; // 0x0354
    uint32_t m_bIsPlayerSimulated; // 0x04C8
    uint32_t m_bSimulatedEveryTick; // 0x04C9
    uint32_t m_bAnimatedEveryTick; // 0x04CA
    uint32_t m_bAlternateSorting; // 0x04CB
    uint32_t m_iTextureFrameIndex; // 0x04CC
    uint32_t m_hOwnerEntity; // 0x04D8
    uint32_t m_hEffectEntity; // 0x04DC
    uint32_t m_bOnFire; // 0x0515
    float m_CreationTime; // 0x0518
    uint32_t m_RealClassName; // 0x051C
    uint32_t m_OverrideMaterial; // 0x0520
    uint32_t m_OverrideSubMaterials[0]; // 0x0528
    uint32_t m_spawnflags; // 0x0640
    uint32_t m_iGModFlags; // 0x0644
    uintptr_t m_GMOD_bool[32]; // 0x06A0
    uintptr_t m_GMOD_float[32]; // 0x06C0
    uintptr_t m_GMOD_int[32]; // 0x0740
    uintptr_t m_GMOD_Vector[32]; // 0x07C0
    uintptr_t m_GMOD_QAngle[32]; // 0x0940
    uintptr_t m_GMOD_EHANDLE[32]; // 0x0AC0
    const char* m_GMOD_String0; // 0x0B40
    const char* m_GMOD_String1; // 0x0D40
    const char* m_GMOD_String2; // 0x0F40
    const char* m_GMOD_String3; // 0x1140
    int64_t m_GMOD_DataTable; // 0x1340
    uint32_t m_iCreationID; // 0x1388
    uint32_t m_iMapCreatedID; // 0x138C
    uint32_t m_nSkin; // 0x1398
    uint32_t m_nBody; // 0x139C
    uint32_t m_nHitboxSet; // 0x13A0
    float m_flPlaybackRate; // 0x13C0
    fVector3 m_vecForce; // 0x13CC
    uint32_t m_nForceBone; // 0x13D8
    uint32_t m_bClientSideFrameReset; // 0x140C
    float m_fadeMinDist; // 0x1444
    float m_fadeMaxDist; // 0x1448
    float m_flFadeScale; // 0x144C
    float m_flModelWidthScale; // 0x149C
    float m_flModelScale; // 0x149C
    uintptr_t m_flPoseParameter[24]; // 0x14A0
    uintptr_t m_flEncodedController[4]; // 0x15BC
    uint32_t m_bClientSideAnimation; // 0x160C
    uint32_t m_nNewSequenceParity; // 0x1610
    uint32_t m_nResetEventsParity; // 0x1614
    uint32_t m_nSequence; // 0x163C
    float m_flCycle; // 0x1644
    uint32_t m_hLightingOrigin; // 0x16C4
    uint32_t m_hLightingOriginRelative; // 0x16C8
    uint32_t m_nMuzzleFlashParity; // 0x16CC
    fVector3 m_OverrideViewTarget; // 0x16EC
    uint32_t m_pBoneManipulator; // 0x1778
    uint32_t m_pFlexManipulator; // 0x1780
    uint32_t m_bEmit; // 0x17E4
    float m_flRadius; // 0x17E8
    uint32_t m_bHeld; // 0x17EC
    uint32_t m_bLaunched; // 0x17ED
    uint32_t m_bIsInfiniteLife; // 0x1800
    float m_fTimeTillDeath; // 0x1804
};

class CWeaponSMG1 // parent CBaseEntity {
public:
    void* m_OverrideSubMaterials; // 0x0000
    uint32_t movecollide; // 0x0000
    uint32_t movetype; // 0x0000
    uint32_t m_nRenderFX; // 0x0054
    uint32_t m_clrRender; // 0x0058
    uint32_t m_flAnimTime; // 0x0060
    uint32_t m_flSimulationTime; // 0x0068
    uint32_t m_ubInterpolationFrame; // 0x0074
    uint32_t m_fEffects; // 0x0078
    uint32_t m_nRenderMode; // 0x007C
    uint32_t m_nNextThinkTick; // 0x0084
    uint32_t m_nModelIndex; // 0x008C
    uint32_t m_takedamage; // 0x008E
    uint32_t m_iHealth; // 0x0090
    uint32_t m_iMaxHealth; // 0x0094
    uint32_t m_iTeamNum; // 0x009C
    uint32_t m_PredictableID; // 0x00A0
    float m_vecVelocity[0]; // 0x00F4
    float m_vecVelocity[1]; // 0x00F8
    float m_vecVelocity[2]; // 0x00FC
    uint32_t m_iParentAttachment; // 0x017A
    uint32_t moveparent; // 0x0190
    fVector3 m_vecMinsPreScaled; // 0x01A4
    fVector3 m_vecMaxsPreScaled; // 0x01B0
    fVector3 m_vecMins; // 0x01BC
    fVector3 m_vecMaxs; // 0x01C8
    uint32_t m_usSolidFlags; // 0x01D8
    uint32_t m_nSurroundType; // 0x01DC
    uint32_t m_nSolidType; // 0x01DD
    uint32_t m_triggerBloat; // 0x01DE
    fVector3 m_vecSpecifiedSurroundingMinsPreScaled; // 0x01E0
    fVector3 m_vecSpecifiedSurroundingMaxsPreScaled; // 0x01EC
    fVector3 m_vecSpecifiedSurroundingMins; // 0x01F8
    fVector3 m_vecSpecifiedSurroundingMaxs; // 0x0204
    float m_flElasticity; // 0x0248
    float m_flShadowCastDistance; // 0x024C
    fVector3 m_vecOrigin; // 0x0338
    fVector3 m_angRotation; // 0x0344
    uint32_t m_CollisionGroup; // 0x0354
    uint32_t m_bIsPlayerSimulated; // 0x04C8
    uint32_t m_bSimulatedEveryTick; // 0x04C9
    uint32_t m_bAnimatedEveryTick; // 0x04CA
    uint32_t m_bAlternateSorting; // 0x04CB
    uint32_t m_iTextureFrameIndex; // 0x04CC
    uint32_t m_hOwnerEntity; // 0x04D8
    uint32_t m_hEffectEntity; // 0x04DC
    uint32_t m_bOnFire; // 0x0515
    float m_CreationTime; // 0x0518
    uint32_t m_RealClassName; // 0x051C
    uint32_t m_OverrideMaterial; // 0x0520
    uint32_t m_OverrideSubMaterials[0]; // 0x0528
    uint32_t m_spawnflags; // 0x0640
    uint32_t m_iGModFlags; // 0x0644
    uintptr_t m_GMOD_bool[32]; // 0x06A0
    uintptr_t m_GMOD_float[32]; // 0x06C0
    uintptr_t m_GMOD_int[32]; // 0x0740
    uintptr_t m_GMOD_Vector[32]; // 0x07C0
    uintptr_t m_GMOD_QAngle[32]; // 0x0940
    uintptr_t m_GMOD_EHANDLE[32]; // 0x0AC0
    const char* m_GMOD_String0; // 0x0B40
    const char* m_GMOD_String1; // 0x0D40
    const char* m_GMOD_String2; // 0x0F40
    const char* m_GMOD_String3; // 0x1140
    int64_t m_GMOD_DataTable; // 0x1340
    uint32_t m_iCreationID; // 0x1388
    uint32_t m_iMapCreatedID; // 0x138C
    uint32_t m_nSkin; // 0x1398
    uint32_t m_nBody; // 0x139C
    uint32_t m_nHitboxSet; // 0x13A0
    float m_flPlaybackRate; // 0x13C0
    fVector3 m_vecForce; // 0x13CC
    uint32_t m_nForceBone; // 0x13D8
    uint32_t m_bClientSideFrameReset; // 0x140C
    float m_fadeMinDist; // 0x1444
    float m_fadeMaxDist; // 0x1448
    float m_flFadeScale; // 0x144C
    float m_flModelScale; // 0x149C
    float m_flModelWidthScale; // 0x149C
    uintptr_t m_flPoseParameter[24]; // 0x14A0
    uintptr_t m_flEncodedController[4]; // 0x15BC
    uint32_t m_bClientSideAnimation; // 0x160C
    uint32_t m_nNewSequenceParity; // 0x1610
    uint32_t m_nResetEventsParity; // 0x1614
    uint32_t m_nSequence; // 0x163C
    float m_flCycle; // 0x1644
    uint32_t m_hLightingOrigin; // 0x16C4
    uint32_t m_hLightingOriginRelative; // 0x16C8
    uint32_t m_nMuzzleFlashParity; // 0x16CC
    fVector3 m_OverrideViewTarget; // 0x16EC
    uint32_t m_pBoneManipulator; // 0x1778
    uint32_t m_pFlexManipulator; // 0x1780
    uint32_t m_hOwner; // 0x17D8
    uint32_t m_nViewModelIndex; // 0x17E0
    float m_flNextPrimaryAttack; // 0x17E4
    float m_flNextSecondaryAttack; // 0x17E8
    float m_flTimeWeaponIdle; // 0x17EC
    uint32_t m_iViewModelIndex; // 0x17F4
    uint32_t m_iWorldModelIndex; // 0x17F8
    uint32_t m_iState; // 0x1818
    uint32_t m_iPrimaryAmmoType; // 0x1820
    uint32_t m_iSecondaryAmmoType; // 0x1824
    uint32_t m_iClip1; // 0x1828
    uint32_t m_iClip2; // 0x182C
    uint32_t m_bFlipViewModel; // 0x1858
    uint32_t m_nShotsFired; // 0x18B8
};

class CBaseHL2MPCombatWeapon // parent CBaseEntity {
public:
    void* m_OverrideSubMaterials; // 0x0000
    uint32_t movecollide; // 0x0000
    uint32_t movetype; // 0x0000
    uint32_t m_nRenderFX; // 0x0054
    uint32_t m_clrRender; // 0x0058
    uint32_t m_flAnimTime; // 0x0060
    uint32_t m_flSimulationTime; // 0x0068
    uint32_t m_ubInterpolationFrame; // 0x0074
    uint32_t m_fEffects; // 0x0078
    uint32_t m_nRenderMode; // 0x007C
    uint32_t m_nNextThinkTick; // 0x0084
    uint32_t m_nModelIndex; // 0x008C
    uint32_t m_takedamage; // 0x008E
    uint32_t m_iHealth; // 0x0090
    uint32_t m_iMaxHealth; // 0x0094
    uint32_t m_iTeamNum; // 0x009C
    uint32_t m_PredictableID; // 0x00A0
    float m_vecVelocity[0]; // 0x00F4
    float m_vecVelocity[1]; // 0x00F8
    float m_vecVelocity[2]; // 0x00FC
    uint32_t m_iParentAttachment; // 0x017A
    uint32_t moveparent; // 0x0190
    fVector3 m_vecMinsPreScaled; // 0x01A4
    fVector3 m_vecMaxsPreScaled; // 0x01B0
    fVector3 m_vecMins; // 0x01BC
    fVector3 m_vecMaxs; // 0x01C8
    uint32_t m_usSolidFlags; // 0x01D8
    uint32_t m_nSurroundType; // 0x01DC
    uint32_t m_nSolidType; // 0x01DD
    uint32_t m_triggerBloat; // 0x01DE
    fVector3 m_vecSpecifiedSurroundingMinsPreScaled; // 0x01E0
    fVector3 m_vecSpecifiedSurroundingMaxsPreScaled; // 0x01EC
    fVector3 m_vecSpecifiedSurroundingMins; // 0x01F8
    fVector3 m_vecSpecifiedSurroundingMaxs; // 0x0204
    float m_flElasticity; // 0x0248
    float m_flShadowCastDistance; // 0x024C
    fVector3 m_vecOrigin; // 0x0338
    fVector3 m_angRotation; // 0x0344
    uint32_t m_CollisionGroup; // 0x0354
    uint32_t m_bIsPlayerSimulated; // 0x04C8
    uint32_t m_bSimulatedEveryTick; // 0x04C9
    uint32_t m_bAnimatedEveryTick; // 0x04CA
    uint32_t m_bAlternateSorting; // 0x04CB
    uint32_t m_iTextureFrameIndex; // 0x04CC
    uint32_t m_hOwnerEntity; // 0x04D8
    uint32_t m_hEffectEntity; // 0x04DC
    uint32_t m_bOnFire; // 0x0515
    float m_CreationTime; // 0x0518
    uint32_t m_RealClassName; // 0x051C
    uint32_t m_OverrideMaterial; // 0x0520
    uint32_t m_OverrideSubMaterials[0]; // 0x0528
    uint32_t m_spawnflags; // 0x0640
    uint32_t m_iGModFlags; // 0x0644
    uintptr_t m_GMOD_bool[32]; // 0x06A0
    uintptr_t m_GMOD_float[32]; // 0x06C0
    uintptr_t m_GMOD_int[32]; // 0x0740
    uintptr_t m_GMOD_Vector[32]; // 0x07C0
    uintptr_t m_GMOD_QAngle[32]; // 0x0940
    uintptr_t m_GMOD_EHANDLE[32]; // 0x0AC0
    const char* m_GMOD_String0; // 0x0B40
    const char* m_GMOD_String1; // 0x0D40
    const char* m_GMOD_String2; // 0x0F40
    const char* m_GMOD_String3; // 0x1140
    int64_t m_GMOD_DataTable; // 0x1340
    uint32_t m_iCreationID; // 0x1388
    uint32_t m_iMapCreatedID; // 0x138C
    uint32_t m_nSkin; // 0x1398
    uint32_t m_nBody; // 0x139C
    uint32_t m_nHitboxSet; // 0x13A0
    float m_flPlaybackRate; // 0x13C0
    fVector3 m_vecForce; // 0x13CC
    uint32_t m_nForceBone; // 0x13D8
    uint32_t m_bClientSideFrameReset; // 0x140C
    float m_fadeMinDist; // 0x1444
    float m_fadeMaxDist; // 0x1448
    float m_flFadeScale; // 0x144C
    float m_flModelScale; // 0x149C
    float m_flModelWidthScale; // 0x149C
    uintptr_t m_flPoseParameter[24]; // 0x14A0
    uintptr_t m_flEncodedController[4]; // 0x15BC
    uint32_t m_bClientSideAnimation; // 0x160C
    uint32_t m_nNewSequenceParity; // 0x1610
    uint32_t m_nResetEventsParity; // 0x1614
    uint32_t m_nSequence; // 0x163C
    float m_flCycle; // 0x1644
    uint32_t m_hLightingOrigin; // 0x16C4
    uint32_t m_hLightingOriginRelative; // 0x16C8
    uint32_t m_nMuzzleFlashParity; // 0x16CC
    fVector3 m_OverrideViewTarget; // 0x16EC
    uint32_t m_pBoneManipulator; // 0x1778
    uint32_t m_pFlexManipulator; // 0x1780
    uint32_t m_hOwner; // 0x17D8
    uint32_t m_nViewModelIndex; // 0x17E0
    float m_flNextPrimaryAttack; // 0x17E4
    float m_flNextSecondaryAttack; // 0x17E8
    float m_flTimeWeaponIdle; // 0x17EC
    uint32_t m_iViewModelIndex; // 0x17F4
    uint32_t m_iWorldModelIndex; // 0x17F8
    uint32_t m_iState; // 0x1818
    uint32_t m_iPrimaryAmmoType; // 0x1820
    uint32_t m_iSecondaryAmmoType; // 0x1824
    uint32_t m_iClip1; // 0x1828
    uint32_t m_iClip2; // 0x182C
    uint32_t m_bFlipViewModel; // 0x1858
};

class CWeapon_SLAM // parent CBaseEntity {
public:
    uint32_t movecollide; // 0x0000
    void* m_OverrideSubMaterials; // 0x0000
    uint32_t movetype; // 0x0000
    uint32_t m_nRenderFX; // 0x0054
    uint32_t m_clrRender; // 0x0058
    uint32_t m_flAnimTime; // 0x0060
    uint32_t m_flSimulationTime; // 0x0068
    uint32_t m_ubInterpolationFrame; // 0x0074
    uint32_t m_fEffects; // 0x0078
    uint32_t m_nRenderMode; // 0x007C
    uint32_t m_nNextThinkTick; // 0x0084
    uint32_t m_nModelIndex; // 0x008C
    uint32_t m_takedamage; // 0x008E
    uint32_t m_iHealth; // 0x0090
    uint32_t m_iMaxHealth; // 0x0094
    uint32_t m_iTeamNum; // 0x009C
    uint32_t m_PredictableID; // 0x00A0
    float m_vecVelocity[0]; // 0x00F4
    float m_vecVelocity[1]; // 0x00F8
    float m_vecVelocity[2]; // 0x00FC
    uint32_t m_iParentAttachment; // 0x017A
    uint32_t moveparent; // 0x0190
    fVector3 m_vecMinsPreScaled; // 0x01A4
    fVector3 m_vecMaxsPreScaled; // 0x01B0
    fVector3 m_vecMins; // 0x01BC
    fVector3 m_vecMaxs; // 0x01C8
    uint32_t m_usSolidFlags; // 0x01D8
    uint32_t m_nSurroundType; // 0x01DC
    uint32_t m_nSolidType; // 0x01DD
    uint32_t m_triggerBloat; // 0x01DE
    fVector3 m_vecSpecifiedSurroundingMinsPreScaled; // 0x01E0
    fVector3 m_vecSpecifiedSurroundingMaxsPreScaled; // 0x01EC
    fVector3 m_vecSpecifiedSurroundingMins; // 0x01F8
    fVector3 m_vecSpecifiedSurroundingMaxs; // 0x0204
    float m_flElasticity; // 0x0248
    float m_flShadowCastDistance; // 0x024C
    fVector3 m_vecOrigin; // 0x0338
    fVector3 m_angRotation; // 0x0344
    uint32_t m_CollisionGroup; // 0x0354
    uint32_t m_bIsPlayerSimulated; // 0x04C8
    uint32_t m_bSimulatedEveryTick; // 0x04C9
    uint32_t m_bAnimatedEveryTick; // 0x04CA
    uint32_t m_bAlternateSorting; // 0x04CB
    uint32_t m_iTextureFrameIndex; // 0x04CC
    uint32_t m_hOwnerEntity; // 0x04D8
    uint32_t m_hEffectEntity; // 0x04DC
    uint32_t m_bOnFire; // 0x0515
    float m_CreationTime; // 0x0518
    uint32_t m_RealClassName; // 0x051C
    uint32_t m_OverrideMaterial; // 0x0520
    uint32_t m_OverrideSubMaterials[0]; // 0x0528
    uint32_t m_spawnflags; // 0x0640
    uint32_t m_iGModFlags; // 0x0644
    uintptr_t m_GMOD_bool[32]; // 0x06A0
    uintptr_t m_GMOD_float[32]; // 0x06C0
    uintptr_t m_GMOD_int[32]; // 0x0740
    uintptr_t m_GMOD_Vector[32]; // 0x07C0
    uintptr_t m_GMOD_QAngle[32]; // 0x0940
    uintptr_t m_GMOD_EHANDLE[32]; // 0x0AC0
    const char* m_GMOD_String0; // 0x0B40
    const char* m_GMOD_String1; // 0x0D40
    const char* m_GMOD_String2; // 0x0F40
    const char* m_GMOD_String3; // 0x1140
    int64_t m_GMOD_DataTable; // 0x1340
    uint32_t m_iCreationID; // 0x1388
    uint32_t m_iMapCreatedID; // 0x138C
    uint32_t m_nSkin; // 0x1398
    uint32_t m_nBody; // 0x139C
    uint32_t m_nHitboxSet; // 0x13A0
    float m_flPlaybackRate; // 0x13C0
    fVector3 m_vecForce; // 0x13CC
    uint32_t m_nForceBone; // 0x13D8
    uint32_t m_bClientSideFrameReset; // 0x140C
    float m_fadeMinDist; // 0x1444
    float m_fadeMaxDist; // 0x1448
    float m_flFadeScale; // 0x144C
    float m_flModelScale; // 0x149C
    float m_flModelWidthScale; // 0x149C
    uintptr_t m_flPoseParameter[24]; // 0x14A0
    uintptr_t m_flEncodedController[4]; // 0x15BC
    uint32_t m_bClientSideAnimation; // 0x160C
    uint32_t m_nNewSequenceParity; // 0x1610
    uint32_t m_nResetEventsParity; // 0x1614
    uint32_t m_nSequence; // 0x163C
    float m_flCycle; // 0x1644
    uint32_t m_hLightingOrigin; // 0x16C4
    uint32_t m_hLightingOriginRelative; // 0x16C8
    uint32_t m_nMuzzleFlashParity; // 0x16CC
    fVector3 m_OverrideViewTarget; // 0x16EC
    uint32_t m_pBoneManipulator; // 0x1778
    uint32_t m_pFlexManipulator; // 0x1780
    uint32_t m_hOwner; // 0x17D8
    uint32_t m_nViewModelIndex; // 0x17E0
    float m_flNextPrimaryAttack; // 0x17E4
    float m_flNextSecondaryAttack; // 0x17E8
    float m_flTimeWeaponIdle; // 0x17EC
    uint32_t m_iViewModelIndex; // 0x17F4
    uint32_t m_iWorldModelIndex; // 0x17F8
    uint32_t m_iState; // 0x1818
    uint32_t m_iPrimaryAmmoType; // 0x1820
    uint32_t m_iSecondaryAmmoType; // 0x1824
    uint32_t m_iClip1; // 0x1828
    uint32_t m_iClip2; // 0x182C
    uint32_t m_bFlipViewModel; // 0x1858
    uint32_t m_tSlamState; // 0x18B8
    uint32_t m_bDetonatorArmed; // 0x18BC
    uint32_t m_bNeedDetonatorDraw; // 0x18BD
    uint32_t m_bNeedDetonatorHolster; // 0x18BE
    uint32_t m_bNeedReload; // 0x18BF
    uint32_t m_bClearReload; // 0x18C0
    uint32_t m_bThrowSatchel; // 0x18C1
    uint32_t m_bAttachSatchel; // 0x18C2
    uint32_t m_bAttachTripmine; // 0x18C3
};

class CWeaponShotgun // parent CBaseEntity {
public:
    uint32_t movecollide; // 0x0000
    void* m_OverrideSubMaterials; // 0x0000
    uint32_t movetype; // 0x0000
    uint32_t m_nRenderFX; // 0x0054
    uint32_t m_clrRender; // 0x0058
    uint32_t m_flAnimTime; // 0x0060
    uint32_t m_flSimulationTime; // 0x0068
    uint32_t m_ubInterpolationFrame; // 0x0074
    uint32_t m_fEffects; // 0x0078
    uint32_t m_nRenderMode; // 0x007C
    uint32_t m_nNextThinkTick; // 0x0084
    uint32_t m_nModelIndex; // 0x008C
    uint32_t m_takedamage; // 0x008E
    uint32_t m_iHealth; // 0x0090
    uint32_t m_iMaxHealth; // 0x0094
    uint32_t m_iTeamNum; // 0x009C
    uint32_t m_PredictableID; // 0x00A0
    float m_vecVelocity[0]; // 0x00F4
    float m_vecVelocity[1]; // 0x00F8
    float m_vecVelocity[2]; // 0x00FC
    uint32_t m_iParentAttachment; // 0x017A
    uint32_t moveparent; // 0x0190
    fVector3 m_vecMinsPreScaled; // 0x01A4
    fVector3 m_vecMaxsPreScaled; // 0x01B0
    fVector3 m_vecMins; // 0x01BC
    fVector3 m_vecMaxs; // 0x01C8
    uint32_t m_usSolidFlags; // 0x01D8
    uint32_t m_nSurroundType; // 0x01DC
    uint32_t m_nSolidType; // 0x01DD
    uint32_t m_triggerBloat; // 0x01DE
    fVector3 m_vecSpecifiedSurroundingMinsPreScaled; // 0x01E0
    fVector3 m_vecSpecifiedSurroundingMaxsPreScaled; // 0x01EC
    fVector3 m_vecSpecifiedSurroundingMins; // 0x01F8
    fVector3 m_vecSpecifiedSurroundingMaxs; // 0x0204
    float m_flElasticity; // 0x0248
    float m_flShadowCastDistance; // 0x024C
    fVector3 m_vecOrigin; // 0x0338
    fVector3 m_angRotation; // 0x0344
    uint32_t m_CollisionGroup; // 0x0354
    uint32_t m_bIsPlayerSimulated; // 0x04C8
    uint32_t m_bSimulatedEveryTick; // 0x04C9
    uint32_t m_bAnimatedEveryTick; // 0x04CA
    uint32_t m_bAlternateSorting; // 0x04CB
    uint32_t m_iTextureFrameIndex; // 0x04CC
    uint32_t m_hOwnerEntity; // 0x04D8
    uint32_t m_hEffectEntity; // 0x04DC
    uint32_t m_bOnFire; // 0x0515
    float m_CreationTime; // 0x0518
    uint32_t m_RealClassName; // 0x051C
    uint32_t m_OverrideMaterial; // 0x0520
    uint32_t m_OverrideSubMaterials[0]; // 0x0528
    uint32_t m_spawnflags; // 0x0640
    uint32_t m_iGModFlags; // 0x0644
    uintptr_t m_GMOD_bool[32]; // 0x06A0
    uintptr_t m_GMOD_float[32]; // 0x06C0
    uintptr_t m_GMOD_int[32]; // 0x0740
    uintptr_t m_GMOD_Vector[32]; // 0x07C0
    uintptr_t m_GMOD_QAngle[32]; // 0x0940
    uintptr_t m_GMOD_EHANDLE[32]; // 0x0AC0
    const char* m_GMOD_String0; // 0x0B40
    const char* m_GMOD_String1; // 0x0D40
    const char* m_GMOD_String2; // 0x0F40
    const char* m_GMOD_String3; // 0x1140
    int64_t m_GMOD_DataTable; // 0x1340
    uint32_t m_iCreationID; // 0x1388
    uint32_t m_iMapCreatedID; // 0x138C
    uint32_t m_nSkin; // 0x1398
    uint32_t m_nBody; // 0x139C
    uint32_t m_nHitboxSet; // 0x13A0
    float m_flPlaybackRate; // 0x13C0
    fVector3 m_vecForce; // 0x13CC
    uint32_t m_nForceBone; // 0x13D8
    uint32_t m_bClientSideFrameReset; // 0x140C
    float m_fadeMinDist; // 0x1444
    float m_fadeMaxDist; // 0x1448
    float m_flFadeScale; // 0x144C
    float m_flModelScale; // 0x149C
    float m_flModelWidthScale; // 0x149C
    uintptr_t m_flPoseParameter[24]; // 0x14A0
    uintptr_t m_flEncodedController[4]; // 0x15BC
    uint32_t m_bClientSideAnimation; // 0x160C
    uint32_t m_nNewSequenceParity; // 0x1610
    uint32_t m_nResetEventsParity; // 0x1614
    uint32_t m_nSequence; // 0x163C
    float m_flCycle; // 0x1644
    uint32_t m_hLightingOrigin; // 0x16C4
    uint32_t m_hLightingOriginRelative; // 0x16C8
    uint32_t m_nMuzzleFlashParity; // 0x16CC
    fVector3 m_OverrideViewTarget; // 0x16EC
    uint32_t m_pBoneManipulator; // 0x1778
    uint32_t m_pFlexManipulator; // 0x1780
    uint32_t m_hOwner; // 0x17D8
    uint32_t m_nViewModelIndex; // 0x17E0
    float m_flNextPrimaryAttack; // 0x17E4
    float m_flNextSecondaryAttack; // 0x17E8
    float m_flTimeWeaponIdle; // 0x17EC
    uint32_t m_iViewModelIndex; // 0x17F4
    uint32_t m_iWorldModelIndex; // 0x17F8
    uint32_t m_iState; // 0x1818
    uint32_t m_iPrimaryAmmoType; // 0x1820
    uint32_t m_iSecondaryAmmoType; // 0x1824
    uint32_t m_iClip1; // 0x1828
    uint32_t m_iClip2; // 0x182C
    uint32_t m_bFlipViewModel; // 0x1858
    uint32_t m_bNeedPump; // 0x18B8
    uint32_t m_bDelayedFire1; // 0x18B9
    uint32_t m_bDelayedFire2; // 0x18BA
    uint32_t m_bDelayedReload; // 0x18BB
};

class CWeaponRPG // parent CBaseEntity {
public:
    uint32_t movetype; // 0x0000
    void* m_OverrideSubMaterials; // 0x0000
    uint32_t movecollide; // 0x0000
    uint32_t m_nRenderFX; // 0x0054
    uint32_t m_clrRender; // 0x0058
    uint32_t m_flAnimTime; // 0x0060
    uint32_t m_flSimulationTime; // 0x0068
    uint32_t m_ubInterpolationFrame; // 0x0074
    uint32_t m_fEffects; // 0x0078
    uint32_t m_nRenderMode; // 0x007C
    uint32_t m_nNextThinkTick; // 0x0084
    uint32_t m_nModelIndex; // 0x008C
    uint32_t m_takedamage; // 0x008E
    uint32_t m_iHealth; // 0x0090
    uint32_t m_iMaxHealth; // 0x0094
    uint32_t m_iTeamNum; // 0x009C
    uint32_t m_PredictableID; // 0x00A0
    float m_vecVelocity[0]; // 0x00F4
    float m_vecVelocity[1]; // 0x00F8
    float m_vecVelocity[2]; // 0x00FC
    uint32_t m_iParentAttachment; // 0x017A
    uint32_t moveparent; // 0x0190
    fVector3 m_vecMinsPreScaled; // 0x01A4
    fVector3 m_vecMaxsPreScaled; // 0x01B0
    fVector3 m_vecMins; // 0x01BC
    fVector3 m_vecMaxs; // 0x01C8
    uint32_t m_usSolidFlags; // 0x01D8
    uint32_t m_nSurroundType; // 0x01DC
    uint32_t m_nSolidType; // 0x01DD
    uint32_t m_triggerBloat; // 0x01DE
    fVector3 m_vecSpecifiedSurroundingMinsPreScaled; // 0x01E0
    fVector3 m_vecSpecifiedSurroundingMaxsPreScaled; // 0x01EC
    fVector3 m_vecSpecifiedSurroundingMins; // 0x01F8
    fVector3 m_vecSpecifiedSurroundingMaxs; // 0x0204
    float m_flElasticity; // 0x0248
    float m_flShadowCastDistance; // 0x024C
    fVector3 m_vecOrigin; // 0x0338
    fVector3 m_angRotation; // 0x0344
    uint32_t m_CollisionGroup; // 0x0354
    uint32_t m_bIsPlayerSimulated; // 0x04C8
    uint32_t m_bSimulatedEveryTick; // 0x04C9
    uint32_t m_bAnimatedEveryTick; // 0x04CA
    uint32_t m_bAlternateSorting; // 0x04CB
    uint32_t m_iTextureFrameIndex; // 0x04CC
    uint32_t m_hOwnerEntity; // 0x04D8
    uint32_t m_hEffectEntity; // 0x04DC
    uint32_t m_bOnFire; // 0x0515
    float m_CreationTime; // 0x0518
    uint32_t m_RealClassName; // 0x051C
    uint32_t m_OverrideMaterial; // 0x0520
    uint32_t m_OverrideSubMaterials[0]; // 0x0528
    uint32_t m_spawnflags; // 0x0640
    uint32_t m_iGModFlags; // 0x0644
    uintptr_t m_GMOD_bool[32]; // 0x06A0
    uintptr_t m_GMOD_float[32]; // 0x06C0
    uintptr_t m_GMOD_int[32]; // 0x0740
    uintptr_t m_GMOD_Vector[32]; // 0x07C0
    uintptr_t m_GMOD_QAngle[32]; // 0x0940
    uintptr_t m_GMOD_EHANDLE[32]; // 0x0AC0
    const char* m_GMOD_String0; // 0x0B40
    const char* m_GMOD_String1; // 0x0D40
    const char* m_GMOD_String2; // 0x0F40
    const char* m_GMOD_String3; // 0x1140
    int64_t m_GMOD_DataTable; // 0x1340
    uint32_t m_iCreationID; // 0x1388
    uint32_t m_iMapCreatedID; // 0x138C
    uint32_t m_nSkin; // 0x1398
    uint32_t m_nBody; // 0x139C
    uint32_t m_nHitboxSet; // 0x13A0
    float m_flPlaybackRate; // 0x13C0
    fVector3 m_vecForce; // 0x13CC
    uint32_t m_nForceBone; // 0x13D8
    uint32_t m_bClientSideFrameReset; // 0x140C
    float m_fadeMinDist; // 0x1444
    float m_fadeMaxDist; // 0x1448
    float m_flFadeScale; // 0x144C
    float m_flModelWidthScale; // 0x149C
    float m_flModelScale; // 0x149C
    uintptr_t m_flPoseParameter[24]; // 0x14A0
    uintptr_t m_flEncodedController[4]; // 0x15BC
    uint32_t m_bClientSideAnimation; // 0x160C
    uint32_t m_nNewSequenceParity; // 0x1610
    uint32_t m_nResetEventsParity; // 0x1614
    uint32_t m_nSequence; // 0x163C
    float m_flCycle; // 0x1644
    uint32_t m_hLightingOrigin; // 0x16C4
    uint32_t m_hLightingOriginRelative; // 0x16C8
    uint32_t m_nMuzzleFlashParity; // 0x16CC
    fVector3 m_OverrideViewTarget; // 0x16EC
    uint32_t m_pBoneManipulator; // 0x1778
    uint32_t m_pFlexManipulator; // 0x1780
    uint32_t m_hOwner; // 0x17D8
    uint32_t m_nViewModelIndex; // 0x17E0
    float m_flNextPrimaryAttack; // 0x17E4
    float m_flNextSecondaryAttack; // 0x17E8
    float m_flTimeWeaponIdle; // 0x17EC
    uint32_t m_iViewModelIndex; // 0x17F4
    uint32_t m_iWorldModelIndex; // 0x17F8
    uint32_t m_iState; // 0x1818
    uint32_t m_iPrimaryAmmoType; // 0x1820
    uint32_t m_iSecondaryAmmoType; // 0x1824
    uint32_t m_iClip1; // 0x1828
    uint32_t m_iClip2; // 0x182C
    uint32_t m_bFlipViewModel; // 0x1858
    uint32_t m_bInitialStateUpdate; // 0x18C4
    uint32_t m_bGuiding; // 0x18C5
    uint32_t m_bHideGuiding; // 0x18C6
    uint32_t m_hMissile; // 0x18C8
    fVector3 m_vecLaserDot; // 0x18CC
};

class CLaserDot // parent CBaseEntity {
public:
    void* m_OverrideSubMaterials; // 0x0000
    uint32_t movecollide; // 0x0000
    uint32_t movetype; // 0x0000
    uint32_t m_nRenderFX; // 0x0054
    uint32_t m_clrRender; // 0x0058
    uint32_t m_flAnimTime; // 0x0060
    uint32_t m_flSimulationTime; // 0x0068
    uint32_t m_ubInterpolationFrame; // 0x0074
    uint32_t m_fEffects; // 0x0078
    uint32_t m_nRenderMode; // 0x007C
    uint32_t m_nModelIndex; // 0x008C
    uint32_t m_takedamage; // 0x008E
    uint32_t m_iHealth; // 0x0090
    uint32_t m_iMaxHealth; // 0x0094
    uint32_t m_iTeamNum; // 0x009C
    uint32_t m_PredictableID; // 0x00A0
    float m_vecVelocity[0]; // 0x00F4
    float m_vecVelocity[1]; // 0x00F8
    float m_vecVelocity[2]; // 0x00FC
    uint32_t m_iParentAttachment; // 0x017A
    uint32_t moveparent; // 0x0190
    fVector3 m_vecMinsPreScaled; // 0x01A4
    fVector3 m_vecMaxsPreScaled; // 0x01B0
    fVector3 m_vecMins; // 0x01BC
    fVector3 m_vecMaxs; // 0x01C8
    uint32_t m_usSolidFlags; // 0x01D8
    uint32_t m_nSurroundType; // 0x01DC
    uint32_t m_nSolidType; // 0x01DD
    uint32_t m_triggerBloat; // 0x01DE
    fVector3 m_vecSpecifiedSurroundingMinsPreScaled; // 0x01E0
    fVector3 m_vecSpecifiedSurroundingMaxsPreScaled; // 0x01EC
    fVector3 m_vecSpecifiedSurroundingMins; // 0x01F8
    fVector3 m_vecSpecifiedSurroundingMaxs; // 0x0204
    float m_flElasticity; // 0x0248
    float m_flShadowCastDistance; // 0x024C
    fVector3 m_vecOrigin; // 0x0338
    fVector3 m_angRotation; // 0x0344
    uint32_t m_CollisionGroup; // 0x0354
    uint32_t m_bIsPlayerSimulated; // 0x04C8
    uint32_t m_bSimulatedEveryTick; // 0x04C9
    uint32_t m_bAnimatedEveryTick; // 0x04CA
    uint32_t m_bAlternateSorting; // 0x04CB
    uint32_t m_iTextureFrameIndex; // 0x04CC
    uint32_t m_hOwnerEntity; // 0x04D8
    uint32_t m_hEffectEntity; // 0x04DC
    uint32_t m_bOnFire; // 0x0515
    float m_CreationTime; // 0x0518
    uint32_t m_RealClassName; // 0x051C
    uint32_t m_OverrideMaterial; // 0x0520
    uint32_t m_OverrideSubMaterials[0]; // 0x0528
    uint32_t m_spawnflags; // 0x0640
    uint32_t m_iGModFlags; // 0x0644
    uintptr_t m_GMOD_bool[32]; // 0x06A0
    uintptr_t m_GMOD_float[32]; // 0x06C0
    uintptr_t m_GMOD_int[32]; // 0x0740
    uintptr_t m_GMOD_Vector[32]; // 0x07C0
    uintptr_t m_GMOD_QAngle[32]; // 0x0940
    uintptr_t m_GMOD_EHANDLE[32]; // 0x0AC0
    const char* m_GMOD_String0; // 0x0B40
    const char* m_GMOD_String1; // 0x0D40
    const char* m_GMOD_String2; // 0x0F40
    const char* m_GMOD_String3; // 0x1140
    int64_t m_GMOD_DataTable; // 0x1340
    uint32_t m_iCreationID; // 0x1388
    uint32_t m_iMapCreatedID; // 0x138C
};

class CWeaponPistol // parent CBaseEntity {
public:
    uint32_t movecollide; // 0x0000
    void* m_OverrideSubMaterials; // 0x0000
    uint32_t movetype; // 0x0000
    uint32_t m_nRenderFX; // 0x0054
    uint32_t m_clrRender; // 0x0058
    uint32_t m_flAnimTime; // 0x0060
    uint32_t m_flSimulationTime; // 0x0068
    uint32_t m_ubInterpolationFrame; // 0x0074
    uint32_t m_fEffects; // 0x0078
    uint32_t m_nRenderMode; // 0x007C
    uint32_t m_nNextThinkTick; // 0x0084
    uint32_t m_nModelIndex; // 0x008C
    uint32_t m_takedamage; // 0x008E
    uint32_t m_iHealth; // 0x0090
    uint32_t m_iMaxHealth; // 0x0094
    uint32_t m_iTeamNum; // 0x009C
    uint32_t m_PredictableID; // 0x00A0
    float m_vecVelocity[0]; // 0x00F4
    float m_vecVelocity[1]; // 0x00F8
    float m_vecVelocity[2]; // 0x00FC
    uint32_t m_iParentAttachment; // 0x017A
    uint32_t moveparent; // 0x0190
    fVector3 m_vecMinsPreScaled; // 0x01A4
    fVector3 m_vecMaxsPreScaled; // 0x01B0
    fVector3 m_vecMins; // 0x01BC
    fVector3 m_vecMaxs; // 0x01C8
    uint32_t m_usSolidFlags; // 0x01D8
    uint32_t m_nSurroundType; // 0x01DC
    uint32_t m_nSolidType; // 0x01DD
    uint32_t m_triggerBloat; // 0x01DE
    fVector3 m_vecSpecifiedSurroundingMinsPreScaled; // 0x01E0
    fVector3 m_vecSpecifiedSurroundingMaxsPreScaled; // 0x01EC
    fVector3 m_vecSpecifiedSurroundingMins; // 0x01F8
    fVector3 m_vecSpecifiedSurroundingMaxs; // 0x0204
    float m_flElasticity; // 0x0248
    float m_flShadowCastDistance; // 0x024C
    fVector3 m_vecOrigin; // 0x0338
    fVector3 m_angRotation; // 0x0344
    uint32_t m_CollisionGroup; // 0x0354
    uint32_t m_bIsPlayerSimulated; // 0x04C8
    uint32_t m_bSimulatedEveryTick; // 0x04C9
    uint32_t m_bAnimatedEveryTick; // 0x04CA
    uint32_t m_bAlternateSorting; // 0x04CB
    uint32_t m_iTextureFrameIndex; // 0x04CC
    uint32_t m_hOwnerEntity; // 0x04D8
    uint32_t m_hEffectEntity; // 0x04DC
    uint32_t m_bOnFire; // 0x0515
    float m_CreationTime; // 0x0518
    uint32_t m_RealClassName; // 0x051C
    uint32_t m_OverrideMaterial; // 0x0520
    uint32_t m_OverrideSubMaterials[0]; // 0x0528
    uint32_t m_spawnflags; // 0x0640
    uint32_t m_iGModFlags; // 0x0644
    uintptr_t m_GMOD_bool[32]; // 0x06A0
    uintptr_t m_GMOD_float[32]; // 0x06C0
    uintptr_t m_GMOD_int[32]; // 0x0740
    uintptr_t m_GMOD_Vector[32]; // 0x07C0
    uintptr_t m_GMOD_QAngle[32]; // 0x0940
    uintptr_t m_GMOD_EHANDLE[32]; // 0x0AC0
    const char* m_GMOD_String0; // 0x0B40
    const char* m_GMOD_String1; // 0x0D40
    const char* m_GMOD_String2; // 0x0F40
    const char* m_GMOD_String3; // 0x1140
    int64_t m_GMOD_DataTable; // 0x1340
    uint32_t m_iCreationID; // 0x1388
    uint32_t m_iMapCreatedID; // 0x138C
    uint32_t m_nSkin; // 0x1398
    uint32_t m_nBody; // 0x139C
    uint32_t m_nHitboxSet; // 0x13A0
    float m_flPlaybackRate; // 0x13C0
    fVector3 m_vecForce; // 0x13CC
    uint32_t m_nForceBone; // 0x13D8
    uint32_t m_bClientSideFrameReset; // 0x140C
    float m_fadeMinDist; // 0x1444
    float m_fadeMaxDist; // 0x1448
    float m_flFadeScale; // 0x144C
    float m_flModelScale; // 0x149C
    float m_flModelWidthScale; // 0x149C
    uintptr_t m_flPoseParameter[24]; // 0x14A0
    uintptr_t m_flEncodedController[4]; // 0x15BC
    uint32_t m_bClientSideAnimation; // 0x160C
    uint32_t m_nNewSequenceParity; // 0x1610
    uint32_t m_nResetEventsParity; // 0x1614
    uint32_t m_nSequence; // 0x163C
    float m_flCycle; // 0x1644
    uint32_t m_hLightingOrigin; // 0x16C4
    uint32_t m_hLightingOriginRelative; // 0x16C8
    uint32_t m_nMuzzleFlashParity; // 0x16CC
    fVector3 m_OverrideViewTarget; // 0x16EC
    uint32_t m_pBoneManipulator; // 0x1778
    uint32_t m_pFlexManipulator; // 0x1780
    uint32_t m_hOwner; // 0x17D8
    uint32_t m_nViewModelIndex; // 0x17E0
    float m_flNextPrimaryAttack; // 0x17E4
    float m_flNextSecondaryAttack; // 0x17E8
    float m_flTimeWeaponIdle; // 0x17EC
    uint32_t m_iViewModelIndex; // 0x17F4
    uint32_t m_iWorldModelIndex; // 0x17F8
    uint32_t m_iState; // 0x1818
    uint32_t m_iPrimaryAmmoType; // 0x1820
    uint32_t m_iSecondaryAmmoType; // 0x1824
    uint32_t m_iClip1; // 0x1828
    uint32_t m_iClip2; // 0x182C
    uint32_t m_bFlipViewModel; // 0x1858
    uint32_t m_nShotsFired; // 0x18B8
    float m_flSoonestPrimaryAttack; // 0x18C0
    float m_flLastAttackTime; // 0x18C4
    float m_flAccuracyPenalty; // 0x18C8
    uint32_t m_nNumShotsFired; // 0x18CC
};

class CBaseHL2MPBludgeonWeapon // parent CBaseEntity {
public:
    void* m_OverrideSubMaterials; // 0x0000
    uint32_t movecollide; // 0x0000
    uint32_t movetype; // 0x0000
    uint32_t m_nRenderFX; // 0x0054
    uint32_t m_clrRender; // 0x0058
    uint32_t m_flAnimTime; // 0x0060
    uint32_t m_flSimulationTime; // 0x0068
    uint32_t m_ubInterpolationFrame; // 0x0074
    uint32_t m_fEffects; // 0x0078
    uint32_t m_nRenderMode; // 0x007C
    uint32_t m_nNextThinkTick; // 0x0084
    uint32_t m_nModelIndex; // 0x008C
    uint32_t m_takedamage; // 0x008E
    uint32_t m_iHealth; // 0x0090
    uint32_t m_iMaxHealth; // 0x0094
    uint32_t m_iTeamNum; // 0x009C
    uint32_t m_PredictableID; // 0x00A0
    float m_vecVelocity[0]; // 0x00F4
    float m_vecVelocity[1]; // 0x00F8
    float m_vecVelocity[2]; // 0x00FC
    uint32_t m_iParentAttachment; // 0x017A
    uint32_t moveparent; // 0x0190
    fVector3 m_vecMinsPreScaled; // 0x01A4
    fVector3 m_vecMaxsPreScaled; // 0x01B0
    fVector3 m_vecMins; // 0x01BC
    fVector3 m_vecMaxs; // 0x01C8
    uint32_t m_usSolidFlags; // 0x01D8
    uint32_t m_nSurroundType; // 0x01DC
    uint32_t m_nSolidType; // 0x01DD
    uint32_t m_triggerBloat; // 0x01DE
    fVector3 m_vecSpecifiedSurroundingMinsPreScaled; // 0x01E0
    fVector3 m_vecSpecifiedSurroundingMaxsPreScaled; // 0x01EC
    fVector3 m_vecSpecifiedSurroundingMins; // 0x01F8
    fVector3 m_vecSpecifiedSurroundingMaxs; // 0x0204
    float m_flElasticity; // 0x0248
    float m_flShadowCastDistance; // 0x024C
    fVector3 m_vecOrigin; // 0x0338
    fVector3 m_angRotation; // 0x0344
    uint32_t m_CollisionGroup; // 0x0354
    uint32_t m_bIsPlayerSimulated; // 0x04C8
    uint32_t m_bSimulatedEveryTick; // 0x04C9
    uint32_t m_bAnimatedEveryTick; // 0x04CA
    uint32_t m_bAlternateSorting; // 0x04CB
    uint32_t m_iTextureFrameIndex; // 0x04CC
    uint32_t m_hOwnerEntity; // 0x04D8
    uint32_t m_hEffectEntity; // 0x04DC
    uint32_t m_bOnFire; // 0x0515
    float m_CreationTime; // 0x0518
    uint32_t m_RealClassName; // 0x051C
    uint32_t m_OverrideMaterial; // 0x0520
    uint32_t m_OverrideSubMaterials[0]; // 0x0528
    uint32_t m_spawnflags; // 0x0640
    uint32_t m_iGModFlags; // 0x0644
    uintptr_t m_GMOD_bool[32]; // 0x06A0
    uintptr_t m_GMOD_float[32]; // 0x06C0
    uintptr_t m_GMOD_int[32]; // 0x0740
    uintptr_t m_GMOD_Vector[32]; // 0x07C0
    uintptr_t m_GMOD_QAngle[32]; // 0x0940
    uintptr_t m_GMOD_EHANDLE[32]; // 0x0AC0
    const char* m_GMOD_String0; // 0x0B40
    const char* m_GMOD_String1; // 0x0D40
    const char* m_GMOD_String2; // 0x0F40
    const char* m_GMOD_String3; // 0x1140
    int64_t m_GMOD_DataTable; // 0x1340
    uint32_t m_iCreationID; // 0x1388
    uint32_t m_iMapCreatedID; // 0x138C
    uint32_t m_nSkin; // 0x1398
    uint32_t m_nBody; // 0x139C
    uint32_t m_nHitboxSet; // 0x13A0
    float m_flPlaybackRate; // 0x13C0
    fVector3 m_vecForce; // 0x13CC
    uint32_t m_nForceBone; // 0x13D8
    uint32_t m_bClientSideFrameReset; // 0x140C
    float m_fadeMinDist; // 0x1444
    float m_fadeMaxDist; // 0x1448
    float m_flFadeScale; // 0x144C
    float m_flModelScale; // 0x149C
    float m_flModelWidthScale; // 0x149C
    uintptr_t m_flPoseParameter[24]; // 0x14A0
    uintptr_t m_flEncodedController[4]; // 0x15BC
    uint32_t m_bClientSideAnimation; // 0x160C
    uint32_t m_nNewSequenceParity; // 0x1610
    uint32_t m_nResetEventsParity; // 0x1614
    uint32_t m_nSequence; // 0x163C
    float m_flCycle; // 0x1644
    uint32_t m_hLightingOrigin; // 0x16C4
    uint32_t m_hLightingOriginRelative; // 0x16C8
    uint32_t m_nMuzzleFlashParity; // 0x16CC
    fVector3 m_OverrideViewTarget; // 0x16EC
    uint32_t m_pBoneManipulator; // 0x1778
    uint32_t m_pFlexManipulator; // 0x1780
    uint32_t m_hOwner; // 0x17D8
    uint32_t m_nViewModelIndex; // 0x17E0
    float m_flNextPrimaryAttack; // 0x17E4
    float m_flNextSecondaryAttack; // 0x17E8
    float m_flTimeWeaponIdle; // 0x17EC
    uint32_t m_iViewModelIndex; // 0x17F4
    uint32_t m_iWorldModelIndex; // 0x17F8
    uint32_t m_iState; // 0x1818
    uint32_t m_iPrimaryAmmoType; // 0x1820
    uint32_t m_iSecondaryAmmoType; // 0x1824
    uint32_t m_iClip1; // 0x1828
    uint32_t m_iClip2; // 0x182C
    uint32_t m_bFlipViewModel; // 0x1858
};

class CHL2MPMachineGun // parent CBaseEntity {
public:
    void* m_OverrideSubMaterials; // 0x0000
    uint32_t movecollide; // 0x0000
    uint32_t movetype; // 0x0000
    uint32_t m_nRenderFX; // 0x0054
    uint32_t m_clrRender; // 0x0058
    uint32_t m_flAnimTime; // 0x0060
    uint32_t m_flSimulationTime; // 0x0068
    uint32_t m_ubInterpolationFrame; // 0x0074
    uint32_t m_fEffects; // 0x0078
    uint32_t m_nRenderMode; // 0x007C
    uint32_t m_nNextThinkTick; // 0x0084
    uint32_t m_nModelIndex; // 0x008C
    uint32_t m_takedamage; // 0x008E
    uint32_t m_iHealth; // 0x0090
    uint32_t m_iMaxHealth; // 0x0094
    uint32_t m_iTeamNum; // 0x009C
    uint32_t m_PredictableID; // 0x00A0
    float m_vecVelocity[0]; // 0x00F4
    float m_vecVelocity[1]; // 0x00F8
    float m_vecVelocity[2]; // 0x00FC
    uint32_t m_iParentAttachment; // 0x017A
    uint32_t moveparent; // 0x0190
    fVector3 m_vecMinsPreScaled; // 0x01A4
    fVector3 m_vecMaxsPreScaled; // 0x01B0
    fVector3 m_vecMins; // 0x01BC
    fVector3 m_vecMaxs; // 0x01C8
    uint32_t m_usSolidFlags; // 0x01D8
    uint32_t m_nSurroundType; // 0x01DC
    uint32_t m_nSolidType; // 0x01DD
    uint32_t m_triggerBloat; // 0x01DE
    fVector3 m_vecSpecifiedSurroundingMinsPreScaled; // 0x01E0
    fVector3 m_vecSpecifiedSurroundingMaxsPreScaled; // 0x01EC
    fVector3 m_vecSpecifiedSurroundingMins; // 0x01F8
    fVector3 m_vecSpecifiedSurroundingMaxs; // 0x0204
    float m_flElasticity; // 0x0248
    float m_flShadowCastDistance; // 0x024C
    fVector3 m_vecOrigin; // 0x0338
    fVector3 m_angRotation; // 0x0344
    uint32_t m_CollisionGroup; // 0x0354
    uint32_t m_bIsPlayerSimulated; // 0x04C8
    uint32_t m_bSimulatedEveryTick; // 0x04C9
    uint32_t m_bAnimatedEveryTick; // 0x04CA
    uint32_t m_bAlternateSorting; // 0x04CB
    uint32_t m_iTextureFrameIndex; // 0x04CC
    uint32_t m_hOwnerEntity; // 0x04D8
    uint32_t m_hEffectEntity; // 0x04DC
    uint32_t m_bOnFire; // 0x0515
    float m_CreationTime; // 0x0518
    uint32_t m_RealClassName; // 0x051C
    uint32_t m_OverrideMaterial; // 0x0520
    uint32_t m_OverrideSubMaterials[0]; // 0x0528
    uint32_t m_spawnflags; // 0x0640
    uint32_t m_iGModFlags; // 0x0644
    uintptr_t m_GMOD_bool[32]; // 0x06A0
    uintptr_t m_GMOD_float[32]; // 0x06C0
    uintptr_t m_GMOD_int[32]; // 0x0740
    uintptr_t m_GMOD_Vector[32]; // 0x07C0
    uintptr_t m_GMOD_QAngle[32]; // 0x0940
    uintptr_t m_GMOD_EHANDLE[32]; // 0x0AC0
    const char* m_GMOD_String0; // 0x0B40
    const char* m_GMOD_String1; // 0x0D40
    const char* m_GMOD_String2; // 0x0F40
    const char* m_GMOD_String3; // 0x1140
    int64_t m_GMOD_DataTable; // 0x1340
    uint32_t m_iCreationID; // 0x1388
    uint32_t m_iMapCreatedID; // 0x138C
    uint32_t m_nSkin; // 0x1398
    uint32_t m_nBody; // 0x139C
    uint32_t m_nHitboxSet; // 0x13A0
    float m_flPlaybackRate; // 0x13C0
    fVector3 m_vecForce; // 0x13CC
    uint32_t m_nForceBone; // 0x13D8
    uint32_t m_bClientSideFrameReset; // 0x140C
    float m_fadeMinDist; // 0x1444
    float m_fadeMaxDist; // 0x1448
    float m_flFadeScale; // 0x144C
    float m_flModelScale; // 0x149C
    float m_flModelWidthScale; // 0x149C
    uintptr_t m_flPoseParameter[24]; // 0x14A0
    uintptr_t m_flEncodedController[4]; // 0x15BC
    uint32_t m_bClientSideAnimation; // 0x160C
    uint32_t m_nNewSequenceParity; // 0x1610
    uint32_t m_nResetEventsParity; // 0x1614
    uint32_t m_nSequence; // 0x163C
    float m_flCycle; // 0x1644
    uint32_t m_hLightingOrigin; // 0x16C4
    uint32_t m_hLightingOriginRelative; // 0x16C8
    uint32_t m_nMuzzleFlashParity; // 0x16CC
    fVector3 m_OverrideViewTarget; // 0x16EC
    uint32_t m_pBoneManipulator; // 0x1778
    uint32_t m_pFlexManipulator; // 0x1780
    uint32_t m_hOwner; // 0x17D8
    uint32_t m_nViewModelIndex; // 0x17E0
    float m_flNextPrimaryAttack; // 0x17E4
    float m_flNextSecondaryAttack; // 0x17E8
    float m_flTimeWeaponIdle; // 0x17EC
    uint32_t m_iViewModelIndex; // 0x17F4
    uint32_t m_iWorldModelIndex; // 0x17F8
    uint32_t m_iState; // 0x1818
    uint32_t m_iPrimaryAmmoType; // 0x1820
    uint32_t m_iSecondaryAmmoType; // 0x1824
    uint32_t m_iClip1; // 0x1828
    uint32_t m_iClip2; // 0x182C
    uint32_t m_bFlipViewModel; // 0x1858
    uint32_t m_nShotsFired; // 0x18B8
};

class CWeaponHL2MPBase // parent CBaseEntity {
public:
    void* m_OverrideSubMaterials; // 0x0000
    uint32_t movecollide; // 0x0000
    uint32_t movetype; // 0x0000
    uint32_t m_nRenderFX; // 0x0054
    uint32_t m_clrRender; // 0x0058
    uint32_t m_flAnimTime; // 0x0060
    uint32_t m_flSimulationTime; // 0x0068
    uint32_t m_ubInterpolationFrame; // 0x0074
    uint32_t m_fEffects; // 0x0078
    uint32_t m_nRenderMode; // 0x007C
    uint32_t m_nNextThinkTick; // 0x0084
    uint32_t m_nModelIndex; // 0x008C
    uint32_t m_takedamage; // 0x008E
    uint32_t m_iHealth; // 0x0090
    uint32_t m_iMaxHealth; // 0x0094
    uint32_t m_iTeamNum; // 0x009C
    uint32_t m_PredictableID; // 0x00A0
    float m_vecVelocity[0]; // 0x00F4
    float m_vecVelocity[1]; // 0x00F8
    float m_vecVelocity[2]; // 0x00FC
    uint32_t m_iParentAttachment; // 0x017A
    uint32_t moveparent; // 0x0190
    fVector3 m_vecMinsPreScaled; // 0x01A4
    fVector3 m_vecMaxsPreScaled; // 0x01B0
    fVector3 m_vecMins; // 0x01BC
    fVector3 m_vecMaxs; // 0x01C8
    uint32_t m_usSolidFlags; // 0x01D8
    uint32_t m_nSurroundType; // 0x01DC
    uint32_t m_nSolidType; // 0x01DD
    uint32_t m_triggerBloat; // 0x01DE
    fVector3 m_vecSpecifiedSurroundingMinsPreScaled; // 0x01E0
    fVector3 m_vecSpecifiedSurroundingMaxsPreScaled; // 0x01EC
    fVector3 m_vecSpecifiedSurroundingMins; // 0x01F8
    fVector3 m_vecSpecifiedSurroundingMaxs; // 0x0204
    float m_flElasticity; // 0x0248
    float m_flShadowCastDistance; // 0x024C
    fVector3 m_vecOrigin; // 0x0338
    fVector3 m_angRotation; // 0x0344
    uint32_t m_CollisionGroup; // 0x0354
    uint32_t m_bIsPlayerSimulated; // 0x04C8
    uint32_t m_bSimulatedEveryTick; // 0x04C9
    uint32_t m_bAnimatedEveryTick; // 0x04CA
    uint32_t m_bAlternateSorting; // 0x04CB
    uint32_t m_iTextureFrameIndex; // 0x04CC
    uint32_t m_hOwnerEntity; // 0x04D8
    uint32_t m_hEffectEntity; // 0x04DC
    uint32_t m_bOnFire; // 0x0515
    float m_CreationTime; // 0x0518
    uint32_t m_RealClassName; // 0x051C
    uint32_t m_OverrideMaterial; // 0x0520
    uint32_t m_OverrideSubMaterials[0]; // 0x0528
    uint32_t m_spawnflags; // 0x0640
    uint32_t m_iGModFlags; // 0x0644
    uintptr_t m_GMOD_bool[32]; // 0x06A0
    uintptr_t m_GMOD_float[32]; // 0x06C0
    uintptr_t m_GMOD_int[32]; // 0x0740
    uintptr_t m_GMOD_Vector[32]; // 0x07C0
    uintptr_t m_GMOD_QAngle[32]; // 0x0940
    uintptr_t m_GMOD_EHANDLE[32]; // 0x0AC0
    const char* m_GMOD_String0; // 0x0B40
    const char* m_GMOD_String1; // 0x0D40
    const char* m_GMOD_String2; // 0x0F40
    const char* m_GMOD_String3; // 0x1140
    int64_t m_GMOD_DataTable; // 0x1340
    uint32_t m_iCreationID; // 0x1388
    uint32_t m_iMapCreatedID; // 0x138C
    uint32_t m_nSkin; // 0x1398
    uint32_t m_nBody; // 0x139C
    uint32_t m_nHitboxSet; // 0x13A0
    float m_flPlaybackRate; // 0x13C0
    fVector3 m_vecForce; // 0x13CC
    uint32_t m_nForceBone; // 0x13D8
    uint32_t m_bClientSideFrameReset; // 0x140C
    float m_fadeMinDist; // 0x1444
    float m_fadeMaxDist; // 0x1448
    float m_flFadeScale; // 0x144C
    float m_flModelScale; // 0x149C
    float m_flModelWidthScale; // 0x149C
    uintptr_t m_flPoseParameter[24]; // 0x14A0
    uintptr_t m_flEncodedController[4]; // 0x15BC
    uint32_t m_bClientSideAnimation; // 0x160C
    uint32_t m_nNewSequenceParity; // 0x1610
    uint32_t m_nResetEventsParity; // 0x1614
    uint32_t m_nSequence; // 0x163C
    float m_flCycle; // 0x1644
    uint32_t m_hLightingOrigin; // 0x16C4
    uint32_t m_hLightingOriginRelative; // 0x16C8
    uint32_t m_nMuzzleFlashParity; // 0x16CC
    fVector3 m_OverrideViewTarget; // 0x16EC
    uint32_t m_pBoneManipulator; // 0x1778
    uint32_t m_pFlexManipulator; // 0x1780
    uint32_t m_hOwner; // 0x17D8
    uint32_t m_nViewModelIndex; // 0x17E0
    float m_flNextPrimaryAttack; // 0x17E4
    float m_flNextSecondaryAttack; // 0x17E8
    float m_flTimeWeaponIdle; // 0x17EC
    uint32_t m_iViewModelIndex; // 0x17F4
    uint32_t m_iWorldModelIndex; // 0x17F8
    uint32_t m_iState; // 0x1818
    uint32_t m_iPrimaryAmmoType; // 0x1820
    uint32_t m_iSecondaryAmmoType; // 0x1824
    uint32_t m_iClip1; // 0x1828
    uint32_t m_iClip2; // 0x182C
    uint32_t m_bFlipViewModel; // 0x1858
};

class CWeaponFrag // parent CBaseEntity {
public:
    uint32_t movetype; // 0x0000
    void* m_OverrideSubMaterials; // 0x0000
    uint32_t movecollide; // 0x0000
    uint32_t m_nRenderFX; // 0x0054
    uint32_t m_clrRender; // 0x0058
    uint32_t m_flAnimTime; // 0x0060
    uint32_t m_flSimulationTime; // 0x0068
    uint32_t m_ubInterpolationFrame; // 0x0074
    uint32_t m_fEffects; // 0x0078
    uint32_t m_nRenderMode; // 0x007C
    uint32_t m_nNextThinkTick; // 0x0084
    uint32_t m_nModelIndex; // 0x008C
    uint32_t m_takedamage; // 0x008E
    uint32_t m_iHealth; // 0x0090
    uint32_t m_iMaxHealth; // 0x0094
    uint32_t m_iTeamNum; // 0x009C
    uint32_t m_PredictableID; // 0x00A0
    float m_vecVelocity[0]; // 0x00F4
    float m_vecVelocity[1]; // 0x00F8
    float m_vecVelocity[2]; // 0x00FC
    uint32_t m_iParentAttachment; // 0x017A
    uint32_t moveparent; // 0x0190
    fVector3 m_vecMinsPreScaled; // 0x01A4
    fVector3 m_vecMaxsPreScaled; // 0x01B0
    fVector3 m_vecMins; // 0x01BC
    fVector3 m_vecMaxs; // 0x01C8
    uint32_t m_usSolidFlags; // 0x01D8
    uint32_t m_nSurroundType; // 0x01DC
    uint32_t m_nSolidType; // 0x01DD
    uint32_t m_triggerBloat; // 0x01DE
    fVector3 m_vecSpecifiedSurroundingMinsPreScaled; // 0x01E0
    fVector3 m_vecSpecifiedSurroundingMaxsPreScaled; // 0x01EC
    fVector3 m_vecSpecifiedSurroundingMins; // 0x01F8
    fVector3 m_vecSpecifiedSurroundingMaxs; // 0x0204
    float m_flElasticity; // 0x0248
    float m_flShadowCastDistance; // 0x024C
    fVector3 m_vecOrigin; // 0x0338
    fVector3 m_angRotation; // 0x0344
    uint32_t m_CollisionGroup; // 0x0354
    uint32_t m_bIsPlayerSimulated; // 0x04C8
    uint32_t m_bSimulatedEveryTick; // 0x04C9
    uint32_t m_bAnimatedEveryTick; // 0x04CA
    uint32_t m_bAlternateSorting; // 0x04CB
    uint32_t m_iTextureFrameIndex; // 0x04CC
    uint32_t m_hOwnerEntity; // 0x04D8
    uint32_t m_hEffectEntity; // 0x04DC
    uint32_t m_bOnFire; // 0x0515
    float m_CreationTime; // 0x0518
    uint32_t m_RealClassName; // 0x051C
    uint32_t m_OverrideMaterial; // 0x0520
    uint32_t m_OverrideSubMaterials[0]; // 0x0528
    uint32_t m_spawnflags; // 0x0640
    uint32_t m_iGModFlags; // 0x0644
    uintptr_t m_GMOD_bool[32]; // 0x06A0
    uintptr_t m_GMOD_float[32]; // 0x06C0
    uintptr_t m_GMOD_int[32]; // 0x0740
    uintptr_t m_GMOD_Vector[32]; // 0x07C0
    uintptr_t m_GMOD_QAngle[32]; // 0x0940
    uintptr_t m_GMOD_EHANDLE[32]; // 0x0AC0
    const char* m_GMOD_String0; // 0x0B40
    const char* m_GMOD_String1; // 0x0D40
    const char* m_GMOD_String2; // 0x0F40
    const char* m_GMOD_String3; // 0x1140
    int64_t m_GMOD_DataTable; // 0x1340
    uint32_t m_iCreationID; // 0x1388
    uint32_t m_iMapCreatedID; // 0x138C
    uint32_t m_nSkin; // 0x1398
    uint32_t m_nBody; // 0x139C
    uint32_t m_nHitboxSet; // 0x13A0
    float m_flPlaybackRate; // 0x13C0
    fVector3 m_vecForce; // 0x13CC
    uint32_t m_nForceBone; // 0x13D8
    uint32_t m_bClientSideFrameReset; // 0x140C
    float m_fadeMinDist; // 0x1444
    float m_fadeMaxDist; // 0x1448
    float m_flFadeScale; // 0x144C
    float m_flModelScale; // 0x149C
    float m_flModelWidthScale; // 0x149C
    uintptr_t m_flPoseParameter[24]; // 0x14A0
    uintptr_t m_flEncodedController[4]; // 0x15BC
    uint32_t m_bClientSideAnimation; // 0x160C
    uint32_t m_nNewSequenceParity; // 0x1610
    uint32_t m_nResetEventsParity; // 0x1614
    uint32_t m_nSequence; // 0x163C
    float m_flCycle; // 0x1644
    uint32_t m_hLightingOrigin; // 0x16C4
    uint32_t m_hLightingOriginRelative; // 0x16C8
    uint32_t m_nMuzzleFlashParity; // 0x16CC
    fVector3 m_OverrideViewTarget; // 0x16EC
    uint32_t m_pBoneManipulator; // 0x1778
    uint32_t m_pFlexManipulator; // 0x1780
    uint32_t m_hOwner; // 0x17D8
    uint32_t m_nViewModelIndex; // 0x17E0
    float m_flNextPrimaryAttack; // 0x17E4
    float m_flNextSecondaryAttack; // 0x17E8
    float m_flTimeWeaponIdle; // 0x17EC
    uint32_t m_iViewModelIndex; // 0x17F4
    uint32_t m_iWorldModelIndex; // 0x17F8
    uint32_t m_iState; // 0x1818
    uint32_t m_iPrimaryAmmoType; // 0x1820
    uint32_t m_iSecondaryAmmoType; // 0x1824
    uint32_t m_iClip1; // 0x1828
    uint32_t m_iClip2; // 0x182C
    uint32_t m_bFlipViewModel; // 0x1858
    uint32_t m_bRedraw; // 0x18B8
    uint32_t m_AttackPaused; // 0x18BC
    uint32_t m_fDrawbackFinished; // 0x18C0
};

class CWeaponCrowbar // parent CBaseEntity {
public:
    void* m_OverrideSubMaterials; // 0x0000
    uint32_t movecollide; // 0x0000
    uint32_t movetype; // 0x0000
    uint32_t m_nRenderFX; // 0x0054
    uint32_t m_clrRender; // 0x0058
    uint32_t m_flAnimTime; // 0x0060
    uint32_t m_flSimulationTime; // 0x0068
    uint32_t m_ubInterpolationFrame; // 0x0074
    uint32_t m_fEffects; // 0x0078
    uint32_t m_nRenderMode; // 0x007C
    uint32_t m_nNextThinkTick; // 0x0084
    uint32_t m_nModelIndex; // 0x008C
    uint32_t m_takedamage; // 0x008E
    uint32_t m_iHealth; // 0x0090
    uint32_t m_iMaxHealth; // 0x0094
    uint32_t m_iTeamNum; // 0x009C
    uint32_t m_PredictableID; // 0x00A0
    float m_vecVelocity[0]; // 0x00F4
    float m_vecVelocity[1]; // 0x00F8
    float m_vecVelocity[2]; // 0x00FC
    uint32_t m_iParentAttachment; // 0x017A
    uint32_t moveparent; // 0x0190
    fVector3 m_vecMinsPreScaled; // 0x01A4
    fVector3 m_vecMaxsPreScaled; // 0x01B0
    fVector3 m_vecMins; // 0x01BC
    fVector3 m_vecMaxs; // 0x01C8
    uint32_t m_usSolidFlags; // 0x01D8
    uint32_t m_nSurroundType; // 0x01DC
    uint32_t m_nSolidType; // 0x01DD
    uint32_t m_triggerBloat; // 0x01DE
    fVector3 m_vecSpecifiedSurroundingMinsPreScaled; // 0x01E0
    fVector3 m_vecSpecifiedSurroundingMaxsPreScaled; // 0x01EC
    fVector3 m_vecSpecifiedSurroundingMins; // 0x01F8
    fVector3 m_vecSpecifiedSurroundingMaxs; // 0x0204
    float m_flElasticity; // 0x0248
    float m_flShadowCastDistance; // 0x024C
    fVector3 m_vecOrigin; // 0x0338
    fVector3 m_angRotation; // 0x0344
    uint32_t m_CollisionGroup; // 0x0354
    uint32_t m_bIsPlayerSimulated; // 0x04C8
    uint32_t m_bSimulatedEveryTick; // 0x04C9
    uint32_t m_bAnimatedEveryTick; // 0x04CA
    uint32_t m_bAlternateSorting; // 0x04CB
    uint32_t m_iTextureFrameIndex; // 0x04CC
    uint32_t m_hOwnerEntity; // 0x04D8
    uint32_t m_hEffectEntity; // 0x04DC
    uint32_t m_bOnFire; // 0x0515
    float m_CreationTime; // 0x0518
    uint32_t m_RealClassName; // 0x051C
    uint32_t m_OverrideMaterial; // 0x0520
    uint32_t m_OverrideSubMaterials[0]; // 0x0528
    uint32_t m_spawnflags; // 0x0640
    uint32_t m_iGModFlags; // 0x0644
    uintptr_t m_GMOD_bool[32]; // 0x06A0
    uintptr_t m_GMOD_float[32]; // 0x06C0
    uintptr_t m_GMOD_int[32]; // 0x0740
    uintptr_t m_GMOD_Vector[32]; // 0x07C0
    uintptr_t m_GMOD_QAngle[32]; // 0x0940
    uintptr_t m_GMOD_EHANDLE[32]; // 0x0AC0
    const char* m_GMOD_String0; // 0x0B40
    const char* m_GMOD_String1; // 0x0D40
    const char* m_GMOD_String2; // 0x0F40
    const char* m_GMOD_String3; // 0x1140
    int64_t m_GMOD_DataTable; // 0x1340
    uint32_t m_iCreationID; // 0x1388
    uint32_t m_iMapCreatedID; // 0x138C
    uint32_t m_nSkin; // 0x1398
    uint32_t m_nBody; // 0x139C
    uint32_t m_nHitboxSet; // 0x13A0
    float m_flPlaybackRate; // 0x13C0
    fVector3 m_vecForce; // 0x13CC
    uint32_t m_nForceBone; // 0x13D8
    uint32_t m_bClientSideFrameReset; // 0x140C
    float m_fadeMinDist; // 0x1444
    float m_fadeMaxDist; // 0x1448
    float m_flFadeScale; // 0x144C
    float m_flModelScale; // 0x149C
    float m_flModelWidthScale; // 0x149C
    uintptr_t m_flPoseParameter[24]; // 0x14A0
    uintptr_t m_flEncodedController[4]; // 0x15BC
    uint32_t m_bClientSideAnimation; // 0x160C
    uint32_t m_nNewSequenceParity; // 0x1610
    uint32_t m_nResetEventsParity; // 0x1614
    uint32_t m_nSequence; // 0x163C
    float m_flCycle; // 0x1644
    uint32_t m_hLightingOrigin; // 0x16C4
    uint32_t m_hLightingOriginRelative; // 0x16C8
    uint32_t m_nMuzzleFlashParity; // 0x16CC
    fVector3 m_OverrideViewTarget; // 0x16EC
    uint32_t m_pBoneManipulator; // 0x1778
    uint32_t m_pFlexManipulator; // 0x1780
    uint32_t m_hOwner; // 0x17D8
    uint32_t m_nViewModelIndex; // 0x17E0
    float m_flNextPrimaryAttack; // 0x17E4
    float m_flNextSecondaryAttack; // 0x17E8
    float m_flTimeWeaponIdle; // 0x17EC
    uint32_t m_iViewModelIndex; // 0x17F4
    uint32_t m_iWorldModelIndex; // 0x17F8
    uint32_t m_iState; // 0x1818
    uint32_t m_iPrimaryAmmoType; // 0x1820
    uint32_t m_iSecondaryAmmoType; // 0x1824
    uint32_t m_iClip1; // 0x1828
    uint32_t m_iClip2; // 0x182C
    uint32_t m_bFlipViewModel; // 0x1858
};

class CEnvProjectedTexture // parent CBaseEntity {
public:
    void* m_OverrideSubMaterials; // 0x0000
    uint32_t movecollide; // 0x0000
    uint32_t movetype; // 0x0000
    uint32_t m_nRenderFX; // 0x0054
    uint32_t m_clrRender; // 0x0058
    uint32_t m_flAnimTime; // 0x0060
    uint32_t m_flSimulationTime; // 0x0068
    uint32_t m_ubInterpolationFrame; // 0x0074
    uint32_t m_fEffects; // 0x0078
    uint32_t m_nRenderMode; // 0x007C
    uint32_t m_nModelIndex; // 0x008C
    uint32_t m_takedamage; // 0x008E
    uint32_t m_iHealth; // 0x0090
    uint32_t m_iMaxHealth; // 0x0094
    uint32_t m_iTeamNum; // 0x009C
    uint32_t m_PredictableID; // 0x00A0
    float m_vecVelocity[0]; // 0x00F4
    float m_vecVelocity[1]; // 0x00F8
    float m_vecVelocity[2]; // 0x00FC
    uint32_t m_iParentAttachment; // 0x017A
    uint32_t moveparent; // 0x0190
    fVector3 m_vecMinsPreScaled; // 0x01A4
    fVector3 m_vecMaxsPreScaled; // 0x01B0
    fVector3 m_vecMins; // 0x01BC
    fVector3 m_vecMaxs; // 0x01C8
    uint32_t m_usSolidFlags; // 0x01D8
    uint32_t m_nSurroundType; // 0x01DC
    uint32_t m_nSolidType; // 0x01DD
    uint32_t m_triggerBloat; // 0x01DE
    fVector3 m_vecSpecifiedSurroundingMinsPreScaled; // 0x01E0
    fVector3 m_vecSpecifiedSurroundingMaxsPreScaled; // 0x01EC
    fVector3 m_vecSpecifiedSurroundingMins; // 0x01F8
    fVector3 m_vecSpecifiedSurroundingMaxs; // 0x0204
    float m_flElasticity; // 0x0248
    float m_flShadowCastDistance; // 0x024C
    fVector3 m_vecOrigin; // 0x0338
    fVector3 m_angRotation; // 0x0344
    uint32_t m_CollisionGroup; // 0x0354
    uint32_t m_bIsPlayerSimulated; // 0x04C8
    uint32_t m_bSimulatedEveryTick; // 0x04C9
    uint32_t m_bAnimatedEveryTick; // 0x04CA
    uint32_t m_bAlternateSorting; // 0x04CB
    uint32_t m_iTextureFrameIndex; // 0x04CC
    uint32_t m_hOwnerEntity; // 0x04D8
    uint32_t m_hEffectEntity; // 0x04DC
    uint32_t m_bOnFire; // 0x0515
    float m_CreationTime; // 0x0518
    uint32_t m_RealClassName; // 0x051C
    uint32_t m_OverrideMaterial; // 0x0520
    uint32_t m_OverrideSubMaterials[0]; // 0x0528
    uint32_t m_spawnflags; // 0x0640
    uint32_t m_iGModFlags; // 0x0644
    uintptr_t m_GMOD_bool[32]; // 0x06A0
    uintptr_t m_GMOD_float[32]; // 0x06C0
    uintptr_t m_GMOD_int[32]; // 0x0740
    uintptr_t m_GMOD_Vector[32]; // 0x07C0
    uintptr_t m_GMOD_QAngle[32]; // 0x0940
    uintptr_t m_GMOD_EHANDLE[32]; // 0x0AC0
    const char* m_GMOD_String0; // 0x0B40
    const char* m_GMOD_String1; // 0x0D40
    const char* m_GMOD_String2; // 0x0F40
    const char* m_GMOD_String3; // 0x1140
    int64_t m_GMOD_DataTable; // 0x1340
    uint32_t m_iCreationID; // 0x1388
    uint32_t m_iMapCreatedID; // 0x138C
    uint32_t m_hTargetEntity; // 0x1394
    uint32_t m_bState; // 0x1398
    float m_flLightFOV; // 0x139C
    uint32_t m_bEnableShadows; // 0x13A0
    uint32_t m_bLightOnlyTarget; // 0x13A1
    uint32_t m_bLightWorld; // 0x13A2
    uint32_t m_bCameraSpace; // 0x13A3
    fVector3 m_LinearFloatLightColor; // 0x13A4
    float m_flNearZ; // 0x13B0
    float m_flFarZ; // 0x13B4
    const char* m_SpotlightTextureName; // 0x13B8
    uint32_t m_nSpotlightTextureFrame; // 0x14BC
    uint32_t m_nShadowQuality; // 0x14C0
    uint32_t m_iStyle; // 0x14C8
};

class CWeaponCrossbow // parent CBaseEntity {
public:
    uint32_t movetype; // 0x0000
    void* m_OverrideSubMaterials; // 0x0000
    uint32_t movecollide; // 0x0000
    uint32_t m_nRenderFX; // 0x0054
    uint32_t m_clrRender; // 0x0058
    uint32_t m_flAnimTime; // 0x0060
    uint32_t m_flSimulationTime; // 0x0068
    uint32_t m_ubInterpolationFrame; // 0x0074
    uint32_t m_fEffects; // 0x0078
    uint32_t m_nRenderMode; // 0x007C
    uint32_t m_nNextThinkTick; // 0x0084
    uint32_t m_nModelIndex; // 0x008C
    uint32_t m_takedamage; // 0x008E
    uint32_t m_iHealth; // 0x0090
    uint32_t m_iMaxHealth; // 0x0094
    uint32_t m_iTeamNum; // 0x009C
    uint32_t m_PredictableID; // 0x00A0
    float m_vecVelocity[0]; // 0x00F4
    float m_vecVelocity[1]; // 0x00F8
    float m_vecVelocity[2]; // 0x00FC
    uint32_t m_iParentAttachment; // 0x017A
    uint32_t moveparent; // 0x0190
    fVector3 m_vecMinsPreScaled; // 0x01A4
    fVector3 m_vecMaxsPreScaled; // 0x01B0
    fVector3 m_vecMins; // 0x01BC
    fVector3 m_vecMaxs; // 0x01C8
    uint32_t m_usSolidFlags; // 0x01D8
    uint32_t m_nSurroundType; // 0x01DC
    uint32_t m_nSolidType; // 0x01DD
    uint32_t m_triggerBloat; // 0x01DE
    fVector3 m_vecSpecifiedSurroundingMinsPreScaled; // 0x01E0
    fVector3 m_vecSpecifiedSurroundingMaxsPreScaled; // 0x01EC
    fVector3 m_vecSpecifiedSurroundingMins; // 0x01F8
    fVector3 m_vecSpecifiedSurroundingMaxs; // 0x0204
    float m_flElasticity; // 0x0248
    float m_flShadowCastDistance; // 0x024C
    fVector3 m_vecOrigin; // 0x0338
    fVector3 m_angRotation; // 0x0344
    uint32_t m_CollisionGroup; // 0x0354
    uint32_t m_bIsPlayerSimulated; // 0x04C8
    uint32_t m_bSimulatedEveryTick; // 0x04C9
    uint32_t m_bAnimatedEveryTick; // 0x04CA
    uint32_t m_bAlternateSorting; // 0x04CB
    uint32_t m_iTextureFrameIndex; // 0x04CC
    uint32_t m_hOwnerEntity; // 0x04D8
    uint32_t m_hEffectEntity; // 0x04DC
    uint32_t m_bOnFire; // 0x0515
    float m_CreationTime; // 0x0518
    uint32_t m_RealClassName; // 0x051C
    uint32_t m_OverrideMaterial; // 0x0520
    uint32_t m_OverrideSubMaterials[0]; // 0x0528
    uint32_t m_spawnflags; // 0x0640
    uint32_t m_iGModFlags; // 0x0644
    uintptr_t m_GMOD_bool[32]; // 0x06A0
    uintptr_t m_GMOD_float[32]; // 0x06C0
    uintptr_t m_GMOD_int[32]; // 0x0740
    uintptr_t m_GMOD_Vector[32]; // 0x07C0
    uintptr_t m_GMOD_QAngle[32]; // 0x0940
    uintptr_t m_GMOD_EHANDLE[32]; // 0x0AC0
    const char* m_GMOD_String0; // 0x0B40
    const char* m_GMOD_String1; // 0x0D40
    const char* m_GMOD_String2; // 0x0F40
    const char* m_GMOD_String3; // 0x1140
    int64_t m_GMOD_DataTable; // 0x1340
    uint32_t m_iCreationID; // 0x1388
    uint32_t m_iMapCreatedID; // 0x138C
    uint32_t m_nSkin; // 0x1398
    uint32_t m_nBody; // 0x139C
    uint32_t m_nHitboxSet; // 0x13A0
    float m_flPlaybackRate; // 0x13C0
    fVector3 m_vecForce; // 0x13CC
    uint32_t m_nForceBone; // 0x13D8
    uint32_t m_bClientSideFrameReset; // 0x140C
    float m_fadeMinDist; // 0x1444
    float m_fadeMaxDist; // 0x1448
    float m_flFadeScale; // 0x144C
    float m_flModelScale; // 0x149C
    float m_flModelWidthScale; // 0x149C
    uintptr_t m_flPoseParameter[24]; // 0x14A0
    uintptr_t m_flEncodedController[4]; // 0x15BC
    uint32_t m_bClientSideAnimation; // 0x160C
    uint32_t m_nNewSequenceParity; // 0x1610
    uint32_t m_nResetEventsParity; // 0x1614
    uint32_t m_nSequence; // 0x163C
    float m_flCycle; // 0x1644
    uint32_t m_hLightingOrigin; // 0x16C4
    uint32_t m_hLightingOriginRelative; // 0x16C8
    uint32_t m_nMuzzleFlashParity; // 0x16CC
    fVector3 m_OverrideViewTarget; // 0x16EC
    uint32_t m_pBoneManipulator; // 0x1778
    uint32_t m_pFlexManipulator; // 0x1780
    uint32_t m_hOwner; // 0x17D8
    uint32_t m_nViewModelIndex; // 0x17E0
    float m_flNextPrimaryAttack; // 0x17E4
    float m_flNextSecondaryAttack; // 0x17E8
    float m_flTimeWeaponIdle; // 0x17EC
    uint32_t m_iViewModelIndex; // 0x17F4
    uint32_t m_iWorldModelIndex; // 0x17F8
    uint32_t m_iState; // 0x1818
    uint32_t m_iPrimaryAmmoType; // 0x1820
    uint32_t m_iSecondaryAmmoType; // 0x1824
    uint32_t m_iClip1; // 0x1828
    uint32_t m_iClip2; // 0x182C
    uint32_t m_bFlipViewModel; // 0x1858
    uint32_t m_bInZoom; // 0x18BC
    uint32_t m_bMustReload; // 0x18BD
};

class CSpatialEntity // parent CBaseEntity {
public:
    uint32_t movetype; // 0x0000
    void* m_OverrideSubMaterials; // 0x0000
    uint32_t movecollide; // 0x0000
    uint32_t m_nRenderFX; // 0x0054
    uint32_t m_clrRender; // 0x0058
    uint32_t m_flAnimTime; // 0x0060
    uint32_t m_flSimulationTime; // 0x0068
    uint32_t m_ubInterpolationFrame; // 0x0074
    uint32_t m_fEffects; // 0x0078
    uint32_t m_nRenderMode; // 0x007C
    uint32_t m_nModelIndex; // 0x008C
    uint32_t m_takedamage; // 0x008E
    uint32_t m_iHealth; // 0x0090
    uint32_t m_iMaxHealth; // 0x0094
    uint32_t m_iTeamNum; // 0x009C
    uint32_t m_PredictableID; // 0x00A0
    float m_vecVelocity[0]; // 0x00F4
    float m_vecVelocity[1]; // 0x00F8
    float m_vecVelocity[2]; // 0x00FC
    uint32_t m_iParentAttachment; // 0x017A
    uint32_t moveparent; // 0x0190
    fVector3 m_vecMinsPreScaled; // 0x01A4
    fVector3 m_vecMaxsPreScaled; // 0x01B0
    fVector3 m_vecMins; // 0x01BC
    fVector3 m_vecMaxs; // 0x01C8
    uint32_t m_usSolidFlags; // 0x01D8
    uint32_t m_nSurroundType; // 0x01DC
    uint32_t m_nSolidType; // 0x01DD
    uint32_t m_triggerBloat; // 0x01DE
    fVector3 m_vecSpecifiedSurroundingMinsPreScaled; // 0x01E0
    fVector3 m_vecSpecifiedSurroundingMaxsPreScaled; // 0x01EC
    fVector3 m_vecSpecifiedSurroundingMins; // 0x01F8
    fVector3 m_vecSpecifiedSurroundingMaxs; // 0x0204
    float m_flElasticity; // 0x0248
    float m_flShadowCastDistance; // 0x024C
    fVector3 m_angRotation; // 0x0344
    uint32_t m_CollisionGroup; // 0x0354
    uint32_t m_bIsPlayerSimulated; // 0x04C8
    uint32_t m_bSimulatedEveryTick; // 0x04C9
    uint32_t m_bAnimatedEveryTick; // 0x04CA
    uint32_t m_bAlternateSorting; // 0x04CB
    uint32_t m_iTextureFrameIndex; // 0x04CC
    uint32_t m_hOwnerEntity; // 0x04D8
    uint32_t m_hEffectEntity; // 0x04DC
    uint32_t m_bOnFire; // 0x0515
    float m_CreationTime; // 0x0518
    uint32_t m_RealClassName; // 0x051C
    uint32_t m_OverrideMaterial; // 0x0520
    uint32_t m_OverrideSubMaterials[0]; // 0x0528
    uint32_t m_spawnflags; // 0x0640
    uint32_t m_iGModFlags; // 0x0644
    uintptr_t m_GMOD_bool[32]; // 0x06A0
    uintptr_t m_GMOD_float[32]; // 0x06C0
    uintptr_t m_GMOD_int[32]; // 0x0740
    uintptr_t m_GMOD_Vector[32]; // 0x07C0
    uintptr_t m_GMOD_QAngle[32]; // 0x0940
    uintptr_t m_GMOD_EHANDLE[32]; // 0x0AC0
    const char* m_GMOD_String0; // 0x0B40
    const char* m_GMOD_String1; // 0x0D40
    const char* m_GMOD_String2; // 0x0F40
    const char* m_GMOD_String3; // 0x1140
    int64_t m_GMOD_DataTable; // 0x1340
    uint32_t m_iCreationID; // 0x1388
    uint32_t m_iMapCreatedID; // 0x138C
    fVector3 m_vecOrigin; // 0x1390
    float m_minFalloff; // 0x139C
    float m_maxFalloff; // 0x13A0
    float m_flCurWeight; // 0x13A4
    uint32_t m_bEnabled; // 0x14AC
};

class CWeaponAR2 // parent CBaseEntity {
public:
    void* m_OverrideSubMaterials; // 0x0000
    uint32_t movecollide; // 0x0000
    uint32_t movetype; // 0x0000
    uint32_t m_nRenderFX; // 0x0054
    uint32_t m_clrRender; // 0x0058
    uint32_t m_flAnimTime; // 0x0060
    uint32_t m_flSimulationTime; // 0x0068
    uint32_t m_ubInterpolationFrame; // 0x0074
    uint32_t m_fEffects; // 0x0078
    uint32_t m_nRenderMode; // 0x007C
    uint32_t m_nNextThinkTick; // 0x0084
    uint32_t m_nModelIndex; // 0x008C
    uint32_t m_takedamage; // 0x008E
    uint32_t m_iHealth; // 0x0090
    uint32_t m_iMaxHealth; // 0x0094
    uint32_t m_iTeamNum; // 0x009C
    uint32_t m_PredictableID; // 0x00A0
    float m_vecVelocity[0]; // 0x00F4
    float m_vecVelocity[1]; // 0x00F8
    float m_vecVelocity[2]; // 0x00FC
    uint32_t m_iParentAttachment; // 0x017A
    uint32_t moveparent; // 0x0190
    fVector3 m_vecMinsPreScaled; // 0x01A4
    fVector3 m_vecMaxsPreScaled; // 0x01B0
    fVector3 m_vecMins; // 0x01BC
    fVector3 m_vecMaxs; // 0x01C8
    uint32_t m_usSolidFlags; // 0x01D8
    uint32_t m_nSurroundType; // 0x01DC
    uint32_t m_nSolidType; // 0x01DD
    uint32_t m_triggerBloat; // 0x01DE
    fVector3 m_vecSpecifiedSurroundingMinsPreScaled; // 0x01E0
    fVector3 m_vecSpecifiedSurroundingMaxsPreScaled; // 0x01EC
    fVector3 m_vecSpecifiedSurroundingMins; // 0x01F8
    fVector3 m_vecSpecifiedSurroundingMaxs; // 0x0204
    float m_flElasticity; // 0x0248
    float m_flShadowCastDistance; // 0x024C
    fVector3 m_vecOrigin; // 0x0338
    fVector3 m_angRotation; // 0x0344
    uint32_t m_CollisionGroup; // 0x0354
    uint32_t m_bIsPlayerSimulated; // 0x04C8
    uint32_t m_bSimulatedEveryTick; // 0x04C9
    uint32_t m_bAnimatedEveryTick; // 0x04CA
    uint32_t m_bAlternateSorting; // 0x04CB
    uint32_t m_iTextureFrameIndex; // 0x04CC
    uint32_t m_hOwnerEntity; // 0x04D8
    uint32_t m_hEffectEntity; // 0x04DC
    uint32_t m_bOnFire; // 0x0515
    float m_CreationTime; // 0x0518
    uint32_t m_RealClassName; // 0x051C
    uint32_t m_OverrideMaterial; // 0x0520
    uint32_t m_OverrideSubMaterials[0]; // 0x0528
    uint32_t m_spawnflags; // 0x0640
    uint32_t m_iGModFlags; // 0x0644
    uintptr_t m_GMOD_bool[32]; // 0x06A0
    uintptr_t m_GMOD_float[32]; // 0x06C0
    uintptr_t m_GMOD_int[32]; // 0x0740
    uintptr_t m_GMOD_Vector[32]; // 0x07C0
    uintptr_t m_GMOD_QAngle[32]; // 0x0940
    uintptr_t m_GMOD_EHANDLE[32]; // 0x0AC0
    const char* m_GMOD_String0; // 0x0B40
    const char* m_GMOD_String1; // 0x0D40
    const char* m_GMOD_String2; // 0x0F40
    const char* m_GMOD_String3; // 0x1140
    int64_t m_GMOD_DataTable; // 0x1340
    uint32_t m_iCreationID; // 0x1388
    uint32_t m_iMapCreatedID; // 0x138C
    uint32_t m_nSkin; // 0x1398
    uint32_t m_nBody; // 0x139C
    uint32_t m_nHitboxSet; // 0x13A0
    float m_flPlaybackRate; // 0x13C0
    fVector3 m_vecForce; // 0x13CC
    uint32_t m_nForceBone; // 0x13D8
    uint32_t m_bClientSideFrameReset; // 0x140C
    float m_fadeMinDist; // 0x1444
    float m_fadeMaxDist; // 0x1448
    float m_flFadeScale; // 0x144C
    float m_flModelScale; // 0x149C
    float m_flModelWidthScale; // 0x149C
    uintptr_t m_flPoseParameter[24]; // 0x14A0
    uintptr_t m_flEncodedController[4]; // 0x15BC
    uint32_t m_bClientSideAnimation; // 0x160C
    uint32_t m_nNewSequenceParity; // 0x1610
    uint32_t m_nResetEventsParity; // 0x1614
    uint32_t m_nSequence; // 0x163C
    float m_flCycle; // 0x1644
    uint32_t m_hLightingOrigin; // 0x16C4
    uint32_t m_hLightingOriginRelative; // 0x16C8
    uint32_t m_nMuzzleFlashParity; // 0x16CC
    fVector3 m_OverrideViewTarget; // 0x16EC
    uint32_t m_pBoneManipulator; // 0x1778
    uint32_t m_pFlexManipulator; // 0x1780
    uint32_t m_hOwner; // 0x17D8
    uint32_t m_nViewModelIndex; // 0x17E0
    float m_flNextPrimaryAttack; // 0x17E4
    float m_flNextSecondaryAttack; // 0x17E8
    float m_flTimeWeaponIdle; // 0x17EC
    uint32_t m_iViewModelIndex; // 0x17F4
    uint32_t m_iWorldModelIndex; // 0x17F8
    uint32_t m_iState; // 0x1818
    uint32_t m_iPrimaryAmmoType; // 0x1820
    uint32_t m_iSecondaryAmmoType; // 0x1824
    uint32_t m_iClip1; // 0x1828
    uint32_t m_iClip2; // 0x182C
    uint32_t m_bFlipViewModel; // 0x1858
    uint32_t m_nShotsFired; // 0x18B8
};

class CWeapon357 // parent CBaseEntity {
public:
    void* m_OverrideSubMaterials; // 0x0000
    uint32_t movecollide; // 0x0000
    uint32_t movetype; // 0x0000
    uint32_t m_nRenderFX; // 0x0054
    uint32_t m_clrRender; // 0x0058
    uint32_t m_flAnimTime; // 0x0060
    uint32_t m_flSimulationTime; // 0x0068
    uint32_t m_ubInterpolationFrame; // 0x0074
    uint32_t m_fEffects; // 0x0078
    uint32_t m_nRenderMode; // 0x007C
    uint32_t m_nNextThinkTick; // 0x0084
    uint32_t m_nModelIndex; // 0x008C
    uint32_t m_takedamage; // 0x008E
    uint32_t m_iHealth; // 0x0090
    uint32_t m_iMaxHealth; // 0x0094
    uint32_t m_iTeamNum; // 0x009C
    uint32_t m_PredictableID; // 0x00A0
    float m_vecVelocity[0]; // 0x00F4
    float m_vecVelocity[1]; // 0x00F8
    float m_vecVelocity[2]; // 0x00FC
    uint32_t m_iParentAttachment; // 0x017A
    uint32_t moveparent; // 0x0190
    fVector3 m_vecMinsPreScaled; // 0x01A4
    fVector3 m_vecMaxsPreScaled; // 0x01B0
    fVector3 m_vecMins; // 0x01BC
    fVector3 m_vecMaxs; // 0x01C8
    uint32_t m_usSolidFlags; // 0x01D8
    uint32_t m_nSurroundType; // 0x01DC
    uint32_t m_nSolidType; // 0x01DD
    uint32_t m_triggerBloat; // 0x01DE
    fVector3 m_vecSpecifiedSurroundingMinsPreScaled; // 0x01E0
    fVector3 m_vecSpecifiedSurroundingMaxsPreScaled; // 0x01EC
    fVector3 m_vecSpecifiedSurroundingMins; // 0x01F8
    fVector3 m_vecSpecifiedSurroundingMaxs; // 0x0204
    float m_flElasticity; // 0x0248
    float m_flShadowCastDistance; // 0x024C
    fVector3 m_vecOrigin; // 0x0338
    fVector3 m_angRotation; // 0x0344
    uint32_t m_CollisionGroup; // 0x0354
    uint32_t m_bIsPlayerSimulated; // 0x04C8
    uint32_t m_bSimulatedEveryTick; // 0x04C9
    uint32_t m_bAnimatedEveryTick; // 0x04CA
    uint32_t m_bAlternateSorting; // 0x04CB
    uint32_t m_iTextureFrameIndex; // 0x04CC
    uint32_t m_hOwnerEntity; // 0x04D8
    uint32_t m_hEffectEntity; // 0x04DC
    uint32_t m_bOnFire; // 0x0515
    float m_CreationTime; // 0x0518
    uint32_t m_RealClassName; // 0x051C
    uint32_t m_OverrideMaterial; // 0x0520
    uint32_t m_OverrideSubMaterials[0]; // 0x0528
    uint32_t m_spawnflags; // 0x0640
    uint32_t m_iGModFlags; // 0x0644
    uintptr_t m_GMOD_bool[32]; // 0x06A0
    uintptr_t m_GMOD_float[32]; // 0x06C0
    uintptr_t m_GMOD_int[32]; // 0x0740
    uintptr_t m_GMOD_Vector[32]; // 0x07C0
    uintptr_t m_GMOD_QAngle[32]; // 0x0940
    uintptr_t m_GMOD_EHANDLE[32]; // 0x0AC0
    const char* m_GMOD_String0; // 0x0B40
    const char* m_GMOD_String1; // 0x0D40
    const char* m_GMOD_String2; // 0x0F40
    const char* m_GMOD_String3; // 0x1140
    int64_t m_GMOD_DataTable; // 0x1340
    uint32_t m_iCreationID; // 0x1388
    uint32_t m_iMapCreatedID; // 0x138C
    uint32_t m_nSkin; // 0x1398
    uint32_t m_nBody; // 0x139C
    uint32_t m_nHitboxSet; // 0x13A0
    float m_flPlaybackRate; // 0x13C0
    fVector3 m_vecForce; // 0x13CC
    uint32_t m_nForceBone; // 0x13D8
    uint32_t m_bClientSideFrameReset; // 0x140C
    float m_fadeMinDist; // 0x1444
    float m_fadeMaxDist; // 0x1448
    float m_flFadeScale; // 0x144C
    float m_flModelScale; // 0x149C
    float m_flModelWidthScale; // 0x149C
    uintptr_t m_flPoseParameter[24]; // 0x14A0
    uintptr_t m_flEncodedController[4]; // 0x15BC
    uint32_t m_bClientSideAnimation; // 0x160C
    uint32_t m_nNewSequenceParity; // 0x1610
    uint32_t m_nResetEventsParity; // 0x1614
    uint32_t m_nSequence; // 0x163C
    float m_flCycle; // 0x1644
    uint32_t m_hLightingOrigin; // 0x16C4
    uint32_t m_hLightingOriginRelative; // 0x16C8
    uint32_t m_nMuzzleFlashParity; // 0x16CC
    fVector3 m_OverrideViewTarget; // 0x16EC
    uint32_t m_pBoneManipulator; // 0x1778
    uint32_t m_pFlexManipulator; // 0x1780
    uint32_t m_hOwner; // 0x17D8
    uint32_t m_nViewModelIndex; // 0x17E0
    float m_flNextPrimaryAttack; // 0x17E4
    float m_flNextSecondaryAttack; // 0x17E8
    float m_flTimeWeaponIdle; // 0x17EC
    uint32_t m_iViewModelIndex; // 0x17F4
    uint32_t m_iWorldModelIndex; // 0x17F8
    uint32_t m_iState; // 0x1818
    uint32_t m_iPrimaryAmmoType; // 0x1820
    uint32_t m_iSecondaryAmmoType; // 0x1824
    uint32_t m_iClip1; // 0x1828
    uint32_t m_iClip2; // 0x182C
    uint32_t m_bFlipViewModel; // 0x1858
};

class CPhysicsPropMultiplayer // parent CBaseEntity {
public:
    uint32_t movecollide; // 0x0000
    uint32_t movetype; // 0x0000
    void* m_OverrideSubMaterials; // 0x0000
    uint32_t m_nRenderFX; // 0x0054
    uint32_t m_clrRender; // 0x0058
    uint32_t m_flAnimTime; // 0x0060
    uint32_t m_flSimulationTime; // 0x0068
    uint32_t m_ubInterpolationFrame; // 0x0074
    uint32_t m_fEffects; // 0x0078
    uint32_t m_nRenderMode; // 0x007C
    uint32_t m_nModelIndex; // 0x008C
    uint32_t m_takedamage; // 0x008E
    uint32_t m_iHealth; // 0x0090
    uint32_t m_iMaxHealth; // 0x0094
    uint32_t m_iTeamNum; // 0x009C
    uint32_t m_PredictableID; // 0x00A0
    float m_vecVelocity[0]; // 0x00F4
    float m_vecVelocity[1]; // 0x00F8
    float m_vecVelocity[2]; // 0x00FC
    uint32_t m_iParentAttachment; // 0x017A
    uint32_t moveparent; // 0x0190
    fVector3 m_vecMinsPreScaled; // 0x01A4
    fVector3 m_vecMaxsPreScaled; // 0x01B0
    fVector3 m_vecMins; // 0x01BC
    fVector3 m_vecMaxs; // 0x01C8
    uint32_t m_usSolidFlags; // 0x01D8
    uint32_t m_nSurroundType; // 0x01DC
    uint32_t m_nSolidType; // 0x01DD
    uint32_t m_triggerBloat; // 0x01DE
    fVector3 m_vecSpecifiedSurroundingMinsPreScaled; // 0x01E0
    fVector3 m_vecSpecifiedSurroundingMaxsPreScaled; // 0x01EC
    fVector3 m_vecSpecifiedSurroundingMins; // 0x01F8
    fVector3 m_vecSpecifiedSurroundingMaxs; // 0x0204
    float m_flElasticity; // 0x0248
    float m_flShadowCastDistance; // 0x024C
    fVector3 m_vecOrigin; // 0x0338
    fVector3 m_angRotation; // 0x0344
    uint32_t m_CollisionGroup; // 0x0354
    uint32_t m_bIsPlayerSimulated; // 0x04C8
    uint32_t m_bSimulatedEveryTick; // 0x04C9
    uint32_t m_bAnimatedEveryTick; // 0x04CA
    uint32_t m_bAlternateSorting; // 0x04CB
    uint32_t m_iTextureFrameIndex; // 0x04CC
    uint32_t m_hOwnerEntity; // 0x04D8
    uint32_t m_hEffectEntity; // 0x04DC
    uint32_t m_bOnFire; // 0x0515
    float m_CreationTime; // 0x0518
    uint32_t m_RealClassName; // 0x051C
    uint32_t m_OverrideMaterial; // 0x0520
    uint32_t m_OverrideSubMaterials[0]; // 0x0528
    uint32_t m_spawnflags; // 0x0640
    uint32_t m_iGModFlags; // 0x0644
    uintptr_t m_GMOD_bool[32]; // 0x06A0
    uintptr_t m_GMOD_float[32]; // 0x06C0
    uintptr_t m_GMOD_int[32]; // 0x0740
    uintptr_t m_GMOD_Vector[32]; // 0x07C0
    uintptr_t m_GMOD_QAngle[32]; // 0x0940
    uintptr_t m_GMOD_EHANDLE[32]; // 0x0AC0
    const char* m_GMOD_String0; // 0x0B40
    const char* m_GMOD_String1; // 0x0D40
    const char* m_GMOD_String2; // 0x0F40
    const char* m_GMOD_String3; // 0x1140
    int64_t m_GMOD_DataTable; // 0x1340
    uint32_t m_iCreationID; // 0x1388
    uint32_t m_iMapCreatedID; // 0x138C
    uint32_t m_nSkin; // 0x1398
    uint32_t m_nBody; // 0x139C
    uint32_t m_nHitboxSet; // 0x13A0
    float m_flPlaybackRate; // 0x13C0
    fVector3 m_vecForce; // 0x13CC
    uint32_t m_nForceBone; // 0x13D8
    uint32_t m_bClientSideFrameReset; // 0x140C
    float m_fadeMinDist; // 0x1444
    float m_fadeMaxDist; // 0x1448
    float m_flFadeScale; // 0x144C
    float m_flModelScale; // 0x149C
    float m_flModelWidthScale; // 0x149C
    uintptr_t m_flPoseParameter[24]; // 0x14A0
    uintptr_t m_flEncodedController[4]; // 0x15BC
    uint32_t m_bClientSideAnimation; // 0x160C
    uint32_t m_nNewSequenceParity; // 0x1610
    uint32_t m_nResetEventsParity; // 0x1614
    uint32_t m_nSequence; // 0x163C
    float m_flCycle; // 0x1644
    uint32_t m_hLightingOrigin; // 0x16C4
    uint32_t m_hLightingOriginRelative; // 0x16C8
    uint32_t m_nMuzzleFlashParity; // 0x16CC
    fVector3 m_OverrideViewTarget; // 0x16EC
    uint32_t m_pBoneManipulator; // 0x1778
    uint32_t m_pFlexManipulator; // 0x1780
    uint32_t m_bAwake; // 0x17D8
    uint32_t m_iPhysicsMode; // 0x17E4
    float m_fMass; // 0x17E8
    fVector3 m_collisionMins; // 0x17EC
    fVector3 m_collisionMaxs; // 0x17F8
};

class CHL2MPGameRulesProxy // parent CGameRulesProxy {
public:
    uint32_t m_bTeamPlayEnabled; // 0x0020
};

class CTEHL2MPFireBullets {
public:
    uint32_t m_iPlayer; // 0x0010
    fVector3 m_vecOrigin; // 0x0014
    fVector3 m_vecDir; // 0x0020
    uint32_t m_iAmmoID; // 0x002C
    uint32_t m_iWeaponIndex; // 0x0030
    uint32_t m_iSeed; // 0x0034
    float m_flSpread; // 0x0038
    uint32_t m_iShots; // 0x003C
    uint32_t m_bDoImpacts; // 0x0040
    uint32_t m_bDoTracers; // 0x0041
    float m_flSpreadY; // 0x0044
    const char* m_TracerType; // 0x0048
};

class CBaseGrenade // parent CBaseEntity {
public:
    uint32_t movecollide; // 0x0000
    void* m_OverrideSubMaterials; // 0x0000
    uint32_t movetype; // 0x0000
    uint32_t m_nRenderFX; // 0x0054
    uint32_t m_clrRender; // 0x0058
    uint32_t m_flAnimTime; // 0x0060
    uint32_t m_flSimulationTime; // 0x0068
    uint32_t m_ubInterpolationFrame; // 0x0074
    uint32_t m_fEffects; // 0x0078
    uint32_t m_nRenderMode; // 0x007C
    uint32_t m_nModelIndex; // 0x008C
    uint32_t m_takedamage; // 0x008E
    uint32_t m_iHealth; // 0x0090
    uint32_t m_iMaxHealth; // 0x0094
    uint32_t m_iTeamNum; // 0x009C
    uint32_t m_PredictableID; // 0x00A0
    float m_vecVelocity[0]; // 0x00F4
    fVector3 m_vecVelocity; // 0x00F4
    float m_vecVelocity[1]; // 0x00F8
    float m_vecVelocity[2]; // 0x00FC
    uint32_t m_iParentAttachment; // 0x017A
    uint32_t moveparent; // 0x0190
    fVector3 m_vecMinsPreScaled; // 0x01A4
    fVector3 m_vecMaxsPreScaled; // 0x01B0
    fVector3 m_vecMins; // 0x01BC
    fVector3 m_vecMaxs; // 0x01C8
    uint32_t m_usSolidFlags; // 0x01D8
    uint32_t m_nSurroundType; // 0x01DC
    uint32_t m_nSolidType; // 0x01DD
    uint32_t m_triggerBloat; // 0x01DE
    fVector3 m_vecSpecifiedSurroundingMinsPreScaled; // 0x01E0
    fVector3 m_vecSpecifiedSurroundingMaxsPreScaled; // 0x01EC
    fVector3 m_vecSpecifiedSurroundingMins; // 0x01F8
    fVector3 m_vecSpecifiedSurroundingMaxs; // 0x0204
    float m_flElasticity; // 0x0248
    float m_flShadowCastDistance; // 0x024C
    fVector3 m_vecOrigin; // 0x0338
    fVector3 m_angRotation; // 0x0344
    uint32_t m_fFlags; // 0x0350
    uint32_t m_CollisionGroup; // 0x0354
    uint32_t m_bIsPlayerSimulated; // 0x04C8
    uint32_t m_bSimulatedEveryTick; // 0x04C9
    uint32_t m_bAnimatedEveryTick; // 0x04CA
    uint32_t m_bAlternateSorting; // 0x04CB
    uint32_t m_iTextureFrameIndex; // 0x04CC
    uint32_t m_hOwnerEntity; // 0x04D8
    uint32_t m_hEffectEntity; // 0x04DC
    uint32_t m_bOnFire; // 0x0515
    float m_CreationTime; // 0x0518
    uint32_t m_RealClassName; // 0x051C
    uint32_t m_OverrideMaterial; // 0x0520
    uint32_t m_OverrideSubMaterials[0]; // 0x0528
    uint32_t m_spawnflags; // 0x0640
    uint32_t m_iGModFlags; // 0x0644
    uintptr_t m_GMOD_bool[32]; // 0x06A0
    uintptr_t m_GMOD_float[32]; // 0x06C0
    uintptr_t m_GMOD_int[32]; // 0x0740
    uintptr_t m_GMOD_Vector[32]; // 0x07C0
    uintptr_t m_GMOD_QAngle[32]; // 0x0940
    uintptr_t m_GMOD_EHANDLE[32]; // 0x0AC0
    const char* m_GMOD_String0; // 0x0B40
    const char* m_GMOD_String1; // 0x0D40
    const char* m_GMOD_String2; // 0x0F40
    const char* m_GMOD_String3; // 0x1140
    int64_t m_GMOD_DataTable; // 0x1340
    uint32_t m_iCreationID; // 0x1388
    uint32_t m_iMapCreatedID; // 0x138C
    uint32_t m_nSkin; // 0x1398
    uint32_t m_nBody; // 0x139C
    uint32_t m_nHitboxSet; // 0x13A0
    float m_flPlaybackRate; // 0x13C0
    fVector3 m_vecForce; // 0x13CC
    uint32_t m_nForceBone; // 0x13D8
    uint32_t m_bClientSideFrameReset; // 0x140C
    float m_fadeMinDist; // 0x1444
    float m_fadeMaxDist; // 0x1448
    float m_flFadeScale; // 0x144C
    float m_flModelScale; // 0x149C
    float m_flModelWidthScale; // 0x149C
    uintptr_t m_flPoseParameter[24]; // 0x14A0
    uintptr_t m_flEncodedController[4]; // 0x15BC
    uint32_t m_bClientSideAnimation; // 0x160C
    uint32_t m_nNewSequenceParity; // 0x1610
    uint32_t m_nResetEventsParity; // 0x1614
    uint32_t m_nSequence; // 0x163C
    float m_flCycle; // 0x1644
    uint32_t m_hLightingOrigin; // 0x16C4
    uint32_t m_hLightingOriginRelative; // 0x16C8
    uint32_t m_nMuzzleFlashParity; // 0x16CC
    fVector3 m_OverrideViewTarget; // 0x16EC
    uint32_t m_pBoneManipulator; // 0x1778
    uint32_t m_pFlexManipulator; // 0x1780
    uint32_t m_bIsLive; // 0x17D9
    float m_DmgRadius; // 0x17DC
    float m_flDamage; // 0x17EC
    uint32_t m_hThrower; // 0x17F8
};

class CTEPlayerAnimEvent {
public:
    uint32_t m_hPlayer; // 0x0010
    uint32_t m_iEvent; // 0x0014
    uint32_t m_nData; // 0x0018
};

class CHL2MPRagdoll {
public:
    uint32_t m_nModelIndex; // 0x008C
    fVector3 m_vecForce; // 0x13CC
    uint32_t m_nForceBone; // 0x13D8
    uint32_t m_hPlayer; // 0x1840
    fVector3 m_vecRagdollVelocity; // 0x1844
    fVector3 m_vecRagdollOrigin; // 0x1850
};

class CHL2MP_Player // parent CBaseEntity {
public:
    void* m_OverrideSubMaterials; // 0x0000
    void* m_hViewModel; // 0x0000
    uint32_t m_nSequence; // 0x0000
    uint32_t lengthprop15; // 0x0000
    uint32_t movetype; // 0x0000
    uint32_t movecollide; // 0x0000
    float m_flPrevCycle; // 0x0004
    float m_flWeight; // 0x0008
    uint32_t m_nOrder; // 0x000C
    float m_flCycle; // 0x0014
    uint32_t m_nRenderFX; // 0x0054
    uint32_t m_clrRender; // 0x0058
    uint32_t m_flAnimTime; // 0x0060
    uint32_t m_flSimulationTime; // 0x0068
    uint32_t m_ubInterpolationFrame; // 0x0074
    uint32_t m_fEffects; // 0x0078
    uint32_t m_nRenderMode; // 0x007C
    uint32_t m_nNextThinkTick; // 0x0084
    uint32_t m_nModelIndex; // 0x008C
    uint32_t m_takedamage; // 0x008E
    uint32_t m_lifeState; // 0x008F
    uint32_t m_iHealth; // 0x0090
    uint32_t m_iMaxHealth; // 0x0094
    uint32_t m_iTeamNum; // 0x009C
    uint32_t m_PredictableID; // 0x00A0
    float m_vecViewOffset[0]; // 0x00E8
    float m_vecViewOffset[1]; // 0x00EC
    float m_vecViewOffset[2]; // 0x00F0
    float m_vecVelocity[0]; // 0x00F4
    float m_vecVelocity[1]; // 0x00F8
    float m_vecVelocity[2]; // 0x00FC
    fVector3 m_vecBaseVelocity; // 0x0158
    uint32_t m_iParentAttachment; // 0x017A
    uint32_t moveparent; // 0x0190
    fVector3 m_vecMinsPreScaled; // 0x01A4
    fVector3 m_vecMaxsPreScaled; // 0x01B0
    fVector3 m_vecMins; // 0x01BC
    fVector3 m_vecMaxs; // 0x01C8
    uint32_t m_usSolidFlags; // 0x01D8
    uint32_t m_nSurroundType; // 0x01DC
    uint32_t m_nSolidType; // 0x01DD
    uint32_t m_triggerBloat; // 0x01DE
    fVector3 m_vecSpecifiedSurroundingMinsPreScaled; // 0x01E0
    fVector3 m_vecSpecifiedSurroundingMaxsPreScaled; // 0x01EC
    fVector3 m_vecSpecifiedSurroundingMins; // 0x01F8
    fVector3 m_vecSpecifiedSurroundingMaxs; // 0x0204
    float m_flElasticity; // 0x0248
    float m_flShadowCastDistance; // 0x024C
    uint32_t m_hGroundEntity; // 0x0254
    float m_flFriction; // 0x025C
    fVector3 m_vecOrigin; // 0x0338
    fVector3 m_angRotation; // 0x0344
    uint32_t m_fFlags; // 0x0350
    uint32_t m_CollisionGroup; // 0x0354
    uint32_t m_bIsPlayerSimulated; // 0x04C8
    uint32_t m_bSimulatedEveryTick; // 0x04C9
    uint32_t m_bAnimatedEveryTick; // 0x04CA
    uint32_t m_bAlternateSorting; // 0x04CB
    uint32_t m_iTextureFrameIndex; // 0x04CC
    uint32_t m_hOwnerEntity; // 0x04D8
    uint32_t m_hEffectEntity; // 0x04DC
    uint32_t m_bOnFire; // 0x0515
    float m_CreationTime; // 0x0518
    uint32_t m_RealClassName; // 0x051C
    uint32_t m_OverrideMaterial; // 0x0520
    uint32_t m_OverrideSubMaterials[0]; // 0x0528
    uint32_t m_spawnflags; // 0x0640
    uint32_t m_iGModFlags; // 0x0644
    uintptr_t m_GMOD_bool[32]; // 0x06A0
    uintptr_t m_GMOD_float[32]; // 0x06C0
    uintptr_t m_GMOD_int[32]; // 0x0740
    uintptr_t m_GMOD_Vector[32]; // 0x07C0
    uintptr_t m_GMOD_QAngle[32]; // 0x0940
    uintptr_t m_GMOD_EHANDLE[32]; // 0x0AC0
    const char* m_GMOD_String0; // 0x0B40
    const char* m_GMOD_String1; // 0x0D40
    const char* m_GMOD_String2; // 0x0F40
    const char* m_GMOD_String3; // 0x1140
    int64_t m_GMOD_DataTable; // 0x1340
    uint32_t m_iCreationID; // 0x1388
    uint32_t m_iMapCreatedID; // 0x138C
    uint32_t m_nSkin; // 0x1398
    uint32_t m_nBody; // 0x139C
    uint32_t m_nHitboxSet; // 0x13A0
    float m_flPlaybackRate; // 0x13C0
    fVector3 m_vecForce; // 0x13CC
    uint32_t m_nForceBone; // 0x13D8
    uint32_t m_bClientSideFrameReset; // 0x140C
    float m_fadeMinDist; // 0x1444
    float m_fadeMaxDist; // 0x1448
    float m_flFadeScale; // 0x144C
    float m_flModelScale; // 0x149C
    float m_flModelWidthScale; // 0x149C
    uintptr_t m_flPoseParameter[24]; // 0x14A0
    uintptr_t m_flEncodedController[4]; // 0x15BC
    uint32_t m_bClientSideAnimation; // 0x160C
    uint32_t m_nNewSequenceParity; // 0x1610
    uint32_t m_nResetEventsParity; // 0x1614
    uint32_t m_hLightingOrigin; // 0x16C4
    uint32_t m_hLightingOriginRelative; // 0x16C8
    uint32_t m_nMuzzleFlashParity; // 0x16CC
    fVector3 m_OverrideViewTarget; // 0x16EC
    uint32_t m_pBoneManipulator; // 0x1778
    uint32_t m_pFlexManipulator; // 0x1780
    fVector3 m_viewtarget; // 0x1844
    uintptr_t m_flexWeight[96]; // 0x1880
    uint32_t m_blinktoggle; // 0x1A30
    fVector3 m_vecLean; // 0x1B9C
    fVector3 m_vecShift; // 0x1BD8
    float m_flNextAttack; // 0x1C18
    uint32_t m_bloodColor; // 0x1C1C
    uintptr_t m_iAmmo[256]; // 0x1C20
    uintptr_t m_hMyWeapons[256]; // 0x2020
    uint32_t m_hActiveWeapon; // 0x2420
    uintptr_t m_chAreaBits[32]; // 0x2490
    uintptr_t m_chAreaPortalBits[24]; // 0x24B0
    uint32_t m_iHideHUD; // 0x24C8
    float m_flFOVRate; // 0x24CC
    uint32_t m_bDucked; // 0x24D0
    uint32_t m_bDucking; // 0x24D1
    uint32_t m_bInDuckJump; // 0x24D2
    float m_flDucktime; // 0x24D4
    float m_flDuckJumpTime; // 0x24D8
    float m_flJumpTime; // 0x24DC
    float m_flFallVelocity; // 0x24E4
    fVector3 m_vecPunchAngle; // 0x24F8
    fVector3 m_vecPunchAngleVel; // 0x2534
    uint32_t m_bDrawViewmodel; // 0x2570
    uint32_t m_bWearingSuit; // 0x2571
    uint32_t m_bPoisoned; // 0x2572
    float m_flStepSize; // 0x2574
    uint32_t m_bAllowAutoMovement; // 0x2578
    uint32_t m_skybox3d.scale; // 0x2580
    fVector3 m_skybox3d.origin; // 0x2584
    uint32_t m_skybox3d.area; // 0x2590
    fVector3 m_skybox3d.fog.dirPrimary; // 0x2598
    uint32_t m_skybox3d.fog.colorPrimary; // 0x25A4
    uint32_t m_skybox3d.fog.colorSecondary; // 0x25A8
    uint32_t m_skybox3d.fog.colorPrimaryHDR; // 0x25AC
    uint32_t m_skybox3d.fog.colorSecondaryHDR; // 0x25B0
    float m_skybox3d.fog.start; // 0x25BC
    float m_skybox3d.fog.end; // 0x25C0
    float m_skybox3d.fog.maxdensity; // 0x25C8
    uint32_t m_skybox3d.fog.enable; // 0x25E0
    uint32_t m_skybox3d.fog.blend; // 0x25E1
    uint32_t m_skybox3d.fog.radial; // 0x25E2
    float m_skybox3d.fog.HDRColorScale; // 0x25E4
    uint32_t m_PlayerFog.m_hCtrl; // 0x25EC
    fVector3 m_audio.localSound[0]; // 0x2610
    fVector3 m_audio.localSound[1]; // 0x261C
    fVector3 m_audio.localSound[2]; // 0x2628
    fVector3 m_audio.localSound[3]; // 0x2634
    fVector3 m_audio.localSound[4]; // 0x2640
    fVector3 m_audio.localSound[5]; // 0x264C
    fVector3 m_audio.localSound[6]; // 0x2658
    fVector3 m_audio.localSound[7]; // 0x2664
    uint32_t m_audio.soundscapeIndex; // 0x2670
    uint32_t m_audio.localBits; // 0x2674
    uint32_t m_audio.ent; // 0x2678
    float m_fSprintSpeed; // 0x2680
    float m_fWalkSpeed; // 0x2684
    float m_fSlowWalkSpeed; // 0x2688
    float m_fLadderSpeed; // 0x268C
    float m_fCrouchedWalkSpeed; // 0x2690
    float m_fDuckSpeed; // 0x2694
    float m_fUnDuckSpeed; // 0x2698
    uint32_t m_bDuckToggled; // 0x269C
    uint32_t m_hTonemapController; // 0x26A0
    uint32_t deadflag; // 0x26A8
    float m_iFOV; // 0x26B8
    float m_iFOVStart; // 0x26BC
    float m_flFOVTime; // 0x26C0
    float m_iDefaultFOV; // 0x26C4
    uint32_t m_hZoomOwner; // 0x26C8
    uint32_t m_fOnTarget; // 0x26D4
    uint32_t m_hConstraintEntity; // 0x270C
    fVector3 m_vecConstraintCenter; // 0x2710
    float m_flConstraintRadius; // 0x271C
    float m_flConstraintWidth; // 0x2720
    float m_flConstraintSpeedFactor; // 0x2724
    uint32_t m_iObserverMode; // 0x2728
    uint32_t m_hObserverTarget; // 0x272C
    float m_flDeathTime; // 0x274C
    uint32_t m_hVehicle; // 0x2758
    uint32_t m_hUseEntity; // 0x2760
    float m_flMaxspeed; // 0x2764
    uint32_t m_nTickBase; // 0x27D0
    uint32_t m_bUseWeaponsInVehicle; // 0x27E2
    uint32_t m_hLastWeapon; // 0x27E8
    uint32_t m_hViewModel[0]; // 0x2800
    float m_flLaggedMovementValue; // 0x2DAC
    const char* m_szLastPlaceName; // 0x2DCC
    uint32_t m_hColorCorrectionCtrl; // 0x2F4C
    uint32_t m_hViewEntity; // 0x2F74
    uint32_t m_bDisableWorldClicking; // 0x2FA8
    float m_flSuitPower; // 0x2FB4
    uint32_t m_bZooming; // 0x2FB8
    uint32_t m_bitsActiveDevices; // 0x2FBC
    uint32_t m_iSquadMemberCount; // 0x2FC0
    uint32_t m_iSquadMedicCount; // 0x2FC4
    uint32_t m_fSquadInFollowMode; // 0x2FC8
    uint32_t m_bWeaponLowered; // 0x2FC9
    uint32_t m_hAutoAimTarget; // 0x2FCC
    fVector3 m_vecAutoAimPoint; // 0x2FD0
    uint32_t m_bDisplayReticle; // 0x2FDC
    uint32_t m_bStickyAutoAim; // 0x2FDD
    uint32_t m_bAutoAimTarget; // 0x2FDE
    uint32_t m_hLadder; // 0x2FE0
    uint32_t m_fIsSprinting; // 0x3018
    float m_angEyeAngles[0]; // 0x3040
    float m_angEyeAngles[1]; // 0x3044
    uint32_t m_hRagdoll; // 0x307C
    uint32_t m_iSpawnInterpCounter; // 0x30C0
    uint32_t m_iPlayerSoundType; // 0x30C8
    uint32_t m_fIsWalking; // 0x30D8
};

class CWeaponBugBait // parent CBaseEntity {
public:
    uint32_t movetype; // 0x0000
    void* m_OverrideSubMaterials; // 0x0000
    uint32_t movecollide; // 0x0000
    uint32_t m_nRenderFX; // 0x0054
    uint32_t m_clrRender; // 0x0058
    uint32_t m_flAnimTime; // 0x0060
    uint32_t m_flSimulationTime; // 0x0068
    uint32_t m_ubInterpolationFrame; // 0x0074
    uint32_t m_fEffects; // 0x0078
    uint32_t m_nRenderMode; // 0x007C
    uint32_t m_nNextThinkTick; // 0x0084
    uint32_t m_nModelIndex; // 0x008C
    uint32_t m_takedamage; // 0x008E
    uint32_t m_iHealth; // 0x0090
    uint32_t m_iMaxHealth; // 0x0094
    uint32_t m_iTeamNum; // 0x009C
    uint32_t m_PredictableID; // 0x00A0
    float m_vecVelocity[0]; // 0x00F4
    float m_vecVelocity[1]; // 0x00F8
    float m_vecVelocity[2]; // 0x00FC
    uint32_t m_iParentAttachment; // 0x017A
    uint32_t moveparent; // 0x0190
    fVector3 m_vecMinsPreScaled; // 0x01A4
    fVector3 m_vecMaxsPreScaled; // 0x01B0
    fVector3 m_vecMins; // 0x01BC
    fVector3 m_vecMaxs; // 0x01C8
    uint32_t m_usSolidFlags; // 0x01D8
    uint32_t m_nSurroundType; // 0x01DC
    uint32_t m_nSolidType; // 0x01DD
    uint32_t m_triggerBloat; // 0x01DE
    fVector3 m_vecSpecifiedSurroundingMinsPreScaled; // 0x01E0
    fVector3 m_vecSpecifiedSurroundingMaxsPreScaled; // 0x01EC
    fVector3 m_vecSpecifiedSurroundingMins; // 0x01F8
    fVector3 m_vecSpecifiedSurroundingMaxs; // 0x0204
    float m_flElasticity; // 0x0248
    float m_flShadowCastDistance; // 0x024C
    fVector3 m_vecOrigin; // 0x0338
    fVector3 m_angRotation; // 0x0344
    uint32_t m_CollisionGroup; // 0x0354
    uint32_t m_bIsPlayerSimulated; // 0x04C8
    uint32_t m_bSimulatedEveryTick; // 0x04C9
    uint32_t m_bAnimatedEveryTick; // 0x04CA
    uint32_t m_bAlternateSorting; // 0x04CB
    uint32_t m_iTextureFrameIndex; // 0x04CC
    uint32_t m_hOwnerEntity; // 0x04D8
    uint32_t m_hEffectEntity; // 0x04DC
    uint32_t m_bOnFire; // 0x0515
    float m_CreationTime; // 0x0518
    uint32_t m_RealClassName; // 0x051C
    uint32_t m_OverrideMaterial; // 0x0520
    uint32_t m_OverrideSubMaterials[0]; // 0x0528
    uint32_t m_spawnflags; // 0x0640
    uint32_t m_iGModFlags; // 0x0644
    uintptr_t m_GMOD_bool[32]; // 0x06A0
    uintptr_t m_GMOD_float[32]; // 0x06C0
    uintptr_t m_GMOD_int[32]; // 0x0740
    uintptr_t m_GMOD_Vector[32]; // 0x07C0
    uintptr_t m_GMOD_QAngle[32]; // 0x0940
    uintptr_t m_GMOD_EHANDLE[32]; // 0x0AC0
    const char* m_GMOD_String0; // 0x0B40
    const char* m_GMOD_String1; // 0x0D40
    const char* m_GMOD_String2; // 0x0F40
    const char* m_GMOD_String3; // 0x1140
    int64_t m_GMOD_DataTable; // 0x1340
    uint32_t m_iCreationID; // 0x1388
    uint32_t m_iMapCreatedID; // 0x138C
    uint32_t m_nSkin; // 0x1398
    uint32_t m_nBody; // 0x139C
    uint32_t m_nHitboxSet; // 0x13A0
    float m_flPlaybackRate; // 0x13C0
    fVector3 m_vecForce; // 0x13CC
    uint32_t m_nForceBone; // 0x13D8
    uint32_t m_bClientSideFrameReset; // 0x140C
    float m_fadeMinDist; // 0x1444
    float m_fadeMaxDist; // 0x1448
    float m_flFadeScale; // 0x144C
    float m_flModelScale; // 0x149C
    float m_flModelWidthScale; // 0x149C
    uintptr_t m_flPoseParameter[24]; // 0x14A0
    uintptr_t m_flEncodedController[4]; // 0x15BC
    uint32_t m_bClientSideAnimation; // 0x160C
    uint32_t m_nNewSequenceParity; // 0x1610
    uint32_t m_nResetEventsParity; // 0x1614
    uint32_t m_nSequence; // 0x163C
    float m_flCycle; // 0x1644
    uint32_t m_hLightingOrigin; // 0x16C4
    uint32_t m_hLightingOriginRelative; // 0x16C8
    uint32_t m_nMuzzleFlashParity; // 0x16CC
    fVector3 m_OverrideViewTarget; // 0x16EC
    uint32_t m_pBoneManipulator; // 0x1778
    uint32_t m_pFlexManipulator; // 0x1780
    uint32_t m_hOwner; // 0x17D8
    uint32_t m_nViewModelIndex; // 0x17E0
    float m_flNextPrimaryAttack; // 0x17E4
    float m_flNextSecondaryAttack; // 0x17E8
    float m_flTimeWeaponIdle; // 0x17EC
    uint32_t m_iViewModelIndex; // 0x17F4
    uint32_t m_iWorldModelIndex; // 0x17F8
    uint32_t m_iState; // 0x1818
    uint32_t m_iPrimaryAmmoType; // 0x1820
    uint32_t m_iSecondaryAmmoType; // 0x1824
    uint32_t m_iClip1; // 0x1828
    uint32_t m_iClip2; // 0x182C
    uint32_t m_bFlipViewModel; // 0x1858
    uint32_t m_bDrawBackFinished; // 0x18B8
    uint32_t m_bRedraw; // 0x18B9
};

class CSpriteTrail // parent CBaseEntity {
public:
    uint32_t movecollide; // 0x0000
    uint32_t movetype; // 0x0000
    void* m_OverrideSubMaterials; // 0x0000
    uint32_t m_nRenderFX; // 0x0054
    uint32_t m_clrRender; // 0x0058
    uint32_t m_flAnimTime; // 0x0060
    uint32_t m_flSimulationTime; // 0x0068
    uint32_t m_ubInterpolationFrame; // 0x0074
    uint32_t m_fEffects; // 0x0078
    uint32_t m_nRenderMode; // 0x007C
    uint32_t m_nModelIndex; // 0x008C
    uint32_t m_takedamage; // 0x008E
    uint32_t m_iHealth; // 0x0090
    uint32_t m_iMaxHealth; // 0x0094
    uint32_t m_iTeamNum; // 0x009C
    uint32_t m_PredictableID; // 0x00A0
    float m_vecVelocity[0]; // 0x00F4
    float m_vecVelocity[1]; // 0x00F8
    float m_vecVelocity[2]; // 0x00FC
    uint32_t m_iParentAttachment; // 0x017A
    uint32_t moveparent; // 0x0190
    fVector3 m_vecMinsPreScaled; // 0x01A4
    fVector3 m_vecMaxsPreScaled; // 0x01B0
    fVector3 m_vecMins; // 0x01BC
    fVector3 m_vecMaxs; // 0x01C8
    uint32_t m_usSolidFlags; // 0x01D8
    uint32_t m_nSurroundType; // 0x01DC
    uint32_t m_nSolidType; // 0x01DD
    uint32_t m_triggerBloat; // 0x01DE
    fVector3 m_vecSpecifiedSurroundingMinsPreScaled; // 0x01E0
    fVector3 m_vecSpecifiedSurroundingMaxsPreScaled; // 0x01EC
    fVector3 m_vecSpecifiedSurroundingMins; // 0x01F8
    fVector3 m_vecSpecifiedSurroundingMaxs; // 0x0204
    float m_flElasticity; // 0x0248
    float m_flShadowCastDistance; // 0x024C
    fVector3 m_vecOrigin; // 0x0338
    fVector3 m_angRotation; // 0x0344
    uint32_t m_CollisionGroup; // 0x0354
    uint32_t m_bIsPlayerSimulated; // 0x04C8
    uint32_t m_bSimulatedEveryTick; // 0x04C9
    uint32_t m_bAnimatedEveryTick; // 0x04CA
    uint32_t m_bAlternateSorting; // 0x04CB
    uint32_t m_iTextureFrameIndex; // 0x04CC
    uint32_t m_hOwnerEntity; // 0x04D8
    uint32_t m_hEffectEntity; // 0x04DC
    uint32_t m_bOnFire; // 0x0515
    float m_CreationTime; // 0x0518
    uint32_t m_RealClassName; // 0x051C
    uint32_t m_OverrideMaterial; // 0x0520
    uint32_t m_OverrideSubMaterials[0]; // 0x0528
    uint32_t m_spawnflags; // 0x0640
    uint32_t m_iGModFlags; // 0x0644
    uintptr_t m_GMOD_bool[32]; // 0x06A0
    uintptr_t m_GMOD_float[32]; // 0x06C0
    uintptr_t m_GMOD_int[32]; // 0x0740
    uintptr_t m_GMOD_Vector[32]; // 0x07C0
    uintptr_t m_GMOD_QAngle[32]; // 0x0940
    uintptr_t m_GMOD_EHANDLE[32]; // 0x0AC0
    const char* m_GMOD_String0; // 0x0B40
    const char* m_GMOD_String1; // 0x0D40
    const char* m_GMOD_String2; // 0x0F40
    const char* m_GMOD_String3; // 0x1140
    int64_t m_GMOD_DataTable; // 0x1340
    uint32_t m_iCreationID; // 0x1388
    uint32_t m_iMapCreatedID; // 0x138C
    uint32_t m_hAttachedToEntity; // 0x13A0
    uint32_t m_nAttachment; // 0x13A4
    float m_flSpriteFramerate; // 0x13A8
    float m_flFrame; // 0x13AC
    uint32_t m_nBrightness; // 0x13B4
    float m_flBrightnessTime; // 0x13B8
    float m_flSpriteScale; // 0x13BC
    float m_flScaleTime; // 0x13C0
    uint32_t m_bWorldSpaceScale; // 0x13C4
    float m_flGlowProxySize; // 0x13C8
    float m_flHDRColorScale; // 0x13CC
    float m_flLifeTime; // 0x202C
    float m_flStartWidth; // 0x2030
    float m_flEndWidth; // 0x2034
    float m_flStartWidthVariance; // 0x2038
    float m_flTextureRes; // 0x203C
    float m_flMinFadeLength; // 0x2040
    fVector3 m_vecSkyboxOrigin; // 0x2044
    float m_flSkyboxScale; // 0x2050
};

class CCrossbowBolt // parent CBaseEntity {
public:
    uint32_t movecollide; // 0x0000
    void* m_OverrideSubMaterials; // 0x0000
    uint32_t lengthprop15; // 0x0000
    uint32_t movetype; // 0x0000
    uint32_t m_nSequence; // 0x0000
    float m_flPrevCycle; // 0x0004
    float m_flWeight; // 0x0008
    uint32_t m_nOrder; // 0x000C
    float m_flCycle; // 0x0014
    uint32_t m_nRenderFX; // 0x0054
    uint32_t m_clrRender; // 0x0058
    uint32_t m_flAnimTime; // 0x0060
    uint32_t m_flSimulationTime; // 0x0068
    uint32_t m_ubInterpolationFrame; // 0x0074
    uint32_t m_fEffects; // 0x0078
    uint32_t m_nRenderMode; // 0x007C
    uint32_t m_nModelIndex; // 0x008C
    uint32_t m_takedamage; // 0x008E
    uint32_t m_iHealth; // 0x0090
    uint32_t m_iMaxHealth; // 0x0094
    uint32_t m_iTeamNum; // 0x009C
    uint32_t m_PredictableID; // 0x00A0
    float m_vecViewOffset[0]; // 0x00E8
    float m_vecViewOffset[1]; // 0x00EC
    float m_vecViewOffset[2]; // 0x00F0
    float m_vecVelocity[0]; // 0x00F4
    float m_vecVelocity[1]; // 0x00F8
    float m_vecVelocity[2]; // 0x00FC
    uint32_t m_iParentAttachment; // 0x017A
    uint32_t moveparent; // 0x0190
    fVector3 m_vecMinsPreScaled; // 0x01A4
    fVector3 m_vecMaxsPreScaled; // 0x01B0
    fVector3 m_vecMins; // 0x01BC
    fVector3 m_vecMaxs; // 0x01C8
    uint32_t m_usSolidFlags; // 0x01D8
    uint32_t m_nSurroundType; // 0x01DC
    uint32_t m_nSolidType; // 0x01DD
    uint32_t m_triggerBloat; // 0x01DE
    fVector3 m_vecSpecifiedSurroundingMinsPreScaled; // 0x01E0
    fVector3 m_vecSpecifiedSurroundingMaxsPreScaled; // 0x01EC
    fVector3 m_vecSpecifiedSurroundingMins; // 0x01F8
    fVector3 m_vecSpecifiedSurroundingMaxs; // 0x0204
    float m_flElasticity; // 0x0248
    float m_flShadowCastDistance; // 0x024C
    fVector3 m_vecOrigin; // 0x0338
    fVector3 m_angRotation; // 0x0344
    uint32_t m_CollisionGroup; // 0x0354
    uint32_t m_bIsPlayerSimulated; // 0x04C8
    uint32_t m_bSimulatedEveryTick; // 0x04C9
    uint32_t m_bAnimatedEveryTick; // 0x04CA
    uint32_t m_bAlternateSorting; // 0x04CB
    uint32_t m_iTextureFrameIndex; // 0x04CC
    uint32_t m_hOwnerEntity; // 0x04D8
    uint32_t m_hEffectEntity; // 0x04DC
    uint32_t m_bOnFire; // 0x0515
    float m_CreationTime; // 0x0518
    uint32_t m_RealClassName; // 0x051C
    uint32_t m_OverrideMaterial; // 0x0520
    uint32_t m_OverrideSubMaterials[0]; // 0x0528
    uint32_t m_spawnflags; // 0x0640
    uint32_t m_iGModFlags; // 0x0644
    uintptr_t m_GMOD_bool[32]; // 0x06A0
    uintptr_t m_GMOD_float[32]; // 0x06C0
    uintptr_t m_GMOD_int[32]; // 0x0740
    uintptr_t m_GMOD_Vector[32]; // 0x07C0
    uintptr_t m_GMOD_QAngle[32]; // 0x0940
    uintptr_t m_GMOD_EHANDLE[32]; // 0x0AC0
    const char* m_GMOD_String0; // 0x0B40
    const char* m_GMOD_String1; // 0x0D40
    const char* m_GMOD_String2; // 0x0F40
    const char* m_GMOD_String3; // 0x1140
    int64_t m_GMOD_DataTable; // 0x1340
    uint32_t m_iCreationID; // 0x1388
    uint32_t m_iMapCreatedID; // 0x138C
    uint32_t m_nSkin; // 0x1398
    uint32_t m_nBody; // 0x139C
    uint32_t m_nHitboxSet; // 0x13A0
    float m_flPlaybackRate; // 0x13C0
    fVector3 m_vecForce; // 0x13CC
    uint32_t m_nForceBone; // 0x13D8
    uint32_t m_bClientSideFrameReset; // 0x140C
    float m_fadeMinDist; // 0x1444
    float m_fadeMaxDist; // 0x1448
    float m_flFadeScale; // 0x144C
    float m_flModelScale; // 0x149C
    float m_flModelWidthScale; // 0x149C
    uintptr_t m_flPoseParameter[24]; // 0x14A0
    uintptr_t m_flEncodedController[4]; // 0x15BC
    uint32_t m_bClientSideAnimation; // 0x160C
    uint32_t m_nNewSequenceParity; // 0x1610
    uint32_t m_nResetEventsParity; // 0x1614
    uint32_t m_hLightingOrigin; // 0x16C4
    uint32_t m_hLightingOriginRelative; // 0x16C8
    uint32_t m_nMuzzleFlashParity; // 0x16CC
    fVector3 m_OverrideViewTarget; // 0x16EC
    uint32_t m_pBoneManipulator; // 0x1778
    uint32_t m_pFlexManipulator; // 0x1780
    fVector3 m_viewtarget; // 0x1844
    uintptr_t m_flexWeight[96]; // 0x1880
    uint32_t m_blinktoggle; // 0x1A30
    fVector3 m_vecLean; // 0x1B9C
    fVector3 m_vecShift; // 0x1BD8
    float m_flNextAttack; // 0x1C18
    uint32_t m_bloodColor; // 0x1C1C
    uintptr_t m_hMyWeapons[256]; // 0x2020
    uint32_t m_hActiveWeapon; // 0x2420
};

class NextBotCombatCharacter // parent CBaseEntity {
public:
    uint32_t movecollide; // 0x0000
    void* m_OverrideSubMaterials; // 0x0000
    uint32_t lengthprop15; // 0x0000
    uint32_t movetype; // 0x0000
    uint32_t m_nSequence; // 0x0000
    float m_flPrevCycle; // 0x0004
    float m_flWeight; // 0x0008
    uint32_t m_nOrder; // 0x000C
    float m_flCycle; // 0x0014
    uint32_t m_nRenderFX; // 0x0054
    uint32_t m_clrRender; // 0x0058
    uint32_t m_flAnimTime; // 0x0060
    uint32_t m_flSimulationTime; // 0x0068
    uint32_t m_ubInterpolationFrame; // 0x0074
    uint32_t m_fEffects; // 0x0078
    uint32_t m_nRenderMode; // 0x007C
    uint32_t m_nModelIndex; // 0x008C
    uint32_t m_takedamage; // 0x008E
    uint32_t m_iHealth; // 0x0090
    uint32_t m_iMaxHealth; // 0x0094
    uint32_t m_iTeamNum; // 0x009C
    uint32_t m_PredictableID; // 0x00A0
    float m_vecViewOffset[0]; // 0x00E8
    float m_vecViewOffset[1]; // 0x00EC
    float m_vecViewOffset[2]; // 0x00F0
    float m_vecVelocity[0]; // 0x00F4
    float m_vecVelocity[1]; // 0x00F8
    float m_vecVelocity[2]; // 0x00FC
    uint32_t m_iParentAttachment; // 0x017A
    uint32_t moveparent; // 0x0190
    fVector3 m_vecMinsPreScaled; // 0x01A4
    fVector3 m_vecMaxsPreScaled; // 0x01B0
    fVector3 m_vecMins; // 0x01BC
    fVector3 m_vecMaxs; // 0x01C8
    uint32_t m_usSolidFlags; // 0x01D8
    uint32_t m_nSurroundType; // 0x01DC
    uint32_t m_nSolidType; // 0x01DD
    uint32_t m_triggerBloat; // 0x01DE
    fVector3 m_vecSpecifiedSurroundingMinsPreScaled; // 0x01E0
    fVector3 m_vecSpecifiedSurroundingMaxsPreScaled; // 0x01EC
    fVector3 m_vecSpecifiedSurroundingMins; // 0x01F8
    fVector3 m_vecSpecifiedSurroundingMaxs; // 0x0204
    float m_flElasticity; // 0x0248
    float m_flShadowCastDistance; // 0x024C
    fVector3 m_vecOrigin; // 0x0338
    fVector3 m_angRotation; // 0x0344
    uint32_t m_CollisionGroup; // 0x0354
    uint32_t m_bIsPlayerSimulated; // 0x04C8
    uint32_t m_bSimulatedEveryTick; // 0x04C9
    uint32_t m_bAnimatedEveryTick; // 0x04CA
    uint32_t m_bAlternateSorting; // 0x04CB
    uint32_t m_iTextureFrameIndex; // 0x04CC
    uint32_t m_hOwnerEntity; // 0x04D8
    uint32_t m_hEffectEntity; // 0x04DC
    uint32_t m_bOnFire; // 0x0515
    float m_CreationTime; // 0x0518
    uint32_t m_RealClassName; // 0x051C
    uint32_t m_OverrideMaterial; // 0x0520
    uint32_t m_OverrideSubMaterials[0]; // 0x0528
    uint32_t m_spawnflags; // 0x0640
    uint32_t m_iGModFlags; // 0x0644
    uintptr_t m_GMOD_bool[32]; // 0x06A0
    uintptr_t m_GMOD_float[32]; // 0x06C0
    uintptr_t m_GMOD_int[32]; // 0x0740
    uintptr_t m_GMOD_Vector[32]; // 0x07C0
    uintptr_t m_GMOD_QAngle[32]; // 0x0940
    uintptr_t m_GMOD_EHANDLE[32]; // 0x0AC0
    const char* m_GMOD_String0; // 0x0B40
    const char* m_GMOD_String1; // 0x0D40
    const char* m_GMOD_String2; // 0x0F40
    const char* m_GMOD_String3; // 0x1140
    int64_t m_GMOD_DataTable; // 0x1340
    uint32_t m_iCreationID; // 0x1388
    uint32_t m_iMapCreatedID; // 0x138C
    uint32_t m_nSkin; // 0x1398
    uint32_t m_nBody; // 0x139C
    uint32_t m_nHitboxSet; // 0x13A0
    float m_flPlaybackRate; // 0x13C0
    fVector3 m_vecForce; // 0x13CC
    uint32_t m_nForceBone; // 0x13D8
    uint32_t m_bClientSideFrameReset; // 0x140C
    float m_fadeMinDist; // 0x1444
    float m_fadeMaxDist; // 0x1448
    float m_flFadeScale; // 0x144C
    float m_flModelScale; // 0x149C
    float m_flModelWidthScale; // 0x149C
    uintptr_t m_flPoseParameter[24]; // 0x14A0
    uintptr_t m_flEncodedController[4]; // 0x15BC
    uint32_t m_bClientSideAnimation; // 0x160C
    uint32_t m_nNewSequenceParity; // 0x1610
    uint32_t m_nResetEventsParity; // 0x1614
    uint32_t m_hLightingOrigin; // 0x16C4
    uint32_t m_hLightingOriginRelative; // 0x16C8
    uint32_t m_nMuzzleFlashParity; // 0x16CC
    fVector3 m_OverrideViewTarget; // 0x16EC
    uint32_t m_pBoneManipulator; // 0x1778
    uint32_t m_pFlexManipulator; // 0x1780
    fVector3 m_viewtarget; // 0x1844
    uintptr_t m_flexWeight[96]; // 0x1880
    uint32_t m_blinktoggle; // 0x1A30
    fVector3 m_vecLean; // 0x1B9C
    fVector3 m_vecShift; // 0x1BD8
    float m_flNextAttack; // 0x1C18
    uint32_t m_bloodColor; // 0x1C1C
    uintptr_t m_hMyWeapons[256]; // 0x2020
    uint32_t m_hActiveWeapon; // 0x2420
};

class CWeaponOldManHarpoon // parent CBaseEntity {
public:
    void* m_OverrideSubMaterials; // 0x0000
    uint32_t movecollide; // 0x0000
    uint32_t movetype; // 0x0000
    uint32_t m_nRenderFX; // 0x0054
    uint32_t m_clrRender; // 0x0058
    uint32_t m_flAnimTime; // 0x0060
    uint32_t m_flSimulationTime; // 0x0068
    uint32_t m_ubInterpolationFrame; // 0x0074
    uint32_t m_fEffects; // 0x0078
    uint32_t m_nRenderMode; // 0x007C
    uint32_t m_nNextThinkTick; // 0x0084
    uint32_t m_nModelIndex; // 0x008C
    uint32_t m_takedamage; // 0x008E
    uint32_t m_iHealth; // 0x0090
    uint32_t m_iMaxHealth; // 0x0094
    uint32_t m_iTeamNum; // 0x009C
    uint32_t m_PredictableID; // 0x00A0
    float m_vecVelocity[0]; // 0x00F4
    float m_vecVelocity[1]; // 0x00F8
    float m_vecVelocity[2]; // 0x00FC
    uint32_t m_iParentAttachment; // 0x017A
    uint32_t moveparent; // 0x0190
    fVector3 m_vecMinsPreScaled; // 0x01A4
    fVector3 m_vecMaxsPreScaled; // 0x01B0
    fVector3 m_vecMins; // 0x01BC
    fVector3 m_vecMaxs; // 0x01C8
    uint32_t m_usSolidFlags; // 0x01D8
    uint32_t m_nSurroundType; // 0x01DC
    uint32_t m_nSolidType; // 0x01DD
    uint32_t m_triggerBloat; // 0x01DE
    fVector3 m_vecSpecifiedSurroundingMinsPreScaled; // 0x01E0
    fVector3 m_vecSpecifiedSurroundingMaxsPreScaled; // 0x01EC
    fVector3 m_vecSpecifiedSurroundingMins; // 0x01F8
    fVector3 m_vecSpecifiedSurroundingMaxs; // 0x0204
    float m_flElasticity; // 0x0248
    float m_flShadowCastDistance; // 0x024C
    fVector3 m_vecOrigin; // 0x0338
    fVector3 m_angRotation; // 0x0344
    uint32_t m_CollisionGroup; // 0x0354
    uint32_t m_bIsPlayerSimulated; // 0x04C8
    uint32_t m_bSimulatedEveryTick; // 0x04C9
    uint32_t m_bAnimatedEveryTick; // 0x04CA
    uint32_t m_bAlternateSorting; // 0x04CB
    uint32_t m_iTextureFrameIndex; // 0x04CC
    uint32_t m_hOwnerEntity; // 0x04D8
    uint32_t m_hEffectEntity; // 0x04DC
    uint32_t m_bOnFire; // 0x0515
    float m_CreationTime; // 0x0518
    uint32_t m_RealClassName; // 0x051C
    uint32_t m_OverrideMaterial; // 0x0520
    uint32_t m_OverrideSubMaterials[0]; // 0x0528
    uint32_t m_spawnflags; // 0x0640
    uint32_t m_iGModFlags; // 0x0644
    uintptr_t m_GMOD_bool[32]; // 0x06A0
    uintptr_t m_GMOD_float[32]; // 0x06C0
    uintptr_t m_GMOD_int[32]; // 0x0740
    uintptr_t m_GMOD_Vector[32]; // 0x07C0
    uintptr_t m_GMOD_QAngle[32]; // 0x0940
    uintptr_t m_GMOD_EHANDLE[32]; // 0x0AC0
    const char* m_GMOD_String0; // 0x0B40
    const char* m_GMOD_String1; // 0x0D40
    const char* m_GMOD_String2; // 0x0F40
    const char* m_GMOD_String3; // 0x1140
    int64_t m_GMOD_DataTable; // 0x1340
    uint32_t m_iCreationID; // 0x1388
    uint32_t m_iMapCreatedID; // 0x138C
    uint32_t m_nSkin; // 0x1398
    uint32_t m_nBody; // 0x139C
    uint32_t m_nHitboxSet; // 0x13A0
    float m_flPlaybackRate; // 0x13C0
    fVector3 m_vecForce; // 0x13CC
    uint32_t m_nForceBone; // 0x13D8
    uint32_t m_bClientSideFrameReset; // 0x140C
    float m_fadeMinDist; // 0x1444
    float m_fadeMaxDist; // 0x1448
    float m_flFadeScale; // 0x144C
    float m_flModelScale; // 0x149C
    float m_flModelWidthScale; // 0x149C
    uintptr_t m_flPoseParameter[24]; // 0x14A0
    uintptr_t m_flEncodedController[4]; // 0x15BC
    uint32_t m_bClientSideAnimation; // 0x160C
    uint32_t m_nNewSequenceParity; // 0x1610
    uint32_t m_nResetEventsParity; // 0x1614
    uint32_t m_nSequence; // 0x163C
    float m_flCycle; // 0x1644
    uint32_t m_hLightingOrigin; // 0x16C4
    uint32_t m_hLightingOriginRelative; // 0x16C8
    uint32_t m_nMuzzleFlashParity; // 0x16CC
    fVector3 m_OverrideViewTarget; // 0x16EC
    uint32_t m_pBoneManipulator; // 0x1778
    uint32_t m_pFlexManipulator; // 0x1780
    uint32_t m_hOwner; // 0x17D8
    uint32_t m_nViewModelIndex; // 0x17E0
    float m_flNextPrimaryAttack; // 0x17E4
    float m_flNextSecondaryAttack; // 0x17E8
    float m_flTimeWeaponIdle; // 0x17EC
    uint32_t m_iViewModelIndex; // 0x17F4
    uint32_t m_iWorldModelIndex; // 0x17F8
    uint32_t m_iState; // 0x1818
    uint32_t m_iPrimaryAmmoType; // 0x1820
    uint32_t m_iSecondaryAmmoType; // 0x1824
    uint32_t m_iClip1; // 0x1828
    uint32_t m_iClip2; // 0x182C
    uint32_t m_bFlipViewModel; // 0x1858
};

class CVGuiScreen // parent CBaseEntity {
public:
    void* m_OverrideSubMaterials; // 0x0000
    uint32_t movecollide; // 0x0000
    uint32_t movetype; // 0x0000
    uint32_t m_nRenderFX; // 0x0054
    uint32_t m_clrRender; // 0x0058
    uint32_t m_flAnimTime; // 0x0060
    uint32_t m_flSimulationTime; // 0x0068
    uint32_t m_ubInterpolationFrame; // 0x0074
    uint32_t m_fEffects; // 0x0078
    uint32_t m_nRenderMode; // 0x007C
    uint32_t m_nModelIndex; // 0x008C
    uint32_t m_takedamage; // 0x008E
    uint32_t m_iHealth; // 0x0090
    uint32_t m_iMaxHealth; // 0x0094
    uint32_t m_iTeamNum; // 0x009C
    uint32_t m_PredictableID; // 0x00A0
    float m_vecVelocity[0]; // 0x00F4
    float m_vecVelocity[1]; // 0x00F8
    float m_vecVelocity[2]; // 0x00FC
    uint32_t m_iParentAttachment; // 0x017A
    uint32_t moveparent; // 0x0190
    fVector3 m_vecMinsPreScaled; // 0x01A4
    fVector3 m_vecMaxsPreScaled; // 0x01B0
    fVector3 m_vecMins; // 0x01BC
    fVector3 m_vecMaxs; // 0x01C8
    uint32_t m_usSolidFlags; // 0x01D8
    uint32_t m_nSurroundType; // 0x01DC
    uint32_t m_nSolidType; // 0x01DD
    uint32_t m_triggerBloat; // 0x01DE
    fVector3 m_vecSpecifiedSurroundingMinsPreScaled; // 0x01E0
    fVector3 m_vecSpecifiedSurroundingMaxsPreScaled; // 0x01EC
    fVector3 m_vecSpecifiedSurroundingMins; // 0x01F8
    fVector3 m_vecSpecifiedSurroundingMaxs; // 0x0204
    float m_flElasticity; // 0x0248
    float m_flShadowCastDistance; // 0x024C
    fVector3 m_vecOrigin; // 0x0338
    fVector3 m_angRotation; // 0x0344
    uint32_t m_CollisionGroup; // 0x0354
    uint32_t m_bIsPlayerSimulated; // 0x04C8
    uint32_t m_bSimulatedEveryTick; // 0x04C9
    uint32_t m_bAnimatedEveryTick; // 0x04CA
    uint32_t m_bAlternateSorting; // 0x04CB
    uint32_t m_iTextureFrameIndex; // 0x04CC
    uint32_t m_hOwnerEntity; // 0x04D8
    uint32_t m_hEffectEntity; // 0x04DC
    uint32_t m_bOnFire; // 0x0515
    float m_CreationTime; // 0x0518
    uint32_t m_RealClassName; // 0x051C
    uint32_t m_OverrideMaterial; // 0x0520
    uint32_t m_OverrideSubMaterials[0]; // 0x0528
    uint32_t m_spawnflags; // 0x0640
    uint32_t m_iGModFlags; // 0x0644
    uintptr_t m_GMOD_bool[32]; // 0x06A0
    uintptr_t m_GMOD_float[32]; // 0x06C0
    uintptr_t m_GMOD_int[32]; // 0x0740
    uintptr_t m_GMOD_Vector[32]; // 0x07C0
    uintptr_t m_GMOD_QAngle[32]; // 0x0940
    uintptr_t m_GMOD_EHANDLE[32]; // 0x0AC0
    const char* m_GMOD_String0; // 0x0B40
    const char* m_GMOD_String1; // 0x0D40
    const char* m_GMOD_String2; // 0x0F40
    const char* m_GMOD_String3; // 0x1140
    int64_t m_GMOD_DataTable; // 0x1340
    uint32_t m_iCreationID; // 0x1388
    uint32_t m_iMapCreatedID; // 0x138C
    float m_flWidth; // 0x1398
    float m_flHeight; // 0x139C
    uint32_t m_nPanelName; // 0x13A0
    uint32_t m_nAttachmentIndex; // 0x13BC
    uint32_t m_nOverlayMaterial; // 0x13C0
    uint32_t m_fScreenFlags; // 0x13C4
    uint32_t m_hPlayerOwner; // 0x1420
};

class CWeaponCitizenSuitcase // parent CBaseEntity {
public:
    void* m_OverrideSubMaterials; // 0x0000
    uint32_t movecollide; // 0x0000
    uint32_t movetype; // 0x0000
    uint32_t m_nRenderFX; // 0x0054
    uint32_t m_clrRender; // 0x0058
    uint32_t m_flAnimTime; // 0x0060
    uint32_t m_flSimulationTime; // 0x0068
    uint32_t m_ubInterpolationFrame; // 0x0074
    uint32_t m_fEffects; // 0x0078
    uint32_t m_nRenderMode; // 0x007C
    uint32_t m_nNextThinkTick; // 0x0084
    uint32_t m_nModelIndex; // 0x008C
    uint32_t m_takedamage; // 0x008E
    uint32_t m_iHealth; // 0x0090
    uint32_t m_iMaxHealth; // 0x0094
    uint32_t m_iTeamNum; // 0x009C
    uint32_t m_PredictableID; // 0x00A0
    float m_vecVelocity[0]; // 0x00F4
    float m_vecVelocity[1]; // 0x00F8
    float m_vecVelocity[2]; // 0x00FC
    uint32_t m_iParentAttachment; // 0x017A
    uint32_t moveparent; // 0x0190
    fVector3 m_vecMinsPreScaled; // 0x01A4
    fVector3 m_vecMaxsPreScaled; // 0x01B0
    fVector3 m_vecMins; // 0x01BC
    fVector3 m_vecMaxs; // 0x01C8
    uint32_t m_usSolidFlags; // 0x01D8
    uint32_t m_nSurroundType; // 0x01DC
    uint32_t m_nSolidType; // 0x01DD
    uint32_t m_triggerBloat; // 0x01DE
    fVector3 m_vecSpecifiedSurroundingMinsPreScaled; // 0x01E0
    fVector3 m_vecSpecifiedSurroundingMaxsPreScaled; // 0x01EC
    fVector3 m_vecSpecifiedSurroundingMins; // 0x01F8
    fVector3 m_vecSpecifiedSurroundingMaxs; // 0x0204
    float m_flElasticity; // 0x0248
    float m_flShadowCastDistance; // 0x024C
    fVector3 m_vecOrigin; // 0x0338
    fVector3 m_angRotation; // 0x0344
    uint32_t m_CollisionGroup; // 0x0354
    uint32_t m_bIsPlayerSimulated; // 0x04C8
    uint32_t m_bSimulatedEveryTick; // 0x04C9
    uint32_t m_bAnimatedEveryTick; // 0x04CA
    uint32_t m_bAlternateSorting; // 0x04CB
    uint32_t m_iTextureFrameIndex; // 0x04CC
    uint32_t m_hOwnerEntity; // 0x04D8
    uint32_t m_hEffectEntity; // 0x04DC
    uint32_t m_bOnFire; // 0x0515
    float m_CreationTime; // 0x0518
    uint32_t m_RealClassName; // 0x051C
    uint32_t m_OverrideMaterial; // 0x0520
    uint32_t m_OverrideSubMaterials[0]; // 0x0528
    uint32_t m_spawnflags; // 0x0640
    uint32_t m_iGModFlags; // 0x0644
    uintptr_t m_GMOD_bool[32]; // 0x06A0
    uintptr_t m_GMOD_float[32]; // 0x06C0
    uintptr_t m_GMOD_int[32]; // 0x0740
    uintptr_t m_GMOD_Vector[32]; // 0x07C0
    uintptr_t m_GMOD_QAngle[32]; // 0x0940
    uintptr_t m_GMOD_EHANDLE[32]; // 0x0AC0
    const char* m_GMOD_String0; // 0x0B40
    const char* m_GMOD_String1; // 0x0D40
    const char* m_GMOD_String2; // 0x0F40
    const char* m_GMOD_String3; // 0x1140
    int64_t m_GMOD_DataTable; // 0x1340
    uint32_t m_iCreationID; // 0x1388
    uint32_t m_iMapCreatedID; // 0x138C
    uint32_t m_nSkin; // 0x1398
    uint32_t m_nBody; // 0x139C
    uint32_t m_nHitboxSet; // 0x13A0
    float m_flPlaybackRate; // 0x13C0
    fVector3 m_vecForce; // 0x13CC
    uint32_t m_nForceBone; // 0x13D8
    uint32_t m_bClientSideFrameReset; // 0x140C
    float m_fadeMinDist; // 0x1444
    float m_fadeMaxDist; // 0x1448
    float m_flFadeScale; // 0x144C
    float m_flModelScale; // 0x149C
    float m_flModelWidthScale; // 0x149C
    uintptr_t m_flPoseParameter[24]; // 0x14A0
    uintptr_t m_flEncodedController[4]; // 0x15BC
    uint32_t m_bClientSideAnimation; // 0x160C
    uint32_t m_nNewSequenceParity; // 0x1610
    uint32_t m_nResetEventsParity; // 0x1614
    uint32_t m_nSequence; // 0x163C
    float m_flCycle; // 0x1644
    uint32_t m_hLightingOrigin; // 0x16C4
    uint32_t m_hLightingOriginRelative; // 0x16C8
    uint32_t m_nMuzzleFlashParity; // 0x16CC
    fVector3 m_OverrideViewTarget; // 0x16EC
    uint32_t m_pBoneManipulator; // 0x1778
    uint32_t m_pFlexManipulator; // 0x1780
    uint32_t m_hOwner; // 0x17D8
    uint32_t m_nViewModelIndex; // 0x17E0
    float m_flNextPrimaryAttack; // 0x17E4
    float m_flNextSecondaryAttack; // 0x17E8
    float m_flTimeWeaponIdle; // 0x17EC
    uint32_t m_iViewModelIndex; // 0x17F4
    uint32_t m_iWorldModelIndex; // 0x17F8
    uint32_t m_iState; // 0x1818
    uint32_t m_iPrimaryAmmoType; // 0x1820
    uint32_t m_iSecondaryAmmoType; // 0x1824
    uint32_t m_iClip1; // 0x1828
    uint32_t m_iClip2; // 0x182C
    uint32_t m_bFlipViewModel; // 0x1858
};

class CWeaponCitizenPackage // parent CBaseEntity {
public:
    void* m_OverrideSubMaterials; // 0x0000
    uint32_t movecollide; // 0x0000
    uint32_t movetype; // 0x0000
    uint32_t m_nRenderFX; // 0x0054
    uint32_t m_clrRender; // 0x0058
    uint32_t m_flAnimTime; // 0x0060
    uint32_t m_flSimulationTime; // 0x0068
    uint32_t m_ubInterpolationFrame; // 0x0074
    uint32_t m_fEffects; // 0x0078
    uint32_t m_nRenderMode; // 0x007C
    uint32_t m_nNextThinkTick; // 0x0084
    uint32_t m_nModelIndex; // 0x008C
    uint32_t m_takedamage; // 0x008E
    uint32_t m_iHealth; // 0x0090
    uint32_t m_iMaxHealth; // 0x0094
    uint32_t m_iTeamNum; // 0x009C
    uint32_t m_PredictableID; // 0x00A0
    float m_vecVelocity[0]; // 0x00F4
    float m_vecVelocity[1]; // 0x00F8
    float m_vecVelocity[2]; // 0x00FC
    uint32_t m_iParentAttachment; // 0x017A
    uint32_t moveparent; // 0x0190
    fVector3 m_vecMinsPreScaled; // 0x01A4
    fVector3 m_vecMaxsPreScaled; // 0x01B0
    fVector3 m_vecMins; // 0x01BC
    fVector3 m_vecMaxs; // 0x01C8
    uint32_t m_usSolidFlags; // 0x01D8
    uint32_t m_nSurroundType; // 0x01DC
    uint32_t m_nSolidType; // 0x01DD
    uint32_t m_triggerBloat; // 0x01DE
    fVector3 m_vecSpecifiedSurroundingMinsPreScaled; // 0x01E0
    fVector3 m_vecSpecifiedSurroundingMaxsPreScaled; // 0x01EC
    fVector3 m_vecSpecifiedSurroundingMins; // 0x01F8
    fVector3 m_vecSpecifiedSurroundingMaxs; // 0x0204
    float m_flElasticity; // 0x0248
    float m_flShadowCastDistance; // 0x024C
    fVector3 m_vecOrigin; // 0x0338
    fVector3 m_angRotation; // 0x0344
    uint32_t m_CollisionGroup; // 0x0354
    uint32_t m_bIsPlayerSimulated; // 0x04C8
    uint32_t m_bSimulatedEveryTick; // 0x04C9
    uint32_t m_bAnimatedEveryTick; // 0x04CA
    uint32_t m_bAlternateSorting; // 0x04CB
    uint32_t m_iTextureFrameIndex; // 0x04CC
    uint32_t m_hOwnerEntity; // 0x04D8
    uint32_t m_hEffectEntity; // 0x04DC
    uint32_t m_bOnFire; // 0x0515
    float m_CreationTime; // 0x0518
    uint32_t m_RealClassName; // 0x051C
    uint32_t m_OverrideMaterial; // 0x0520
    uint32_t m_OverrideSubMaterials[0]; // 0x0528
    uint32_t m_spawnflags; // 0x0640
    uint32_t m_iGModFlags; // 0x0644
    uintptr_t m_GMOD_bool[32]; // 0x06A0
    uintptr_t m_GMOD_float[32]; // 0x06C0
    uintptr_t m_GMOD_int[32]; // 0x0740
    uintptr_t m_GMOD_Vector[32]; // 0x07C0
    uintptr_t m_GMOD_QAngle[32]; // 0x0940
    uintptr_t m_GMOD_EHANDLE[32]; // 0x0AC0
    const char* m_GMOD_String0; // 0x0B40
    const char* m_GMOD_String1; // 0x0D40
    const char* m_GMOD_String2; // 0x0F40
    const char* m_GMOD_String3; // 0x1140
    int64_t m_GMOD_DataTable; // 0x1340
    uint32_t m_iCreationID; // 0x1388
    uint32_t m_iMapCreatedID; // 0x138C
    uint32_t m_nSkin; // 0x1398
    uint32_t m_nBody; // 0x139C
    uint32_t m_nHitboxSet; // 0x13A0
    float m_flPlaybackRate; // 0x13C0
    fVector3 m_vecForce; // 0x13CC
    uint32_t m_nForceBone; // 0x13D8
    uint32_t m_bClientSideFrameReset; // 0x140C
    float m_fadeMinDist; // 0x1444
    float m_fadeMaxDist; // 0x1448
    float m_flFadeScale; // 0x144C
    float m_flModelScale; // 0x149C
    float m_flModelWidthScale; // 0x149C
    uintptr_t m_flPoseParameter[24]; // 0x14A0
    uintptr_t m_flEncodedController[4]; // 0x15BC
    uint32_t m_bClientSideAnimation; // 0x160C
    uint32_t m_nNewSequenceParity; // 0x1610
    uint32_t m_nResetEventsParity; // 0x1614
    uint32_t m_nSequence; // 0x163C
    float m_flCycle; // 0x1644
    uint32_t m_hLightingOrigin; // 0x16C4
    uint32_t m_hLightingOriginRelative; // 0x16C8
    uint32_t m_nMuzzleFlashParity; // 0x16CC
    fVector3 m_OverrideViewTarget; // 0x16EC
    uint32_t m_pBoneManipulator; // 0x1778
    uint32_t m_pFlexManipulator; // 0x1780
    uint32_t m_hOwner; // 0x17D8
    uint32_t m_nViewModelIndex; // 0x17E0
    float m_flNextPrimaryAttack; // 0x17E4
    float m_flNextSecondaryAttack; // 0x17E8
    float m_flTimeWeaponIdle; // 0x17EC
    uint32_t m_iViewModelIndex; // 0x17F4
    uint32_t m_iWorldModelIndex; // 0x17F8
    uint32_t m_iState; // 0x1818
    uint32_t m_iPrimaryAmmoType; // 0x1820
    uint32_t m_iSecondaryAmmoType; // 0x1824
    uint32_t m_iClip1; // 0x1828
    uint32_t m_iClip2; // 0x182C
    uint32_t m_bFlipViewModel; // 0x1858
};

class CWeaponCubemap // parent CBaseEntity {
public:
    void* m_OverrideSubMaterials; // 0x0000
    uint32_t movecollide; // 0x0000
    uint32_t movetype; // 0x0000
    uint32_t m_nRenderFX; // 0x0054
    uint32_t m_clrRender; // 0x0058
    uint32_t m_flAnimTime; // 0x0060
    uint32_t m_flSimulationTime; // 0x0068
    uint32_t m_ubInterpolationFrame; // 0x0074
    uint32_t m_fEffects; // 0x0078
    uint32_t m_nRenderMode; // 0x007C
    uint32_t m_nNextThinkTick; // 0x0084
    uint32_t m_nModelIndex; // 0x008C
    uint32_t m_takedamage; // 0x008E
    uint32_t m_iHealth; // 0x0090
    uint32_t m_iMaxHealth; // 0x0094
    uint32_t m_iTeamNum; // 0x009C
    uint32_t m_PredictableID; // 0x00A0
    float m_vecVelocity[0]; // 0x00F4
    float m_vecVelocity[1]; // 0x00F8
    float m_vecVelocity[2]; // 0x00FC
    uint32_t m_iParentAttachment; // 0x017A
    uint32_t moveparent; // 0x0190
    fVector3 m_vecMinsPreScaled; // 0x01A4
    fVector3 m_vecMaxsPreScaled; // 0x01B0
    fVector3 m_vecMins; // 0x01BC
    fVector3 m_vecMaxs; // 0x01C8
    uint32_t m_usSolidFlags; // 0x01D8
    uint32_t m_nSurroundType; // 0x01DC
    uint32_t m_nSolidType; // 0x01DD
    uint32_t m_triggerBloat; // 0x01DE
    fVector3 m_vecSpecifiedSurroundingMinsPreScaled; // 0x01E0
    fVector3 m_vecSpecifiedSurroundingMaxsPreScaled; // 0x01EC
    fVector3 m_vecSpecifiedSurroundingMins; // 0x01F8
    fVector3 m_vecSpecifiedSurroundingMaxs; // 0x0204
    float m_flElasticity; // 0x0248
    float m_flShadowCastDistance; // 0x024C
    fVector3 m_vecOrigin; // 0x0338
    fVector3 m_angRotation; // 0x0344
    uint32_t m_CollisionGroup; // 0x0354
    uint32_t m_bIsPlayerSimulated; // 0x04C8
    uint32_t m_bSimulatedEveryTick; // 0x04C9
    uint32_t m_bAnimatedEveryTick; // 0x04CA
    uint32_t m_bAlternateSorting; // 0x04CB
    uint32_t m_iTextureFrameIndex; // 0x04CC
    uint32_t m_hOwnerEntity; // 0x04D8
    uint32_t m_hEffectEntity; // 0x04DC
    uint32_t m_bOnFire; // 0x0515
    float m_CreationTime; // 0x0518
    uint32_t m_RealClassName; // 0x051C
    uint32_t m_OverrideMaterial; // 0x0520
    uint32_t m_OverrideSubMaterials[0]; // 0x0528
    uint32_t m_spawnflags; // 0x0640
    uint32_t m_iGModFlags; // 0x0644
    uintptr_t m_GMOD_bool[32]; // 0x06A0
    uintptr_t m_GMOD_float[32]; // 0x06C0
    uintptr_t m_GMOD_int[32]; // 0x0740
    uintptr_t m_GMOD_Vector[32]; // 0x07C0
    uintptr_t m_GMOD_QAngle[32]; // 0x0940
    uintptr_t m_GMOD_EHANDLE[32]; // 0x0AC0
    const char* m_GMOD_String0; // 0x0B40
    const char* m_GMOD_String1; // 0x0D40
    const char* m_GMOD_String2; // 0x0F40
    const char* m_GMOD_String3; // 0x1140
    int64_t m_GMOD_DataTable; // 0x1340
    uint32_t m_iCreationID; // 0x1388
    uint32_t m_iMapCreatedID; // 0x138C
    uint32_t m_nSkin; // 0x1398
    uint32_t m_nBody; // 0x139C
    uint32_t m_nHitboxSet; // 0x13A0
    float m_flPlaybackRate; // 0x13C0
    fVector3 m_vecForce; // 0x13CC
    uint32_t m_nForceBone; // 0x13D8
    uint32_t m_bClientSideFrameReset; // 0x140C
    float m_fadeMinDist; // 0x1444
    float m_fadeMaxDist; // 0x1448
    float m_flFadeScale; // 0x144C
    float m_flModelScale; // 0x149C
    float m_flModelWidthScale; // 0x149C
    uintptr_t m_flPoseParameter[24]; // 0x14A0
    uintptr_t m_flEncodedController[4]; // 0x15BC
    uint32_t m_bClientSideAnimation; // 0x160C
    uint32_t m_nNewSequenceParity; // 0x1610
    uint32_t m_nResetEventsParity; // 0x1614
    uint32_t m_nSequence; // 0x163C
    float m_flCycle; // 0x1644
    uint32_t m_hLightingOrigin; // 0x16C4
    uint32_t m_hLightingOriginRelative; // 0x16C8
    uint32_t m_nMuzzleFlashParity; // 0x16CC
    fVector3 m_OverrideViewTarget; // 0x16EC
    uint32_t m_pBoneManipulator; // 0x1778
    uint32_t m_pFlexManipulator; // 0x1780
    uint32_t m_hOwner; // 0x17D8
    uint32_t m_nViewModelIndex; // 0x17E0
    float m_flNextPrimaryAttack; // 0x17E4
    float m_flNextSecondaryAttack; // 0x17E8
    float m_flTimeWeaponIdle; // 0x17EC
    uint32_t m_iViewModelIndex; // 0x17F4
    uint32_t m_iWorldModelIndex; // 0x17F8
    uint32_t m_iState; // 0x1818
    uint32_t m_iPrimaryAmmoType; // 0x1820
    uint32_t m_iSecondaryAmmoType; // 0x1824
    uint32_t m_iClip1; // 0x1828
    uint32_t m_iClip2; // 0x182C
    uint32_t m_bFlipViewModel; // 0x1858
};

class CWeaponAnnabelle // parent CBaseEntity {
public:
    void* m_OverrideSubMaterials; // 0x0000
    uint32_t movecollide; // 0x0000
    uint32_t movetype; // 0x0000
    uint32_t m_nRenderFX; // 0x0054
    uint32_t m_clrRender; // 0x0058
    uint32_t m_flAnimTime; // 0x0060
    uint32_t m_flSimulationTime; // 0x0068
    uint32_t m_ubInterpolationFrame; // 0x0074
    uint32_t m_fEffects; // 0x0078
    uint32_t m_nRenderMode; // 0x007C
    uint32_t m_nNextThinkTick; // 0x0084
    uint32_t m_nModelIndex; // 0x008C
    uint32_t m_takedamage; // 0x008E
    uint32_t m_iHealth; // 0x0090
    uint32_t m_iMaxHealth; // 0x0094
    uint32_t m_iTeamNum; // 0x009C
    uint32_t m_PredictableID; // 0x00A0
    float m_vecVelocity[0]; // 0x00F4
    float m_vecVelocity[1]; // 0x00F8
    float m_vecVelocity[2]; // 0x00FC
    uint32_t m_iParentAttachment; // 0x017A
    uint32_t moveparent; // 0x0190
    fVector3 m_vecMinsPreScaled; // 0x01A4
    fVector3 m_vecMaxsPreScaled; // 0x01B0
    fVector3 m_vecMins; // 0x01BC
    fVector3 m_vecMaxs; // 0x01C8
    uint32_t m_usSolidFlags; // 0x01D8
    uint32_t m_nSurroundType; // 0x01DC
    uint32_t m_nSolidType; // 0x01DD
    uint32_t m_triggerBloat; // 0x01DE
    fVector3 m_vecSpecifiedSurroundingMinsPreScaled; // 0x01E0
    fVector3 m_vecSpecifiedSurroundingMaxsPreScaled; // 0x01EC
    fVector3 m_vecSpecifiedSurroundingMins; // 0x01F8
    fVector3 m_vecSpecifiedSurroundingMaxs; // 0x0204
    float m_flElasticity; // 0x0248
    float m_flShadowCastDistance; // 0x024C
    fVector3 m_vecOrigin; // 0x0338
    fVector3 m_angRotation; // 0x0344
    uint32_t m_CollisionGroup; // 0x0354
    uint32_t m_bIsPlayerSimulated; // 0x04C8
    uint32_t m_bSimulatedEveryTick; // 0x04C9
    uint32_t m_bAnimatedEveryTick; // 0x04CA
    uint32_t m_bAlternateSorting; // 0x04CB
    uint32_t m_iTextureFrameIndex; // 0x04CC
    uint32_t m_hOwnerEntity; // 0x04D8
    uint32_t m_hEffectEntity; // 0x04DC
    uint32_t m_bOnFire; // 0x0515
    float m_CreationTime; // 0x0518
    uint32_t m_RealClassName; // 0x051C
    uint32_t m_OverrideMaterial; // 0x0520
    uint32_t m_OverrideSubMaterials[0]; // 0x0528
    uint32_t m_spawnflags; // 0x0640
    uint32_t m_iGModFlags; // 0x0644
    uintptr_t m_GMOD_bool[32]; // 0x06A0
    uintptr_t m_GMOD_float[32]; // 0x06C0
    uintptr_t m_GMOD_int[32]; // 0x0740
    uintptr_t m_GMOD_Vector[32]; // 0x07C0
    uintptr_t m_GMOD_QAngle[32]; // 0x0940
    uintptr_t m_GMOD_EHANDLE[32]; // 0x0AC0
    const char* m_GMOD_String0; // 0x0B40
    const char* m_GMOD_String1; // 0x0D40
    const char* m_GMOD_String2; // 0x0F40
    const char* m_GMOD_String3; // 0x1140
    int64_t m_GMOD_DataTable; // 0x1340
    uint32_t m_iCreationID; // 0x1388
    uint32_t m_iMapCreatedID; // 0x138C
    uint32_t m_nSkin; // 0x1398
    uint32_t m_nBody; // 0x139C
    uint32_t m_nHitboxSet; // 0x13A0
    float m_flPlaybackRate; // 0x13C0
    fVector3 m_vecForce; // 0x13CC
    uint32_t m_nForceBone; // 0x13D8
    uint32_t m_bClientSideFrameReset; // 0x140C
    float m_fadeMinDist; // 0x1444
    float m_fadeMaxDist; // 0x1448
    float m_flFadeScale; // 0x144C
    float m_flModelScale; // 0x149C
    float m_flModelWidthScale; // 0x149C
    uintptr_t m_flPoseParameter[24]; // 0x14A0
    uintptr_t m_flEncodedController[4]; // 0x15BC
    uint32_t m_bClientSideAnimation; // 0x160C
    uint32_t m_nNewSequenceParity; // 0x1610
    uint32_t m_nResetEventsParity; // 0x1614
    uint32_t m_nSequence; // 0x163C
    float m_flCycle; // 0x1644
    uint32_t m_hLightingOrigin; // 0x16C4
    uint32_t m_hLightingOriginRelative; // 0x16C8
    uint32_t m_nMuzzleFlashParity; // 0x16CC
    fVector3 m_OverrideViewTarget; // 0x16EC
    uint32_t m_pBoneManipulator; // 0x1778
    uint32_t m_pFlexManipulator; // 0x1780
    uint32_t m_hOwner; // 0x17D8
    uint32_t m_nViewModelIndex; // 0x17E0
    float m_flNextPrimaryAttack; // 0x17E4
    float m_flNextSecondaryAttack; // 0x17E8
    float m_flTimeWeaponIdle; // 0x17EC
    uint32_t m_iViewModelIndex; // 0x17F4
    uint32_t m_iWorldModelIndex; // 0x17F8
    uint32_t m_iState; // 0x1818
    uint32_t m_iPrimaryAmmoType; // 0x1820
    uint32_t m_iSecondaryAmmoType; // 0x1824
    uint32_t m_iClip1; // 0x1828
    uint32_t m_iClip2; // 0x182C
    uint32_t m_bFlipViewModel; // 0x1858
};

class CWeaponCycler // parent CBaseEntity {
public:
    void* m_OverrideSubMaterials; // 0x0000
    uint32_t movecollide; // 0x0000
    uint32_t movetype; // 0x0000
    uint32_t m_nRenderFX; // 0x0054
    uint32_t m_clrRender; // 0x0058
    uint32_t m_flAnimTime; // 0x0060
    uint32_t m_flSimulationTime; // 0x0068
    uint32_t m_ubInterpolationFrame; // 0x0074
    uint32_t m_fEffects; // 0x0078
    uint32_t m_nRenderMode; // 0x007C
    uint32_t m_nNextThinkTick; // 0x0084
    uint32_t m_nModelIndex; // 0x008C
    uint32_t m_takedamage; // 0x008E
    uint32_t m_iHealth; // 0x0090
    uint32_t m_iMaxHealth; // 0x0094
    uint32_t m_iTeamNum; // 0x009C
    uint32_t m_PredictableID; // 0x00A0
    float m_vecVelocity[0]; // 0x00F4
    float m_vecVelocity[1]; // 0x00F8
    float m_vecVelocity[2]; // 0x00FC
    uint32_t m_iParentAttachment; // 0x017A
    uint32_t moveparent; // 0x0190
    fVector3 m_vecMinsPreScaled; // 0x01A4
    fVector3 m_vecMaxsPreScaled; // 0x01B0
    fVector3 m_vecMins; // 0x01BC
    fVector3 m_vecMaxs; // 0x01C8
    uint32_t m_usSolidFlags; // 0x01D8
    uint32_t m_nSurroundType; // 0x01DC
    uint32_t m_nSolidType; // 0x01DD
    uint32_t m_triggerBloat; // 0x01DE
    fVector3 m_vecSpecifiedSurroundingMinsPreScaled; // 0x01E0
    fVector3 m_vecSpecifiedSurroundingMaxsPreScaled; // 0x01EC
    fVector3 m_vecSpecifiedSurroundingMins; // 0x01F8
    fVector3 m_vecSpecifiedSurroundingMaxs; // 0x0204
    float m_flElasticity; // 0x0248
    float m_flShadowCastDistance; // 0x024C
    fVector3 m_vecOrigin; // 0x0338
    fVector3 m_angRotation; // 0x0344
    uint32_t m_CollisionGroup; // 0x0354
    uint32_t m_bIsPlayerSimulated; // 0x04C8
    uint32_t m_bSimulatedEveryTick; // 0x04C9
    uint32_t m_bAnimatedEveryTick; // 0x04CA
    uint32_t m_bAlternateSorting; // 0x04CB
    uint32_t m_iTextureFrameIndex; // 0x04CC
    uint32_t m_hOwnerEntity; // 0x04D8
    uint32_t m_hEffectEntity; // 0x04DC
    uint32_t m_bOnFire; // 0x0515
    float m_CreationTime; // 0x0518
    uint32_t m_RealClassName; // 0x051C
    uint32_t m_OverrideMaterial; // 0x0520
    uint32_t m_OverrideSubMaterials[0]; // 0x0528
    uint32_t m_spawnflags; // 0x0640
    uint32_t m_iGModFlags; // 0x0644
    uintptr_t m_GMOD_bool[32]; // 0x06A0
    uintptr_t m_GMOD_float[32]; // 0x06C0
    uintptr_t m_GMOD_int[32]; // 0x0740
    uintptr_t m_GMOD_Vector[32]; // 0x07C0
    uintptr_t m_GMOD_QAngle[32]; // 0x0940
    uintptr_t m_GMOD_EHANDLE[32]; // 0x0AC0
    const char* m_GMOD_String0; // 0x0B40
    const char* m_GMOD_String1; // 0x0D40
    const char* m_GMOD_String2; // 0x0F40
    const char* m_GMOD_String3; // 0x1140
    int64_t m_GMOD_DataTable; // 0x1340
    uint32_t m_iCreationID; // 0x1388
    uint32_t m_iMapCreatedID; // 0x138C
    uint32_t m_nSkin; // 0x1398
    uint32_t m_nBody; // 0x139C
    uint32_t m_nHitboxSet; // 0x13A0
    float m_flPlaybackRate; // 0x13C0
    fVector3 m_vecForce; // 0x13CC
    uint32_t m_nForceBone; // 0x13D8
    uint32_t m_bClientSideFrameReset; // 0x140C
    float m_fadeMinDist; // 0x1444
    float m_fadeMaxDist; // 0x1448
    float m_flFadeScale; // 0x144C
    float m_flModelScale; // 0x149C
    float m_flModelWidthScale; // 0x149C
    uintptr_t m_flPoseParameter[24]; // 0x14A0
    uintptr_t m_flEncodedController[4]; // 0x15BC
    uint32_t m_bClientSideAnimation; // 0x160C
    uint32_t m_nNewSequenceParity; // 0x1610
    uint32_t m_nResetEventsParity; // 0x1614
    uint32_t m_nSequence; // 0x163C
    float m_flCycle; // 0x1644
    uint32_t m_hLightingOrigin; // 0x16C4
    uint32_t m_hLightingOriginRelative; // 0x16C8
    uint32_t m_nMuzzleFlashParity; // 0x16CC
    fVector3 m_OverrideViewTarget; // 0x16EC
    uint32_t m_pBoneManipulator; // 0x1778
    uint32_t m_pFlexManipulator; // 0x1780
    uint32_t m_hOwner; // 0x17D8
    uint32_t m_nViewModelIndex; // 0x17E0
    float m_flNextPrimaryAttack; // 0x17E4
    float m_flNextSecondaryAttack; // 0x17E8
    float m_flTimeWeaponIdle; // 0x17EC
    uint32_t m_iViewModelIndex; // 0x17F4
    uint32_t m_iWorldModelIndex; // 0x17F8
    uint32_t m_iState; // 0x1818
    uint32_t m_iPrimaryAmmoType; // 0x1820
    uint32_t m_iSecondaryAmmoType; // 0x1824
    uint32_t m_iClip1; // 0x1828
    uint32_t m_iClip2; // 0x182C
    uint32_t m_bFlipViewModel; // 0x1858
};

class CVortigauntEffectDispel // parent CBaseEntity {
public:
    uint32_t movecollide; // 0x0000
    uint32_t movetype; // 0x0000
    void* m_OverrideSubMaterials; // 0x0000
    uint32_t m_nRenderFX; // 0x0054
    uint32_t m_clrRender; // 0x0058
    uint32_t m_flAnimTime; // 0x0060
    uint32_t m_flSimulationTime; // 0x0068
    uint32_t m_ubInterpolationFrame; // 0x0074
    uint32_t m_fEffects; // 0x0078
    uint32_t m_nRenderMode; // 0x007C
    uint32_t m_nModelIndex; // 0x008C
    uint32_t m_takedamage; // 0x008E
    uint32_t m_iHealth; // 0x0090
    uint32_t m_iMaxHealth; // 0x0094
    uint32_t m_iTeamNum; // 0x009C
    uint32_t m_PredictableID; // 0x00A0
    float m_vecVelocity[0]; // 0x00F4
    float m_vecVelocity[1]; // 0x00F8
    float m_vecVelocity[2]; // 0x00FC
    uint32_t m_iParentAttachment; // 0x017A
    uint32_t moveparent; // 0x0190
    fVector3 m_vecMinsPreScaled; // 0x01A4
    fVector3 m_vecMaxsPreScaled; // 0x01B0
    fVector3 m_vecMins; // 0x01BC
    fVector3 m_vecMaxs; // 0x01C8
    uint32_t m_usSolidFlags; // 0x01D8
    uint32_t m_nSurroundType; // 0x01DC
    uint32_t m_nSolidType; // 0x01DD
    uint32_t m_triggerBloat; // 0x01DE
    fVector3 m_vecSpecifiedSurroundingMinsPreScaled; // 0x01E0
    fVector3 m_vecSpecifiedSurroundingMaxsPreScaled; // 0x01EC
    fVector3 m_vecSpecifiedSurroundingMins; // 0x01F8
    fVector3 m_vecSpecifiedSurroundingMaxs; // 0x0204
    float m_flElasticity; // 0x0248
    float m_flShadowCastDistance; // 0x024C
    fVector3 m_vecOrigin; // 0x0338
    fVector3 m_angRotation; // 0x0344
