// Generated by Voidie

class CMaterialModifyControl // parent CBaseEntity {
public:
    uint32_t movetype; // 0x0000
    uint32_t movecollide; // 0x0000
    uint32_t m_nRenderFX; // 0x008C
    uint32_t m_clrRender; // 0x0090
    uint32_t m_flAnimTime; // 0x00A0
    uint32_t m_flSimulationTime; // 0x00A8
    uint32_t m_ubInterpolationFrame; // 0x00B4
    uint32_t m_fEffects; // 0x00B8
    uint32_t m_nRenderMode; // 0x00BC
    uint32_t m_nModelIndex; // 0x00CC
    uintptr_t m_nModelIndexOverrides[4]; // 0x00D0
    uint32_t m_iTeamNum; // 0x00EC
    uint32_t m_PredictableID; // 0x00F0
    float m_flGravity; // 0x020C
    uint32_t m_iParentAttachment; // 0x0226
    uint32_t moveparent; // 0x023C
    fVector3 m_vecMinsPreScaled; // 0x0260
    fVector3 m_vecMaxsPreScaled; // 0x026C
    fVector3 m_vecMins; // 0x0278
    fVector3 m_vecMaxs; // 0x0284
    uint32_t m_usSolidFlags; // 0x0294
    uint32_t m_nSurroundType; // 0x0298
    uint32_t m_nSolidType; // 0x0299
    uint32_t m_triggerBloat; // 0x029A
    uint32_t m_bUniformTriggerBloat; // 0x029B
    fVector3 m_vecSpecifiedSurroundingMinsPreScaled; // 0x029C
    fVector3 m_vecSpecifiedSurroundingMaxsPreScaled; // 0x02A8
    fVector3 m_vecSpecifiedSurroundingMins; // 0x02B4
    fVector3 m_vecSpecifiedSurroundingMaxs; // 0x02C0
    float m_flElasticity; // 0x0320
    float m_flShadowCastDistance; // 0x0324
    fVector3 m_vecOrigin; // 0x0458
    fVector3 m_angRotation; // 0x0464
    uint32_t m_CollisionGroup; // 0x0474
    uint32_t m_bIsPlayerSimulated; // 0x0754
    uint32_t m_bSimulatedEveryTick; // 0x0755
    uint32_t m_bAnimatedEveryTick; // 0x0756
    uint32_t m_bAlternateSorting; // 0x0757
    uint32_t m_iTextureFrameIndex; // 0x0758
    uint32_t m_hOwnerEntity; // 0x0764
    uint32_t m_hEffectEntity; // 0x0768
    const char* m_szMaterialName; // 0x07C0
    const char* m_szMaterialVar; // 0x08BF
    const char* m_szMaterialVarValue; // 0x09BE
    uint32_t m_iFrameStart; // 0x0ACC
    uint32_t m_iFrameEnd; // 0x0AD0
    uint32_t m_bWrap; // 0x0AD4
    float m_flFramerate; // 0x0AD8
    uint32_t m_bNewAnimCommandsSemaphore; // 0x0ADC
    float m_flFloatLerpStartValue; // 0x0AE0
    float m_flFloatLerpEndValue; // 0x0AE4
    float m_flFloatLerpTransitionTime; // 0x0AE8
    uint32_t m_bFloatLerpWrap; // 0x0AEC
    uint32_t m_nModifyMode; // 0x0AF4
};

class CTFRobotDestructionLogic {
public:
    uint32_t m_nMaxPoints; // 0x07C4
    float m_flFinaleLength; // 0x07C8
    float m_flBlueFinaleEndTime; // 0x07CC
    float m_flRedFinaleEndTime; // 0x07D0
    uint32_t m_nBlueScore; // 0x07D4
    uint32_t m_nRedScore; // 0x07D8
    uint32_t m_nBlueTargetPoints; // 0x07DC
    uint32_t m_nRedTargetPoints; // 0x07E0
    float m_flBlueTeamRespawnScale; // 0x07E4
    float m_flRedTeamRespawnScale; // 0x07E8
    const char* m_szResFile; // 0x07EC
    uintptr_t m_eWinningMethod[4]; // 0x08F0
    float m_flCountdownEndTime; // 0x0900
};

class CTFParachute_Primary // parent CBaseEntity {
public:
    uint32_t movecollide; // 0x0000
    uint32_t movetype; // 0x0000
    uint32_t m_nRenderFX; // 0x008C
    uint32_t m_clrRender; // 0x0090
    uint32_t m_flAnimTime; // 0x00A0
    uint32_t m_flSimulationTime; // 0x00A8
    uint32_t m_ubInterpolationFrame; // 0x00B4
    uint32_t m_fEffects; // 0x00B8
    uint32_t m_nRenderMode; // 0x00BC
    uint32_t m_nNextThinkTick; // 0x00C4
    uint32_t m_nModelIndex; // 0x00CC
    uintptr_t m_nModelIndexOverrides[4]; // 0x00D0
    uint32_t m_iTeamNum; // 0x00EC
    uint32_t m_PredictableID; // 0x00F0
    float m_flGravity; // 0x020C
    uint32_t m_iParentAttachment; // 0x0226
    uint32_t moveparent; // 0x023C
    fVector3 m_vecMinsPreScaled; // 0x0260
    fVector3 m_vecMaxsPreScaled; // 0x026C
    fVector3 m_vecMins; // 0x0278
    fVector3 m_vecMaxs; // 0x0284
    uint32_t m_usSolidFlags; // 0x0294
    uint32_t m_nSurroundType; // 0x0298
    uint32_t m_nSolidType; // 0x0299
    uint32_t m_triggerBloat; // 0x029A
    uint32_t m_bUniformTriggerBloat; // 0x029B
    fVector3 m_vecSpecifiedSurroundingMinsPreScaled; // 0x029C
    fVector3 m_vecSpecifiedSurroundingMaxsPreScaled; // 0x02A8
    fVector3 m_vecSpecifiedSurroundingMins; // 0x02B4
    fVector3 m_vecSpecifiedSurroundingMaxs; // 0x02C0
    float m_flElasticity; // 0x0320
    float m_flShadowCastDistance; // 0x0324
    fVector3 m_vecOrigin; // 0x0458
    fVector3 m_angRotation; // 0x0464
    uint32_t m_CollisionGroup; // 0x0474
    uint32_t m_bIsPlayerSimulated; // 0x0754
    uint32_t m_bSimulatedEveryTick; // 0x0755
    uint32_t m_bAnimatedEveryTick; // 0x0756
    uint32_t m_bAlternateSorting; // 0x0757
    uint32_t m_iTextureFrameIndex; // 0x0758
    uint32_t m_hOwnerEntity; // 0x0764
    uint32_t m_hEffectEntity; // 0x0768
    uint32_t m_nSkin; // 0x07D0
    uint32_t m_nBody; // 0x07D4
    uint32_t m_nHitboxSet; // 0x07D8
    float m_flPlaybackRate; // 0x080C
    fVector3 m_vecForce; // 0x0820
    uint32_t m_nForceBone; // 0x082C
    uint32_t m_bClientSideFrameReset; // 0x086C
    float m_fadeMinDist; // 0x08B0
    float m_fadeMaxDist; // 0x08B4
    float m_flFadeScale; // 0x08B8
    float m_flModelScale; // 0x091C
    float m_flModelWidthScale; // 0x091C
    uintptr_t m_flPoseParameter[24]; // 0x0920
    uintptr_t m_flEncodedController[4]; // 0x0A68
    uint32_t m_bClientSideAnimation; // 0x0AD8
    uint32_t m_nNewSequenceParity; // 0x0ADC
    uint32_t m_nResetEventsParity; // 0x0AE0
    uint32_t m_nSequence; // 0x0B08
    float m_flCycle; // 0x0B10
    uint32_t m_hLightingOrigin; // 0x0BD8
    uint32_t m_hLightingOriginRelative; // 0x0BDC
    uint32_t m_nMuzzleFlashParity; // 0x0BE0
    uint32_t m_iReapplyProvisionParity; // 0x0C88
    uint32_t m_hOuter; // 0x0C8C
    uint32_t m_ProviderType; // 0x0C94
    uint32_t m_iItemDefinitionIndex; // 0x0D10
    uint32_t m_iEntityQuality; // 0x0D14
    uint32_t m_iEntityLevel; // 0x0D18
    uint32_t m_iItemIDHigh; // 0x0D28
    uint32_t m_iItemIDLow; // 0x0D2C
    uint32_t m_iAccountID; // 0x0D30
    uint32_t m_iTeamNumber; // 0x0D98
    uint32_t m_bInitialized; // 0x0D9C
    uint32_t lengthprop20; // 0x0DE8
    uint32_t m_iAttributeDefinitionIndex; // 0x0DF0
    float m_flValue; // 0x0DF4
    uint32_t m_iRawValue32; // 0x0DF4
    uint32_t m_nRefundableCurrency; // 0x0DF8
    uint32_t m_bOnlyIterateItemViewAttributes; // 0x0E18
    uint32_t m_bValidatedAttachedEntity; // 0x0E20
    uint32_t m_hOwner; // 0x0E90
    uint32_t m_nViewModelIndex; // 0x0EA0
    float m_flNextPrimaryAttack; // 0x0EA4
    float m_flNextSecondaryAttack; // 0x0EA8
    float m_flTimeWeaponIdle; // 0x0EAC
    uint32_t m_iViewModelIndex; // 0x0EB4
    uint32_t m_iWorldModelIndex; // 0x0EB8
    uint32_t m_iState; // 0x0ED8
    uint32_t m_iPrimaryAmmoType; // 0x0EE8
    uint32_t m_iSecondaryAmmoType; // 0x0EEC
    uint32_t m_iClip1; // 0x0EF0
    uint32_t m_iClip2; // 0x0EF4
    uint32_t m_bFlipViewModel; // 0x0F20
    uint32_t m_nCustomViewmodelModelIndex; // 0x0F44
    float m_flEffectBarRegenTime; // 0x0F80
    uint32_t m_iReloadMode; // 0x0F88
    float m_flReloadPriorNextFire; // 0x0F8C
    uint32_t m_bLowered; // 0x0FA8
    float m_flLastCritCheckTime; // 0x0FB8
    uint32_t m_bResetParity; // 0x104C
    uint32_t m_bReloadedThroughAnimEvent; // 0x1064
    float m_flEnergy; // 0x1068
    uint32_t m_iConsecutiveShots; // 0x106C
    uint32_t m_bDisguiseWeapon; // 0x1070
    float m_flLastFireTime; // 0x1074
    uint32_t m_hExtraWearable; // 0x1078
    uint32_t m_hExtraWearableViewModel; // 0x107C
    float m_flObservedCritChance; // 0x1080
    uint32_t m_bBeingRepurposedForTaunt; // 0x1084
    uint32_t m_nKillComboClass; // 0x1088
    uint32_t m_nKillComboCount; // 0x108C
    float m_flInspectAnimEndTime; // 0x1090
    uint32_t m_nInspectStage; // 0x1094
};

class CTEBeamRingPoint // parent CBaseBeam {
public:
    uint32_t m_nModelIndex; // 0x0020
    uint32_t m_nHaloIndex; // 0x0024
    uint32_t m_nStartFrame; // 0x0028
    uint32_t m_nFrameRate; // 0x002C
    float m_fLife; // 0x0030
    float m_fWidth; // 0x0034
    float m_fEndWidth; // 0x0038
    uint32_t m_nFadeLength; // 0x003C
    float m_fAmplitude; // 0x0040
    uint32_t r; // 0x0044
    uint32_t g; // 0x0048
    uint32_t b; // 0x004C
    uint32_t a; // 0x0050
    uint32_t m_nSpeed; // 0x0054
    uint32_t m_nFlags; // 0x0058
    fVector3 m_vecCenter; // 0x0060
    float m_flStartRadius; // 0x006C
    float m_flEndRadius; // 0x0070
};

class CTFShotgun // parent CBaseEntity {
public:
    uint32_t movecollide; // 0x0000
    uint32_t movetype; // 0x0000
    uint32_t m_nRenderFX; // 0x008C
    uint32_t m_clrRender; // 0x0090
    uint32_t m_flAnimTime; // 0x00A0
    uint32_t m_flSimulationTime; // 0x00A8
    uint32_t m_ubInterpolationFrame; // 0x00B4
    uint32_t m_fEffects; // 0x00B8
    uint32_t m_nRenderMode; // 0x00BC
    uint32_t m_nNextThinkTick; // 0x00C4
    uint32_t m_nModelIndex; // 0x00CC
    uintptr_t m_nModelIndexOverrides[4]; // 0x00D0
    uint32_t m_iTeamNum; // 0x00EC
    uint32_t m_PredictableID; // 0x00F0
    float m_flGravity; // 0x020C
    uint32_t m_iParentAttachment; // 0x0226
    uint32_t moveparent; // 0x023C
    fVector3 m_vecMinsPreScaled; // 0x0260
    fVector3 m_vecMaxsPreScaled; // 0x026C
    fVector3 m_vecMins; // 0x0278
    fVector3 m_vecMaxs; // 0x0284
    uint32_t m_usSolidFlags; // 0x0294
    uint32_t m_nSurroundType; // 0x0298
    uint32_t m_nSolidType; // 0x0299
    uint32_t m_triggerBloat; // 0x029A
    uint32_t m_bUniformTriggerBloat; // 0x029B
    fVector3 m_vecSpecifiedSurroundingMinsPreScaled; // 0x029C
    fVector3 m_vecSpecifiedSurroundingMaxsPreScaled; // 0x02A8
    fVector3 m_vecSpecifiedSurroundingMins; // 0x02B4
    fVector3 m_vecSpecifiedSurroundingMaxs; // 0x02C0
    float m_flElasticity; // 0x0320
    float m_flShadowCastDistance; // 0x0324
    fVector3 m_vecOrigin; // 0x0458
    fVector3 m_angRotation; // 0x0464
    uint32_t m_CollisionGroup; // 0x0474
    uint32_t m_bIsPlayerSimulated; // 0x0754
    uint32_t m_bSimulatedEveryTick; // 0x0755
    uint32_t m_bAnimatedEveryTick; // 0x0756
    uint32_t m_bAlternateSorting; // 0x0757
    uint32_t m_iTextureFrameIndex; // 0x0758
    uint32_t m_hOwnerEntity; // 0x0764
    uint32_t m_hEffectEntity; // 0x0768
    uint32_t m_nSkin; // 0x07D0
    uint32_t m_nBody; // 0x07D4
    uint32_t m_nHitboxSet; // 0x07D8
    float m_flPlaybackRate; // 0x080C
    fVector3 m_vecForce; // 0x0820
    uint32_t m_nForceBone; // 0x082C
    uint32_t m_bClientSideFrameReset; // 0x086C
    float m_fadeMinDist; // 0x08B0
    float m_fadeMaxDist; // 0x08B4
    float m_flFadeScale; // 0x08B8
    float m_flModelScale; // 0x091C
    float m_flModelWidthScale; // 0x091C
    uintptr_t m_flPoseParameter[24]; // 0x0920
    uintptr_t m_flEncodedController[4]; // 0x0A68
    uint32_t m_bClientSideAnimation; // 0x0AD8
    uint32_t m_nNewSequenceParity; // 0x0ADC
    uint32_t m_nResetEventsParity; // 0x0AE0
    uint32_t m_nSequence; // 0x0B08
    float m_flCycle; // 0x0B10
    uint32_t m_hLightingOrigin; // 0x0BD8
    uint32_t m_hLightingOriginRelative; // 0x0BDC
    uint32_t m_nMuzzleFlashParity; // 0x0BE0
    uint32_t m_iReapplyProvisionParity; // 0x0C88
    uint32_t m_hOuter; // 0x0C8C
    uint32_t m_ProviderType; // 0x0C94
    uint32_t m_iItemDefinitionIndex; // 0x0D10
    uint32_t m_iEntityQuality; // 0x0D14
    uint32_t m_iEntityLevel; // 0x0D18
    uint32_t m_iItemIDHigh; // 0x0D28
    uint32_t m_iItemIDLow; // 0x0D2C
    uint32_t m_iAccountID; // 0x0D30
    uint32_t m_iTeamNumber; // 0x0D98
    uint32_t m_bInitialized; // 0x0D9C
    uint32_t lengthprop20; // 0x0DE8
    uint32_t m_iAttributeDefinitionIndex; // 0x0DF0
    float m_flValue; // 0x0DF4
    uint32_t m_iRawValue32; // 0x0DF4
    uint32_t m_nRefundableCurrency; // 0x0DF8
    uint32_t m_bOnlyIterateItemViewAttributes; // 0x0E18
    uint32_t m_bValidatedAttachedEntity; // 0x0E20
    uint32_t m_hOwner; // 0x0E90
    uint32_t m_nViewModelIndex; // 0x0EA0
    float m_flNextPrimaryAttack; // 0x0EA4
    float m_flNextSecondaryAttack; // 0x0EA8
    float m_flTimeWeaponIdle; // 0x0EAC
    uint32_t m_iViewModelIndex; // 0x0EB4
    uint32_t m_iWorldModelIndex; // 0x0EB8
    uint32_t m_iState; // 0x0ED8
    uint32_t m_iPrimaryAmmoType; // 0x0EE8
    uint32_t m_iSecondaryAmmoType; // 0x0EEC
    uint32_t m_iClip1; // 0x0EF0
    uint32_t m_iClip2; // 0x0EF4
    uint32_t m_bFlipViewModel; // 0x0F20
    uint32_t m_nCustomViewmodelModelIndex; // 0x0F44
    float m_flEffectBarRegenTime; // 0x0F80
    uint32_t m_iReloadMode; // 0x0F88
    float m_flReloadPriorNextFire; // 0x0F8C
    uint32_t m_bLowered; // 0x0FA8
    float m_flLastCritCheckTime; // 0x0FB8
    uint32_t m_bResetParity; // 0x104C
    uint32_t m_bReloadedThroughAnimEvent; // 0x1064
    float m_flEnergy; // 0x1068
    uint32_t m_iConsecutiveShots; // 0x106C
    uint32_t m_bDisguiseWeapon; // 0x1070
    float m_flLastFireTime; // 0x1074
    uint32_t m_hExtraWearable; // 0x1078
    uint32_t m_hExtraWearableViewModel; // 0x107C
    float m_flObservedCritChance; // 0x1080
    uint32_t m_bBeingRepurposedForTaunt; // 0x1084
    uint32_t m_nKillComboClass; // 0x1088
    uint32_t m_nKillComboCount; // 0x108C
    float m_flInspectAnimEndTime; // 0x1090
    uint32_t m_nInspectStage; // 0x1094
};

class CTFWearableCampaignItem // parent CBaseEntity {
public:
    uint32_t movetype; // 0x0000
    uint32_t movecollide; // 0x0000
    uint32_t m_nRenderFX; // 0x008C
    uint32_t m_clrRender; // 0x0090
    uint32_t m_flAnimTime; // 0x00A0
    uint32_t m_flSimulationTime; // 0x00A8
    uint32_t m_ubInterpolationFrame; // 0x00B4
    uint32_t m_fEffects; // 0x00B8
    uint32_t m_nRenderMode; // 0x00BC
    uint32_t m_nModelIndex; // 0x00CC
    uintptr_t m_nModelIndexOverrides[4]; // 0x00D0
    uint32_t m_iTeamNum; // 0x00EC
    uint32_t m_PredictableID; // 0x00F0
    float m_flGravity; // 0x020C
    uint32_t m_iParentAttachment; // 0x0226
    uint32_t moveparent; // 0x023C
    fVector3 m_vecMinsPreScaled; // 0x0260
    fVector3 m_vecMaxsPreScaled; // 0x026C
    fVector3 m_vecMins; // 0x0278
    fVector3 m_vecMaxs; // 0x0284
    uint32_t m_usSolidFlags; // 0x0294
    uint32_t m_nSurroundType; // 0x0298
    uint32_t m_nSolidType; // 0x0299
    uint32_t m_triggerBloat; // 0x029A
    uint32_t m_bUniformTriggerBloat; // 0x029B
    fVector3 m_vecSpecifiedSurroundingMinsPreScaled; // 0x029C
    fVector3 m_vecSpecifiedSurroundingMaxsPreScaled; // 0x02A8
    fVector3 m_vecSpecifiedSurroundingMins; // 0x02B4
    fVector3 m_vecSpecifiedSurroundingMaxs; // 0x02C0
    float m_flElasticity; // 0x0320
    float m_flShadowCastDistance; // 0x0324
    fVector3 m_vecOrigin; // 0x0458
    fVector3 m_angRotation; // 0x0464
    uint32_t m_CollisionGroup; // 0x0474
    uint32_t m_bIsPlayerSimulated; // 0x0754
    uint32_t m_bSimulatedEveryTick; // 0x0755
    uint32_t m_bAnimatedEveryTick; // 0x0756
    uint32_t m_bAlternateSorting; // 0x0757
    uint32_t m_iTextureFrameIndex; // 0x0758
    uint32_t m_hOwnerEntity; // 0x0764
    uint32_t m_hEffectEntity; // 0x0768
    uint32_t m_nSkin; // 0x07D0
    uint32_t m_nBody; // 0x07D4
    uint32_t m_nHitboxSet; // 0x07D8
    float m_flPlaybackRate; // 0x080C
    fVector3 m_vecForce; // 0x0820
    uint32_t m_nForceBone; // 0x082C
    uint32_t m_bClientSideFrameReset; // 0x086C
    float m_fadeMinDist; // 0x08B0
    float m_fadeMaxDist; // 0x08B4
    float m_flFadeScale; // 0x08B8
    float m_flModelScale; // 0x091C
    float m_flModelWidthScale; // 0x091C
    uintptr_t m_flPoseParameter[24]; // 0x0920
    uintptr_t m_flEncodedController[4]; // 0x0A68
    uint32_t m_bClientSideAnimation; // 0x0AD8
    uint32_t m_nNewSequenceParity; // 0x0ADC
    uint32_t m_nResetEventsParity; // 0x0AE0
    uint32_t m_nSequence; // 0x0B08
    float m_flCycle; // 0x0B10
    uint32_t m_hLightingOrigin; // 0x0BD8
    uint32_t m_hLightingOriginRelative; // 0x0BDC
    uint32_t m_nMuzzleFlashParity; // 0x0BE0
    uint32_t m_iReapplyProvisionParity; // 0x0C88
    uint32_t m_hOuter; // 0x0C8C
    uint32_t m_ProviderType; // 0x0C94
    uint32_t m_iItemDefinitionIndex; // 0x0D10
    uint32_t m_iEntityQuality; // 0x0D14
    uint32_t m_iEntityLevel; // 0x0D18
    uint32_t m_iItemIDHigh; // 0x0D28
    uint32_t m_iItemIDLow; // 0x0D2C
    uint32_t m_iAccountID; // 0x0D30
    uint32_t m_iTeamNumber; // 0x0D98
    uint32_t m_bInitialized; // 0x0D9C
    uint32_t lengthprop20; // 0x0DE8
    uint32_t m_iAttributeDefinitionIndex; // 0x0DF0
    uint32_t m_iRawValue32; // 0x0DF4
    float m_flValue; // 0x0DF4
    uint32_t m_nRefundableCurrency; // 0x0DF8
    uint32_t m_bOnlyIterateItemViewAttributes; // 0x0E18
    uint32_t m_bValidatedAttachedEntity; // 0x0E20
    uint32_t m_bDisguiseWearable; // 0x0EB0
    uint32_t m_hWeaponAssociatedWith; // 0x0EB4
    uint32_t m_nState; // 0x0EE0
};

class CEntityDissolve // parent CBaseEntity {
public:
    uint32_t movetype; // 0x0000
    uint32_t movecollide; // 0x0000
    uint32_t m_nRenderFX; // 0x008C
    uint32_t m_clrRender; // 0x0090
    uint32_t m_flAnimTime; // 0x00A0
    uint32_t m_flSimulationTime; // 0x00A8
    uint32_t m_ubInterpolationFrame; // 0x00B4
    uint32_t m_fEffects; // 0x00B8
    uint32_t m_nRenderMode; // 0x00BC
    uint32_t m_nModelIndex; // 0x00CC
    uintptr_t m_nModelIndexOverrides[4]; // 0x00D0
    uint32_t m_iTeamNum; // 0x00EC
    uint32_t m_PredictableID; // 0x00F0
    float m_flGravity; // 0x020C
    uint32_t m_iParentAttachment; // 0x0226
    uint32_t moveparent; // 0x023C
    fVector3 m_vecMinsPreScaled; // 0x0260
    fVector3 m_vecMaxsPreScaled; // 0x026C
    fVector3 m_vecMins; // 0x0278
    fVector3 m_vecMaxs; // 0x0284
    uint32_t m_usSolidFlags; // 0x0294
    uint32_t m_nSurroundType; // 0x0298
    uint32_t m_nSolidType; // 0x0299
    uint32_t m_triggerBloat; // 0x029A
    uint32_t m_bUniformTriggerBloat; // 0x029B
    fVector3 m_vecSpecifiedSurroundingMinsPreScaled; // 0x029C
    fVector3 m_vecSpecifiedSurroundingMaxsPreScaled; // 0x02A8
    fVector3 m_vecSpecifiedSurroundingMins; // 0x02B4
    fVector3 m_vecSpecifiedSurroundingMaxs; // 0x02C0
    float m_flElasticity; // 0x0320
    float m_flShadowCastDistance; // 0x0324
    fVector3 m_vecOrigin; // 0x0458
    fVector3 m_angRotation; // 0x0464
    uint32_t m_CollisionGroup; // 0x0474
    uint32_t m_bIsPlayerSimulated; // 0x0754
    uint32_t m_bSimulatedEveryTick; // 0x0755
    uint32_t m_bAnimatedEveryTick; // 0x0756
    uint32_t m_bAlternateSorting; // 0x0757
    uint32_t m_iTextureFrameIndex; // 0x0758
    uint32_t m_hOwnerEntity; // 0x0764
    uint32_t m_hEffectEntity; // 0x0768
    float m_flStartTime; // 0x07C8
    float m_flFadeOutStart; // 0x07CC
    float m_flFadeOutLength; // 0x07D0
    float m_flFadeOutModelStart; // 0x07D4
    float m_flFadeOutModelLength; // 0x07D8
    float m_flFadeInStart; // 0x07DC
    float m_flFadeInLength; // 0x07E0
    uint32_t m_nDissolveType; // 0x07E4
    fVector3 m_vDissolverOrigin; // 0x07F8
    uint32_t m_nMagnitude; // 0x0804
};

class CTFWeaponPDA_Engineer_Build // parent CBaseEntity {
public:
    uint32_t movecollide; // 0x0000
    uint32_t movetype; // 0x0000
    uint32_t m_nRenderFX; // 0x008C
    uint32_t m_clrRender; // 0x0090
    uint32_t m_flAnimTime; // 0x00A0
    uint32_t m_flSimulationTime; // 0x00A8
    uint32_t m_ubInterpolationFrame; // 0x00B4
    uint32_t m_fEffects; // 0x00B8
    uint32_t m_nRenderMode; // 0x00BC
    uint32_t m_nNextThinkTick; // 0x00C4
    uint32_t m_nModelIndex; // 0x00CC
    uintptr_t m_nModelIndexOverrides[4]; // 0x00D0
    uint32_t m_iTeamNum; // 0x00EC
    uint32_t m_PredictableID; // 0x00F0
    float m_flGravity; // 0x020C
    uint32_t m_iParentAttachment; // 0x0226
    uint32_t moveparent; // 0x023C
    fVector3 m_vecMinsPreScaled; // 0x0260
    fVector3 m_vecMaxsPreScaled; // 0x026C
    fVector3 m_vecMins; // 0x0278
    fVector3 m_vecMaxs; // 0x0284
    uint32_t m_usSolidFlags; // 0x0294
    uint32_t m_nSurroundType; // 0x0298
    uint32_t m_nSolidType; // 0x0299
    uint32_t m_triggerBloat; // 0x029A
    uint32_t m_bUniformTriggerBloat; // 0x029B
    fVector3 m_vecSpecifiedSurroundingMinsPreScaled; // 0x029C
    fVector3 m_vecSpecifiedSurroundingMaxsPreScaled; // 0x02A8
    fVector3 m_vecSpecifiedSurroundingMins; // 0x02B4
    fVector3 m_vecSpecifiedSurroundingMaxs; // 0x02C0
    float m_flElasticity; // 0x0320
    float m_flShadowCastDistance; // 0x0324
    fVector3 m_vecOrigin; // 0x0458
    fVector3 m_angRotation; // 0x0464
    uint32_t m_CollisionGroup; // 0x0474
    uint32_t m_bIsPlayerSimulated; // 0x0754
    uint32_t m_bSimulatedEveryTick; // 0x0755
    uint32_t m_bAnimatedEveryTick; // 0x0756
    uint32_t m_bAlternateSorting; // 0x0757
    uint32_t m_iTextureFrameIndex; // 0x0758
    uint32_t m_hOwnerEntity; // 0x0764
    uint32_t m_hEffectEntity; // 0x0768
    uint32_t m_nSkin; // 0x07D0
    uint32_t m_nBody; // 0x07D4
    uint32_t m_nHitboxSet; // 0x07D8
    float m_flPlaybackRate; // 0x080C
    fVector3 m_vecForce; // 0x0820
    uint32_t m_nForceBone; // 0x082C
    uint32_t m_bClientSideFrameReset; // 0x086C
    float m_fadeMinDist; // 0x08B0
    float m_fadeMaxDist; // 0x08B4
    float m_flFadeScale; // 0x08B8
    float m_flModelScale; // 0x091C
    float m_flModelWidthScale; // 0x091C
    uintptr_t m_flPoseParameter[24]; // 0x0920
    uintptr_t m_flEncodedController[4]; // 0x0A68
    uint32_t m_bClientSideAnimation; // 0x0AD8
    uint32_t m_nNewSequenceParity; // 0x0ADC
    uint32_t m_nResetEventsParity; // 0x0AE0
    uint32_t m_nSequence; // 0x0B08
    float m_flCycle; // 0x0B10
    uint32_t m_hLightingOrigin; // 0x0BD8
    uint32_t m_hLightingOriginRelative; // 0x0BDC
    uint32_t m_nMuzzleFlashParity; // 0x0BE0
    uint32_t m_iReapplyProvisionParity; // 0x0C88
    uint32_t m_hOuter; // 0x0C8C
    uint32_t m_ProviderType; // 0x0C94
    uint32_t m_iItemDefinitionIndex; // 0x0D10
    uint32_t m_iEntityQuality; // 0x0D14
    uint32_t m_iEntityLevel; // 0x0D18
    uint32_t m_iItemIDHigh; // 0x0D28
    uint32_t m_iItemIDLow; // 0x0D2C
    uint32_t m_iAccountID; // 0x0D30
    uint32_t m_iTeamNumber; // 0x0D98
    uint32_t m_bInitialized; // 0x0D9C
    uint32_t lengthprop20; // 0x0DE8
    uint32_t m_iAttributeDefinitionIndex; // 0x0DF0
    float m_flValue; // 0x0DF4
    uint32_t m_iRawValue32; // 0x0DF4
    uint32_t m_nRefundableCurrency; // 0x0DF8
    uint32_t m_bOnlyIterateItemViewAttributes; // 0x0E18
    uint32_t m_bValidatedAttachedEntity; // 0x0E20
    uint32_t m_hOwner; // 0x0E90
    uint32_t m_nViewModelIndex; // 0x0EA0
    float m_flNextPrimaryAttack; // 0x0EA4
    float m_flNextSecondaryAttack; // 0x0EA8
    float m_flTimeWeaponIdle; // 0x0EAC
    uint32_t m_iViewModelIndex; // 0x0EB4
    uint32_t m_iWorldModelIndex; // 0x0EB8
    uint32_t m_iState; // 0x0ED8
    uint32_t m_iPrimaryAmmoType; // 0x0EE8
    uint32_t m_iSecondaryAmmoType; // 0x0EEC
    uint32_t m_iClip1; // 0x0EF0
    uint32_t m_iClip2; // 0x0EF4
    uint32_t m_bFlipViewModel; // 0x0F20
    uint32_t m_nCustomViewmodelModelIndex; // 0x0F44
    float m_flEffectBarRegenTime; // 0x0F80
    uint32_t m_iReloadMode; // 0x0F88
    float m_flReloadPriorNextFire; // 0x0F8C
    uint32_t m_bLowered; // 0x0FA8
    float m_flLastCritCheckTime; // 0x0FB8
    uint32_t m_bResetParity; // 0x104C
    uint32_t m_bReloadedThroughAnimEvent; // 0x1064
    float m_flEnergy; // 0x1068
    uint32_t m_iConsecutiveShots; // 0x106C
    uint32_t m_bDisguiseWeapon; // 0x1070
    float m_flLastFireTime; // 0x1074
    uint32_t m_hExtraWearable; // 0x1078
    uint32_t m_hExtraWearableViewModel; // 0x107C
    float m_flObservedCritChance; // 0x1080
    uint32_t m_bBeingRepurposedForTaunt; // 0x1084
    uint32_t m_nKillComboClass; // 0x1088
    uint32_t m_nKillComboCount; // 0x108C
    float m_flInspectAnimEndTime; // 0x1090
    uint32_t m_nInspectStage; // 0x1094
};

class CBaseCombatCharacter // parent CBaseEntity {
public:
    uint32_t movecollide; // 0x0000
    uint32_t movetype; // 0x0000
    uint32_t lengthprop15; // 0x0000
    uint32_t m_nSequence; // 0x0000
    float m_flPrevCycle; // 0x0004
    float m_flWeight; // 0x0008
    uint32_t m_nOrder; // 0x000C
    float m_flCycle; // 0x0014
    uint32_t m_nRenderFX; // 0x008C
    uint32_t m_clrRender; // 0x0090
    uint32_t m_flAnimTime; // 0x00A0
    uint32_t m_flSimulationTime; // 0x00A8
    uint32_t m_ubInterpolationFrame; // 0x00B4
    uint32_t m_fEffects; // 0x00B8
    uint32_t m_nRenderMode; // 0x00BC
    uint32_t m_nModelIndex; // 0x00CC
    uintptr_t m_nModelIndexOverrides[4]; // 0x00D0
    uint32_t m_iTeamNum; // 0x00EC
    uint32_t m_PredictableID; // 0x00F0
    float m_flGravity; // 0x020C
    uint32_t m_iParentAttachment; // 0x0226
    uint32_t moveparent; // 0x023C
    fVector3 m_vecMinsPreScaled; // 0x0260
    fVector3 m_vecMaxsPreScaled; // 0x026C
    fVector3 m_vecMins; // 0x0278
    fVector3 m_vecMaxs; // 0x0284
    uint32_t m_usSolidFlags; // 0x0294
    uint32_t m_nSurroundType; // 0x0298
    uint32_t m_nSolidType; // 0x0299
    uint32_t m_triggerBloat; // 0x029A
    uint32_t m_bUniformTriggerBloat; // 0x029B
    fVector3 m_vecSpecifiedSurroundingMinsPreScaled; // 0x029C
    fVector3 m_vecSpecifiedSurroundingMaxsPreScaled; // 0x02A8
    fVector3 m_vecSpecifiedSurroundingMins; // 0x02B4
    fVector3 m_vecSpecifiedSurroundingMaxs; // 0x02C0
    float m_flElasticity; // 0x0320
    float m_flShadowCastDistance; // 0x0324
    fVector3 m_vecOrigin; // 0x0458
    fVector3 m_angRotation; // 0x0464
    uint32_t m_CollisionGroup; // 0x0474
    uint32_t m_bIsPlayerSimulated; // 0x0754
    uint32_t m_bSimulatedEveryTick; // 0x0755
    uint32_t m_bAnimatedEveryTick; // 0x0756
    uint32_t m_bAlternateSorting; // 0x0757
    uint32_t m_iTextureFrameIndex; // 0x0758
    uint32_t m_hOwnerEntity; // 0x0764
    uint32_t m_hEffectEntity; // 0x0768
    uint32_t m_nSkin; // 0x07D0
    uint32_t m_nBody; // 0x07D4
    uint32_t m_nHitboxSet; // 0x07D8
    float m_flPlaybackRate; // 0x080C
    fVector3 m_vecForce; // 0x0820
    uint32_t m_nForceBone; // 0x082C
    uint32_t m_bClientSideFrameReset; // 0x086C
    float m_fadeMinDist; // 0x08B0
    float m_fadeMaxDist; // 0x08B4
    float m_flFadeScale; // 0x08B8
    float m_flModelWidthScale; // 0x091C
    float m_flModelScale; // 0x091C
    uintptr_t m_flPoseParameter[24]; // 0x0920
    uintptr_t m_flEncodedController[4]; // 0x0A68
    uint32_t m_bClientSideAnimation; // 0x0AD8
    uint32_t m_nNewSequenceParity; // 0x0ADC
    uint32_t m_nResetEventsParity; // 0x0AE0
    uint32_t m_hLightingOrigin; // 0x0BD8
    uint32_t m_hLightingOriginRelative; // 0x0BDC
    uint32_t m_nMuzzleFlashParity; // 0x0BE0
    fVector3 m_viewtarget; // 0x0CA0
    uintptr_t m_flexWeight[96]; // 0x0D00
    uint32_t m_blinktoggle; // 0x0ED0
    float m_flNextAttack; // 0x1090
    uintptr_t m_hMyWeapons[48]; // 0x1118
    uint32_t m_hActiveWeapon; // 0x11D8
    uint32_t m_bGlowEnabled; // 0x11DD
};

class CTFRobotDestruction_RobotGroup {
public:
    uint32_t m_iTeamNum; // 0x07C8
    const char* m_pszHudIcon; // 0x07CC
    uint32_t m_nGroupNumber; // 0x08D0
    uint32_t m_nState; // 0x08D4
    float m_flRespawnStartTime; // 0x08D8
    float m_flRespawnEndTime; // 0x08DC
    float m_flLastAttackedTime; // 0x08E0
};

class CTFWearableRazorback // parent CBaseEntity {
public:
    uint32_t movetype; // 0x0000
    uint32_t movecollide; // 0x0000
    uint32_t m_nRenderFX; // 0x008C
    uint32_t m_clrRender; // 0x0090
    uint32_t m_flAnimTime; // 0x00A0
    uint32_t m_flSimulationTime; // 0x00A8
    uint32_t m_ubInterpolationFrame; // 0x00B4
    uint32_t m_fEffects; // 0x00B8
    uint32_t m_nRenderMode; // 0x00BC
    uint32_t m_nModelIndex; // 0x00CC
    uintptr_t m_nModelIndexOverrides[4]; // 0x00D0
    uint32_t m_iTeamNum; // 0x00EC
    uint32_t m_PredictableID; // 0x00F0
    float m_flGravity; // 0x020C
    uint32_t m_iParentAttachment; // 0x0226
    uint32_t moveparent; // 0x023C
    fVector3 m_vecMinsPreScaled; // 0x0260
    fVector3 m_vecMaxsPreScaled; // 0x026C
    fVector3 m_vecMins; // 0x0278
    fVector3 m_vecMaxs; // 0x0284
    uint32_t m_usSolidFlags; // 0x0294
    uint32_t m_nSurroundType; // 0x0298
    uint32_t m_nSolidType; // 0x0299
    uint32_t m_triggerBloat; // 0x029A
    uint32_t m_bUniformTriggerBloat; // 0x029B
    fVector3 m_vecSpecifiedSurroundingMinsPreScaled; // 0x029C
    fVector3 m_vecSpecifiedSurroundingMaxsPreScaled; // 0x02A8
    fVector3 m_vecSpecifiedSurroundingMins; // 0x02B4
    fVector3 m_vecSpecifiedSurroundingMaxs; // 0x02C0
    float m_flElasticity; // 0x0320
    float m_flShadowCastDistance; // 0x0324
    fVector3 m_vecOrigin; // 0x0458
    fVector3 m_angRotation; // 0x0464
    uint32_t m_CollisionGroup; // 0x0474
    uint32_t m_bIsPlayerSimulated; // 0x0754
    uint32_t m_bSimulatedEveryTick; // 0x0755
    uint32_t m_bAnimatedEveryTick; // 0x0756
    uint32_t m_bAlternateSorting; // 0x0757
    uint32_t m_iTextureFrameIndex; // 0x0758
    uint32_t m_hOwnerEntity; // 0x0764
    uint32_t m_hEffectEntity; // 0x0768
    uint32_t m_nSkin; // 0x07D0
    uint32_t m_nBody; // 0x07D4
    uint32_t m_nHitboxSet; // 0x07D8
    float m_flPlaybackRate; // 0x080C
    fVector3 m_vecForce; // 0x0820
    uint32_t m_nForceBone; // 0x082C
    uint32_t m_bClientSideFrameReset; // 0x086C
    float m_fadeMinDist; // 0x08B0
    float m_fadeMaxDist; // 0x08B4
    float m_flFadeScale; // 0x08B8
    float m_flModelScale; // 0x091C
    float m_flModelWidthScale; // 0x091C
    uintptr_t m_flPoseParameter[24]; // 0x0920
    uintptr_t m_flEncodedController[4]; // 0x0A68
    uint32_t m_bClientSideAnimation; // 0x0AD8
    uint32_t m_nNewSequenceParity; // 0x0ADC
    uint32_t m_nResetEventsParity; // 0x0AE0
    uint32_t m_nSequence; // 0x0B08
    float m_flCycle; // 0x0B10
    uint32_t m_hLightingOrigin; // 0x0BD8
    uint32_t m_hLightingOriginRelative; // 0x0BDC
    uint32_t m_nMuzzleFlashParity; // 0x0BE0
    uint32_t m_iReapplyProvisionParity; // 0x0C88
    uint32_t m_hOuter; // 0x0C8C
    uint32_t m_ProviderType; // 0x0C94
    uint32_t m_iItemDefinitionIndex; // 0x0D10
    uint32_t m_iEntityQuality; // 0x0D14
    uint32_t m_iEntityLevel; // 0x0D18
    uint32_t m_iItemIDHigh; // 0x0D28
    uint32_t m_iItemIDLow; // 0x0D2C
    uint32_t m_iAccountID; // 0x0D30
    uint32_t m_iTeamNumber; // 0x0D98
    uint32_t m_bInitialized; // 0x0D9C
    uint32_t lengthprop20; // 0x0DE8
    uint32_t m_iAttributeDefinitionIndex; // 0x0DF0
    uint32_t m_iRawValue32; // 0x0DF4
    float m_flValue; // 0x0DF4
    uint32_t m_nRefundableCurrency; // 0x0DF8
    uint32_t m_bOnlyIterateItemViewAttributes; // 0x0E18
    uint32_t m_bValidatedAttachedEntity; // 0x0E20
    uint32_t m_bDisguiseWearable; // 0x0EB0
    uint32_t m_hWeaponAssociatedWith; // 0x0EB4
};

class CTFWeaponPDAExpansion_Teleporter // parent CBaseEntity {
public:
    uint32_t movetype; // 0x0000
    uint32_t movecollide; // 0x0000
    uint32_t m_nRenderFX; // 0x008C
    uint32_t m_clrRender; // 0x0090
    uint32_t m_flAnimTime; // 0x00A0
    uint32_t m_flSimulationTime; // 0x00A8
    uint32_t m_ubInterpolationFrame; // 0x00B4
    uint32_t m_fEffects; // 0x00B8
    uint32_t m_nRenderMode; // 0x00BC
    uint32_t m_nModelIndex; // 0x00CC
    uintptr_t m_nModelIndexOverrides[4]; // 0x00D0
    uint32_t m_iTeamNum; // 0x00EC
    uint32_t m_PredictableID; // 0x00F0
    float m_flGravity; // 0x020C
    uint32_t m_iParentAttachment; // 0x0226
    uint32_t moveparent; // 0x023C
    fVector3 m_vecMinsPreScaled; // 0x0260
    fVector3 m_vecMaxsPreScaled; // 0x026C
    fVector3 m_vecMins; // 0x0278
    fVector3 m_vecMaxs; // 0x0284
    uint32_t m_usSolidFlags; // 0x0294
    uint32_t m_nSurroundType; // 0x0298
    uint32_t m_nSolidType; // 0x0299
    uint32_t m_triggerBloat; // 0x029A
    uint32_t m_bUniformTriggerBloat; // 0x029B
    fVector3 m_vecSpecifiedSurroundingMinsPreScaled; // 0x029C
    fVector3 m_vecSpecifiedSurroundingMaxsPreScaled; // 0x02A8
    fVector3 m_vecSpecifiedSurroundingMins; // 0x02B4
    fVector3 m_vecSpecifiedSurroundingMaxs; // 0x02C0
    float m_flElasticity; // 0x0320
    float m_flShadowCastDistance; // 0x0324
    fVector3 m_vecOrigin; // 0x0458
    fVector3 m_angRotation; // 0x0464
    uint32_t m_CollisionGroup; // 0x0474
    uint32_t m_bIsPlayerSimulated; // 0x0754
    uint32_t m_bSimulatedEveryTick; // 0x0755
    uint32_t m_bAnimatedEveryTick; // 0x0756
    uint32_t m_bAlternateSorting; // 0x0757
    uint32_t m_iTextureFrameIndex; // 0x0758
    uint32_t m_hOwnerEntity; // 0x0764
    uint32_t m_hEffectEntity; // 0x0768
    uint32_t m_nSkin; // 0x07D0
    uint32_t m_nBody; // 0x07D4
    uint32_t m_nHitboxSet; // 0x07D8
    float m_flPlaybackRate; // 0x080C
    fVector3 m_vecForce; // 0x0820
    uint32_t m_nForceBone; // 0x082C
    uint32_t m_bClientSideFrameReset; // 0x086C
    float m_fadeMinDist; // 0x08B0
    float m_fadeMaxDist; // 0x08B4
    float m_flFadeScale; // 0x08B8
    float m_flModelScale; // 0x091C
    float m_flModelWidthScale; // 0x091C
    uintptr_t m_flPoseParameter[24]; // 0x0920
    uintptr_t m_flEncodedController[4]; // 0x0A68
    uint32_t m_bClientSideAnimation; // 0x0AD8
    uint32_t m_nNewSequenceParity; // 0x0ADC
    uint32_t m_nResetEventsParity; // 0x0AE0
    uint32_t m_nSequence; // 0x0B08
    float m_flCycle; // 0x0B10
    uint32_t m_hLightingOrigin; // 0x0BD8
    uint32_t m_hLightingOriginRelative; // 0x0BDC
    uint32_t m_nMuzzleFlashParity; // 0x0BE0
    uint32_t m_iReapplyProvisionParity; // 0x0C88
    uint32_t m_hOuter; // 0x0C8C
    uint32_t m_ProviderType; // 0x0C94
    uint32_t m_iItemDefinitionIndex; // 0x0D10
    uint32_t m_iEntityQuality; // 0x0D14
    uint32_t m_iEntityLevel; // 0x0D18
    uint32_t m_iItemIDHigh; // 0x0D28
    uint32_t m_iItemIDLow; // 0x0D2C
    uint32_t m_iAccountID; // 0x0D30
    uint32_t m_iTeamNumber; // 0x0D98
    uint32_t m_bInitialized; // 0x0D9C
    uint32_t lengthprop20; // 0x0DE8
    uint32_t m_iAttributeDefinitionIndex; // 0x0DF0
    uint32_t m_iRawValue32; // 0x0DF4
    float m_flValue; // 0x0DF4
    uint32_t m_nRefundableCurrency; // 0x0DF8
    uint32_t m_bOnlyIterateItemViewAttributes; // 0x0E18
    uint32_t m_bValidatedAttachedEntity; // 0x0E20
    uint32_t m_bDisguiseWearable; // 0x0EB0
    uint32_t m_hWeaponAssociatedWith; // 0x0EB4
};

class CColorCorrection // parent CBaseEntity {
public:
    uint32_t movetype; // 0x0000
    uint32_t movecollide; // 0x0000
    uint32_t m_nRenderFX; // 0x008C
    uint32_t m_clrRender; // 0x0090
    uint32_t m_flAnimTime; // 0x00A0
    uint32_t m_flSimulationTime; // 0x00A8
    uint32_t m_ubInterpolationFrame; // 0x00B4
    uint32_t m_fEffects; // 0x00B8
    uint32_t m_nRenderMode; // 0x00BC
    uint32_t m_nModelIndex; // 0x00CC
    uintptr_t m_nModelIndexOverrides[4]; // 0x00D0
    uint32_t m_iTeamNum; // 0x00EC
    uint32_t m_PredictableID; // 0x00F0
    float m_flGravity; // 0x020C
    uint32_t m_iParentAttachment; // 0x0226
    uint32_t moveparent; // 0x023C
    fVector3 m_vecMinsPreScaled; // 0x0260
    fVector3 m_vecMaxsPreScaled; // 0x026C
    fVector3 m_vecMins; // 0x0278
    fVector3 m_vecMaxs; // 0x0284
    uint32_t m_usSolidFlags; // 0x0294
    uint32_t m_nSurroundType; // 0x0298
    uint32_t m_nSolidType; // 0x0299
    uint32_t m_triggerBloat; // 0x029A
    uint32_t m_bUniformTriggerBloat; // 0x029B
    fVector3 m_vecSpecifiedSurroundingMinsPreScaled; // 0x029C
    fVector3 m_vecSpecifiedSurroundingMaxsPreScaled; // 0x02A8
    fVector3 m_vecSpecifiedSurroundingMins; // 0x02B4
    fVector3 m_vecSpecifiedSurroundingMaxs; // 0x02C0
    float m_flElasticity; // 0x0320
    float m_flShadowCastDistance; // 0x0324
    fVector3 m_angRotation; // 0x0464
    uint32_t m_CollisionGroup; // 0x0474
    uint32_t m_bIsPlayerSimulated; // 0x0754
    uint32_t m_bSimulatedEveryTick; // 0x0755
    uint32_t m_bAnimatedEveryTick; // 0x0756
    uint32_t m_bAlternateSorting; // 0x0757
    uint32_t m_iTextureFrameIndex; // 0x0758
    uint32_t m_hOwnerEntity; // 0x0764
    uint32_t m_hEffectEntity; // 0x0768
    fVector3 m_vecOrigin; // 0x07C0
    float m_minFalloff; // 0x07CC
    float m_maxFalloff; // 0x07D0
    float m_flCurWeight; // 0x07D4
    const char* m_netLookupFilename; // 0x07D8
    uint32_t m_bEnabled; // 0x08DC
};

class CTFPlayer // parent CBaseEntity {
public:
    uint32_t 001; // 0x0000
    uint32_t 006; // 0x0000
    uint32_t lengthprop15; // 0x0000
    uint32_t 003; // 0x0000
    uint32_t m_nSequence; // 0x0000
    uint32_t movecollide; // 0x0000
    uint32_t 002; // 0x0000
    uint32_t movetype; // 0x0000
    uint32_t 000; // 0x0000
    uint32_t lengthprop8; // 0x0000
    uint32_t 004; // 0x0000
    uint32_t 005; // 0x0000
    uint32_t 007; // 0x0000
    void* "player_object_array"; // 0x0000
    void* m_hViewModel; // 0x0000
    float m_flPrevCycle; // 0x0004
    float m_flWeight; // 0x0008
    uint32_t m_nOrder; // 0x000C
    float m_flCycle; // 0x0014
    uint32_t m_nRenderFX; // 0x008C
    uint32_t m_clrRender; // 0x0090
    uint32_t m_flAnimTime; // 0x00A0
    uint32_t m_flSimulationTime; // 0x00A8
    uint32_t m_ubInterpolationFrame; // 0x00B4
    uint32_t m_fEffects; // 0x00B8
    uint32_t m_nRenderMode; // 0x00BC
    uint32_t m_nNextThinkTick; // 0x00C4
    uint32_t m_nModelIndex; // 0x00CC
    uintptr_t m_nModelIndexOverrides[4]; // 0x00D0
    uint32_t m_lifeState; // 0x00E1
    uint32_t m_iHealth; // 0x00E4
    uint32_t m_iTeamNum; // 0x00EC
    uint32_t m_PredictableID; // 0x00F0
    float m_vecViewOffset[0]; // 0x0154
    float m_vecViewOffset[1]; // 0x0158
    float m_vecViewOffset[2]; // 0x015C
    float m_vecVelocity[0]; // 0x0178
    float m_vecVelocity[1]; // 0x017C
    float m_vecVelocity[2]; // 0x0180
    fVector3 m_vecBaseVelocity; // 0x0200
    float m_flGravity; // 0x020C
    uint32_t m_iParentAttachment; // 0x0226
    uint32_t m_nWaterLevel; // 0x0228
    uint32_t moveparent; // 0x023C
    fVector3 m_vecMinsPreScaled; // 0x0260
    fVector3 m_vecMaxsPreScaled; // 0x026C
    fVector3 m_vecMins; // 0x0278
    fVector3 m_vecMaxs; // 0x0284
    uint32_t m_usSolidFlags; // 0x0294
    uint32_t m_nSurroundType; // 0x0298
    uint32_t m_nSolidType; // 0x0299
    uint32_t m_triggerBloat; // 0x029A
    uint32_t m_bUniformTriggerBloat; // 0x029B
    fVector3 m_vecSpecifiedSurroundingMinsPreScaled; // 0x029C
    fVector3 m_vecSpecifiedSurroundingMaxsPreScaled; // 0x02A8
    fVector3 m_vecSpecifiedSurroundingMins; // 0x02B4
    fVector3 m_vecSpecifiedSurroundingMaxs; // 0x02C0
    float m_flElasticity; // 0x0320
    float m_flShadowCastDistance; // 0x0324
    uint32_t m_hGroundEntity; // 0x032C
    float m_flFriction; // 0x0334
    fVector2 m_vecOrigin; // 0x0458
    float m_vecOrigin[2]; // 0x0460
    fVector3 m_angRotation; // 0x0464
    uint32_t m_fFlags; // 0x0470
    uint32_t m_CollisionGroup; // 0x0474
    uint32_t m_bIsPlayerSimulated; // 0x0754
    uint32_t m_bSimulatedEveryTick; // 0x0755
    uint32_t m_bAnimatedEveryTick; // 0x0756
    uint32_t m_bAlternateSorting; // 0x0757
    uint32_t m_iTextureFrameIndex; // 0x0758
    uint32_t m_hOwnerEntity; // 0x0764
    uint32_t m_hEffectEntity; // 0x0768
    uint32_t m_nSkin; // 0x07D0
    uint32_t m_nBody; // 0x07D4
    uint32_t m_nHitboxSet; // 0x07D8
    float m_flPlaybackRate; // 0x080C
    fVector3 m_vecForce; // 0x0820
    uint32_t m_nForceBone; // 0x082C
    uint32_t m_bClientSideFrameReset; // 0x086C
    float m_fadeMinDist; // 0x08B0
    float m_fadeMaxDist; // 0x08B4
    float m_flFadeScale; // 0x08B8
    float m_flModelScale; // 0x091C
    float m_flModelWidthScale; // 0x091C
    uintptr_t m_flPoseParameter[24]; // 0x0920
    uintptr_t m_flEncodedController[4]; // 0x0A68
    uint32_t m_bClientSideAnimation; // 0x0AD8
    uint32_t m_nNewSequenceParity; // 0x0ADC
    uint32_t m_nResetEventsParity; // 0x0AE0
    uint32_t m_hLightingOrigin; // 0x0BD8
    uint32_t m_hLightingOriginRelative; // 0x0BDC
    uint32_t m_nMuzzleFlashParity; // 0x0BE0
    fVector3 m_viewtarget; // 0x0CA0
    uintptr_t m_flexWeight[96]; // 0x0D00
    uint32_t m_blinktoggle; // 0x0ED0
    float m_flNextAttack; // 0x1090
    uintptr_t m_iAmmo[32]; // 0x1098
    uintptr_t m_hMyWeapons[48]; // 0x1118
    uint32_t m_hActiveWeapon; // 0x11D8
    uint32_t m_bGlowEnabled; // 0x11DD
    uintptr_t m_chAreaBits[32]; // 0x1250
    uintptr_t m_chAreaPortalBits[24]; // 0x1270
    uint32_t m_iHideHUD; // 0x1288
    float m_flFOVRate; // 0x128C
    uint32_t m_bDucked; // 0x1290
    uint32_t m_bDucking; // 0x1291
    uint32_t m_bInDuckJump; // 0x1292
    float m_flDucktime; // 0x1294
    float m_flDuckJumpTime; // 0x1298
    float m_flJumpTime; // 0x129C
    float m_flFallVelocity; // 0x12A4
    fVector3 m_vecPunchAngle; // 0x12BC
    fVector3 m_vecPunchAngleVel; // 0x1318
    uint32_t m_bDrawViewmodel; // 0x1378
    uint32_t m_bWearingSuit; // 0x1379
    uint32_t m_bPoisoned; // 0x137A
    uint32_t m_bForceLocalPlayerDraw; // 0x137B
    float m_flStepSize; // 0x1380
    uint32_t m_bAllowAutoMovement; // 0x1384
    uint32_t m_skybox3d.scale; // 0x1390
    fVector3 m_skybox3d.origin; // 0x1394
    uint32_t m_skybox3d.area; // 0x13A0
    fVector3 m_skybox3d.fog.dirPrimary; // 0x13B0
    uint32_t m_skybox3d.fog.colorPrimary; // 0x13BC
    uint32_t m_skybox3d.fog.colorSecondary; // 0x13C0
    float m_skybox3d.fog.start; // 0x13CC
    float m_skybox3d.fog.end; // 0x13D0
    float m_skybox3d.fog.maxdensity; // 0x13D8
    uint32_t m_skybox3d.fog.enable; // 0x13EC
    uint32_t m_skybox3d.fog.blend; // 0x13ED
    uint32_t m_skybox3d.fog.radial; // 0x13EE
    uint32_t m_PlayerFog.m_hCtrl; // 0x13F8
    fVector3 m_audio.localSound[0]; // 0x1420
    fVector3 m_audio.localSound[1]; // 0x142C
    fVector3 m_audio.localSound[2]; // 0x1438
    fVector3 m_audio.localSound[3]; // 0x1444
    fVector3 m_audio.localSound[4]; // 0x1450
    fVector3 m_audio.localSound[5]; // 0x145C
    fVector3 m_audio.localSound[6]; // 0x1468
    fVector3 m_audio.localSound[7]; // 0x1474
    uint32_t m_audio.soundscapeIndex; // 0x1480
    uint32_t m_audio.localBits; // 0x1484
    uint32_t m_audio.entIndex; // 0x1488
    const char* m_szScriptOverlayMaterial; // 0x1491
    uint32_t lengthprop20; // 0x1598
    uint32_t m_iAttributeDefinitionIndex; // 0x15A0
    float m_flValue; // 0x15A4
    uint32_t m_iRawValue32; // 0x15A4
    uint32_t m_nRefundableCurrency; // 0x15A8
    uint32_t deadflag; // 0x15D0
    uint32_t m_iFOV; // 0x15E0
    uint32_t m_iFOVStart; // 0x15E4
    float m_flFOVTime; // 0x15E8
    uint32_t m_iDefaultFOV; // 0x15EC
    uint32_t m_hZoomOwner; // 0x15F0
    uint32_t m_fOnTarget; // 0x15F4
    uint32_t m_hConstraintEntity; // 0x1630
    fVector3 m_vecConstraintCenter; // 0x1634
    float m_flConstraintRadius; // 0x1640
    float m_flConstraintWidth; // 0x1644
    float m_flConstraintSpeedFactor; // 0x1648
    uint32_t m_iObserverMode; // 0x164C
    uint32_t m_hObserverTarget; // 0x1650
    float m_flDeathTime; // 0x1670
    uint32_t m_hVehicle; // 0x167C
    uint32_t m_hUseEntity; // 0x1684
    float m_flMaxspeed; // 0x1688
    uint32_t m_iBonusProgress; // 0x168C
    uint32_t m_iBonusChallenge; // 0x1690
    uint32_t m_nTickBase; // 0x1720
    uint32_t m_hLastWeapon; // 0x1738
    float m_flLaggedMovementValue; // 0x1898
    const char* m_szLastPlaceName; // 0x18B8
    uint32_t m_iKartState; // 0x1A78
    uint32_t m_iReapplyProvisionParity; // 0x1AD0
    uint32_t m_hOuter; // 0x1AD4
    uint32_t m_ProviderType; // 0x1ADC
    uint32_t m_hRagdoll; // 0x1B18
    uint32_t m_iClass; // 0x1BB0
    const char* m_iszClassIcon; // 0x1BB4
    const char* m_iszCustomModel; // 0x1CB8
    fVector3 m_vecCustomModelOffset; // 0x1DBC
    fVector3 m_angCustomModelRotation; // 0x1DC8
    uint32_t m_bCustomModelRotates; // 0x1DD4
    uint32_t m_bCustomModelRotationSet; // 0x1DD5
    uint32_t m_bCustomModelVisibleToSelf; // 0x1DD6
    uint32_t m_bUseClassAnimations; // 0x1DD7
    uint32_t m_iClassModelParity; // 0x1DD8
    float m_flKartNextAvailableBoost; // 0x1E70
    uint32_t m_iKartHealth; // 0x1E74
    uint32_t lengthprop131; // 0x1E88
    uint32_t m_pProvider; // 0x1E98
    uint32_t m_iCaptures; // 0x1F20
    uint32_t m_iDefenses; // 0x1F24
    uint32_t m_iKills; // 0x1F28
    uint32_t m_iDeaths; // 0x1F2C
    uint32_t m_iSuicides; // 0x1F30
    uint32_t m_iDominations; // 0x1F34
    uint32_t m_iRevenge; // 0x1F38
    uint32_t m_iBuildingsBuilt; // 0x1F3C
    uint32_t m_iBuildingsDestroyed; // 0x1F40
    uint32_t m_iHeadshots; // 0x1F44
    uint32_t m_iBackstabs; // 0x1F48
    uint32_t m_iHealPoints; // 0x1F4C
    uint32_t m_iInvulns; // 0x1F50
    uint32_t m_iTeleports; // 0x1F54
    uint32_t m_iDamageDone; // 0x1F58
    uint32_t m_iCrits; // 0x1F5C
    uint32_t m_iResupplyPoints; // 0x1F60
    uint32_t m_iKillAssists; // 0x1F64
    uint32_t m_iBonusPoints; // 0x1F68
    uint32_t m_iPoints; // 0x1F6C
    uint32_t m_nPlayerState; // 0x1F70
    uint32_t m_nPlayerCond; // 0x1F74
    uint32_t m_nPlayerCondEx; // 0x1F78
    uint32_t m_nPlayerCondEx2; // 0x1F7C
    uint32_t m_nPlayerCondEx3; // 0x1F80
    uint32_t m_nPlayerCondEx4; // 0x1F84
    uint32_t _condition_bits; // 0x1FB0
    uint32_t m_nDisguiseTeam; // 0x1FB8
    uint32_t m_nDisguiseClass; // 0x1FBC
    uint32_t m_nDisguiseSkinOverride; // 0x1FC0
    uint32_t m_nMaskClass; // 0x1FC4
    uint32_t m_hDisguiseTarget; // 0x1FC8
    uint32_t m_iDisguiseHealth; // 0x1FCC
    uint32_t m_nDesiredDisguiseClass; // 0x1FD0
    uint32_t m_nDesiredDisguiseTeam; // 0x1FD4
    uint32_t m_hDisguiseWeapon; // 0x1FD8
    uint32_t m_nTeamTeleporterUsed; // 0x1FDC
    float m_flInvisChangeCompleteTime; // 0x2000
    uint32_t m_nNumHealers; // 0x2038
    uint32_t m_nHalloweenBombHeadStage; // 0x203C
    uint32_t m_bKingRuneBuffActive; // 0x204C
    uint32_t m_bLastDisguisedAsOwnTeam; // 0x204E
    uint32_t m_iTauntIndex; // 0x2050
    uint32_t m_iTauntConcept; // 0x2054
    uint32_t m_unTauntSourceItemID_Low; // 0x2058
    uint32_t m_unTauntSourceItemID_High; // 0x205C
    uint32_t m_bFeignDeathReady; // 0x20A4
    uint32_t m_iDesiredPlayerClass; // 0x20A8
    float m_flCloakMeter; // 0x20B0
    uint32_t m_bInUpgradeZone; // 0x20B4
    float m_flEnergyDrinkMeter; // 0x20B8
    float m_flHypeMeter; // 0x20BC
    float m_flChargeMeter; // 0x20C0
    float m_flRageMeter; // 0x20C4
    uint32_t m_bRageDraining; // 0x20C8
    float m_flNextRageEarnTime; // 0x20CC
    uint32_t m_bJumping; // 0x20E8
    uint32_t m_iAirDash; // 0x20EC
    uint32_t m_nAirDucked; // 0x20F0
    float m_flDuckTimer; // 0x20F4
    float m_flStealthNoAttackExpire; // 0x20F8
    float m_flStealthNextChangeTime; // 0x20FC
    float m_flRuneCharge; // 0x2100
    uintptr_t m_flItemChargeMeter[11]; // 0x2104
    uint32_t m_iCritMult; // 0x215C
    uintptr_t m_bPlayerDominated[102]; // 0x2160
    uintptr_t m_bPlayerDominatingMe[102]; // 0x21C6
    float m_flMovementStunTime; // 0x222C
    uint32_t m_iMovementStunAmount; // 0x2230
    uint32_t m_iMovementStunParity; // 0x2234
    uint32_t m_hStunner; // 0x2238
    uint32_t m_iStunFlags; // 0x223C
    uint32_t m_iStunIndex; // 0x2240
    uint32_t m_hCarriedObject; // 0x2244
    uint32_t m_bCarryingObject; // 0x2248
    uint32_t m_nArenaNumChanges; // 0x2250
    uint32_t m_iWeaponKnockbackID; // 0x2254
    uint32_t m_bLoadoutUnavailable; // 0x2258
    uint32_t m_iItemFindBonus; // 0x225C
    uint32_t m_bShieldEquipped; // 0x2260
    uint32_t m_bParachuteEquipped; // 0x2261
    uint32_t m_iDecapitations; // 0x2264
    uintptr_t m_nStreaks[4]; // 0x226C
    uint32_t m_iRevengeCrits; // 0x2288
    uint32_t m_iNextMeleeCrit; // 0x228C
    uint32_t m_iDisguiseBody; // 0x2298
    uint32_t m_iSpawnRoomTouchCount; // 0x229C
    float m_flNextNoiseMakerTime; // 0x22A0
    uint32_t m_iKillCountSinceLastDeploy; // 0x22C4
    float m_flFirstPrimaryAttack; // 0x22C8
    float m_flSpyTranqBuffDuration; // 0x22CC
    uint32_t m_bArenaFirstBloodBoost; // 0x2330
    uint32_t m_bHasPasstimeBall; // 0x2344
    uint32_t m_bIsTargetedForPasstimePass; // 0x2345
    uint32_t m_hPasstimePassTarget; // 0x2348
    float m_askForBallTime; // 0x234C
    float m_flHolsterAnimTime; // 0x2350
    uint32_t m_hSwitchTo; // 0x2354
    uint32_t m_hItem; // 0x23B0
    uint32_t m_hCoach; // 0x23B8
    uint32_t m_hStudent; // 0x23BC
    float m_flMvMLastDamageTime; // 0x23E0
    float "m_flLastDamageTime"; // 0x23E0
    uint32_t m_bInPowerPlay; // 0x23E4
    uint32_t m_iSpawnCounter; // 0x23E8
    uint32_t m_bArenaSpectator; // 0x23EC
    uint32_t m_bFlipViewModels; // 0x23ED
    uint32_t m_bIsMiniBoss; // 0x23EE
    uint32_t m_bIsABot; // 0x23EF
    uint32_t m_nBotSkill; // 0x23F0
    uint32_t m_bSaveMeParity; // 0x23F8
    uint32_t m_bIsCoaching; // 0x23FA
    float m_angEyeAngles[0]; // 0x23FC
    float m_angEyeAngles[1]; // 0x2400
    uint32_t m_bAllowMoveDuringTaunt; // 0x2408
    uint32_t m_bIsReadyToHighFive; // 0x241C
    uint32_t m_hHighFivePartner; // 0x2420
    uint32_t m_nForceTauntCam; // 0x2424
    float m_flTauntYaw; // 0x2428
    uint32_t m_nActiveTauntSlot; // 0x2430
    uint32_t m_iTauntItemDefIndex; // 0x2438
    float m_flCurrentTauntMoveSpeed; // 0x243C
    float m_flVehicleReverseTime; // 0x2440
    uint32_t m_nCurrency; // 0x39BC
    uint32_t m_nExperienceLevel; // 0x39C4
    uint32_t m_nExperienceLevelProgress; // 0x39C8
    uint32_t m_bMatchSafeToLeave; // 0x39D0
    uint32_t m_nActiveWpnClip; // 0x39D2
    float m_flHeadScale; // 0x39F0
    float m_flTorsoScale; // 0x39F4
    float m_flHandScale; // 0x39F8
    uint32_t m_bUseBossHealthBar; // 0x3A18
    uint32_t m_bUsingVRHeadset; // 0x3A19
    uint32_t m_bForcedSkin; // 0x3A1A
    uint32_t m_nForcedSkin; // 0x3A1C
    uint32_t m_hGrapplingHookTarget; // 0x3A2C
    uint32_t m_hSecondaryLastWeapon; // 0x3A30
    uint32_t m_bUsingActionSlot; // 0x3A34
    uint32_t m_iCampaignMedals; // 0x3A38
    float m_flInspectTime; // 0x3A3C
    float m_flHelpmeButtonPressTime; // 0x3A40
    uint32_t m_bViewingCYOAPDA; // 0x3A44
    uint32_t m_bRegenerating; // 0x3A45
    uint32_t m_iPlayerSkinOverride; // 0x3A90
};

class CTFPlayerResource // parent CPlayerResource {
public:
    uintptr_t m_iPing[102]; // 0x0AF8
    uintptr_t m_iScore[102]; // 0x0C90
    uintptr_t m_iDeaths[102]; // 0x0E28
    uintptr_t m_bConnected[102]; // 0x0FC0
    uintptr_t m_iTeam[102]; // 0x1028
    uintptr_t m_bAlive[102]; // 0x11C0
    uintptr_t m_iHealth[102]; // 0x1228
    uintptr_t m_iAccountID[102]; // 0x1440
    uintptr_t m_bValid[102]; // 0x15D8
    uintptr_t m_iUserID[102]; // 0x1640
    uintptr_t m_iTotalScore[102]; // 0x17E0
    uintptr_t m_iMaxHealth[102]; // 0x1978
    uintptr_t m_iMaxBuffedHealth[102]; // 0x1B10
    uintptr_t m_iPlayerClass[102]; // 0x1CA8
    uintptr_t m_bArenaSpectator[102]; // 0x1E40
    uintptr_t m_iActiveDominations[102]; // 0x1EA8
    uintptr_t m_flNextRespawnTime[102]; // 0x2040
    uintptr_t m_iChargeLevel[102]; // 0x21D8
    uintptr_t m_iDamage[102]; // 0x2370
    uintptr_t m_iDamageAssist[102]; // 0x2508
    uintptr_t m_iDamageBoss[102]; // 0x26A0
    uintptr_t m_iHealing[102]; // 0x2838
    uintptr_t m_iHealingAssist[102]; // 0x29D0
    uintptr_t m_iDamageBlocked[102]; // 0x2B68
    uintptr_t m_iCurrencyCollected[102]; // 0x2D00
    uintptr_t m_iBonusPoints[102]; // 0x2E98
    uintptr_t m_iPlayerLevel[102]; // 0x3030
    uintptr_t m_iStreaks[408]; // 0x31C8
    uintptr_t m_iUpgradeRefundCredits[102]; // 0x3828
    uintptr_t m_iBuybackCredits[102]; // 0x39C0
    uint32_t m_iPartyLeaderBlueTeamIndex; // 0x3B58
    uint32_t m_iPartyLeaderRedTeamIndex; // 0x3B5C
    uint32_t m_iEventTeamStatus; // 0x3B60
    uintptr_t m_iPlayerClassWhenKilled[102]; // 0x3B64
    uintptr_t m_iConnectionState[102]; // 0x3CFC
    uintptr_t m_flConnectTime[102]; // 0x3E94
};

class CTFBaseRocket // parent CBaseEntity {
public:
    uint32_t movetype; // 0x0000
    uint32_t movecollide; // 0x0000
    uint32_t m_nRenderFX; // 0x008C
    uint32_t m_clrRender; // 0x0090
    uint32_t m_flAnimTime; // 0x00A0
    uint32_t m_flSimulationTime; // 0x00A8
    uint32_t m_ubInterpolationFrame; // 0x00B4
    uint32_t m_fEffects; // 0x00B8
    uint32_t m_nRenderMode; // 0x00BC
    uint32_t m_nModelIndex; // 0x00CC
    uintptr_t m_nModelIndexOverrides[4]; // 0x00D0
    uint32_t m_iTeamNum; // 0x00EC
    uint32_t m_PredictableID; // 0x00F0
    float m_flGravity; // 0x020C
    uint32_t m_iParentAttachment; // 0x0226
    uint32_t moveparent; // 0x023C
    fVector3 m_vecMinsPreScaled; // 0x0260
    fVector3 m_vecMaxsPreScaled; // 0x026C
    fVector3 m_vecMins; // 0x0278
    fVector3 m_vecMaxs; // 0x0284
    uint32_t m_usSolidFlags; // 0x0294
    uint32_t m_nSurroundType; // 0x0298
    uint32_t m_nSolidType; // 0x0299
    uint32_t m_triggerBloat; // 0x029A
    uint32_t m_bUniformTriggerBloat; // 0x029B
    fVector3 m_vecSpecifiedSurroundingMinsPreScaled; // 0x029C
    fVector3 m_vecSpecifiedSurroundingMaxsPreScaled; // 0x02A8
    fVector3 m_vecSpecifiedSurroundingMins; // 0x02B4
    fVector3 m_vecSpecifiedSurroundingMaxs; // 0x02C0
    float m_flElasticity; // 0x0320
    float m_flShadowCastDistance; // 0x0324
    fVector3 m_vecOrigin; // 0x0458
    fVector3 m_angRotation; // 0x0464
    uint32_t m_CollisionGroup; // 0x0474
    uint32_t m_bIsPlayerSimulated; // 0x0754
    uint32_t m_bSimulatedEveryTick; // 0x0755
    uint32_t m_bAnimatedEveryTick; // 0x0756
    uint32_t m_bAlternateSorting; // 0x0757
    uint32_t m_iTextureFrameIndex; // 0x0758
    uint32_t m_hOwnerEntity; // 0x0764
    uint32_t m_hEffectEntity; // 0x0768
    uint32_t m_nSkin; // 0x07D0
    uint32_t m_nBody; // 0x07D4
    uint32_t m_nHitboxSet; // 0x07D8
    float m_flPlaybackRate; // 0x080C
    fVector3 m_vecForce; // 0x0820
    uint32_t m_nForceBone; // 0x082C
    uint32_t m_bClientSideFrameReset; // 0x086C
    float m_fadeMinDist; // 0x08B0
    float m_fadeMaxDist; // 0x08B4
    float m_flFadeScale; // 0x08B8
    float m_flModelScale; // 0x091C
    float m_flModelWidthScale; // 0x091C
    uintptr_t m_flPoseParameter[24]; // 0x0920
    uintptr_t m_flEncodedController[4]; // 0x0A68
    uint32_t m_bClientSideAnimation; // 0x0AD8
    uint32_t m_nNewSequenceParity; // 0x0ADC
    uint32_t m_nResetEventsParity; // 0x0AE0
    uint32_t m_nSequence; // 0x0B08
    float m_flCycle; // 0x0B10
    uint32_t m_hLightingOrigin; // 0x0BD8
    uint32_t m_hLightingOriginRelative; // 0x0BDC
    uint32_t m_nMuzzleFlashParity; // 0x0BE0
    uint32_t m_hOriginalLauncher; // 0x0C18
    fVector3 m_vInitialVelocity; // 0x0C20
    uint32_t m_iDeflected; // 0x0C2C
    uint32_t m_hLauncher; // 0x0C38
};

class CTFWearableRobotArm // parent CBaseEntity {
public:
    uint32_t movetype; // 0x0000
    uint32_t movecollide; // 0x0000
    uint32_t m_nRenderFX; // 0x008C
    uint32_t m_clrRender; // 0x0090
    uint32_t m_flAnimTime; // 0x00A0
    uint32_t m_flSimulationTime; // 0x00A8
    uint32_t m_ubInterpolationFrame; // 0x00B4
    uint32_t m_fEffects; // 0x00B8
    uint32_t m_nRenderMode; // 0x00BC
    uint32_t m_nModelIndex; // 0x00CC
    uintptr_t m_nModelIndexOverrides[4]; // 0x00D0
    uint32_t m_iTeamNum; // 0x00EC
    uint32_t m_PredictableID; // 0x00F0
    float m_flGravity; // 0x020C
    uint32_t m_iParentAttachment; // 0x0226
    uint32_t moveparent; // 0x023C
    fVector3 m_vecMinsPreScaled; // 0x0260
    fVector3 m_vecMaxsPreScaled; // 0x026C
    fVector3 m_vecMins; // 0x0278
    fVector3 m_vecMaxs; // 0x0284
    uint32_t m_usSolidFlags; // 0x0294
    uint32_t m_nSurroundType; // 0x0298
    uint32_t m_nSolidType; // 0x0299
    uint32_t m_triggerBloat; // 0x029A
    uint32_t m_bUniformTriggerBloat; // 0x029B
    fVector3 m_vecSpecifiedSurroundingMinsPreScaled; // 0x029C
    fVector3 m_vecSpecifiedSurroundingMaxsPreScaled; // 0x02A8
    fVector3 m_vecSpecifiedSurroundingMins; // 0x02B4
    fVector3 m_vecSpecifiedSurroundingMaxs; // 0x02C0
    float m_flElasticity; // 0x0320
    float m_flShadowCastDistance; // 0x0324
    fVector3 m_vecOrigin; // 0x0458
    fVector3 m_angRotation; // 0x0464
    uint32_t m_CollisionGroup; // 0x0474
    uint32_t m_bIsPlayerSimulated; // 0x0754
    uint32_t m_bSimulatedEveryTick; // 0x0755
    uint32_t m_bAnimatedEveryTick; // 0x0756
    uint32_t m_bAlternateSorting; // 0x0757
    uint32_t m_iTextureFrameIndex; // 0x0758
    uint32_t m_hOwnerEntity; // 0x0764
    uint32_t m_hEffectEntity; // 0x0768
    uint32_t m_nSkin; // 0x07D0
    uint32_t m_nBody; // 0x07D4
    uint32_t m_nHitboxSet; // 0x07D8
    float m_flPlaybackRate; // 0x080C
    fVector3 m_vecForce; // 0x0820
    uint32_t m_nForceBone; // 0x082C
    uint32_t m_bClientSideFrameReset; // 0x086C
    float m_fadeMinDist; // 0x08B0
    float m_fadeMaxDist; // 0x08B4
    float m_flFadeScale; // 0x08B8
    float m_flModelScale; // 0x091C
    float m_flModelWidthScale; // 0x091C
    uintptr_t m_flPoseParameter[24]; // 0x0920
    uintptr_t m_flEncodedController[4]; // 0x0A68
    uint32_t m_bClientSideAnimation; // 0x0AD8
    uint32_t m_nNewSequenceParity; // 0x0ADC
    uint32_t m_nResetEventsParity; // 0x0AE0
    uint32_t m_nSequence; // 0x0B08
    float m_flCycle; // 0x0B10
    uint32_t m_hLightingOrigin; // 0x0BD8
    uint32_t m_hLightingOriginRelative; // 0x0BDC
    uint32_t m_nMuzzleFlashParity; // 0x0BE0
    uint32_t m_iReapplyProvisionParity; // 0x0C88
    uint32_t m_hOuter; // 0x0C8C
    uint32_t m_ProviderType; // 0x0C94
    uint32_t m_iItemDefinitionIndex; // 0x0D10
    uint32_t m_iEntityQuality; // 0x0D14
    uint32_t m_iEntityLevel; // 0x0D18
    uint32_t m_iItemIDHigh; // 0x0D28
    uint32_t m_iItemIDLow; // 0x0D2C
    uint32_t m_iAccountID; // 0x0D30
    uint32_t m_iTeamNumber; // 0x0D98
    uint32_t m_bInitialized; // 0x0D9C
    uint32_t lengthprop20; // 0x0DE8
    uint32_t m_iAttributeDefinitionIndex; // 0x0DF0
    uint32_t m_iRawValue32; // 0x0DF4
    float m_flValue; // 0x0DF4
    uint32_t m_nRefundableCurrency; // 0x0DF8
    uint32_t m_bOnlyIterateItemViewAttributes; // 0x0E18
    uint32_t m_bValidatedAttachedEntity; // 0x0E20
    uint32_t m_bDisguiseWearable; // 0x0EB0
    uint32_t m_hWeaponAssociatedWith; // 0x0EB4
};

class CTFSniperRifleClassic // parent CBaseEntity {
public:
    uint32_t movecollide; // 0x0000
    uint32_t movetype; // 0x0000
    uint32_t m_nRenderFX; // 0x008C
    uint32_t m_clrRender; // 0x0090
    uint32_t m_flAnimTime; // 0x00A0
    uint32_t m_flSimulationTime; // 0x00A8
    uint32_t m_ubInterpolationFrame; // 0x00B4
    uint32_t m_fEffects; // 0x00B8
    uint32_t m_nRenderMode; // 0x00BC
    uint32_t m_nNextThinkTick; // 0x00C4
    uint32_t m_nModelIndex; // 0x00CC
    uintptr_t m_nModelIndexOverrides[4]; // 0x00D0
    uint32_t m_iTeamNum; // 0x00EC
    uint32_t m_PredictableID; // 0x00F0
    float m_flGravity; // 0x020C
    uint32_t m_iParentAttachment; // 0x0226
    uint32_t moveparent; // 0x023C
    fVector3 m_vecMinsPreScaled; // 0x0260
    fVector3 m_vecMaxsPreScaled; // 0x026C
    fVector3 m_vecMins; // 0x0278
    fVector3 m_vecMaxs; // 0x0284
    uint32_t m_usSolidFlags; // 0x0294
    uint32_t m_nSurroundType; // 0x0298
    uint32_t m_nSolidType; // 0x0299
    uint32_t m_triggerBloat; // 0x029A
    uint32_t m_bUniformTriggerBloat; // 0x029B
    fVector3 m_vecSpecifiedSurroundingMinsPreScaled; // 0x029C
    fVector3 m_vecSpecifiedSurroundingMaxsPreScaled; // 0x02A8
    fVector3 m_vecSpecifiedSurroundingMins; // 0x02B4
    fVector3 m_vecSpecifiedSurroundingMaxs; // 0x02C0
    float m_flElasticity; // 0x0320
    float m_flShadowCastDistance; // 0x0324
    fVector3 m_vecOrigin; // 0x0458
    fVector3 m_angRotation; // 0x0464
    uint32_t m_CollisionGroup; // 0x0474
    uint32_t m_bIsPlayerSimulated; // 0x0754
    uint32_t m_bSimulatedEveryTick; // 0x0755
    uint32_t m_bAnimatedEveryTick; // 0x0756
    uint32_t m_bAlternateSorting; // 0x0757
    uint32_t m_iTextureFrameIndex; // 0x0758
    uint32_t m_hOwnerEntity; // 0x0764
    uint32_t m_hEffectEntity; // 0x0768
    uint32_t m_nSkin; // 0x07D0
    uint32_t m_nBody; // 0x07D4
    uint32_t m_nHitboxSet; // 0x07D8
    float m_flPlaybackRate; // 0x080C
    fVector3 m_vecForce; // 0x0820
    uint32_t m_nForceBone; // 0x082C
    uint32_t m_bClientSideFrameReset; // 0x086C
    float m_fadeMinDist; // 0x08B0
    float m_fadeMaxDist; // 0x08B4
    float m_flFadeScale; // 0x08B8
    float m_flModelScale; // 0x091C
    float m_flModelWidthScale; // 0x091C
    uintptr_t m_flPoseParameter[24]; // 0x0920
    uintptr_t m_flEncodedController[4]; // 0x0A68
    uint32_t m_bClientSideAnimation; // 0x0AD8
    uint32_t m_nNewSequenceParity; // 0x0ADC
    uint32_t m_nResetEventsParity; // 0x0AE0
    uint32_t m_nSequence; // 0x0B08
    float m_flCycle; // 0x0B10
    uint32_t m_hLightingOrigin; // 0x0BD8
    uint32_t m_hLightingOriginRelative; // 0x0BDC
    uint32_t m_nMuzzleFlashParity; // 0x0BE0
    uint32_t m_iReapplyProvisionParity; // 0x0C88
    uint32_t m_hOuter; // 0x0C8C
    uint32_t m_ProviderType; // 0x0C94
    uint32_t m_iItemDefinitionIndex; // 0x0D10
    uint32_t m_iEntityQuality; // 0x0D14
    uint32_t m_iEntityLevel; // 0x0D18
    uint32_t m_iItemIDHigh; // 0x0D28
    uint32_t m_iItemIDLow; // 0x0D2C
    uint32_t m_iAccountID; // 0x0D30
    uint32_t m_iTeamNumber; // 0x0D98
    uint32_t m_bInitialized; // 0x0D9C
    uint32_t lengthprop20; // 0x0DE8
    uint32_t m_iAttributeDefinitionIndex; // 0x0DF0
    uint32_t m_iRawValue32; // 0x0DF4
    float m_flValue; // 0x0DF4
    uint32_t m_nRefundableCurrency; // 0x0DF8
    uint32_t m_bOnlyIterateItemViewAttributes; // 0x0E18
    uint32_t m_bValidatedAttachedEntity; // 0x0E20
    uint32_t m_hOwner; // 0x0E90
    uint32_t m_nViewModelIndex; // 0x0EA0
    float m_flNextPrimaryAttack; // 0x0EA4
    float m_flNextSecondaryAttack; // 0x0EA8
    float m_flTimeWeaponIdle; // 0x0EAC
    uint32_t m_iViewModelIndex; // 0x0EB4
    uint32_t m_iWorldModelIndex; // 0x0EB8
    uint32_t m_iState; // 0x0ED8
    uint32_t m_iPrimaryAmmoType; // 0x0EE8
    uint32_t m_iSecondaryAmmoType; // 0x0EEC
    uint32_t m_iClip1; // 0x0EF0
    uint32_t m_iClip2; // 0x0EF4
    uint32_t m_bFlipViewModel; // 0x0F20
    uint32_t m_nCustomViewmodelModelIndex; // 0x0F44
    float m_flEffectBarRegenTime; // 0x0F80
    uint32_t m_iReloadMode; // 0x0F88
    float m_flReloadPriorNextFire; // 0x0F8C
    uint32_t m_bLowered; // 0x0FA8
    float m_flLastCritCheckTime; // 0x0FB8
    uint32_t m_bResetParity; // 0x104C
    uint32_t m_bReloadedThroughAnimEvent; // 0x1064
    float m_flEnergy; // 0x1068
    uint32_t m_iConsecutiveShots; // 0x106C
    uint32_t m_bDisguiseWeapon; // 0x1070
    float m_flLastFireTime; // 0x1074
    uint32_t m_hExtraWearable; // 0x1078
    uint32_t m_hExtraWearableViewModel; // 0x107C
    float m_flObservedCritChance; // 0x1080
    uint32_t m_bBeingRepurposedForTaunt; // 0x1084
    uint32_t m_nKillComboClass; // 0x1088
    uint32_t m_nKillComboCount; // 0x108C
    float m_flInspectAnimEndTime; // 0x1090
    uint32_t m_nInspectStage; // 0x1094
    float m_flChargedDamage; // 0x10AC
    uint32_t m_bCharging; // 0x10C8
};

class CTFWearableDemoShield // parent CBaseEntity {
public:
    uint32_t movetype; // 0x0000
    uint32_t movecollide; // 0x0000
    uint32_t m_nRenderFX; // 0x008C
    uint32_t m_clrRender; // 0x0090
    uint32_t m_flAnimTime; // 0x00A0
    uint32_t m_flSimulationTime; // 0x00A8
    uint32_t m_ubInterpolationFrame; // 0x00B4
    uint32_t m_fEffects; // 0x00B8
    uint32_t m_nRenderMode; // 0x00BC
    uint32_t m_nModelIndex; // 0x00CC
    uintptr_t m_nModelIndexOverrides[4]; // 0x00D0
    uint32_t m_iTeamNum; // 0x00EC
    uint32_t m_PredictableID; // 0x00F0
    float m_flGravity; // 0x020C
    uint32_t m_iParentAttachment; // 0x0226
    uint32_t moveparent; // 0x023C
    fVector3 m_vecMinsPreScaled; // 0x0260
    fVector3 m_vecMaxsPreScaled; // 0x026C
    fVector3 m_vecMins; // 0x0278
    fVector3 m_vecMaxs; // 0x0284
    uint32_t m_usSolidFlags; // 0x0294
    uint32_t m_nSurroundType; // 0x0298
    uint32_t m_nSolidType; // 0x0299
    uint32_t m_triggerBloat; // 0x029A
    uint32_t m_bUniformTriggerBloat; // 0x029B
    fVector3 m_vecSpecifiedSurroundingMinsPreScaled; // 0x029C
    fVector3 m_vecSpecifiedSurroundingMaxsPreScaled; // 0x02A8
    fVector3 m_vecSpecifiedSurroundingMins; // 0x02B4
    fVector3 m_vecSpecifiedSurroundingMaxs; // 0x02C0
    float m_flElasticity; // 0x0320
    float m_flShadowCastDistance; // 0x0324
    fVector3 m_vecOrigin; // 0x0458
    fVector3 m_angRotation; // 0x0464
    uint32_t m_CollisionGroup; // 0x0474
    uint32_t m_bIsPlayerSimulated; // 0x0754
    uint32_t m_bSimulatedEveryTick; // 0x0755
    uint32_t m_bAnimatedEveryTick; // 0x0756
    uint32_t m_bAlternateSorting; // 0x0757
    uint32_t m_iTextureFrameIndex; // 0x0758
    uint32_t m_hOwnerEntity; // 0x0764
    uint32_t m_hEffectEntity; // 0x0768
    uint32_t m_nSkin; // 0x07D0
    uint32_t m_nBody; // 0x07D4
    uint32_t m_nHitboxSet; // 0x07D8
    float m_flPlaybackRate; // 0x080C
    fVector3 m_vecForce; // 0x0820
    uint32_t m_nForceBone; // 0x082C
    uint32_t m_bClientSideFrameReset; // 0x086C
    float m_fadeMinDist; // 0x08B0
    float m_fadeMaxDist; // 0x08B4
    float m_flFadeScale; // 0x08B8
    float m_flModelScale; // 0x091C
    float m_flModelWidthScale; // 0x091C
    uintptr_t m_flPoseParameter[24]; // 0x0920
    uintptr_t m_flEncodedController[4]; // 0x0A68
    uint32_t m_bClientSideAnimation; // 0x0AD8
    uint32_t m_nNewSequenceParity; // 0x0ADC
    uint32_t m_nResetEventsParity; // 0x0AE0
    uint32_t m_nSequence; // 0x0B08
    float m_flCycle; // 0x0B10
    uint32_t m_hLightingOrigin; // 0x0BD8
    uint32_t m_hLightingOriginRelative; // 0x0BDC
    uint32_t m_nMuzzleFlashParity; // 0x0BE0
    uint32_t m_iReapplyProvisionParity; // 0x0C88
    uint32_t m_hOuter; // 0x0C8C
    uint32_t m_ProviderType; // 0x0C94
    uint32_t m_iItemDefinitionIndex; // 0x0D10
    uint32_t m_iEntityQuality; // 0x0D14
    uint32_t m_iEntityLevel; // 0x0D18
    uint32_t m_iItemIDHigh; // 0x0D28
    uint32_t m_iItemIDLow; // 0x0D2C
    uint32_t m_iAccountID; // 0x0D30
    uint32_t m_iTeamNumber; // 0x0D98
    uint32_t m_bInitialized; // 0x0D9C
    uint32_t lengthprop20; // 0x0DE8
    uint32_t m_iAttributeDefinitionIndex; // 0x0DF0
    uint32_t m_iRawValue32; // 0x0DF4
    float m_flValue; // 0x0DF4
    uint32_t m_nRefundableCurrency; // 0x0DF8
    uint32_t m_bOnlyIterateItemViewAttributes; // 0x0E18
    uint32_t m_bValidatedAttachedEntity; // 0x0E20
    uint32_t m_bDisguiseWearable; // 0x0EB0
    uint32_t m_hWeaponAssociatedWith; // 0x0EB4
};

class CTFWeaponPDA_Engineer_Destroy // parent CBaseEntity {
public:
    uint32_t movecollide; // 0x0000
    uint32_t movetype; // 0x0000
    uint32_t m_nRenderFX; // 0x008C
    uint32_t m_clrRender; // 0x0090
    uint32_t m_flAnimTime; // 0x00A0
    uint32_t m_flSimulationTime; // 0x00A8
    uint32_t m_ubInterpolationFrame; // 0x00B4
    uint32_t m_fEffects; // 0x00B8
    uint32_t m_nRenderMode; // 0x00BC
    uint32_t m_nNextThinkTick; // 0x00C4
    uint32_t m_nModelIndex; // 0x00CC
    uintptr_t m_nModelIndexOverrides[4]; // 0x00D0
    uint32_t m_iTeamNum; // 0x00EC
    uint32_t m_PredictableID; // 0x00F0
    float m_flGravity; // 0x020C
    uint32_t m_iParentAttachment; // 0x0226
    uint32_t moveparent; // 0x023C
    fVector3 m_vecMinsPreScaled; // 0x0260
    fVector3 m_vecMaxsPreScaled; // 0x026C
    fVector3 m_vecMins; // 0x0278
    fVector3 m_vecMaxs; // 0x0284
    uint32_t m_usSolidFlags; // 0x0294
    uint32_t m_nSurroundType; // 0x0298
    uint32_t m_nSolidType; // 0x0299
    uint32_t m_triggerBloat; // 0x029A
    uint32_t m_bUniformTriggerBloat; // 0x029B
    fVector3 m_vecSpecifiedSurroundingMinsPreScaled; // 0x029C
    fVector3 m_vecSpecifiedSurroundingMaxsPreScaled; // 0x02A8
    fVector3 m_vecSpecifiedSurroundingMins; // 0x02B4
    fVector3 m_vecSpecifiedSurroundingMaxs; // 0x02C0
    float m_flElasticity; // 0x0320
    float m_flShadowCastDistance; // 0x0324
    fVector3 m_vecOrigin; // 0x0458
    fVector3 m_angRotation; // 0x0464
    uint32_t m_CollisionGroup; // 0x0474
    uint32_t m_bIsPlayerSimulated; // 0x0754
    uint32_t m_bSimulatedEveryTick; // 0x0755
    uint32_t m_bAnimatedEveryTick; // 0x0756
    uint32_t m_bAlternateSorting; // 0x0757
    uint32_t m_iTextureFrameIndex; // 0x0758
    uint32_t m_hOwnerEntity; // 0x0764
    uint32_t m_hEffectEntity; // 0x0768
    uint32_t m_nSkin; // 0x07D0
    uint32_t m_nBody; // 0x07D4
    uint32_t m_nHitboxSet; // 0x07D8
    float m_flPlaybackRate; // 0x080C
    fVector3 m_vecForce; // 0x0820
    uint32_t m_nForceBone; // 0x082C
    uint32_t m_bClientSideFrameReset; // 0x086C
    float m_fadeMinDist; // 0x08B0
    float m_fadeMaxDist; // 0x08B4
    float m_flFadeScale; // 0x08B8
    float m_flModelScale; // 0x091C
    float m_flModelWidthScale; // 0x091C
    uintptr_t m_flPoseParameter[24]; // 0x0920
    uintptr_t m_flEncodedController[4]; // 0x0A68
    uint32_t m_bClientSideAnimation; // 0x0AD8
    uint32_t m_nNewSequenceParity; // 0x0ADC
    uint32_t m_nResetEventsParity; // 0x0AE0
    uint32_t m_nSequence; // 0x0B08
    float m_flCycle; // 0x0B10
    uint32_t m_hLightingOrigin; // 0x0BD8
    uint32_t m_hLightingOriginRelative; // 0x0BDC
    uint32_t m_nMuzzleFlashParity; // 0x0BE0
    uint32_t m_iReapplyProvisionParity; // 0x0C88
    uint32_t m_hOuter; // 0x0C8C
    uint32_t m_ProviderType; // 0x0C94
    uint32_t m_iItemDefinitionIndex; // 0x0D10
    uint32_t m_iEntityQuality; // 0x0D14
    uint32_t m_iEntityLevel; // 0x0D18
    uint32_t m_iItemIDHigh; // 0x0D28
    uint32_t m_iItemIDLow; // 0x0D2C
    uint32_t m_iAccountID; // 0x0D30
    uint32_t m_iTeamNumber; // 0x0D98
    uint32_t m_bInitialized; // 0x0D9C
    uint32_t lengthprop20; // 0x0DE8
    uint32_t m_iAttributeDefinitionIndex; // 0x0DF0
    float m_flValue; // 0x0DF4
    uint32_t m_iRawValue32; // 0x0DF4
    uint32_t m_nRefundableCurrency; // 0x0DF8
    uint32_t m_bOnlyIterateItemViewAttributes; // 0x0E18
    uint32_t m_bValidatedAttachedEntity; // 0x0E20
    uint32_t m_hOwner; // 0x0E90
    uint32_t m_nViewModelIndex; // 0x0EA0
    float m_flNextPrimaryAttack; // 0x0EA4
    float m_flNextSecondaryAttack; // 0x0EA8
    float m_flTimeWeaponIdle; // 0x0EAC
    uint32_t m_iViewModelIndex; // 0x0EB4
    uint32_t m_iWorldModelIndex; // 0x0EB8
    uint32_t m_iState; // 0x0ED8
    uint32_t m_iPrimaryAmmoType; // 0x0EE8
    uint32_t m_iSecondaryAmmoType; // 0x0EEC
    uint32_t m_iClip1; // 0x0EF0
    uint32_t m_iClip2; // 0x0EF4
    uint32_t m_bFlipViewModel; // 0x0F20
    uint32_t m_nCustomViewmodelModelIndex; // 0x0F44
    float m_flEffectBarRegenTime; // 0x0F80
    uint32_t m_iReloadMode; // 0x0F88
    float m_flReloadPriorNextFire; // 0x0F8C
    uint32_t m_bLowered; // 0x0FA8
    float m_flLastCritCheckTime; // 0x0FB8
    uint32_t m_bResetParity; // 0x104C
    uint32_t m_bReloadedThroughAnimEvent; // 0x1064
    float m_flEnergy; // 0x1068
    uint32_t m_iConsecutiveShots; // 0x106C
    uint32_t m_bDisguiseWeapon; // 0x1070
    float m_flLastFireTime; // 0x1074
    uint32_t m_hExtraWearable; // 0x1078
    uint32_t m_hExtraWearableViewModel; // 0x107C
    float m_flObservedCritChance; // 0x1080
    uint32_t m_bBeingRepurposedForTaunt; // 0x1084
    uint32_t m_nKillComboClass; // 0x1088
    uint32_t m_nKillComboCount; // 0x108C
    float m_flInspectAnimEndTime; // 0x1090
    uint32_t m_nInspectStage; // 0x1094
};

class CBaseEntity {
public:
    uint32_t movetype; // 0x0000
    uint32_t movecollide; // 0x0000
    uint32_t m_nRenderFX; // 0x008C
    uint32_t m_clrRender; // 0x0090
    uint32_t m_flAnimTime; // 0x00A0
    uint32_t m_flSimulationTime; // 0x00A8
    uint32_t m_ubInterpolationFrame; // 0x00B4
    uint32_t m_fEffects; // 0x00B8
    uint32_t m_nRenderMode; // 0x00BC
    uint32_t m_nModelIndex; // 0x00CC
    uintptr_t m_nModelIndexOverrides[4]; // 0x00D0
    uint32_t m_iTeamNum; // 0x00EC
    uint32_t m_PredictableID; // 0x00F0
    float m_flGravity; // 0x020C
    uint32_t m_iParentAttachment; // 0x0226
    uint32_t moveparent; // 0x023C
    fVector3 m_vecMinsPreScaled; // 0x0260
    fVector3 m_vecMaxsPreScaled; // 0x026C
    fVector3 m_vecMins; // 0x0278
    fVector3 m_vecMaxs; // 0x0284
    uint32_t m_usSolidFlags; // 0x0294
    uint32_t m_nSurroundType; // 0x0298
    uint32_t m_nSolidType; // 0x0299
    uint32_t m_triggerBloat; // 0x029A
    uint32_t m_bUniformTriggerBloat; // 0x029B
    fVector3 m_vecSpecifiedSurroundingMinsPreScaled; // 0x029C
    fVector3 m_vecSpecifiedSurroundingMaxsPreScaled; // 0x02A8
    fVector3 m_vecSpecifiedSurroundingMins; // 0x02B4
    fVector3 m_vecSpecifiedSurroundingMaxs; // 0x02C0
    float m_flElasticity; // 0x0320
    float m_flShadowCastDistance; // 0x0324
    fVector3 m_vecOrigin; // 0x0458
    fVector3 m_angRotation; // 0x0464
    uint32_t m_CollisionGroup; // 0x0474
    uint32_t m_bIsPlayerSimulated; // 0x0754
    uint32_t m_bSimulatedEveryTick; // 0x0755
    uint32_t m_bAnimatedEveryTick; // 0x0756
    uint32_t m_bAlternateSorting; // 0x0757
    uint32_t m_iTextureFrameIndex; // 0x0758
    uint32_t m_hOwnerEntity; // 0x0764
    uint32_t m_hEffectEntity; // 0x0768
};

class CRagdollProp // parent CBaseEntity {
public:
    void* m_ragAngles; // 0x0000
    uint32_t movetype; // 0x0000
    uint32_t movecollide; // 0x0000
    void* m_ragPos; // 0x0000
    uint32_t m_nRenderFX; // 0x008C
    uint32_t m_clrRender; // 0x0090
    uint32_t m_flAnimTime; // 0x00A0
    uint32_t m_flSimulationTime; // 0x00A8
    uint32_t m_ubInterpolationFrame; // 0x00B4
    uint32_t m_fEffects; // 0x00B8
    uint32_t m_nRenderMode; // 0x00BC
    uint32_t m_nModelIndex; // 0x00CC
    uintptr_t m_nModelIndexOverrides[4]; // 0x00D0
    uint32_t m_iTeamNum; // 0x00EC
    uint32_t m_PredictableID; // 0x00F0
    float m_flGravity; // 0x020C
    uint32_t m_iParentAttachment; // 0x0226
    uint32_t moveparent; // 0x023C
    fVector3 m_vecMinsPreScaled; // 0x0260
    fVector3 m_vecMaxsPreScaled; // 0x026C
    fVector3 m_vecMins; // 0x0278
    fVector3 m_vecMaxs; // 0x0284
    uint32_t m_usSolidFlags; // 0x0294
    uint32_t m_nSurroundType; // 0x0298
    uint32_t m_nSolidType; // 0x0299
    uint32_t m_triggerBloat; // 0x029A
    uint32_t m_bUniformTriggerBloat; // 0x029B
    fVector3 m_vecSpecifiedSurroundingMinsPreScaled; // 0x029C
    fVector3 m_vecSpecifiedSurroundingMaxsPreScaled; // 0x02A8
    fVector3 m_vecSpecifiedSurroundingMins; // 0x02B4
    fVector3 m_vecSpecifiedSurroundingMaxs; // 0x02C0
    float m_flElasticity; // 0x0320
    float m_flShadowCastDistance; // 0x0324
    fVector3 m_vecOrigin; // 0x0458
    fVector3 m_angRotation; // 0x0464
    uint32_t m_CollisionGroup; // 0x0474
    uint32_t m_bIsPlayerSimulated; // 0x0754
    uint32_t m_bSimulatedEveryTick; // 0x0755
    uint32_t m_bAnimatedEveryTick; // 0x0756
    uint32_t m_bAlternateSorting; // 0x0757
    uint32_t m_iTextureFrameIndex; // 0x0758
    uint32_t m_hOwnerEntity; // 0x0764
    uint32_t m_hEffectEntity; // 0x0768
    uint32_t m_nSkin; // 0x07D0
    uint32_t m_nBody; // 0x07D4
    uint32_t m_nHitboxSet; // 0x07D8
    float m_flPlaybackRate; // 0x080C
    fVector3 m_vecForce; // 0x0820
    uint32_t m_nForceBone; // 0x082C
    uint32_t m_bClientSideFrameReset; // 0x086C
    float m_fadeMinDist; // 0x08B0
    float m_fadeMaxDist; // 0x08B4
    float m_flFadeScale; // 0x08B8
    float m_flModelScale; // 0x091C
    float m_flModelWidthScale; // 0x091C
    uintptr_t m_flPoseParameter[24]; // 0x0920
    uintptr_t m_flEncodedController[4]; // 0x0A68
    uint32_t m_bClientSideAnimation; // 0x0AD8
    uint32_t m_nNewSequenceParity; // 0x0ADC
    uint32_t m_nResetEventsParity; // 0x0AE0
    uint32_t m_nSequence; // 0x0B08
    float m_flCycle; // 0x0B10
    uint32_t m_hLightingOrigin; // 0x0BD8
    uint32_t m_hLightingOriginRelative; // 0x0BDC
    uint32_t m_nMuzzleFlashParity; // 0x0BE0
    uint32_t m_hUnragdoll; // 0x0F5C
    float m_flBlendWeight; // 0x0F60
    uint32_t m_nOverlaySequence; // 0x0F68
};

class CTFWeaponBaseMerasmusGrenade // parent CBaseEntity {
public:
    uint32_t movecollide; // 0x0000
    uint32_t movetype; // 0x0000
    uint32_t m_nRenderFX; // 0x008C
    uint32_t m_clrRender; // 0x0090
    uint32_t m_flAnimTime; // 0x00A0
    uint32_t m_flSimulationTime; // 0x00A8
    uint32_t m_ubInterpolationFrame; // 0x00B4
    uint32_t m_fEffects; // 0x00B8
    uint32_t m_nRenderMode; // 0x00BC
    uint32_t m_nModelIndex; // 0x00CC
    uintptr_t m_nModelIndexOverrides[4]; // 0x00D0
    uint32_t m_iTeamNum; // 0x00EC
    uint32_t m_PredictableID; // 0x00F0
    fVector3 m_vecVelocity; // 0x0178
    float m_flGravity; // 0x020C
    uint32_t m_iParentAttachment; // 0x0226
    uint32_t moveparent; // 0x023C
    fVector3 m_vecMinsPreScaled; // 0x0260
    fVector3 m_vecMaxsPreScaled; // 0x026C
    fVector3 m_vecMins; // 0x0278
    fVector3 m_vecMaxs; // 0x0284
    uint32_t m_usSolidFlags; // 0x0294
    uint32_t m_nSurroundType; // 0x0298
    uint32_t m_nSolidType; // 0x0299
    uint32_t m_triggerBloat; // 0x029A
    uint32_t m_bUniformTriggerBloat; // 0x029B
    fVector3 m_vecSpecifiedSurroundingMinsPreScaled; // 0x029C
    fVector3 m_vecSpecifiedSurroundingMaxsPreScaled; // 0x02A8
    fVector3 m_vecSpecifiedSurroundingMins; // 0x02B4
    fVector3 m_vecSpecifiedSurroundingMaxs; // 0x02C0
    float m_flElasticity; // 0x0320
    float m_flShadowCastDistance; // 0x0324
    fVector3 m_vecOrigin; // 0x0458
    fVector3 m_angRotation; // 0x0464
    uint32_t m_fFlags; // 0x0470
    uint32_t m_CollisionGroup; // 0x0474
    uint32_t m_bIsPlayerSimulated; // 0x0754
    uint32_t m_bSimulatedEveryTick; // 0x0755
    uint32_t m_bAnimatedEveryTick; // 0x0756
    uint32_t m_bAlternateSorting; // 0x0757
    uint32_t m_iTextureFrameIndex; // 0x0758
    uint32_t m_hOwnerEntity; // 0x0764
    uint32_t m_hEffectEntity; // 0x0768
    uint32_t m_nSkin; // 0x07D0
    uint32_t m_nBody; // 0x07D4
    uint32_t m_nHitboxSet; // 0x07D8
    float m_flPlaybackRate; // 0x080C
    fVector3 m_vecForce; // 0x0820
    uint32_t m_nForceBone; // 0x082C
    uint32_t m_bClientSideFrameReset; // 0x086C
    float m_fadeMinDist; // 0x08B0
    float m_fadeMaxDist; // 0x08B4
    float m_flFadeScale; // 0x08B8
    float m_flModelScale; // 0x091C
    float m_flModelWidthScale; // 0x091C
    uintptr_t m_flPoseParameter[24]; // 0x0920
    uintptr_t m_flEncodedController[4]; // 0x0A68
    uint32_t m_bClientSideAnimation; // 0x0AD8
    uint32_t m_nNewSequenceParity; // 0x0ADC
    uint32_t m_nResetEventsParity; // 0x0AE0
    uint32_t m_nSequence; // 0x0B08
    float m_flCycle; // 0x0B10
    uint32_t m_hLightingOrigin; // 0x0BD8
    uint32_t m_hLightingOriginRelative; // 0x0BDC
    uint32_t m_nMuzzleFlashParity; // 0x0BE0
    uint32_t m_hOriginalLauncher; // 0x0C18
    uint32_t m_bIsLive; // 0x0C21
    float m_DmgRadius; // 0x0C24
    float m_flDamage; // 0x0C34
    uint32_t m_hThrower; // 0x0C40
};

class CTFPistol_ScoutPrimary // parent CBaseEntity {
public:
    uint32_t movecollide; // 0x0000
    uint32_t movetype; // 0x0000
    uint32_t m_nRenderFX; // 0x008C
    uint32_t m_clrRender; // 0x0090
    uint32_t m_flAnimTime; // 0x00A0
    uint32_t m_flSimulationTime; // 0x00A8
    uint32_t m_ubInterpolationFrame; // 0x00B4
    uint32_t m_fEffects; // 0x00B8
    uint32_t m_nRenderMode; // 0x00BC
    uint32_t m_nNextThinkTick; // 0x00C4
    uint32_t m_nModelIndex; // 0x00CC
    uintptr_t m_nModelIndexOverrides[4]; // 0x00D0
    uint32_t m_iTeamNum; // 0x00EC
    uint32_t m_PredictableID; // 0x00F0
    float m_flGravity; // 0x020C
    uint32_t m_iParentAttachment; // 0x0226
    uint32_t moveparent; // 0x023C
    fVector3 m_vecMinsPreScaled; // 0x0260
    fVector3 m_vecMaxsPreScaled; // 0x026C
    fVector3 m_vecMins; // 0x0278
    fVector3 m_vecMaxs; // 0x0284
    uint32_t m_usSolidFlags; // 0x0294
    uint32_t m_nSurroundType; // 0x0298
    uint32_t m_nSolidType; // 0x0299
    uint32_t m_triggerBloat; // 0x029A
    uint32_t m_bUniformTriggerBloat; // 0x029B
    fVector3 m_vecSpecifiedSurroundingMinsPreScaled; // 0x029C
    fVector3 m_vecSpecifiedSurroundingMaxsPreScaled; // 0x02A8
    fVector3 m_vecSpecifiedSurroundingMins; // 0x02B4
    fVector3 m_vecSpecifiedSurroundingMaxs; // 0x02C0
    float m_flElasticity; // 0x0320
    float m_flShadowCastDistance; // 0x0324
    fVector3 m_vecOrigin; // 0x0458
    fVector3 m_angRotation; // 0x0464
    uint32_t m_CollisionGroup; // 0x0474
    uint32_t m_bIsPlayerSimulated; // 0x0754
    uint32_t m_bSimulatedEveryTick; // 0x0755
    uint32_t m_bAnimatedEveryTick; // 0x0756
    uint32_t m_bAlternateSorting; // 0x0757
    uint32_t m_iTextureFrameIndex; // 0x0758
    uint32_t m_hOwnerEntity; // 0x0764
    uint32_t m_hEffectEntity; // 0x0768
    uint32_t m_nSkin; // 0x07D0
    uint32_t m_nBody; // 0x07D4
    uint32_t m_nHitboxSet; // 0x07D8
    float m_flPlaybackRate; // 0x080C
    fVector3 m_vecForce; // 0x0820
    uint32_t m_nForceBone; // 0x082C
    uint32_t m_bClientSideFrameReset; // 0x086C
    float m_fadeMinDist; // 0x08B0
    float m_fadeMaxDist; // 0x08B4
    float m_flFadeScale; // 0x08B8
    float m_flModelScale; // 0x091C
    float m_flModelWidthScale; // 0x091C
    uintptr_t m_flPoseParameter[24]; // 0x0920
    uintptr_t m_flEncodedController[4]; // 0x0A68
    uint32_t m_bClientSideAnimation; // 0x0AD8
    uint32_t m_nNewSequenceParity; // 0x0ADC
    uint32_t m_nResetEventsParity; // 0x0AE0
    uint32_t m_nSequence; // 0x0B08
    float m_flCycle; // 0x0B10
    uint32_t m_hLightingOrigin; // 0x0BD8
    uint32_t m_hLightingOriginRelative; // 0x0BDC
    uint32_t m_nMuzzleFlashParity; // 0x0BE0
    uint32_t m_iReapplyProvisionParity; // 0x0C88
    uint32_t m_hOuter; // 0x0C8C
    uint32_t m_ProviderType; // 0x0C94
    uint32_t m_iItemDefinitionIndex; // 0x0D10
    uint32_t m_iEntityQuality; // 0x0D14
    uint32_t m_iEntityLevel; // 0x0D18
    uint32_t m_iItemIDHigh; // 0x0D28
    uint32_t m_iItemIDLow; // 0x0D2C
    uint32_t m_iAccountID; // 0x0D30
    uint32_t m_iTeamNumber; // 0x0D98
    uint32_t m_bInitialized; // 0x0D9C
    uint32_t lengthprop20; // 0x0DE8
    uint32_t m_iAttributeDefinitionIndex; // 0x0DF0
    float m_flValue; // 0x0DF4
    uint32_t m_iRawValue32; // 0x0DF4
    uint32_t m_nRefundableCurrency; // 0x0DF8
    uint32_t m_bOnlyIterateItemViewAttributes; // 0x0E18
    uint32_t m_bValidatedAttachedEntity; // 0x0E20
    uint32_t m_hOwner; // 0x0E90
    uint32_t m_nViewModelIndex; // 0x0EA0
    float m_flNextPrimaryAttack; // 0x0EA4
    float m_flNextSecondaryAttack; // 0x0EA8
    float m_flTimeWeaponIdle; // 0x0EAC
    uint32_t m_iViewModelIndex; // 0x0EB4
    uint32_t m_iWorldModelIndex; // 0x0EB8
    uint32_t m_iState; // 0x0ED8
    uint32_t m_iPrimaryAmmoType; // 0x0EE8
    uint32_t m_iSecondaryAmmoType; // 0x0EEC
    uint32_t m_iClip1; // 0x0EF0
    uint32_t m_iClip2; // 0x0EF4
    uint32_t m_bFlipViewModel; // 0x0F20
    uint32_t m_nCustomViewmodelModelIndex; // 0x0F44
    float m_flEffectBarRegenTime; // 0x0F80
    uint32_t m_iReloadMode; // 0x0F88
    float m_flReloadPriorNextFire; // 0x0F8C
    uint32_t m_bLowered; // 0x0FA8
    float m_flLastCritCheckTime; // 0x0FB8
    uint32_t m_bResetParity; // 0x104C
    uint32_t m_bReloadedThroughAnimEvent; // 0x1064
    float m_flEnergy; // 0x1068
    uint32_t m_iConsecutiveShots; // 0x106C
    uint32_t m_bDisguiseWeapon; // 0x1070
    float m_flLastFireTime; // 0x1074
    uint32_t m_hExtraWearable; // 0x1078
    uint32_t m_hExtraWearableViewModel; // 0x107C
    float m_flObservedCritChance; // 0x1080
    uint32_t m_bBeingRepurposedForTaunt; // 0x1084
    uint32_t m_nKillComboClass; // 0x1088
    uint32_t m_nKillComboCount; // 0x108C
    float m_flInspectAnimEndTime; // 0x1090
    uint32_t m_nInspectStage; // 0x1094
};

class CTFCrossbow // parent CBaseEntity {
public:
    uint32_t movecollide; // 0x0000
    uint32_t movetype; // 0x0000
    uint32_t m_nRenderFX; // 0x008C
    uint32_t m_clrRender; // 0x0090
    uint32_t m_flAnimTime; // 0x00A0
    uint32_t m_flSimulationTime; // 0x00A8
    uint32_t m_ubInterpolationFrame; // 0x00B4
    uint32_t m_fEffects; // 0x00B8
    uint32_t m_nRenderMode; // 0x00BC
    uint32_t m_nNextThinkTick; // 0x00C4
    uint32_t m_nModelIndex; // 0x00CC
    uintptr_t m_nModelIndexOverrides[4]; // 0x00D0
    uint32_t m_iTeamNum; // 0x00EC
    uint32_t m_PredictableID; // 0x00F0
    float m_flGravity; // 0x020C
    uint32_t m_iParentAttachment; // 0x0226
    uint32_t moveparent; // 0x023C
    fVector3 m_vecMinsPreScaled; // 0x0260
    fVector3 m_vecMaxsPreScaled; // 0x026C
    fVector3 m_vecMins; // 0x0278
    fVector3 m_vecMaxs; // 0x0284
    uint32_t m_usSolidFlags; // 0x0294
    uint32_t m_nSurroundType; // 0x0298
    uint32_t m_nSolidType; // 0x0299
    uint32_t m_triggerBloat; // 0x029A
    uint32_t m_bUniformTriggerBloat; // 0x029B
    fVector3 m_vecSpecifiedSurroundingMinsPreScaled; // 0x029C
    fVector3 m_vecSpecifiedSurroundingMaxsPreScaled; // 0x02A8
    fVector3 m_vecSpecifiedSurroundingMins; // 0x02B4
    fVector3 m_vecSpecifiedSurroundingMaxs; // 0x02C0
    float m_flElasticity; // 0x0320
    float m_flShadowCastDistance; // 0x0324
    fVector3 m_vecOrigin; // 0x0458
    fVector3 m_angRotation; // 0x0464
    uint32_t m_CollisionGroup; // 0x0474
    uint32_t m_bIsPlayerSimulated; // 0x0754
    uint32_t m_bSimulatedEveryTick; // 0x0755
    uint32_t m_bAnimatedEveryTick; // 0x0756
    uint32_t m_bAlternateSorting; // 0x0757
    uint32_t m_iTextureFrameIndex; // 0x0758
    uint32_t m_hOwnerEntity; // 0x0764
    uint32_t m_hEffectEntity; // 0x0768
    uint32_t m_nSkin; // 0x07D0
    uint32_t m_nBody; // 0x07D4
    uint32_t m_nHitboxSet; // 0x07D8
    float m_flPlaybackRate; // 0x080C
    fVector3 m_vecForce; // 0x0820
    uint32_t m_nForceBone; // 0x082C
    uint32_t m_bClientSideFrameReset; // 0x086C
    float m_fadeMinDist; // 0x08B0
    float m_fadeMaxDist; // 0x08B4
    float m_flFadeScale; // 0x08B8
    float m_flModelScale; // 0x091C
    float m_flModelWidthScale; // 0x091C
    uintptr_t m_flPoseParameter[24]; // 0x0920
    uintptr_t m_flEncodedController[4]; // 0x0A68
    uint32_t m_bClientSideAnimation; // 0x0AD8
    uint32_t m_nNewSequenceParity; // 0x0ADC
    uint32_t m_nResetEventsParity; // 0x0AE0
    uint32_t m_nSequence; // 0x0B08
    float m_flCycle; // 0x0B10
    uint32_t m_hLightingOrigin; // 0x0BD8
    uint32_t m_hLightingOriginRelative; // 0x0BDC
    uint32_t m_nMuzzleFlashParity; // 0x0BE0
    uint32_t m_iReapplyProvisionParity; // 0x0C88
    uint32_t m_hOuter; // 0x0C8C
    uint32_t m_ProviderType; // 0x0C94
    uint32_t m_iItemDefinitionIndex; // 0x0D10
    uint32_t m_iEntityQuality; // 0x0D14
    uint32_t m_iEntityLevel; // 0x0D18
    uint32_t m_iItemIDHigh; // 0x0D28
    uint32_t m_iItemIDLow; // 0x0D2C
    uint32_t m_iAccountID; // 0x0D30
    uint32_t m_iTeamNumber; // 0x0D98
    uint32_t m_bInitialized; // 0x0D9C
    uint32_t lengthprop20; // 0x0DE8
    uint32_t m_iAttributeDefinitionIndex; // 0x0DF0
    uint32_t m_iRawValue32; // 0x0DF4
    float m_flValue; // 0x0DF4
    uint32_t m_nRefundableCurrency; // 0x0DF8
    uint32_t m_bOnlyIterateItemViewAttributes; // 0x0E18
    uint32_t m_bValidatedAttachedEntity; // 0x0E20
    uint32_t m_hOwner; // 0x0E90
    uint32_t m_nViewModelIndex; // 0x0EA0
    float m_flNextPrimaryAttack; // 0x0EA4
    float m_flNextSecondaryAttack; // 0x0EA8
    float m_flTimeWeaponIdle; // 0x0EAC
    uint32_t m_iViewModelIndex; // 0x0EB4
    uint32_t m_iWorldModelIndex; // 0x0EB8
    uint32_t m_iState; // 0x0ED8
    uint32_t m_iPrimaryAmmoType; // 0x0EE8
    uint32_t m_iSecondaryAmmoType; // 0x0EEC
    uint32_t m_iClip1; // 0x0EF0
    uint32_t m_iClip2; // 0x0EF4
    uint32_t m_bFlipViewModel; // 0x0F20
    uint32_t m_nCustomViewmodelModelIndex; // 0x0F44
    float m_flEffectBarRegenTime; // 0x0F80
    uint32_t m_iReloadMode; // 0x0F88
    float m_flReloadPriorNextFire; // 0x0F8C
    uint32_t m_bLowered; // 0x0FA8
    float m_flLastCritCheckTime; // 0x0FB8
    uint32_t m_bResetParity; // 0x104C
    uint32_t m_bReloadedThroughAnimEvent; // 0x1064
    float m_flEnergy; // 0x1068
    uint32_t m_iConsecutiveShots; // 0x106C
    uint32_t m_bDisguiseWeapon; // 0x1070
    float m_flLastFireTime; // 0x1074
    uint32_t m_hExtraWearable; // 0x1078
    uint32_t m_hExtraWearableViewModel; // 0x107C
    float m_flObservedCritChance; // 0x1080
    uint32_t m_bBeingRepurposedForTaunt; // 0x1084
    uint32_t m_nKillComboClass; // 0x1088
    uint32_t m_nKillComboCount; // 0x108C
    float m_flInspectAnimEndTime; // 0x1090
    uint32_t m_nInspectStage; // 0x1094
    float m_flRegenerateDuration; // 0x10B0
    float m_flLastUsedTimestamp; // 0x10B4
};

class CBaseObjectUpgrade // parent CBaseEntity {
public:
    uint32_t movecollide; // 0x0000
    uint32_t m_nSequence; // 0x0000
    uint32_t movetype; // 0x0000
    uint32_t lengthprop15; // 0x0000
    float m_flPrevCycle; // 0x0004
    float m_flWeight; // 0x0008
    uint32_t m_nOrder; // 0x000C
    float m_flCycle; // 0x0014
    uint32_t m_nRenderFX; // 0x008C
    uint32_t m_clrRender; // 0x0090
    uint32_t m_flAnimTime; // 0x00A0
    uint32_t m_flSimulationTime; // 0x00A8
    uint32_t m_ubInterpolationFrame; // 0x00B4
    uint32_t m_fEffects; // 0x00B8
    uint32_t m_nRenderMode; // 0x00BC
    uint32_t m_nModelIndex; // 0x00CC
    uintptr_t m_nModelIndexOverrides[4]; // 0x00D0
    uint32_t m_iTeamNum; // 0x00EC
    uint32_t m_PredictableID; // 0x00F0
    float m_flGravity; // 0x020C
    uint32_t m_iParentAttachment; // 0x0226
    uint32_t moveparent; // 0x023C
    fVector3 m_vecMinsPreScaled; // 0x0260
    fVector3 m_vecMaxsPreScaled; // 0x026C
    fVector3 m_vecMins; // 0x0278
    fVector3 m_vecMaxs; // 0x0284
    uint32_t m_usSolidFlags; // 0x0294
    uint32_t m_nSurroundType; // 0x0298
    uint32_t m_nSolidType; // 0x0299
    uint32_t m_triggerBloat; // 0x029A
    uint32_t m_bUniformTriggerBloat; // 0x029B
    fVector3 m_vecSpecifiedSurroundingMinsPreScaled; // 0x029C
    fVector3 m_vecSpecifiedSurroundingMaxsPreScaled; // 0x02A8
    fVector3 m_vecSpecifiedSurroundingMins; // 0x02B4
    fVector3 m_vecSpecifiedSurroundingMaxs; // 0x02C0
    float m_flElasticity; // 0x0320
    float m_flShadowCastDistance; // 0x0324
    fVector3 m_vecOrigin; // 0x0458
    fVector3 m_angRotation; // 0x0464
    uint32_t m_CollisionGroup; // 0x0474
    uint32_t m_bIsPlayerSimulated; // 0x0754
    uint32_t m_bSimulatedEveryTick; // 0x0755
    uint32_t m_bAnimatedEveryTick; // 0x0756
    uint32_t m_bAlternateSorting; // 0x0757
    uint32_t m_iTextureFrameIndex; // 0x0758
    uint32_t m_hOwnerEntity; // 0x0764
    uint32_t m_hEffectEntity; // 0x0768
    uint32_t m_nSkin; // 0x07D0
    uint32_t m_nBody; // 0x07D4
    uint32_t m_nHitboxSet; // 0x07D8
    float m_flPlaybackRate; // 0x080C
    fVector3 m_vecForce; // 0x0820
    uint32_t m_nForceBone; // 0x082C
    uint32_t m_bClientSideFrameReset; // 0x086C
    float m_fadeMinDist; // 0x08B0
    float m_fadeMaxDist; // 0x08B4
    float m_flFadeScale; // 0x08B8
    float m_flModelScale; // 0x091C
    float m_flModelWidthScale; // 0x091C
    uintptr_t m_flPoseParameter[24]; // 0x0920
    uintptr_t m_flEncodedController[4]; // 0x0A68
    uint32_t m_bClientSideAnimation; // 0x0AD8
    uint32_t m_nNewSequenceParity; // 0x0ADC
    uint32_t m_nResetEventsParity; // 0x0AE0
    uint32_t m_hLightingOrigin; // 0x0BD8
    uint32_t m_hLightingOriginRelative; // 0x0BDC
    uint32_t m_nMuzzleFlashParity; // 0x0BE0
    fVector3 m_viewtarget; // 0x0CA0
    uintptr_t m_flexWeight[96]; // 0x0D00
    uint32_t m_blinktoggle; // 0x0ED0
    float m_flNextAttack; // 0x1090
    uintptr_t m_hMyWeapons[48]; // 0x1118
    uint32_t m_hActiveWeapon; // 0x11D8
    uint32_t m_bGlowEnabled; // 0x11DD
    uint32_t m_iUpgradeLevel; // 0x133C
    uint32_t m_iUpgradeMetal; // 0x1344
    uint32_t m_iHighestUpgradeLevel; // 0x1348
    uint32_t m_iUpgradeMetalRequired; // 0x134C
    uint32_t m_fObjectFlags; // 0x136C
    uint32_t m_hBuilder; // 0x137C
    uint32_t m_bHasSapper; // 0x1388
    uint32_t m_iObjectType; // 0x138C
    uint32_t m_iHealth; // 0x1390
    uint32_t m_iMaxHealth; // 0x1394
    uint32_t m_bBuilding; // 0x1399
    uint32_t m_bPlacing; // 0x139B
    uint32_t m_bDisabled; // 0x139C
    uint32_t m_bCarried; // 0x139E
    uint32_t m_bCarryDeploy; // 0x139F
    uint32_t m_bMiniBuilding; // 0x13A1
    uint32_t m_bDisposableBuilding; // 0x13A2
    float m_flPercentageConstructed; // 0x13A4
    uint32_t m_hBuiltOnEntity; // 0x13A8
    uint32_t m_iObjectMode; // 0x13AC
    uint32_t m_bPlasmaDisable; // 0x13B0
    fVector3 m_vecBuildMaxs; // 0x13B4
    fVector3 m_vecBuildMins; // 0x13C0
    uint32_t m_iDesiredBuildRotations; // 0x13CC
    uint32_t m_bServerOverridePlacement; // 0x13D8
    uint32_t m_bWasMapPlaced; // 0x13F8
};

class CTFWearableLevelableItem // parent CBaseEntity {
public:
    uint32_t movetype; // 0x0000
    uint32_t movecollide; // 0x0000
    uint32_t m_nRenderFX; // 0x008C
    uint32_t m_clrRender; // 0x0090
    uint32_t m_flAnimTime; // 0x00A0
    uint32_t m_flSimulationTime; // 0x00A8
    uint32_t m_ubInterpolationFrame; // 0x00B4
    uint32_t m_fEffects; // 0x00B8
    uint32_t m_nRenderMode; // 0x00BC
    uint32_t m_nModelIndex; // 0x00CC
    uintptr_t m_nModelIndexOverrides[4]; // 0x00D0
    uint32_t m_iTeamNum; // 0x00EC
    uint32_t m_PredictableID; // 0x00F0
    float m_flGravity; // 0x020C
    uint32_t m_iParentAttachment; // 0x0226
    uint32_t moveparent; // 0x023C
    fVector3 m_vecMinsPreScaled; // 0x0260
    fVector3 m_vecMaxsPreScaled; // 0x026C
    fVector3 m_vecMins; // 0x0278
    fVector3 m_vecMaxs; // 0x0284
    uint32_t m_usSolidFlags; // 0x0294
    uint32_t m_nSurroundType; // 0x0298
    uint32_t m_nSolidType; // 0x0299
    uint32_t m_triggerBloat; // 0x029A
    uint32_t m_bUniformTriggerBloat; // 0x029B
    fVector3 m_vecSpecifiedSurroundingMinsPreScaled; // 0x029C
    fVector3 m_vecSpecifiedSurroundingMaxsPreScaled; // 0x02A8
    fVector3 m_vecSpecifiedSurroundingMins; // 0x02B4
    fVector3 m_vecSpecifiedSurroundingMaxs; // 0x02C0
    float m_flElasticity; // 0x0320
    float m_flShadowCastDistance; // 0x0324
    fVector3 m_vecOrigin; // 0x0458
    fVector3 m_angRotation; // 0x0464
    uint32_t m_CollisionGroup; // 0x0474
    uint32_t m_bIsPlayerSimulated; // 0x0754
    uint32_t m_bSimulatedEveryTick; // 0x0755
    uint32_t m_bAnimatedEveryTick; // 0x0756
    uint32_t m_bAlternateSorting; // 0x0757
    uint32_t m_iTextureFrameIndex; // 0x0758
    uint32_t m_hOwnerEntity; // 0x0764
    uint32_t m_hEffectEntity; // 0x0768
    uint32_t m_nSkin; // 0x07D0
    uint32_t m_nBody; // 0x07D4
    uint32_t m_nHitboxSet; // 0x07D8
    float m_flPlaybackRate; // 0x080C
    fVector3 m_vecForce; // 0x0820
    uint32_t m_nForceBone; // 0x082C
    uint32_t m_bClientSideFrameReset; // 0x086C
    float m_fadeMinDist; // 0x08B0
    float m_fadeMaxDist; // 0x08B4
    float m_flFadeScale; // 0x08B8
    float m_flModelScale; // 0x091C
    float m_flModelWidthScale; // 0x091C
    uintptr_t m_flPoseParameter[24]; // 0x0920
    uintptr_t m_flEncodedController[4]; // 0x0A68
    uint32_t m_bClientSideAnimation; // 0x0AD8
    uint32_t m_nNewSequenceParity; // 0x0ADC
    uint32_t m_nResetEventsParity; // 0x0AE0
    uint32_t m_nSequence; // 0x0B08
    float m_flCycle; // 0x0B10
    uint32_t m_hLightingOrigin; // 0x0BD8
    uint32_t m_hLightingOriginRelative; // 0x0BDC
    uint32_t m_nMuzzleFlashParity; // 0x0BE0
    uint32_t m_iReapplyProvisionParity; // 0x0C88
    uint32_t m_hOuter; // 0x0C8C
    uint32_t m_ProviderType; // 0x0C94
    uint32_t m_iItemDefinitionIndex; // 0x0D10
    uint32_t m_iEntityQuality; // 0x0D14
    uint32_t m_iEntityLevel; // 0x0D18
    uint32_t m_iItemIDHigh; // 0x0D28
    uint32_t m_iItemIDLow; // 0x0D2C
    uint32_t m_iAccountID; // 0x0D30
    uint32_t m_iTeamNumber; // 0x0D98
    uint32_t m_bInitialized; // 0x0D9C
    uint32_t lengthprop20; // 0x0DE8
    uint32_t m_iAttributeDefinitionIndex; // 0x0DF0
    uint32_t m_iRawValue32; // 0x0DF4
    float m_flValue; // 0x0DF4
    uint32_t m_nRefundableCurrency; // 0x0DF8
    uint32_t m_bOnlyIterateItemViewAttributes; // 0x0E18
    uint32_t m_bValidatedAttachedEntity; // 0x0E20
    uint32_t m_bDisguiseWearable; // 0x0EB0
    uint32_t m_hWeaponAssociatedWith; // 0x0EB4
    uint32_t m_unLevel; // 0x0EE0
};

class CTFWearable // parent CBaseEntity {
public:
    uint32_t movetype; // 0x0000
    uint32_t movecollide; // 0x0000
    uint32_t m_nRenderFX; // 0x008C
    uint32_t m_clrRender; // 0x0090
    uint32_t m_flAnimTime; // 0x00A0
    uint32_t m_flSimulationTime; // 0x00A8
    uint32_t m_ubInterpolationFrame; // 0x00B4
    uint32_t m_fEffects; // 0x00B8
    uint32_t m_nRenderMode; // 0x00BC
    uint32_t m_nModelIndex; // 0x00CC
    uintptr_t m_nModelIndexOverrides[4]; // 0x00D0
    uint32_t m_iTeamNum; // 0x00EC
    uint32_t m_PredictableID; // 0x00F0
    float m_flGravity; // 0x020C
    uint32_t m_iParentAttachment; // 0x0226
    uint32_t moveparent; // 0x023C
    fVector3 m_vecMinsPreScaled; // 0x0260
    fVector3 m_vecMaxsPreScaled; // 0x026C
    fVector3 m_vecMins; // 0x0278
    fVector3 m_vecMaxs; // 0x0284
    uint32_t m_usSolidFlags; // 0x0294
    uint32_t m_nSurroundType; // 0x0298
    uint32_t m_nSolidType; // 0x0299
    uint32_t m_triggerBloat; // 0x029A
    uint32_t m_bUniformTriggerBloat; // 0x029B
    fVector3 m_vecSpecifiedSurroundingMinsPreScaled; // 0x029C
    fVector3 m_vecSpecifiedSurroundingMaxsPreScaled; // 0x02A8
    fVector3 m_vecSpecifiedSurroundingMins; // 0x02B4
    fVector3 m_vecSpecifiedSurroundingMaxs; // 0x02C0
    float m_flElasticity; // 0x0320
    float m_flShadowCastDistance; // 0x0324
    fVector3 m_vecOrigin; // 0x0458
    fVector3 m_angRotation; // 0x0464
    uint32_t m_CollisionGroup; // 0x0474
    uint32_t m_bIsPlayerSimulated; // 0x0754
    uint32_t m_bSimulatedEveryTick; // 0x0755
    uint32_t m_bAnimatedEveryTick; // 0x0756
    uint32_t m_bAlternateSorting; // 0x0757
    uint32_t m_iTextureFrameIndex; // 0x0758
    uint32_t m_hOwnerEntity; // 0x0764
    uint32_t m_hEffectEntity; // 0x0768
    uint32_t m_nSkin; // 0x07D0
    uint32_t m_nBody; // 0x07D4
    uint32_t m_nHitboxSet; // 0x07D8
    float m_flPlaybackRate; // 0x080C
    fVector3 m_vecForce; // 0x0820
    uint32_t m_nForceBone; // 0x082C
    uint32_t m_bClientSideFrameReset; // 0x086C
    float m_fadeMinDist; // 0x08B0
    float m_fadeMaxDist; // 0x08B4
    float m_flFadeScale; // 0x08B8
    float m_flModelScale; // 0x091C
    float m_flModelWidthScale; // 0x091C
    uintptr_t m_flPoseParameter[24]; // 0x0920
    uintptr_t m_flEncodedController[4]; // 0x0A68
    uint32_t m_bClientSideAnimation; // 0x0AD8
    uint32_t m_nNewSequenceParity; // 0x0ADC
    uint32_t m_nResetEventsParity; // 0x0AE0
    uint32_t m_nSequence; // 0x0B08
    float m_flCycle; // 0x0B10
    uint32_t m_hLightingOrigin; // 0x0BD8
    uint32_t m_hLightingOriginRelative; // 0x0BDC
    uint32_t m_nMuzzleFlashParity; // 0x0BE0
    uint32_t m_iReapplyProvisionParity; // 0x0C88
    uint32_t m_hOuter; // 0x0C8C
    uint32_t m_ProviderType; // 0x0C94
    uint32_t m_iItemDefinitionIndex; // 0x0D10
    uint32_t m_iEntityQuality; // 0x0D14
    uint32_t m_iEntityLevel; // 0x0D18
    uint32_t m_iItemIDHigh; // 0x0D28
    uint32_t m_iItemIDLow; // 0x0D2C
    uint32_t m_iAccountID; // 0x0D30
    uint32_t m_iTeamNumber; // 0x0D98
    uint32_t m_bInitialized; // 0x0D9C
    uint32_t lengthprop20; // 0x0DE8
    uint32_t m_iAttributeDefinitionIndex; // 0x0DF0
    uint32_t m_iRawValue32; // 0x0DF4
    float m_flValue; // 0x0DF4
    uint32_t m_nRefundableCurrency; // 0x0DF8
    uint32_t m_bOnlyIterateItemViewAttributes; // 0x0E18
    uint32_t m_bValidatedAttachedEntity; // 0x0E20
    uint32_t m_bDisguiseWearable; // 0x0EB0
    uint32_t m_hWeaponAssociatedWith; // 0x0EB4
};

class CTFProjectile_GrapplingHook // parent CBaseEntity {
public:
    uint32_t movetype; // 0x0000
    uint32_t movecollide; // 0x0000
    uint32_t m_nRenderFX; // 0x008C
    uint32_t m_clrRender; // 0x0090
    uint32_t m_flAnimTime; // 0x00A0
    uint32_t m_flSimulationTime; // 0x00A8
    uint32_t m_ubInterpolationFrame; // 0x00B4
    uint32_t m_fEffects; // 0x00B8
    uint32_t m_nRenderMode; // 0x00BC
    uint32_t m_nModelIndex; // 0x00CC
    uintptr_t m_nModelIndexOverrides[4]; // 0x00D0
    uint32_t m_iTeamNum; // 0x00EC
    uint32_t m_PredictableID; // 0x00F0
    float m_flGravity; // 0x020C
    uint32_t m_iParentAttachment; // 0x0226
    uint32_t moveparent; // 0x023C
    fVector3 m_vecMinsPreScaled; // 0x0260
    fVector3 m_vecMaxsPreScaled; // 0x026C
    fVector3 m_vecMins; // 0x0278
    fVector3 m_vecMaxs; // 0x0284
    uint32_t m_usSolidFlags; // 0x0294
    uint32_t m_nSurroundType; // 0x0298
    uint32_t m_nSolidType; // 0x0299
    uint32_t m_triggerBloat; // 0x029A
    uint32_t m_bUniformTriggerBloat; // 0x029B
    fVector3 m_vecSpecifiedSurroundingMinsPreScaled; // 0x029C
    fVector3 m_vecSpecifiedSurroundingMaxsPreScaled; // 0x02A8
    fVector3 m_vecSpecifiedSurroundingMins; // 0x02B4
    fVector3 m_vecSpecifiedSurroundingMaxs; // 0x02C0
    float m_flElasticity; // 0x0320
    float m_flShadowCastDistance; // 0x0324
    fVector3 m_vecOrigin; // 0x0458
    fVector3 m_angRotation; // 0x0464
    uint32_t m_CollisionGroup; // 0x0474
    uint32_t m_bIsPlayerSimulated; // 0x0754
    uint32_t m_bSimulatedEveryTick; // 0x0755
    uint32_t m_bAnimatedEveryTick; // 0x0756
    uint32_t m_bAlternateSorting; // 0x0757
    uint32_t m_iTextureFrameIndex; // 0x0758
    uint32_t m_hOwnerEntity; // 0x0764
    uint32_t m_hEffectEntity; // 0x0768
    uint32_t m_nSkin; // 0x07D0
    uint32_t m_nBody; // 0x07D4
    uint32_t m_nHitboxSet; // 0x07D8
    float m_flPlaybackRate; // 0x080C
    fVector3 m_vecForce; // 0x0820
    uint32_t m_nForceBone; // 0x082C
    uint32_t m_bClientSideFrameReset; // 0x086C
    float m_fadeMinDist; // 0x08B0
    float m_fadeMaxDist; // 0x08B4
    float m_flFadeScale; // 0x08B8
    float m_flModelScale; // 0x091C
    float m_flModelWidthScale; // 0x091C
    uintptr_t m_flPoseParameter[24]; // 0x0920
    uintptr_t m_flEncodedController[4]; // 0x0A68
    uint32_t m_bClientSideAnimation; // 0x0AD8
    uint32_t m_nNewSequenceParity; // 0x0ADC
    uint32_t m_nResetEventsParity; // 0x0AE0
    uint32_t m_nSequence; // 0x0B08
    float m_flCycle; // 0x0B10
    uint32_t m_hLightingOrigin; // 0x0BD8
    uint32_t m_hLightingOriginRelative; // 0x0BDC
    uint32_t m_nMuzzleFlashParity; // 0x0BE0
    uint32_t m_hOriginalLauncher; // 0x0C18
    fVector3 m_vInitialVelocity; // 0x0C20
    uint32_t m_iDeflected; // 0x0C2C
    uint32_t m_hLauncher; // 0x0C38
    uint32_t m_bArrowAlight; // 0x0C49
    uint32_t m_bCritical; // 0x0C4A
    uint32_t m_iProjectileType; // 0x0C60
};

class CTFDRGPomson // parent CBaseEntity {
public:
    uint32_t movecollide; // 0x0000
    uint32_t movetype; // 0x0000
    uint32_t m_nRenderFX; // 0x008C
    uint32_t m_clrRender; // 0x0090
    uint32_t m_flAnimTime; // 0x00A0
    uint32_t m_flSimulationTime; // 0x00A8
    uint32_t m_ubInterpolationFrame; // 0x00B4
    uint32_t m_fEffects; // 0x00B8
    uint32_t m_nRenderMode; // 0x00BC
    uint32_t m_nNextThinkTick; // 0x00C4
    uint32_t m_nModelIndex; // 0x00CC
    uintptr_t m_nModelIndexOverrides[4]; // 0x00D0
    uint32_t m_iTeamNum; // 0x00EC
    uint32_t m_PredictableID; // 0x00F0
    float m_flGravity; // 0x020C
    uint32_t m_iParentAttachment; // 0x0226
    uint32_t moveparent; // 0x023C
    fVector3 m_vecMinsPreScaled; // 0x0260
    fVector3 m_vecMaxsPreScaled; // 0x026C
    fVector3 m_vecMins; // 0x0278
    fVector3 m_vecMaxs; // 0x0284
    uint32_t m_usSolidFlags; // 0x0294
    uint32_t m_nSurroundType; // 0x0298
    uint32_t m_nSolidType; // 0x0299
    uint32_t m_triggerBloat; // 0x029A
    uint32_t m_bUniformTriggerBloat; // 0x029B
    fVector3 m_vecSpecifiedSurroundingMinsPreScaled; // 0x029C
    fVector3 m_vecSpecifiedSurroundingMaxsPreScaled; // 0x02A8
    fVector3 m_vecSpecifiedSurroundingMins; // 0x02B4
    fVector3 m_vecSpecifiedSurroundingMaxs; // 0x02C0
    float m_flElasticity; // 0x0320
    float m_flShadowCastDistance; // 0x0324
    fVector3 m_vecOrigin; // 0x0458
    fVector3 m_angRotation; // 0x0464
    uint32_t m_CollisionGroup; // 0x0474
    uint32_t m_bIsPlayerSimulated; // 0x0754
    uint32_t m_bSimulatedEveryTick; // 0x0755
    uint32_t m_bAnimatedEveryTick; // 0x0756
    uint32_t m_bAlternateSorting; // 0x0757
    uint32_t m_iTextureFrameIndex; // 0x0758
    uint32_t m_hOwnerEntity; // 0x0764
    uint32_t m_hEffectEntity; // 0x0768
    uint32_t m_nSkin; // 0x07D0
    uint32_t m_nBody; // 0x07D4
    uint32_t m_nHitboxSet; // 0x07D8
    float m_flPlaybackRate; // 0x080C
    fVector3 m_vecForce; // 0x0820
    uint32_t m_nForceBone; // 0x082C
    uint32_t m_bClientSideFrameReset; // 0x086C
    float m_fadeMinDist; // 0x08B0
    float m_fadeMaxDist; // 0x08B4
    float m_flFadeScale; // 0x08B8
    float m_flModelScale; // 0x091C
    float m_flModelWidthScale; // 0x091C
    uintptr_t m_flPoseParameter[24]; // 0x0920
    uintptr_t m_flEncodedController[4]; // 0x0A68
    uint32_t m_bClientSideAnimation; // 0x0AD8
    uint32_t m_nNewSequenceParity; // 0x0ADC
    uint32_t m_nResetEventsParity; // 0x0AE0
    uint32_t m_nSequence; // 0x0B08
    float m_flCycle; // 0x0B10
    uint32_t m_hLightingOrigin; // 0x0BD8
    uint32_t m_hLightingOriginRelative; // 0x0BDC
    uint32_t m_nMuzzleFlashParity; // 0x0BE0
    uint32_t m_iReapplyProvisionParity; // 0x0C88
    uint32_t m_hOuter; // 0x0C8C
    uint32_t m_ProviderType; // 0x0C94
    uint32_t m_iItemDefinitionIndex; // 0x0D10
    uint32_t m_iEntityQuality; // 0x0D14
    uint32_t m_iEntityLevel; // 0x0D18
    uint32_t m_iItemIDHigh; // 0x0D28
    uint32_t m_iItemIDLow; // 0x0D2C
    uint32_t m_iAccountID; // 0x0D30
    uint32_t m_iTeamNumber; // 0x0D98
    uint32_t m_bInitialized; // 0x0D9C
    uint32_t lengthprop20; // 0x0DE8
    uint32_t m_iAttributeDefinitionIndex; // 0x0DF0
    uint32_t m_iRawValue32; // 0x0DF4
    float m_flValue; // 0x0DF4
    uint32_t m_nRefundableCurrency; // 0x0DF8
    uint32_t m_bOnlyIterateItemViewAttributes; // 0x0E18
    uint32_t m_bValidatedAttachedEntity; // 0x0E20
    uint32_t m_hOwner; // 0x0E90
    uint32_t m_nViewModelIndex; // 0x0EA0
    float m_flNextPrimaryAttack; // 0x0EA4
    float m_flNextSecondaryAttack; // 0x0EA8
    float m_flTimeWeaponIdle; // 0x0EAC
    uint32_t m_iViewModelIndex; // 0x0EB4
    uint32_t m_iWorldModelIndex; // 0x0EB8
    uint32_t m_iState; // 0x0ED8
    uint32_t m_iPrimaryAmmoType; // 0x0EE8
    uint32_t m_iSecondaryAmmoType; // 0x0EEC
    uint32_t m_iClip1; // 0x0EF0
    uint32_t m_iClip2; // 0x0EF4
    uint32_t m_bFlipViewModel; // 0x0F20
    uint32_t m_nCustomViewmodelModelIndex; // 0x0F44
    float m_flEffectBarRegenTime; // 0x0F80
    uint32_t m_iReloadMode; // 0x0F88
    float m_flReloadPriorNextFire; // 0x0F8C
    uint32_t m_bLowered; // 0x0FA8
    float m_flLastCritCheckTime; // 0x0FB8
    uint32_t m_bResetParity; // 0x104C
    uint32_t m_bReloadedThroughAnimEvent; // 0x1064
    float m_flEnergy; // 0x1068
    uint32_t m_iConsecutiveShots; // 0x106C
    uint32_t m_bDisguiseWeapon; // 0x1070
    float m_flLastFireTime; // 0x1074
    uint32_t m_hExtraWearable; // 0x1078
    uint32_t m_hExtraWearableViewModel; // 0x107C
    float m_flObservedCritChance; // 0x1080
    uint32_t m_bBeingRepurposedForTaunt; // 0x1084
    uint32_t m_nKillComboClass; // 0x1088
    uint32_t m_nKillComboCount; // 0x108C
    float m_flInspectAnimEndTime; // 0x1090
    uint32_t m_nInspectStage; // 0x1094
    uint32_t m_bUseNewProjectileCode; // 0x10B5
};

class CTFWeaponBaseMelee // parent CBaseEntity {
public:
    uint32_t movecollide; // 0x0000
    uint32_t movetype; // 0x0000
    uint32_t m_nRenderFX; // 0x008C
    uint32_t m_clrRender; // 0x0090
    uint32_t m_flAnimTime; // 0x00A0
    uint32_t m_flSimulationTime; // 0x00A8
    uint32_t m_ubInterpolationFrame; // 0x00B4
    uint32_t m_fEffects; // 0x00B8
    uint32_t m_nRenderMode; // 0x00BC
    uint32_t m_nNextThinkTick; // 0x00C4
    uint32_t m_nModelIndex; // 0x00CC
    uintptr_t m_nModelIndexOverrides[4]; // 0x00D0
    uint32_t m_iTeamNum; // 0x00EC
    uint32_t m_PredictableID; // 0x00F0
    float m_flGravity; // 0x020C
    uint32_t m_iParentAttachment; // 0x0226
    uint32_t moveparent; // 0x023C
    fVector3 m_vecMinsPreScaled; // 0x0260
    fVector3 m_vecMaxsPreScaled; // 0x026C
    fVector3 m_vecMins; // 0x0278
    fVector3 m_vecMaxs; // 0x0284
    uint32_t m_usSolidFlags; // 0x0294
    uint32_t m_nSurroundType; // 0x0298
    uint32_t m_nSolidType; // 0x0299
    uint32_t m_triggerBloat; // 0x029A
    uint32_t m_bUniformTriggerBloat; // 0x029B
    fVector3 m_vecSpecifiedSurroundingMinsPreScaled; // 0x029C
    fVector3 m_vecSpecifiedSurroundingMaxsPreScaled; // 0x02A8
    fVector3 m_vecSpecifiedSurroundingMins; // 0x02B4
    fVector3 m_vecSpecifiedSurroundingMaxs; // 0x02C0
    float m_flElasticity; // 0x0320
    float m_flShadowCastDistance; // 0x0324
    fVector3 m_vecOrigin; // 0x0458
    fVector3 m_angRotation; // 0x0464
    uint32_t m_CollisionGroup; // 0x0474
    uint32_t m_bIsPlayerSimulated; // 0x0754
    uint32_t m_bSimulatedEveryTick; // 0x0755
    uint32_t m_bAnimatedEveryTick; // 0x0756
    uint32_t m_bAlternateSorting; // 0x0757
    uint32_t m_iTextureFrameIndex; // 0x0758
    uint32_t m_hOwnerEntity; // 0x0764
    uint32_t m_hEffectEntity; // 0x0768
    uint32_t m_nSkin; // 0x07D0
    uint32_t m_nBody; // 0x07D4
    uint32_t m_nHitboxSet; // 0x07D8
    float m_flPlaybackRate; // 0x080C
    fVector3 m_vecForce; // 0x0820
    uint32_t m_nForceBone; // 0x082C
    uint32_t m_bClientSideFrameReset; // 0x086C
    float m_fadeMinDist; // 0x08B0
    float m_fadeMaxDist; // 0x08B4
    float m_flFadeScale; // 0x08B8
    float m_flModelScale; // 0x091C
    float m_flModelWidthScale; // 0x091C
    uintptr_t m_flPoseParameter[24]; // 0x0920
    uintptr_t m_flEncodedController[4]; // 0x0A68
    uint32_t m_bClientSideAnimation; // 0x0AD8
    uint32_t m_nNewSequenceParity; // 0x0ADC
    uint32_t m_nResetEventsParity; // 0x0AE0
    uint32_t m_nSequence; // 0x0B08
    float m_flCycle; // 0x0B10
    uint32_t m_hLightingOrigin; // 0x0BD8
    uint32_t m_hLightingOriginRelative; // 0x0BDC
    uint32_t m_nMuzzleFlashParity; // 0x0BE0
    uint32_t m_iReapplyProvisionParity; // 0x0C88
    uint32_t m_hOuter; // 0x0C8C
    uint32_t m_ProviderType; // 0x0C94
    uint32_t m_iItemDefinitionIndex; // 0x0D10
    uint32_t m_iEntityQuality; // 0x0D14
    uint32_t m_iEntityLevel; // 0x0D18
    uint32_t m_iItemIDHigh; // 0x0D28
    uint32_t m_iItemIDLow; // 0x0D2C
    uint32_t m_iAccountID; // 0x0D30
    uint32_t m_iTeamNumber; // 0x0D98
    uint32_t m_bInitialized; // 0x0D9C
    uint32_t lengthprop20; // 0x0DE8
    uint32_t m_iAttributeDefinitionIndex; // 0x0DF0
    float m_flValue; // 0x0DF4
    uint32_t m_iRawValue32; // 0x0DF4
    uint32_t m_nRefundableCurrency; // 0x0DF8
    uint32_t m_bOnlyIterateItemViewAttributes; // 0x0E18
    uint32_t m_bValidatedAttachedEntity; // 0x0E20
    uint32_t m_hOwner; // 0x0E90
    uint32_t m_nViewModelIndex; // 0x0EA0
    float m_flNextPrimaryAttack; // 0x0EA4
    float m_flNextSecondaryAttack; // 0x0EA8
    float m_flTimeWeaponIdle; // 0x0EAC
    uint32_t m_iViewModelIndex; // 0x0EB4
    uint32_t m_iWorldModelIndex; // 0x0EB8
    uint32_t m_iState; // 0x0ED8
    uint32_t m_iPrimaryAmmoType; // 0x0EE8
    uint32_t m_iSecondaryAmmoType; // 0x0EEC
    uint32_t m_iClip1; // 0x0EF0
    uint32_t m_iClip2; // 0x0EF4
    uint32_t m_bFlipViewModel; // 0x0F20
    uint32_t m_nCustomViewmodelModelIndex; // 0x0F44
    float m_flEffectBarRegenTime; // 0x0F80
    uint32_t m_iReloadMode; // 0x0F88
    float m_flReloadPriorNextFire; // 0x0F8C
    uint32_t m_bLowered; // 0x0FA8
    float m_flLastCritCheckTime; // 0x0FB8
    uint32_t m_bResetParity; // 0x104C
    uint32_t m_bReloadedThroughAnimEvent; // 0x1064
    float m_flEnergy; // 0x1068
    uint32_t m_iConsecutiveShots; // 0x106C
    uint32_t m_bDisguiseWeapon; // 0x1070
    float m_flLastFireTime; // 0x1074
    uint32_t m_hExtraWearable; // 0x1078
    uint32_t m_hExtraWearableViewModel; // 0x107C
    float m_flObservedCritChance; // 0x1080
    uint32_t m_bBeingRepurposedForTaunt; // 0x1084
    uint32_t m_nKillComboClass; // 0x1088
    uint32_t m_nKillComboCount; // 0x108C
    float m_flInspectAnimEndTime; // 0x1090
    uint32_t m_nInspectStage; // 0x1094
};

class CWaterLODControl // parent CBaseEntity {
public:
    uint32_t movetype; // 0x0000
    uint32_t movecollide; // 0x0000
    uint32_t m_nRenderFX; // 0x008C
    uint32_t m_clrRender; // 0x0090
    uint32_t m_flAnimTime; // 0x00A0
    uint32_t m_flSimulationTime; // 0x00A8
    uint32_t m_ubInterpolationFrame; // 0x00B4
    uint32_t m_fEffects; // 0x00B8
    uint32_t m_nRenderMode; // 0x00BC
    uint32_t m_nModelIndex; // 0x00CC
    uintptr_t m_nModelIndexOverrides[4]; // 0x00D0
    uint32_t m_iTeamNum; // 0x00EC
    uint32_t m_PredictableID; // 0x00F0
    float m_flGravity; // 0x020C
    uint32_t m_iParentAttachment; // 0x0226
    uint32_t moveparent; // 0x023C
    fVector3 m_vecMinsPreScaled; // 0x0260
    fVector3 m_vecMaxsPreScaled; // 0x026C
    fVector3 m_vecMins; // 0x0278
    fVector3 m_vecMaxs; // 0x0284
    uint32_t m_usSolidFlags; // 0x0294
    uint32_t m_nSurroundType; // 0x0298
    uint32_t m_nSolidType; // 0x0299
    uint32_t m_triggerBloat; // 0x029A
    uint32_t m_bUniformTriggerBloat; // 0x029B
    fVector3 m_vecSpecifiedSurroundingMinsPreScaled; // 0x029C
    fVector3 m_vecSpecifiedSurroundingMaxsPreScaled; // 0x02A8
    fVector3 m_vecSpecifiedSurroundingMins; // 0x02B4
    fVector3 m_vecSpecifiedSurroundingMaxs; // 0x02C0
    float m_flElasticity; // 0x0320
    float m_flShadowCastDistance; // 0x0324
    fVector3 m_vecOrigin; // 0x0458
    fVector3 m_angRotation; // 0x0464
    uint32_t m_CollisionGroup; // 0x0474
    uint32_t m_bIsPlayerSimulated; // 0x0754
    uint32_t m_bSimulatedEveryTick; // 0x0755
    uint32_t m_bAnimatedEveryTick; // 0x0756
    uint32_t m_bAlternateSorting; // 0x0757
    uint32_t m_iTextureFrameIndex; // 0x0758
    uint32_t m_hOwnerEntity; // 0x0764
    uint32_t m_hEffectEntity; // 0x0768
    float m_flCheapWaterStartDistance; // 0x07C0
    float m_flCheapWaterEndDistance; // 0x07C4
};

class CTEPlayerDecal // parent CBaseTempEntity {
public:
    uint32_t m_nPlayer; // 0x0020
    fVector3 m_vecOrigin; // 0x0024
    uint32_t m_nEntity; // 0x0030
};

class CTFRocketPack // parent CBaseEntity {
public:
    uint32_t movecollide; // 0x0000
    uint32_t movetype; // 0x0000
    uint32_t m_nRenderFX; // 0x008C
    uint32_t m_clrRender; // 0x0090
    uint32_t m_flAnimTime; // 0x00A0
    uint32_t m_flSimulationTime; // 0x00A8
    uint32_t m_ubInterpolationFrame; // 0x00B4
    uint32_t m_fEffects; // 0x00B8
    uint32_t m_nRenderMode; // 0x00BC
    uint32_t m_nNextThinkTick; // 0x00C4
    uint32_t m_nModelIndex; // 0x00CC
    uintptr_t m_nModelIndexOverrides[4]; // 0x00D0
    uint32_t m_iTeamNum; // 0x00EC
    uint32_t m_PredictableID; // 0x00F0
    float m_flGravity; // 0x020C
    uint32_t m_iParentAttachment; // 0x0226
    uint32_t moveparent; // 0x023C
    fVector3 m_vecMinsPreScaled; // 0x0260
    fVector3 m_vecMaxsPreScaled; // 0x026C
    fVector3 m_vecMins; // 0x0278
    fVector3 m_vecMaxs; // 0x0284
    uint32_t m_usSolidFlags; // 0x0294
    uint32_t m_nSurroundType; // 0x0298
    uint32_t m_nSolidType; // 0x0299
    uint32_t m_triggerBloat; // 0x029A
    uint32_t m_bUniformTriggerBloat; // 0x029B
    fVector3 m_vecSpecifiedSurroundingMinsPreScaled; // 0x029C
    fVector3 m_vecSpecifiedSurroundingMaxsPreScaled; // 0x02A8
    fVector3 m_vecSpecifiedSurroundingMins; // 0x02B4
    fVector3 m_vecSpecifiedSurroundingMaxs; // 0x02C0
    float m_flElasticity; // 0x0320
    float m_flShadowCastDistance; // 0x0324
    fVector3 m_vecOrigin; // 0x0458
    fVector3 m_angRotation; // 0x0464
    uint32_t m_CollisionGroup; // 0x0474
    uint32_t m_bIsPlayerSimulated; // 0x0754
    uint32_t m_bSimulatedEveryTick; // 0x0755
    uint32_t m_bAnimatedEveryTick; // 0x0756
    uint32_t m_bAlternateSorting; // 0x0757
    uint32_t m_iTextureFrameIndex; // 0x0758
    uint32_t m_hOwnerEntity; // 0x0764
    uint32_t m_hEffectEntity; // 0x0768
    uint32_t m_nSkin; // 0x07D0
    uint32_t m_nBody; // 0x07D4
    uint32_t m_nHitboxSet; // 0x07D8
    float m_flPlaybackRate; // 0x080C
    fVector3 m_vecForce; // 0x0820
    uint32_t m_nForceBone; // 0x082C
    uint32_t m_bClientSideFrameReset; // 0x086C
    float m_fadeMinDist; // 0x08B0
    float m_fadeMaxDist; // 0x08B4
    float m_flFadeScale; // 0x08B8
    float m_flModelScale; // 0x091C
    float m_flModelWidthScale; // 0x091C
    uintptr_t m_flPoseParameter[24]; // 0x0920
    uintptr_t m_flEncodedController[4]; // 0x0A68
    uint32_t m_bClientSideAnimation; // 0x0AD8
    uint32_t m_nNewSequenceParity; // 0x0ADC
    uint32_t m_nResetEventsParity; // 0x0AE0
    uint32_t m_nSequence; // 0x0B08
    float m_flCycle; // 0x0B10
    uint32_t m_hLightingOrigin; // 0x0BD8
    uint32_t m_hLightingOriginRelative; // 0x0BDC
    uint32_t m_nMuzzleFlashParity; // 0x0BE0
    uint32_t m_iReapplyProvisionParity; // 0x0C88
    uint32_t m_hOuter; // 0x0C8C
    uint32_t m_ProviderType; // 0x0C94
    uint32_t m_iItemDefinitionIndex; // 0x0D10
    uint32_t m_iEntityQuality; // 0x0D14
    uint32_t m_iEntityLevel; // 0x0D18
    uint32_t m_iItemIDHigh; // 0x0D28
    uint32_t m_iItemIDLow; // 0x0D2C
    uint32_t m_iAccountID; // 0x0D30
    uint32_t m_iTeamNumber; // 0x0D98
    uint32_t m_bInitialized; // 0x0D9C
    uint32_t lengthprop20; // 0x0DE8
    uint32_t m_iAttributeDefinitionIndex; // 0x0DF0
    uint32_t m_iRawValue32; // 0x0DF4
    float m_flValue; // 0x0DF4
    uint32_t m_nRefundableCurrency; // 0x0DF8
    uint32_t m_bOnlyIterateItemViewAttributes; // 0x0E18
    uint32_t m_bValidatedAttachedEntity; // 0x0E20
    uint32_t m_hOwner; // 0x0E90
    uint32_t m_nViewModelIndex; // 0x0EA0
    float m_flNextPrimaryAttack; // 0x0EA4
    float m_flNextSecondaryAttack; // 0x0EA8
    float m_flTimeWeaponIdle; // 0x0EAC
    uint32_t m_iViewModelIndex; // 0x0EB4
    uint32_t m_iWorldModelIndex; // 0x0EB8
    uint32_t m_iState; // 0x0ED8
    uint32_t m_iPrimaryAmmoType; // 0x0EE8
    uint32_t m_iSecondaryAmmoType; // 0x0EEC
    uint32_t m_iClip1; // 0x0EF0
    uint32_t m_iClip2; // 0x0EF4
    uint32_t m_bFlipViewModel; // 0x0F20
    uint32_t m_nCustomViewmodelModelIndex; // 0x0F44
    float m_flEffectBarRegenTime; // 0x0F80
    uint32_t m_iReloadMode; // 0x0F88
    float m_flReloadPriorNextFire; // 0x0F8C
    uint32_t m_bLowered; // 0x0FA8
    float m_flLastCritCheckTime; // 0x0FB8
    uint32_t m_bResetParity; // 0x104C
    uint32_t m_bReloadedThroughAnimEvent; // 0x1064
    float m_flEnergy; // 0x1068
    uint32_t m_iConsecutiveShots; // 0x106C
    uint32_t m_bDisguiseWeapon; // 0x1070
    float m_flLastFireTime; // 0x1074
    uint32_t m_hExtraWearable; // 0x1078
    uint32_t m_hExtraWearableViewModel; // 0x107C
    float m_flObservedCritChance; // 0x1080
    uint32_t m_bBeingRepurposedForTaunt; // 0x1084
    uint32_t m_nKillComboClass; // 0x1088
    uint32_t m_nKillComboCount; // 0x108C
    float m_flInspectAnimEndTime; // 0x1090
    uint32_t m_nInspectStage; // 0x1094
    float m_flInitLaunchTime; // 0x10B8
    float m_flLaunchTime; // 0x10BC
    float m_flToggleEndTime; // 0x10C0
    uint32_t m_bEnabled; // 0x10C5
};

class CBaseAnimating // parent CBaseEntity {
public:
    uint32_t movetype; // 0x0000
    uint32_t movecollide; // 0x0000
    uint32_t m_nRenderFX; // 0x008C
    uint32_t m_clrRender; // 0x0090
    uint32_t m_flAnimTime; // 0x00A0
    uint32_t m_flSimulationTime; // 0x00A8
    uint32_t m_ubInterpolationFrame; // 0x00B4
    uint32_t m_fEffects; // 0x00B8
    uint32_t m_nRenderMode; // 0x00BC
    uint32_t m_nModelIndex; // 0x00CC
    uintptr_t m_nModelIndexOverrides[4]; // 0x00D0
    uint32_t m_iTeamNum; // 0x00EC
    uint32_t m_PredictableID; // 0x00F0
    float m_flGravity; // 0x020C
    uint32_t m_iParentAttachment; // 0x0226
    uint32_t moveparent; // 0x023C
    fVector3 m_vecMinsPreScaled; // 0x0260
    fVector3 m_vecMaxsPreScaled; // 0x026C
    fVector3 m_vecMins; // 0x0278
    fVector3 m_vecMaxs; // 0x0284
    uint32_t m_usSolidFlags; // 0x0294
    uint32_t m_nSurroundType; // 0x0298
    uint32_t m_nSolidType; // 0x0299
    uint32_t m_triggerBloat; // 0x029A
    uint32_t m_bUniformTriggerBloat; // 0x029B
    fVector3 m_vecSpecifiedSurroundingMinsPreScaled; // 0x029C
    fVector3 m_vecSpecifiedSurroundingMaxsPreScaled; // 0x02A8
    fVector3 m_vecSpecifiedSurroundingMins; // 0x02B4
    fVector3 m_vecSpecifiedSurroundingMaxs; // 0x02C0
    float m_flElasticity; // 0x0320
    float m_flShadowCastDistance; // 0x0324
    fVector3 m_vecOrigin; // 0x0458
    fVector3 m_angRotation; // 0x0464
    uint32_t m_CollisionGroup; // 0x0474
    uint32_t m_bIsPlayerSimulated; // 0x0754
    uint32_t m_bSimulatedEveryTick; // 0x0755
    uint32_t m_bAnimatedEveryTick; // 0x0756
    uint32_t m_bAlternateSorting; // 0x0757
    uint32_t m_iTextureFrameIndex; // 0x0758
    uint32_t m_hOwnerEntity; // 0x0764
    uint32_t m_hEffectEntity; // 0x0768
    uint32_t m_nSkin; // 0x07D0
    uint32_t m_nBody; // 0x07D4
    uint32_t m_nHitboxSet; // 0x07D8
    float m_flPlaybackRate; // 0x080C
    fVector3 m_vecForce; // 0x0820
    uint32_t m_nForceBone; // 0x082C
    uint32_t m_bClientSideFrameReset; // 0x086C
    float m_fadeMinDist; // 0x08B0
    float m_fadeMaxDist; // 0x08B4
    float m_flFadeScale; // 0x08B8
    float m_flModelScale; // 0x091C
    float m_flModelWidthScale; // 0x091C
    uintptr_t m_flPoseParameter[24]; // 0x0920
    uintptr_t m_flEncodedController[4]; // 0x0A68
    uint32_t m_bClientSideAnimation; // 0x0AD8
    uint32_t m_nNewSequenceParity; // 0x0ADC
    uint32_t m_nResetEventsParity; // 0x0AE0
    uint32_t m_nSequence; // 0x0B08
    float m_flCycle; // 0x0B10
    uint32_t m_hLightingOrigin; // 0x0BD8
    uint32_t m_hLightingOriginRelative; // 0x0BDC
    uint32_t m_nMuzzleFlashParity; // 0x0BE0
};

class CTFSword // parent CBaseEntity {
public:
    uint32_t movecollide; // 0x0000
    uint32_t movetype; // 0x0000
    uint32_t m_nRenderFX; // 0x008C
    uint32_t m_clrRender; // 0x0090
    uint32_t m_flAnimTime; // 0x00A0
    uint32_t m_flSimulationTime; // 0x00A8
    uint32_t m_ubInterpolationFrame; // 0x00B4
    uint32_t m_fEffects; // 0x00B8
    uint32_t m_nRenderMode; // 0x00BC
    uint32_t m_nNextThinkTick; // 0x00C4
    uint32_t m_nModelIndex; // 0x00CC
    uintptr_t m_nModelIndexOverrides[4]; // 0x00D0
    uint32_t m_iTeamNum; // 0x00EC
    uint32_t m_PredictableID; // 0x00F0
    float m_flGravity; // 0x020C
    uint32_t m_iParentAttachment; // 0x0226
    uint32_t moveparent; // 0x023C
    fVector3 m_vecMinsPreScaled; // 0x0260
    fVector3 m_vecMaxsPreScaled; // 0x026C
    fVector3 m_vecMins; // 0x0278
    fVector3 m_vecMaxs; // 0x0284
    uint32_t m_usSolidFlags; // 0x0294
    uint32_t m_nSurroundType; // 0x0298
    uint32_t m_nSolidType; // 0x0299
    uint32_t m_triggerBloat; // 0x029A
    uint32_t m_bUniformTriggerBloat; // 0x029B
    fVector3 m_vecSpecifiedSurroundingMinsPreScaled; // 0x029C
    fVector3 m_vecSpecifiedSurroundingMaxsPreScaled; // 0x02A8
    fVector3 m_vecSpecifiedSurroundingMins; // 0x02B4
    fVector3 m_vecSpecifiedSurroundingMaxs; // 0x02C0
    float m_flElasticity; // 0x0320
    float m_flShadowCastDistance; // 0x0324
    fVector3 m_vecOrigin; // 0x0458
    fVector3 m_angRotation; // 0x0464
    uint32_t m_CollisionGroup; // 0x0474
    uint32_t m_bIsPlayerSimulated; // 0x0754
    uint32_t m_bSimulatedEveryTick; // 0x0755
    uint32_t m_bAnimatedEveryTick; // 0x0756
    uint32_t m_bAlternateSorting; // 0x0757
    uint32_t m_iTextureFrameIndex; // 0x0758
    uint32_t m_hOwnerEntity; // 0x0764
    uint32_t m_hEffectEntity; // 0x0768
    uint32_t m_nSkin; // 0x07D0
    uint32_t m_nBody; // 0x07D4
    uint32_t m_nHitboxSet; // 0x07D8
    float m_flPlaybackRate; // 0x080C
    fVector3 m_vecForce; // 0x0820
    uint32_t m_nForceBone; // 0x082C
    uint32_t m_bClientSideFrameReset; // 0x086C
    float m_fadeMinDist; // 0x08B0
    float m_fadeMaxDist; // 0x08B4
    float m_flFadeScale; // 0x08B8
    float m_flModelScale; // 0x091C
    float m_flModelWidthScale; // 0x091C
    uintptr_t m_flPoseParameter[24]; // 0x0920
    uintptr_t m_flEncodedController[4]; // 0x0A68
    uint32_t m_bClientSideAnimation; // 0x0AD8
    uint32_t m_nNewSequenceParity; // 0x0ADC
    uint32_t m_nResetEventsParity; // 0x0AE0
    uint32_t m_nSequence; // 0x0B08
    float m_flCycle; // 0x0B10
    uint32_t m_hLightingOrigin; // 0x0BD8
    uint32_t m_hLightingOriginRelative; // 0x0BDC
    uint32_t m_nMuzzleFlashParity; // 0x0BE0
    uint32_t m_iReapplyProvisionParity; // 0x0C88
    uint32_t m_hOuter; // 0x0C8C
    uint32_t m_ProviderType; // 0x0C94
    uint32_t m_iItemDefinitionIndex; // 0x0D10
    uint32_t m_iEntityQuality; // 0x0D14
    uint32_t m_iEntityLevel; // 0x0D18
    uint32_t m_iItemIDHigh; // 0x0D28
    uint32_t m_iItemIDLow; // 0x0D2C
    uint32_t m_iAccountID; // 0x0D30
    uint32_t m_iTeamNumber; // 0x0D98
    uint32_t m_bInitialized; // 0x0D9C
    uint32_t lengthprop20; // 0x0DE8
    uint32_t m_iAttributeDefinitionIndex; // 0x0DF0
    float m_flValue; // 0x0DF4
    uint32_t m_iRawValue32; // 0x0DF4
    uint32_t m_nRefundableCurrency; // 0x0DF8
    uint32_t m_bOnlyIterateItemViewAttributes; // 0x0E18
    uint32_t m_bValidatedAttachedEntity; // 0x0E20
    uint32_t m_hOwner; // 0x0E90
    uint32_t m_nViewModelIndex; // 0x0EA0
    float m_flNextPrimaryAttack; // 0x0EA4
    float m_flNextSecondaryAttack; // 0x0EA8
    float m_flTimeWeaponIdle; // 0x0EAC
    uint32_t m_iViewModelIndex; // 0x0EB4
    uint32_t m_iWorldModelIndex; // 0x0EB8
    uint32_t m_iState; // 0x0ED8
    uint32_t m_iPrimaryAmmoType; // 0x0EE8
    uint32_t m_iSecondaryAmmoType; // 0x0EEC
    uint32_t m_iClip1; // 0x0EF0
    uint32_t m_iClip2; // 0x0EF4
    uint32_t m_bFlipViewModel; // 0x0F20
    uint32_t m_nCustomViewmodelModelIndex; // 0x0F44
    float m_flEffectBarRegenTime; // 0x0F80
    uint32_t m_iReloadMode; // 0x0F88
    float m_flReloadPriorNextFire; // 0x0F8C
    uint32_t m_bLowered; // 0x0FA8
    float m_flLastCritCheckTime; // 0x0FB8
    uint32_t m_bResetParity; // 0x104C
    uint32_t m_bReloadedThroughAnimEvent; // 0x1064
    float m_flEnergy; // 0x1068
    uint32_t m_iConsecutiveShots; // 0x106C
    uint32_t m_bDisguiseWeapon; // 0x1070
    float m_flLastFireTime; // 0x1074
    uint32_t m_hExtraWearable; // 0x1078
    uint32_t m_hExtraWearableViewModel; // 0x107C
    float m_flObservedCritChance; // 0x1080
    uint32_t m_bBeingRepurposedForTaunt; // 0x1084
    uint32_t m_nKillComboClass; // 0x1088
    uint32_t m_nKillComboCount; // 0x108C
    float m_flInspectAnimEndTime; // 0x1090
    uint32_t m_nInspectStage; // 0x1094
};

class CTFWeaponBase // parent CBaseEntity {
public:
    uint32_t movecollide; // 0x0000
    uint32_t movetype; // 0x0000
    uint32_t m_nRenderFX; // 0x008C
    uint32_t m_clrRender; // 0x0090
    uint32_t m_flAnimTime; // 0x00A0
    uint32_t m_flSimulationTime; // 0x00A8
    uint32_t m_ubInterpolationFrame; // 0x00B4
    uint32_t m_fEffects; // 0x00B8
    uint32_t m_nRenderMode; // 0x00BC
    uint32_t m_nNextThinkTick; // 0x00C4
    uint32_t m_nModelIndex; // 0x00CC
    uintptr_t m_nModelIndexOverrides[4]; // 0x00D0
    uint32_t m_iTeamNum; // 0x00EC
    uint32_t m_PredictableID; // 0x00F0
    float m_flGravity; // 0x020C
    uint32_t m_iParentAttachment; // 0x0226
    uint32_t moveparent; // 0x023C
    fVector3 m_vecMinsPreScaled; // 0x0260
    fVector3 m_vecMaxsPreScaled; // 0x026C
    fVector3 m_vecMins; // 0x0278
    fVector3 m_vecMaxs; // 0x0284
    uint32_t m_usSolidFlags; // 0x0294
    uint32_t m_nSurroundType; // 0x0298
    uint32_t m_nSolidType; // 0x0299
    uint32_t m_triggerBloat; // 0x029A
    uint32_t m_bUniformTriggerBloat; // 0x029B
    fVector3 m_vecSpecifiedSurroundingMinsPreScaled; // 0x029C
    fVector3 m_vecSpecifiedSurroundingMaxsPreScaled; // 0x02A8
    fVector3 m_vecSpecifiedSurroundingMins; // 0x02B4
    fVector3 m_vecSpecifiedSurroundingMaxs; // 0x02C0
    float m_flElasticity; // 0x0320
    float m_flShadowCastDistance; // 0x0324
    fVector3 m_vecOrigin; // 0x0458
    fVector3 m_angRotation; // 0x0464
    uint32_t m_CollisionGroup; // 0x0474
    uint32_t m_bIsPlayerSimulated; // 0x0754
    uint32_t m_bSimulatedEveryTick; // 0x0755
    uint32_t m_bAnimatedEveryTick; // 0x0756
    uint32_t m_bAlternateSorting; // 0x0757
    uint32_t m_iTextureFrameIndex; // 0x0758
    uint32_t m_hOwnerEntity; // 0x0764
    uint32_t m_hEffectEntity; // 0x0768
    uint32_t m_nSkin; // 0x07D0
    uint32_t m_nBody; // 0x07D4
    uint32_t m_nHitboxSet; // 0x07D8
    float m_flPlaybackRate; // 0x080C
    fVector3 m_vecForce; // 0x0820
    uint32_t m_nForceBone; // 0x082C
    uint32_t m_bClientSideFrameReset; // 0x086C
    float m_fadeMinDist; // 0x08B0
    float m_fadeMaxDist; // 0x08B4
    float m_flFadeScale; // 0x08B8
    float m_flModelScale; // 0x091C
    float m_flModelWidthScale; // 0x091C
    uintptr_t m_flPoseParameter[24]; // 0x0920
    uintptr_t m_flEncodedController[4]; // 0x0A68
    uint32_t m_bClientSideAnimation; // 0x0AD8
    uint32_t m_nNewSequenceParity; // 0x0ADC
    uint32_t m_nResetEventsParity; // 0x0AE0
    uint32_t m_nSequence; // 0x0B08
    float m_flCycle; // 0x0B10
    uint32_t m_hLightingOrigin; // 0x0BD8
    uint32_t m_hLightingOriginRelative; // 0x0BDC
    uint32_t m_nMuzzleFlashParity; // 0x0BE0
    uint32_t m_iReapplyProvisionParity; // 0x0C88
    uint32_t m_hOuter; // 0x0C8C
    uint32_t m_ProviderType; // 0x0C94
    uint32_t m_iItemDefinitionIndex; // 0x0D10
    uint32_t m_iEntityQuality; // 0x0D14
    uint32_t m_iEntityLevel; // 0x0D18
    uint32_t m_iItemIDHigh; // 0x0D28
    uint32_t m_iItemIDLow; // 0x0D2C
    uint32_t m_iAccountID; // 0x0D30
    uint32_t m_iTeamNumber; // 0x0D98
    uint32_t m_bInitialized; // 0x0D9C
    uint32_t lengthprop20; // 0x0DE8
    uint32_t m_iAttributeDefinitionIndex; // 0x0DF0
    float m_flValue; // 0x0DF4
    uint32_t m_iRawValue32; // 0x0DF4
    uint32_t m_nRefundableCurrency; // 0x0DF8
    uint32_t m_bOnlyIterateItemViewAttributes; // 0x0E18
    uint32_t m_bValidatedAttachedEntity; // 0x0E20
    uint32_t m_hOwner; // 0x0E90
    uint32_t m_nViewModelIndex; // 0x0EA0
    float m_flNextPrimaryAttack; // 0x0EA4
    float m_flNextSecondaryAttack; // 0x0EA8
    float m_flTimeWeaponIdle; // 0x0EAC
    uint32_t m_iViewModelIndex; // 0x0EB4
    uint32_t m_iWorldModelIndex; // 0x0EB8
    uint32_t m_iState; // 0x0ED8
    uint32_t m_iPrimaryAmmoType; // 0x0EE8
    uint32_t m_iSecondaryAmmoType; // 0x0EEC
    uint32_t m_iClip1; // 0x0EF0
    uint32_t m_iClip2; // 0x0EF4
    uint32_t m_bFlipViewModel; // 0x0F20
    uint32_t m_nCustomViewmodelModelIndex; // 0x0F44
    float m_flEffectBarRegenTime; // 0x0F80
    uint32_t m_iReloadMode; // 0x0F88
    float m_flReloadPriorNextFire; // 0x0F8C
    uint32_t m_bLowered; // 0x0FA8
    float m_flLastCritCheckTime; // 0x0FB8
    uint32_t m_bResetParity; // 0x104C
    uint32_t m_bReloadedThroughAnimEvent; // 0x1064
    float m_flEnergy; // 0x1068
    uint32_t m_iConsecutiveShots; // 0x106C
    uint32_t m_bDisguiseWeapon; // 0x1070
    float m_flLastFireTime; // 0x1074
    uint32_t m_hExtraWearable; // 0x1078
    uint32_t m_hExtraWearableViewModel; // 0x107C
    float m_flObservedCritChance; // 0x1080
    uint32_t m_bBeingRepurposedForTaunt; // 0x1084
    uint32_t m_nKillComboClass; // 0x1088
    uint32_t m_nKillComboCount; // 0x108C
    float m_flInspectAnimEndTime; // 0x1090
    uint32_t m_nInspectStage; // 0x1094
};

class CParticleSystem {
public:
    uint32_t m_iParentAttachment; // 0x0226
    uint32_t moveparent; // 0x023C
    fVector3 m_vecOrigin; // 0x0458
    fVector3 m_angRotation; // 0x0464
    uint32_t m_hOwnerEntity; // 0x0764
    uint32_t m_iEffectIndex; // 0x07C0
    uint32_t m_bActive; // 0x07C4
    float m_flStartTime; // 0x07C8
    uintptr_t m_hControlPointEnts[63]; // 0x07CC
    uintptr_t m_iControlPointParents[63]; // 0x08C8
    uint32_t m_bWeatherEffect; // 0x0907
};

class CTFWeaponBaseGun // parent CBaseEntity {
public:
    uint32_t movecollide; // 0x0000
    uint32_t movetype; // 0x0000
    uint32_t m_nRenderFX; // 0x008C
    uint32_t m_clrRender; // 0x0090
    uint32_t m_flAnimTime; // 0x00A0
    uint32_t m_flSimulationTime; // 0x00A8
    uint32_t m_ubInterpolationFrame; // 0x00B4
    uint32_t m_fEffects; // 0x00B8
    uint32_t m_nRenderMode; // 0x00BC
    uint32_t m_nNextThinkTick; // 0x00C4
    uint32_t m_nModelIndex; // 0x00CC
    uintptr_t m_nModelIndexOverrides[4]; // 0x00D0
    uint32_t m_iTeamNum; // 0x00EC
    uint32_t m_PredictableID; // 0x00F0
    float m_flGravity; // 0x020C
    uint32_t m_iParentAttachment; // 0x0226
    uint32_t moveparent; // 0x023C
    fVector3 m_vecMinsPreScaled; // 0x0260
    fVector3 m_vecMaxsPreScaled; // 0x026C
    fVector3 m_vecMins; // 0x0278
    fVector3 m_vecMaxs; // 0x0284
    uint32_t m_usSolidFlags; // 0x0294
    uint32_t m_nSurroundType; // 0x0298
    uint32_t m_nSolidType; // 0x0299
    uint32_t m_triggerBloat; // 0x029A
    uint32_t m_bUniformTriggerBloat; // 0x029B
    fVector3 m_vecSpecifiedSurroundingMinsPreScaled; // 0x029C
    fVector3 m_vecSpecifiedSurroundingMaxsPreScaled; // 0x02A8
    fVector3 m_vecSpecifiedSurroundingMins; // 0x02B4
    fVector3 m_vecSpecifiedSurroundingMaxs; // 0x02C0
    float m_flElasticity; // 0x0320
    float m_flShadowCastDistance; // 0x0324
    fVector3 m_vecOrigin; // 0x0458
    fVector3 m_angRotation; // 0x0464
    uint32_t m_CollisionGroup; // 0x0474
    uint32_t m_bIsPlayerSimulated; // 0x0754
    uint32_t m_bSimulatedEveryTick; // 0x0755
    uint32_t m_bAnimatedEveryTick; // 0x0756
    uint32_t m_bAlternateSorting; // 0x0757
    uint32_t m_iTextureFrameIndex; // 0x0758
    uint32_t m_hOwnerEntity; // 0x0764
    uint32_t m_hEffectEntity; // 0x0768
    uint32_t m_nSkin; // 0x07D0
    uint32_t m_nBody; // 0x07D4
    uint32_t m_nHitboxSet; // 0x07D8
    float m_flPlaybackRate; // 0x080C
    fVector3 m_vecForce; // 0x0820
    uint32_t m_nForceBone; // 0x082C
    uint32_t m_bClientSideFrameReset; // 0x086C
    float m_fadeMinDist; // 0x08B0
    float m_fadeMaxDist; // 0x08B4
    float m_flFadeScale; // 0x08B8
    float m_flModelScale; // 0x091C
    float m_flModelWidthScale; // 0x091C
    uintptr_t m_flPoseParameter[24]; // 0x0920
    uintptr_t m_flEncodedController[4]; // 0x0A68
    uint32_t m_bClientSideAnimation; // 0x0AD8
    uint32_t m_nNewSequenceParity; // 0x0ADC
    uint32_t m_nResetEventsParity; // 0x0AE0
    uint32_t m_nSequence; // 0x0B08
    float m_flCycle; // 0x0B10
    uint32_t m_hLightingOrigin; // 0x0BD8
    uint32_t m_hLightingOriginRelative; // 0x0BDC
    uint32_t m_nMuzzleFlashParity; // 0x0BE0
    uint32_t m_iReapplyProvisionParity; // 0x0C88
    uint32_t m_hOuter; // 0x0C8C
    uint32_t m_ProviderType; // 0x0C94
    uint32_t m_iItemDefinitionIndex; // 0x0D10
    uint32_t m_iEntityQuality; // 0x0D14
    uint32_t m_iEntityLevel; // 0x0D18
    uint32_t m_iItemIDHigh; // 0x0D28
    uint32_t m_iItemIDLow; // 0x0D2C
    uint32_t m_iAccountID; // 0x0D30
    uint32_t m_iTeamNumber; // 0x0D98
    uint32_t m_bInitialized; // 0x0D9C
    uint32_t lengthprop20; // 0x0DE8
    uint32_t m_iAttributeDefinitionIndex; // 0x0DF0
    float m_flValue; // 0x0DF4
    uint32_t m_iRawValue32; // 0x0DF4
    uint32_t m_nRefundableCurrency; // 0x0DF8
    uint32_t m_bOnlyIterateItemViewAttributes; // 0x0E18
    uint32_t m_bValidatedAttachedEntity; // 0x0E20
    uint32_t m_hOwner; // 0x0E90
    uint32_t m_nViewModelIndex; // 0x0EA0
    float m_flNextPrimaryAttack; // 0x0EA4
    float m_flNextSecondaryAttack; // 0x0EA8
    float m_flTimeWeaponIdle; // 0x0EAC
    uint32_t m_iViewModelIndex; // 0x0EB4
    uint32_t m_iWorldModelIndex; // 0x0EB8
    uint32_t m_iState; // 0x0ED8
    uint32_t m_iPrimaryAmmoType; // 0x0EE8
    uint32_t m_iSecondaryAmmoType; // 0x0EEC
    uint32_t m_iClip1; // 0x0EF0
    uint32_t m_iClip2; // 0x0EF4
    uint32_t m_bFlipViewModel; // 0x0F20
    uint32_t m_nCustomViewmodelModelIndex; // 0x0F44
    float m_flEffectBarRegenTime; // 0x0F80
    uint32_t m_iReloadMode; // 0x0F88
    float m_flReloadPriorNextFire; // 0x0F8C
    uint32_t m_bLowered; // 0x0FA8
    float m_flLastCritCheckTime; // 0x0FB8
    uint32_t m_bResetParity; // 0x104C
    uint32_t m_bReloadedThroughAnimEvent; // 0x1064
    float m_flEnergy; // 0x1068
    uint32_t m_iConsecutiveShots; // 0x106C
    uint32_t m_bDisguiseWeapon; // 0x1070
    float m_flLastFireTime; // 0x1074
    uint32_t m_hExtraWearable; // 0x1078
    uint32_t m_hExtraWearableViewModel; // 0x107C
    float m_flObservedCritChance; // 0x1080
    uint32_t m_bBeingRepurposedForTaunt; // 0x1084
    uint32_t m_nKillComboClass; // 0x1088
    uint32_t m_nKillComboCount; // 0x108C
    float m_flInspectAnimEndTime; // 0x1090
    uint32_t m_nInspectStage; // 0x1094
};

class CRopeKeyframe {
public:
    uint32_t m_iParentAttachment; // 0x0226
    uint32_t moveparent; // 0x023C
    fVector3 m_vecOrigin; // 0x0458
    float m_flScrollSpeed; // 0x07F4
    uint32_t m_RopeFlags; // 0x07F8
    uint32_t m_iRopeMaterialModelIndex; // 0x07FC
    uint32_t m_nSegments; // 0x0AE8
    uint32_t m_hStartPoint; // 0x0AEC
    uint32_t m_hEndPoint; // 0x0AF0
    uint32_t m_iStartAttachment; // 0x0AF4
    uint32_t m_iEndAttachment; // 0x0AF6
    uint32_t m_Subdiv; // 0x0AF8
    uint32_t m_RopeLength; // 0x0AFC
    uint32_t m_Slack; // 0x0B00
    float m_TextureScale; // 0x0B04
    uint32_t m_fLockedPoints; // 0x0B08
    float m_Width; // 0x0B0C
    uint32_t m_bConstrainBetweenEndpoints; // 0x0BA0
};

class CTFRobotArm // parent CBaseEntity {
public:
    uint32_t movecollide; // 0x0000
    uint32_t movetype; // 0x0000
    uint32_t m_nRenderFX; // 0x008C
    uint32_t m_clrRender; // 0x0090
    uint32_t m_flAnimTime; // 0x00A0
    uint32_t m_flSimulationTime; // 0x00A8
    uint32_t m_ubInterpolationFrame; // 0x00B4
    uint32_t m_fEffects; // 0x00B8
    uint32_t m_nRenderMode; // 0x00BC
    uint32_t m_nNextThinkTick; // 0x00C4
    uint32_t m_nModelIndex; // 0x00CC
    uintptr_t m_nModelIndexOverrides[4]; // 0x00D0
    uint32_t m_iTeamNum; // 0x00EC
    uint32_t m_PredictableID; // 0x00F0
    float m_flGravity; // 0x020C
    uint32_t m_iParentAttachment; // 0x0226
    uint32_t moveparent; // 0x023C
    fVector3 m_vecMinsPreScaled; // 0x0260
    fVector3 m_vecMaxsPreScaled; // 0x026C
    fVector3 m_vecMins; // 0x0278
    fVector3 m_vecMaxs; // 0x0284
    uint32_t m_usSolidFlags; // 0x0294
    uint32_t m_nSurroundType; // 0x0298
    uint32_t m_nSolidType; // 0x0299
    uint32_t m_triggerBloat; // 0x029A
    uint32_t m_bUniformTriggerBloat; // 0x029B
    fVector3 m_vecSpecifiedSurroundingMinsPreScaled; // 0x029C
    fVector3 m_vecSpecifiedSurroundingMaxsPreScaled; // 0x02A8
    fVector3 m_vecSpecifiedSurroundingMins; // 0x02B4
    fVector3 m_vecSpecifiedSurroundingMaxs; // 0x02C0
    float m_flElasticity; // 0x0320
    float m_flShadowCastDistance; // 0x0324
    fVector3 m_vecOrigin; // 0x0458
    fVector3 m_angRotation; // 0x0464
    uint32_t m_CollisionGroup; // 0x0474
    uint32_t m_bIsPlayerSimulated; // 0x0754
    uint32_t m_bSimulatedEveryTick; // 0x0755
    uint32_t m_bAnimatedEveryTick; // 0x0756
    uint32_t m_bAlternateSorting; // 0x0757
    uint32_t m_iTextureFrameIndex; // 0x0758
    uint32_t m_hOwnerEntity; // 0x0764
    uint32_t m_hEffectEntity; // 0x0768
    uint32_t m_nSkin; // 0x07D0
    uint32_t m_nBody; // 0x07D4
    uint32_t m_nHitboxSet; // 0x07D8
    float m_flPlaybackRate; // 0x080C
    fVector3 m_vecForce; // 0x0820
    uint32_t m_nForceBone; // 0x082C
    uint32_t m_bClientSideFrameReset; // 0x086C
    float m_fadeMinDist; // 0x08B0
    float m_fadeMaxDist; // 0x08B4
    float m_flFadeScale; // 0x08B8
    float m_flModelScale; // 0x091C
    float m_flModelWidthScale; // 0x091C
    uintptr_t m_flPoseParameter[24]; // 0x0920
    uintptr_t m_flEncodedController[4]; // 0x0A68
    uint32_t m_bClientSideAnimation; // 0x0AD8
    uint32_t m_nNewSequenceParity; // 0x0ADC
    uint32_t m_nResetEventsParity; // 0x0AE0
    uint32_t m_nSequence; // 0x0B08
    float m_flCycle; // 0x0B10
    uint32_t m_hLightingOrigin; // 0x0BD8
    uint32_t m_hLightingOriginRelative; // 0x0BDC
    uint32_t m_nMuzzleFlashParity; // 0x0BE0
    uint32_t m_iReapplyProvisionParity; // 0x0C88
    uint32_t m_hOuter; // 0x0C8C
    uint32_t m_ProviderType; // 0x0C94
    uint32_t m_iItemDefinitionIndex; // 0x0D10
    uint32_t m_iEntityQuality; // 0x0D14
    uint32_t m_iEntityLevel; // 0x0D18
    uint32_t m_iItemIDHigh; // 0x0D28
    uint32_t m_iItemIDLow; // 0x0D2C
    uint32_t m_iAccountID; // 0x0D30
    uint32_t m_iTeamNumber; // 0x0D98
    uint32_t m_bInitialized; // 0x0D9C
    uint32_t lengthprop20; // 0x0DE8
    uint32_t m_iAttributeDefinitionIndex; // 0x0DF0
    uint32_t m_iRawValue32; // 0x0DF4
    float m_flValue; // 0x0DF4
    uint32_t m_nRefundableCurrency; // 0x0DF8
    uint32_t m_bOnlyIterateItemViewAttributes; // 0x0E18
    uint32_t m_bValidatedAttachedEntity; // 0x0E20
    uint32_t m_hOwner; // 0x0E90
    uint32_t m_nViewModelIndex; // 0x0EA0
    float m_flNextPrimaryAttack; // 0x0EA4
    float m_flNextSecondaryAttack; // 0x0EA8
    float m_flTimeWeaponIdle; // 0x0EAC
    uint32_t m_iViewModelIndex; // 0x0EB4
    uint32_t m_iWorldModelIndex; // 0x0EB8
    uint32_t m_iState; // 0x0ED8
    uint32_t m_iPrimaryAmmoType; // 0x0EE8
    uint32_t m_iSecondaryAmmoType; // 0x0EEC
    uint32_t m_iClip1; // 0x0EF0
    uint32_t m_iClip2; // 0x0EF4
    uint32_t m_bFlipViewModel; // 0x0F20
    uint32_t m_nCustomViewmodelModelIndex; // 0x0F44
    float m_flEffectBarRegenTime; // 0x0F80
    uint32_t m_iReloadMode; // 0x0F88
    float m_flReloadPriorNextFire; // 0x0F8C
    uint32_t m_bLowered; // 0x0FA8
    float m_flLastCritCheckTime; // 0x0FB8
    uint32_t m_bResetParity; // 0x104C
    uint32_t m_bReloadedThroughAnimEvent; // 0x1064
    float m_flEnergy; // 0x1068
    uint32_t m_iConsecutiveShots; // 0x106C
    uint32_t m_bDisguiseWeapon; // 0x1070
    float m_flLastFireTime; // 0x1074
    uint32_t m_hExtraWearable; // 0x1078
    uint32_t m_hExtraWearableViewModel; // 0x107C
    float m_flObservedCritChance; // 0x1080
    uint32_t m_bBeingRepurposedForTaunt; // 0x1084
    uint32_t m_nKillComboClass; // 0x1088
    uint32_t m_nKillComboCount; // 0x108C
    float m_flInspectAnimEndTime; // 0x1090
    uint32_t m_nInspectStage; // 0x1094
    uint32_t m_hRobotArm; // 0x10C0
};

class CTFWeaponBaseGrenadeProj // parent CBaseEntity {
public:
    uint32_t movetype; // 0x0000
    uint32_t movecollide; // 0x0000
    uint32_t m_nRenderFX; // 0x008C
    uint32_t m_clrRender; // 0x0090
    uint32_t m_flAnimTime; // 0x00A0
    uint32_t m_flSimulationTime; // 0x00A8
    uint32_t m_ubInterpolationFrame; // 0x00B4
    uint32_t m_fEffects; // 0x00B8
    uint32_t m_nRenderMode; // 0x00BC
    uint32_t m_nModelIndex; // 0x00CC
    uintptr_t m_nModelIndexOverrides[4]; // 0x00D0
    uint32_t m_iTeamNum; // 0x00EC
    uint32_t m_PredictableID; // 0x00F0
    fVector3 m_vecVelocity; // 0x0178
    float m_flGravity; // 0x020C
    uint32_t m_iParentAttachment; // 0x0226
    uint32_t moveparent; // 0x023C
    fVector3 m_vecMinsPreScaled; // 0x0260
    fVector3 m_vecMaxsPreScaled; // 0x026C
    fVector3 m_vecMins; // 0x0278
    fVector3 m_vecMaxs; // 0x0284
    uint32_t m_usSolidFlags; // 0x0294
    uint32_t m_nSurroundType; // 0x0298
    uint32_t m_nSolidType; // 0x0299
    uint32_t m_triggerBloat; // 0x029A
    uint32_t m_bUniformTriggerBloat; // 0x029B
    fVector3 m_vecSpecifiedSurroundingMinsPreScaled; // 0x029C
    fVector3 m_vecSpecifiedSurroundingMaxsPreScaled; // 0x02A8
    fVector3 m_vecSpecifiedSurroundingMins; // 0x02B4
    fVector3 m_vecSpecifiedSurroundingMaxs; // 0x02C0
    float m_flElasticity; // 0x0320
    float m_flShadowCastDistance; // 0x0324
    fVector3 m_vecOrigin; // 0x0458
    fVector3 m_angRotation; // 0x0464
    uint32_t m_fFlags; // 0x0470
    uint32_t m_CollisionGroup; // 0x0474
    uint32_t m_bIsPlayerSimulated; // 0x0754
    uint32_t m_bSimulatedEveryTick; // 0x0755
    uint32_t m_bAnimatedEveryTick; // 0x0756
    uint32_t m_bAlternateSorting; // 0x0757
    uint32_t m_iTextureFrameIndex; // 0x0758
    uint32_t m_hOwnerEntity; // 0x0764
    uint32_t m_hEffectEntity; // 0x0768
    uint32_t m_nSkin; // 0x07D0
    uint32_t m_nBody; // 0x07D4
    uint32_t m_nHitboxSet; // 0x07D8
    float m_flPlaybackRate; // 0x080C
    fVector3 m_vecForce; // 0x0820
    uint32_t m_nForceBone; // 0x082C
    uint32_t m_bClientSideFrameReset; // 0x086C
    float m_fadeMinDist; // 0x08B0
    float m_fadeMaxDist; // 0x08B4
    float m_flFadeScale; // 0x08B8
    float m_flModelScale; // 0x091C
    float m_flModelWidthScale; // 0x091C
    uintptr_t m_flPoseParameter[24]; // 0x0920
    uintptr_t m_flEncodedController[4]; // 0x0A68
    uint32_t m_bClientSideAnimation; // 0x0AD8
    uint32_t m_nNewSequenceParity; // 0x0ADC
    uint32_t m_nResetEventsParity; // 0x0AE0
    uint32_t m_nSequence; // 0x0B08
    float m_flCycle; // 0x0B10
    uint32_t m_hLightingOrigin; // 0x0BD8
    uint32_t m_hLightingOriginRelative; // 0x0BDC
    uint32_t m_nMuzzleFlashParity; // 0x0BE0
    uint32_t m_hOriginalLauncher; // 0x0C18
    uint32_t m_bIsLive; // 0x0C21
    float m_DmgRadius; // 0x0C24
    float m_flDamage; // 0x0C34
    uint32_t m_hThrower; // 0x0C40
    fVector3 m_vInitialVelocity; // 0x0C48
    uint32_t m_iDeflected; // 0x0C58
    uint32_t m_hDeflectOwner; // 0x0C5C
    uint32_t m_bCritical; // 0x0C64
};

class CTFChargedSMG // parent CBaseEntity {
public:
    uint32_t movecollide; // 0x0000
    uint32_t movetype; // 0x0000
    uint32_t m_nRenderFX; // 0x008C
    uint32_t m_clrRender; // 0x0090
    uint32_t m_flAnimTime; // 0x00A0
    uint32_t m_flSimulationTime; // 0x00A8
    uint32_t m_ubInterpolationFrame; // 0x00B4
    uint32_t m_fEffects; // 0x00B8
    uint32_t m_nRenderMode; // 0x00BC
    uint32_t m_nNextThinkTick; // 0x00C4
    uint32_t m_nModelIndex; // 0x00CC
    uintptr_t m_nModelIndexOverrides[4]; // 0x00D0
    uint32_t m_iTeamNum; // 0x00EC
    uint32_t m_PredictableID; // 0x00F0
    float m_flGravity; // 0x020C
    uint32_t m_iParentAttachment; // 0x0226
    uint32_t moveparent; // 0x023C
    fVector3 m_vecMinsPreScaled; // 0x0260
    fVector3 m_vecMaxsPreScaled; // 0x026C
    fVector3 m_vecMins; // 0x0278
    fVector3 m_vecMaxs; // 0x0284
    uint32_t m_usSolidFlags; // 0x0294
    uint32_t m_nSurroundType; // 0x0298
    uint32_t m_nSolidType; // 0x0299
    uint32_t m_triggerBloat; // 0x029A
    uint32_t m_bUniformTriggerBloat; // 0x029B
    fVector3 m_vecSpecifiedSurroundingMinsPreScaled; // 0x029C
    fVector3 m_vecSpecifiedSurroundingMaxsPreScaled; // 0x02A8
    fVector3 m_vecSpecifiedSurroundingMins; // 0x02B4
    fVector3 m_vecSpecifiedSurroundingMaxs; // 0x02C0
    float m_flElasticity; // 0x0320
    float m_flShadowCastDistance; // 0x0324
    fVector3 m_vecOrigin; // 0x0458
    fVector3 m_angRotation; // 0x0464
    uint32_t m_CollisionGroup; // 0x0474
    uint32_t m_bIsPlayerSimulated; // 0x0754
    uint32_t m_bSimulatedEveryTick; // 0x0755
    uint32_t m_bAnimatedEveryTick; // 0x0756
    uint32_t m_bAlternateSorting; // 0x0757
    uint32_t m_iTextureFrameIndex; // 0x0758
    uint32_t m_hOwnerEntity; // 0x0764
    uint32_t m_hEffectEntity; // 0x0768
    uint32_t m_nSkin; // 0x07D0
    uint32_t m_nBody; // 0x07D4
    uint32_t m_nHitboxSet; // 0x07D8
    float m_flPlaybackRate; // 0x080C
    fVector3 m_vecForce; // 0x0820
    uint32_t m_nForceBone; // 0x082C
    uint32_t m_bClientSideFrameReset; // 0x086C
    float m_fadeMinDist; // 0x08B0
    float m_fadeMaxDist; // 0x08B4
    float m_flFadeScale; // 0x08B8
    float m_flModelScale; // 0x091C
    float m_flModelWidthScale; // 0x091C
    uintptr_t m_flPoseParameter[24]; // 0x0920
    uintptr_t m_flEncodedController[4]; // 0x0A68
    uint32_t m_bClientSideAnimation; // 0x0AD8
    uint32_t m_nNewSequenceParity; // 0x0ADC
    uint32_t m_nResetEventsParity; // 0x0AE0
    uint32_t m_nSequence; // 0x0B08
    float m_flCycle; // 0x0B10
    uint32_t m_hLightingOrigin; // 0x0BD8
    uint32_t m_hLightingOriginRelative; // 0x0BDC
    uint32_t m_nMuzzleFlashParity; // 0x0BE0
    uint32_t m_iReapplyProvisionParity; // 0x0C88
    uint32_t m_hOuter; // 0x0C8C
    uint32_t m_ProviderType; // 0x0C94
    uint32_t m_iItemDefinitionIndex; // 0x0D10
    uint32_t m_iEntityQuality; // 0x0D14
    uint32_t m_iEntityLevel; // 0x0D18
    uint32_t m_iItemIDHigh; // 0x0D28
    uint32_t m_iItemIDLow; // 0x0D2C
    uint32_t m_iAccountID; // 0x0D30
    uint32_t m_iTeamNumber; // 0x0D98
    uint32_t m_bInitialized; // 0x0D9C
    uint32_t lengthprop20; // 0x0DE8
    uint32_t m_iAttributeDefinitionIndex; // 0x0DF0
    uint32_t m_iRawValue32; // 0x0DF4
    float m_flValue; // 0x0DF4
    uint32_t m_nRefundableCurrency; // 0x0DF8
    uint32_t m_bOnlyIterateItemViewAttributes; // 0x0E18
    uint32_t m_bValidatedAttachedEntity; // 0x0E20
    uint32_t m_hOwner; // 0x0E90
    uint32_t m_nViewModelIndex; // 0x0EA0
    float m_flNextPrimaryAttack; // 0x0EA4
    float m_flNextSecondaryAttack; // 0x0EA8
    float m_flTimeWeaponIdle; // 0x0EAC
    uint32_t m_iViewModelIndex; // 0x0EB4
    uint32_t m_iWorldModelIndex; // 0x0EB8
    uint32_t m_iState; // 0x0ED8
    uint32_t m_iPrimaryAmmoType; // 0x0EE8
    uint32_t m_iSecondaryAmmoType; // 0x0EEC
    uint32_t m_iClip1; // 0x0EF0
    uint32_t m_iClip2; // 0x0EF4
    uint32_t m_bFlipViewModel; // 0x0F20
    uint32_t m_nCustomViewmodelModelIndex; // 0x0F44
    float m_flEffectBarRegenTime; // 0x0F80
    uint32_t m_iReloadMode; // 0x0F88
    float m_flReloadPriorNextFire; // 0x0F8C
    uint32_t m_bLowered; // 0x0FA8
    float m_flLastCritCheckTime; // 0x0FB8
    uint32_t m_bResetParity; // 0x104C
    uint32_t m_bReloadedThroughAnimEvent; // 0x1064
    float m_flEnergy; // 0x1068
    uint32_t m_iConsecutiveShots; // 0x106C
    uint32_t m_bDisguiseWeapon; // 0x1070
    float m_flLastFireTime; // 0x1074
    uint32_t m_hExtraWearable; // 0x1078
    uint32_t m_hExtraWearableViewModel; // 0x107C
    float m_flObservedCritChance; // 0x1080
    uint32_t m_bBeingRepurposedForTaunt; // 0x1084
    uint32_t m_nKillComboClass; // 0x1088
    uint32_t m_nKillComboCount; // 0x108C
    float m_flInspectAnimEndTime; // 0x1090
    uint32_t m_nInspectStage; // 0x1094
    float m_flMinicritCharge; // 0x10A8
};

class CTFWrench // parent CBaseEntity {
public:
    uint32_t movecollide; // 0x0000
    uint32_t movetype; // 0x0000
    uint32_t m_nRenderFX; // 0x008C
    uint32_t m_clrRender; // 0x0090
    uint32_t m_flAnimTime; // 0x00A0
    uint32_t m_flSimulationTime; // 0x00A8
    uint32_t m_ubInterpolationFrame; // 0x00B4
    uint32_t m_fEffects; // 0x00B8
    uint32_t m_nRenderMode; // 0x00BC
    uint32_t m_nNextThinkTick; // 0x00C4
    uint32_t m_nModelIndex; // 0x00CC
    uintptr_t m_nModelIndexOverrides[4]; // 0x00D0
    uint32_t m_iTeamNum; // 0x00EC
    uint32_t m_PredictableID; // 0x00F0
    float m_flGravity; // 0x020C
    uint32_t m_iParentAttachment; // 0x0226
    uint32_t moveparent; // 0x023C
    fVector3 m_vecMinsPreScaled; // 0x0260
    fVector3 m_vecMaxsPreScaled; // 0x026C
    fVector3 m_vecMins; // 0x0278
    fVector3 m_vecMaxs; // 0x0284
    uint32_t m_usSolidFlags; // 0x0294
    uint32_t m_nSurroundType; // 0x0298
    uint32_t m_nSolidType; // 0x0299
    uint32_t m_triggerBloat; // 0x029A
    uint32_t m_bUniformTriggerBloat; // 0x029B
    fVector3 m_vecSpecifiedSurroundingMinsPreScaled; // 0x029C
    fVector3 m_vecSpecifiedSurroundingMaxsPreScaled; // 0x02A8
    fVector3 m_vecSpecifiedSurroundingMins; // 0x02B4
    fVector3 m_vecSpecifiedSurroundingMaxs; // 0x02C0
    float m_flElasticity; // 0x0320
    float m_flShadowCastDistance; // 0x0324
    fVector3 m_vecOrigin; // 0x0458
    fVector3 m_angRotation; // 0x0464
    uint32_t m_CollisionGroup; // 0x0474
    uint32_t m_bIsPlayerSimulated; // 0x0754
    uint32_t m_bSimulatedEveryTick; // 0x0755
    uint32_t m_bAnimatedEveryTick; // 0x0756
    uint32_t m_bAlternateSorting; // 0x0757
    uint32_t m_iTextureFrameIndex; // 0x0758
    uint32_t m_hOwnerEntity; // 0x0764
    uint32_t m_hEffectEntity; // 0x0768
    uint32_t m_nSkin; // 0x07D0
    uint32_t m_nBody; // 0x07D4
    uint32_t m_nHitboxSet; // 0x07D8
    float m_flPlaybackRate; // 0x080C
    fVector3 m_vecForce; // 0x0820
    uint32_t m_nForceBone; // 0x082C
    uint32_t m_bClientSideFrameReset; // 0x086C
    float m_fadeMinDist; // 0x08B0
    float m_fadeMaxDist; // 0x08B4
    float m_flFadeScale; // 0x08B8
    float m_flModelScale; // 0x091C
    float m_flModelWidthScale; // 0x091C
    uintptr_t m_flPoseParameter[24]; // 0x0920
    uintptr_t m_flEncodedController[4]; // 0x0A68
    uint32_t m_bClientSideAnimation; // 0x0AD8
    uint32_t m_nNewSequenceParity; // 0x0ADC
    uint32_t m_nResetEventsParity; // 0x0AE0
    uint32_t m_nSequence; // 0x0B08
    float m_flCycle; // 0x0B10
    uint32_t m_hLightingOrigin; // 0x0BD8
    uint32_t m_hLightingOriginRelative; // 0x0BDC
    uint32_t m_nMuzzleFlashParity; // 0x0BE0
    uint32_t m_iReapplyProvisionParity; // 0x0C88
    uint32_t m_hOuter; // 0x0C8C
    uint32_t m_ProviderType; // 0x0C94
    uint32_t m_iItemDefinitionIndex; // 0x0D10
    uint32_t m_iEntityQuality; // 0x0D14
    uint32_t m_iEntityLevel; // 0x0D18
    uint32_t m_iItemIDHigh; // 0x0D28
    uint32_t m_iItemIDLow; // 0x0D2C
    uint32_t m_iAccountID; // 0x0D30
    uint32_t m_iTeamNumber; // 0x0D98
    uint32_t m_bInitialized; // 0x0D9C
    uint32_t lengthprop20; // 0x0DE8
    uint32_t m_iAttributeDefinitionIndex; // 0x0DF0
    float m_flValue; // 0x0DF4
    uint32_t m_iRawValue32; // 0x0DF4
    uint32_t m_nRefundableCurrency; // 0x0DF8
    uint32_t m_bOnlyIterateItemViewAttributes; // 0x0E18
    uint32_t m_bValidatedAttachedEntity; // 0x0E20
    uint32_t m_hOwner; // 0x0E90
    uint32_t m_nViewModelIndex; // 0x0EA0
    float m_flNextPrimaryAttack; // 0x0EA4
    float m_flNextSecondaryAttack; // 0x0EA8
    float m_flTimeWeaponIdle; // 0x0EAC
    uint32_t m_iViewModelIndex; // 0x0EB4
    uint32_t m_iWorldModelIndex; // 0x0EB8
    uint32_t m_iState; // 0x0ED8
    uint32_t m_iPrimaryAmmoType; // 0x0EE8
    uint32_t m_iSecondaryAmmoType; // 0x0EEC
    uint32_t m_iClip1; // 0x0EF0
    uint32_t m_iClip2; // 0x0EF4
    uint32_t m_bFlipViewModel; // 0x0F20
    uint32_t m_nCustomViewmodelModelIndex; // 0x0F44
    float m_flEffectBarRegenTime; // 0x0F80
    uint32_t m_iReloadMode; // 0x0F88
    float m_flReloadPriorNextFire; // 0x0F8C
    uint32_t m_bLowered; // 0x0FA8
    float m_flLastCritCheckTime; // 0x0FB8
    uint32_t m_bResetParity; // 0x104C
    uint32_t m_bReloadedThroughAnimEvent; // 0x1064
    float m_flEnergy; // 0x1068
    uint32_t m_iConsecutiveShots; // 0x106C
    uint32_t m_bDisguiseWeapon; // 0x1070
    float m_flLastFireTime; // 0x1074
    uint32_t m_hExtraWearable; // 0x1078
    uint32_t m_hExtraWearableViewModel; // 0x107C
    float m_flObservedCritChance; // 0x1080
    uint32_t m_bBeingRepurposedForTaunt; // 0x1084
    uint32_t m_nKillComboClass; // 0x1088
    uint32_t m_nKillComboCount; // 0x108C
    float m_flInspectAnimEndTime; // 0x1090
    uint32_t m_nInspectStage; // 0x1094
};

class CSun {
public:
    float HDRColorScale; // 0x0000
    uint32_t m_clrRender; // 0x0090
    uint32_t m_clrOverlay; // 0x0970
    uint32_t m_nSize; // 0x0974
    uint32_t m_nOverlaySize; // 0x0978
    fVector3 m_vDirection; // 0x097C
    uint32_t m_bOn; // 0x0988
    uint32_t m_nMaterial; // 0x098C
    uint32_t m_nOverlayMaterial; // 0x0990
};

class CTFProjectile_ThrowableBreadMonster // parent CBaseEntity {
public:
    uint32_t movetype; // 0x0000
    uint32_t movecollide; // 0x0000
    uint32_t m_nRenderFX; // 0x008C
    uint32_t m_clrRender; // 0x0090
    uint32_t m_flAnimTime; // 0x00A0
    uint32_t m_flSimulationTime; // 0x00A8
    uint32_t m_ubInterpolationFrame; // 0x00B4
    uint32_t m_fEffects; // 0x00B8
    uint32_t m_nRenderMode; // 0x00BC
    uint32_t m_nModelIndex; // 0x00CC
    uintptr_t m_nModelIndexOverrides[4]; // 0x00D0
    uint32_t m_iTeamNum; // 0x00EC
    uint32_t m_PredictableID; // 0x00F0
    fVector3 m_vecVelocity; // 0x0178
    float m_flGravity; // 0x020C
    uint32_t m_iParentAttachment; // 0x0226
    uint32_t moveparent; // 0x023C
    fVector3 m_vecMinsPreScaled; // 0x0260
    fVector3 m_vecMaxsPreScaled; // 0x026C
    fVector3 m_vecMins; // 0x0278
    fVector3 m_vecMaxs; // 0x0284
    uint32_t m_usSolidFlags; // 0x0294
    uint32_t m_nSurroundType; // 0x0298
    uint32_t m_nSolidType; // 0x0299
    uint32_t m_triggerBloat; // 0x029A
    uint32_t m_bUniformTriggerBloat; // 0x029B
    fVector3 m_vecSpecifiedSurroundingMinsPreScaled; // 0x029C
    fVector3 m_vecSpecifiedSurroundingMaxsPreScaled; // 0x02A8
    fVector3 m_vecSpecifiedSurroundingMins; // 0x02B4
    fVector3 m_vecSpecifiedSurroundingMaxs; // 0x02C0
    float m_flElasticity; // 0x0320
    float m_flShadowCastDistance; // 0x0324
    fVector3 m_vecOrigin; // 0x0458
    fVector3 m_angRotation; // 0x0464
    uint32_t m_fFlags; // 0x0470
    uint32_t m_CollisionGroup; // 0x0474
    uint32_t m_bIsPlayerSimulated; // 0x0754
    uint32_t m_bSimulatedEveryTick; // 0x0755
    uint32_t m_bAnimatedEveryTick; // 0x0756
    uint32_t m_bAlternateSorting; // 0x0757
    uint32_t m_iTextureFrameIndex; // 0x0758
    uint32_t m_hOwnerEntity; // 0x0764
    uint32_t m_hEffectEntity; // 0x0768
    uint32_t m_nSkin; // 0x07D0
    uint32_t m_nBody; // 0x07D4
    uint32_t m_nHitboxSet; // 0x07D8
    float m_flPlaybackRate; // 0x080C
    fVector3 m_vecForce; // 0x0820
    uint32_t m_nForceBone; // 0x082C
    uint32_t m_bClientSideFrameReset; // 0x086C
    float m_fadeMinDist; // 0x08B0
    float m_fadeMaxDist; // 0x08B4
    float m_flFadeScale; // 0x08B8
    float m_flModelScale; // 0x091C
    float m_flModelWidthScale; // 0x091C
    uintptr_t m_flPoseParameter[24]; // 0x0920
    uintptr_t m_flEncodedController[4]; // 0x0A68
    uint32_t m_bClientSideAnimation; // 0x0AD8
    uint32_t m_nNewSequenceParity; // 0x0ADC
    uint32_t m_nResetEventsParity; // 0x0AE0
    uint32_t m_nSequence; // 0x0B08
    float m_flCycle; // 0x0B10
    uint32_t m_hLightingOrigin; // 0x0BD8
    uint32_t m_hLightingOriginRelative; // 0x0BDC
    uint32_t m_nMuzzleFlashParity; // 0x0BE0
    uint32_t m_hOriginalLauncher; // 0x0C18
    uint32_t m_bIsLive; // 0x0C21
    float m_DmgRadius; // 0x0C24
    float m_flDamage; // 0x0C34
    uint32_t m_hThrower; // 0x0C40
    fVector3 m_vInitialVelocity; // 0x0C48
    uint32_t m_hLauncher; // 0x0C54
    uint32_t m_iDeflected; // 0x0C58
    uint32_t m_hDeflectOwner; // 0x0C5C
    uint32_t m_bCritical; // 0x0C64
    uint32_t m_bTouched; // 0x0C68
    uint32_t m_iType; // 0x0C6C
    uint32_t m_bDefensiveBomb; // 0x0C80
};

class CTFProjectile_ThrowableBrick // parent CBaseEntity {
public:
    uint32_t movetype; // 0x0000
    uint32_t movecollide; // 0x0000
    uint32_t m_nRenderFX; // 0x008C
    uint32_t m_clrRender; // 0x0090
    uint32_t m_flAnimTime; // 0x00A0
    uint32_t m_flSimulationTime; // 0x00A8
    uint32_t m_ubInterpolationFrame; // 0x00B4
    uint32_t m_fEffects; // 0x00B8
    uint32_t m_nRenderMode; // 0x00BC
    uint32_t m_nModelIndex; // 0x00CC
    uintptr_t m_nModelIndexOverrides[4]; // 0x00D0
    uint32_t m_iTeamNum; // 0x00EC
    uint32_t m_PredictableID; // 0x00F0
    fVector3 m_vecVelocity; // 0x0178
    float m_flGravity; // 0x020C
    uint32_t m_iParentAttachment; // 0x0226
    uint32_t moveparent; // 0x023C
    fVector3 m_vecMinsPreScaled; // 0x0260
    fVector3 m_vecMaxsPreScaled; // 0x026C
    fVector3 m_vecMins; // 0x0278
    fVector3 m_vecMaxs; // 0x0284
    uint32_t m_usSolidFlags; // 0x0294
    uint32_t m_nSurroundType; // 0x0298
    uint32_t m_nSolidType; // 0x0299
    uint32_t m_triggerBloat; // 0x029A
    uint32_t m_bUniformTriggerBloat; // 0x029B
    fVector3 m_vecSpecifiedSurroundingMinsPreScaled; // 0x029C
    fVector3 m_vecSpecifiedSurroundingMaxsPreScaled; // 0x02A8
    fVector3 m_vecSpecifiedSurroundingMins; // 0x02B4
    fVector3 m_vecSpecifiedSurroundingMaxs; // 0x02C0
    float m_flElasticity; // 0x0320
    float m_flShadowCastDistance; // 0x0324
    fVector3 m_vecOrigin; // 0x0458
    fVector3 m_angRotation; // 0x0464
    uint32_t m_fFlags; // 0x0470
    uint32_t m_CollisionGroup; // 0x0474
    uint32_t m_bIsPlayerSimulated; // 0x0754
    uint32_t m_bSimulatedEveryTick; // 0x0755
    uint32_t m_bAnimatedEveryTick; // 0x0756
    uint32_t m_bAlternateSorting; // 0x0757
    uint32_t m_iTextureFrameIndex; // 0x0758
    uint32_t m_hOwnerEntity; // 0x0764
    uint32_t m_hEffectEntity; // 0x0768
    uint32_t m_nSkin; // 0x07D0
    uint32_t m_nBody; // 0x07D4
    uint32_t m_nHitboxSet; // 0x07D8
    float m_flPlaybackRate; // 0x080C
    fVector3 m_vecForce; // 0x0820
    uint32_t m_nForceBone; // 0x082C
    uint32_t m_bClientSideFrameReset; // 0x086C
    float m_fadeMinDist; // 0x08B0
    float m_fadeMaxDist; // 0x08B4
    float m_flFadeScale; // 0x08B8
    float m_flModelScale; // 0x091C
    float m_flModelWidthScale; // 0x091C
    uintptr_t m_flPoseParameter[24]; // 0x0920
    uintptr_t m_flEncodedController[4]; // 0x0A68
    uint32_t m_bClientSideAnimation; // 0x0AD8
    uint32_t m_nNewSequenceParity; // 0x0ADC
    uint32_t m_nResetEventsParity; // 0x0AE0
    uint32_t m_nSequence; // 0x0B08
    float m_flCycle; // 0x0B10
    uint32_t m_hLightingOrigin; // 0x0BD8
    uint32_t m_hLightingOriginRelative; // 0x0BDC
    uint32_t m_nMuzzleFlashParity; // 0x0BE0
    uint32_t m_hOriginalLauncher; // 0x0C18
    uint32_t m_bIsLive; // 0x0C21
    float m_DmgRadius; // 0x0C24
    float m_flDamage; // 0x0C34
    uint32_t m_hThrower; // 0x0C40
    fVector3 m_vInitialVelocity; // 0x0C48
    uint32_t m_hLauncher; // 0x0C54
    uint32_t m_iDeflected; // 0x0C58
    uint32_t m_hDeflectOwner; // 0x0C5C
    uint32_t m_bCritical; // 0x0C64
    uint32_t m_bTouched; // 0x0C68
    uint32_t m_iType; // 0x0C6C
    uint32_t m_bDefensiveBomb; // 0x0C80
};

class CTFProjectile_ThrowableRepel // parent CBaseEntity {
public:
    uint32_t movetype; // 0x0000
    uint32_t movecollide; // 0x0000
    uint32_t m_nRenderFX; // 0x008C
    uint32_t m_clrRender; // 0x0090
    uint32_t m_flAnimTime; // 0x00A0
    uint32_t m_flSimulationTime; // 0x00A8
    uint32_t m_ubInterpolationFrame; // 0x00B4
    uint32_t m_fEffects; // 0x00B8
    uint32_t m_nRenderMode; // 0x00BC
    uint32_t m_nModelIndex; // 0x00CC
    uintptr_t m_nModelIndexOverrides[4]; // 0x00D0
    uint32_t m_iTeamNum; // 0x00EC
    uint32_t m_PredictableID; // 0x00F0
    fVector3 m_vecVelocity; // 0x0178
    float m_flGravity; // 0x020C
    uint32_t m_iParentAttachment; // 0x0226
    uint32_t moveparent; // 0x023C
    fVector3 m_vecMinsPreScaled; // 0x0260
    fVector3 m_vecMaxsPreScaled; // 0x026C
    fVector3 m_vecMins; // 0x0278
    fVector3 m_vecMaxs; // 0x0284
    uint32_t m_usSolidFlags; // 0x0294
    uint32_t m_nSurroundType; // 0x0298
    uint32_t m_nSolidType; // 0x0299
    uint32_t m_triggerBloat; // 0x029A
    uint32_t m_bUniformTriggerBloat; // 0x029B
    fVector3 m_vecSpecifiedSurroundingMinsPreScaled; // 0x029C
    fVector3 m_vecSpecifiedSurroundingMaxsPreScaled; // 0x02A8
    fVector3 m_vecSpecifiedSurroundingMins; // 0x02B4
    fVector3 m_vecSpecifiedSurroundingMaxs; // 0x02C0
    float m_flElasticity; // 0x0320
    float m_flShadowCastDistance; // 0x0324
    fVector3 m_vecOrigin; // 0x0458
    fVector3 m_angRotation; // 0x0464
    uint32_t m_fFlags; // 0x0470
    uint32_t m_CollisionGroup; // 0x0474
    uint32_t m_bIsPlayerSimulated; // 0x0754
    uint32_t m_bSimulatedEveryTick; // 0x0755
    uint32_t m_bAnimatedEveryTick; // 0x0756
    uint32_t m_bAlternateSorting; // 0x0757
    uint32_t m_iTextureFrameIndex; // 0x0758
    uint32_t m_hOwnerEntity; // 0x0764
    uint32_t m_hEffectEntity; // 0x0768
    uint32_t m_nSkin; // 0x07D0
    uint32_t m_nBody; // 0x07D4
    uint32_t m_nHitboxSet; // 0x07D8
    float m_flPlaybackRate; // 0x080C
    fVector3 m_vecForce; // 0x0820
    uint32_t m_nForceBone; // 0x082C
    uint32_t m_bClientSideFrameReset; // 0x086C
    float m_fadeMinDist; // 0x08B0
    float m_fadeMaxDist; // 0x08B4
    float m_flFadeScale; // 0x08B8
    float m_flModelScale; // 0x091C
    float m_flModelWidthScale; // 0x091C
    uintptr_t m_flPoseParameter[24]; // 0x0920
    uintptr_t m_flEncodedController[4]; // 0x0A68
    uint32_t m_bClientSideAnimation; // 0x0AD8
    uint32_t m_nNewSequenceParity; // 0x0ADC
    uint32_t m_nResetEventsParity; // 0x0AE0
    uint32_t m_nSequence; // 0x0B08
    float m_flCycle; // 0x0B10
    uint32_t m_hLightingOrigin; // 0x0BD8
    uint32_t m_hLightingOriginRelative; // 0x0BDC
    uint32_t m_nMuzzleFlashParity; // 0x0BE0
    uint32_t m_hOriginalLauncher; // 0x0C18
    uint32_t m_bIsLive; // 0x0C21
    float m_DmgRadius; // 0x0C24
    float m_flDamage; // 0x0C34
    uint32_t m_hThrower; // 0x0C40
    fVector3 m_vInitialVelocity; // 0x0C48
    uint32_t m_hLauncher; // 0x0C54
    uint32_t m_iDeflected; // 0x0C58
    uint32_t m_hDeflectOwner; // 0x0C5C
    uint32_t m_bCritical; // 0x0C64
    uint32_t m_bTouched; // 0x0C68
    uint32_t m_iType; // 0x0C6C
    uint32_t m_bDefensiveBomb; // 0x0C80
};

class CTFProjectile_Throwable // parent CBaseEntity {
public:
    uint32_t movetype; // 0x0000
    uint32_t movecollide; // 0x0000
    uint32_t m_nRenderFX; // 0x008C
    uint32_t m_clrRender; // 0x0090
    uint32_t m_flAnimTime; // 0x00A0
    uint32_t m_flSimulationTime; // 0x00A8
    uint32_t m_ubInterpolationFrame; // 0x00B4
    uint32_t m_fEffects; // 0x00B8
    uint32_t m_nRenderMode; // 0x00BC
    uint32_t m_nModelIndex; // 0x00CC
    uintptr_t m_nModelIndexOverrides[4]; // 0x00D0
    uint32_t m_iTeamNum; // 0x00EC
    uint32_t m_PredictableID; // 0x00F0
    fVector3 m_vecVelocity; // 0x0178
    float m_flGravity; // 0x020C
    uint32_t m_iParentAttachment; // 0x0226
    uint32_t moveparent; // 0x023C
    fVector3 m_vecMinsPreScaled; // 0x0260
    fVector3 m_vecMaxsPreScaled; // 0x026C
    fVector3 m_vecMins; // 0x0278
    fVector3 m_vecMaxs; // 0x0284
    uint32_t m_usSolidFlags; // 0x0294
    uint32_t m_nSurroundType; // 0x0298
    uint32_t m_nSolidType; // 0x0299
    uint32_t m_triggerBloat; // 0x029A
    uint32_t m_bUniformTriggerBloat; // 0x029B
    fVector3 m_vecSpecifiedSurroundingMinsPreScaled; // 0x029C
    fVector3 m_vecSpecifiedSurroundingMaxsPreScaled; // 0x02A8
    fVector3 m_vecSpecifiedSurroundingMins; // 0x02B4
    fVector3 m_vecSpecifiedSurroundingMaxs; // 0x02C0
    float m_flElasticity; // 0x0320
    float m_flShadowCastDistance; // 0x0324
    fVector3 m_vecOrigin; // 0x0458
    fVector3 m_angRotation; // 0x0464
    uint32_t m_fFlags; // 0x0470
    uint32_t m_CollisionGroup; // 0x0474
    uint32_t m_bIsPlayerSimulated; // 0x0754
    uint32_t m_bSimulatedEveryTick; // 0x0755
    uint32_t m_bAnimatedEveryTick; // 0x0756
    uint32_t m_bAlternateSorting; // 0x0757
    uint32_t m_iTextureFrameIndex; // 0x0758
    uint32_t m_hOwnerEntity; // 0x0764
    uint32_t m_hEffectEntity; // 0x0768
    uint32_t m_nSkin; // 0x07D0
    uint32_t m_nBody; // 0x07D4
    uint32_t m_nHitboxSet; // 0x07D8
    float m_flPlaybackRate; // 0x080C
    fVector3 m_vecForce; // 0x0820
    uint32_t m_nForceBone; // 0x082C
    uint32_t m_bClientSideFrameReset; // 0x086C
    float m_fadeMinDist; // 0x08B0
    float m_fadeMaxDist; // 0x08B4
    float m_flFadeScale; // 0x08B8
    float m_flModelScale; // 0x091C
    float m_flModelWidthScale; // 0x091C
    uintptr_t m_flPoseParameter[24]; // 0x0920
    uintptr_t m_flEncodedController[4]; // 0x0A68
    uint32_t m_bClientSideAnimation; // 0x0AD8
    uint32_t m_nNewSequenceParity; // 0x0ADC
    uint32_t m_nResetEventsParity; // 0x0AE0
    uint32_t m_nSequence; // 0x0B08
    float m_flCycle; // 0x0B10
    uint32_t m_hLightingOrigin; // 0x0BD8
    uint32_t m_hLightingOriginRelative; // 0x0BDC
    uint32_t m_nMuzzleFlashParity; // 0x0BE0
    uint32_t m_hOriginalLauncher; // 0x0C18
    uint32_t m_bIsLive; // 0x0C21
    float m_DmgRadius; // 0x0C24
    float m_flDamage; // 0x0C34
    uint32_t m_hThrower; // 0x0C40
    fVector3 m_vInitialVelocity; // 0x0C48
    uint32_t m_hLauncher; // 0x0C54
    uint32_t m_iDeflected; // 0x0C58
    uint32_t m_hDeflectOwner; // 0x0C5C
    uint32_t m_bCritical; // 0x0C64
    uint32_t m_bTouched; // 0x0C68
    uint32_t m_iType; // 0x0C6C
    uint32_t m_bDefensiveBomb; // 0x0C80
};

class CTFThrowable // parent CBaseEntity {
public:
    uint32_t movecollide; // 0x0000
    uint32_t movetype; // 0x0000
    uint32_t m_nRenderFX; // 0x008C
    uint32_t m_clrRender; // 0x0090
    uint32_t m_flAnimTime; // 0x00A0
    uint32_t m_flSimulationTime; // 0x00A8
    uint32_t m_ubInterpolationFrame; // 0x00B4
    uint32_t m_fEffects; // 0x00B8
    uint32_t m_nRenderMode; // 0x00BC
    uint32_t m_nNextThinkTick; // 0x00C4
    uint32_t m_nModelIndex; // 0x00CC
    uintptr_t m_nModelIndexOverrides[4]; // 0x00D0
    uint32_t m_iTeamNum; // 0x00EC
    uint32_t m_PredictableID; // 0x00F0
    float m_flGravity; // 0x020C
    uint32_t m_iParentAttachment; // 0x0226
    uint32_t moveparent; // 0x023C
    fVector3 m_vecMinsPreScaled; // 0x0260
    fVector3 m_vecMaxsPreScaled; // 0x026C
    fVector3 m_vecMins; // 0x0278
    fVector3 m_vecMaxs; // 0x0284
    uint32_t m_usSolidFlags; // 0x0294
    uint32_t m_nSurroundType; // 0x0298
    uint32_t m_nSolidType; // 0x0299
    uint32_t m_triggerBloat; // 0x029A
    uint32_t m_bUniformTriggerBloat; // 0x029B
    fVector3 m_vecSpecifiedSurroundingMinsPreScaled; // 0x029C
    fVector3 m_vecSpecifiedSurroundingMaxsPreScaled; // 0x02A8
    fVector3 m_vecSpecifiedSurroundingMins; // 0x02B4
    fVector3 m_vecSpecifiedSurroundingMaxs; // 0x02C0
    float m_flElasticity; // 0x0320
    float m_flShadowCastDistance; // 0x0324
    fVector3 m_vecOrigin; // 0x0458
    fVector3 m_angRotation; // 0x0464
    uint32_t m_CollisionGroup; // 0x0474
    uint32_t m_bIsPlayerSimulated; // 0x0754
    uint32_t m_bSimulatedEveryTick; // 0x0755
    uint32_t m_bAnimatedEveryTick; // 0x0756
    uint32_t m_bAlternateSorting; // 0x0757
    uint32_t m_iTextureFrameIndex; // 0x0758
    uint32_t m_hOwnerEntity; // 0x0764
    uint32_t m_hEffectEntity; // 0x0768
    uint32_t m_nSkin; // 0x07D0
    uint32_t m_nBody; // 0x07D4
    uint32_t m_nHitboxSet; // 0x07D8
    float m_flPlaybackRate; // 0x080C
    fVector3 m_vecForce; // 0x0820
    uint32_t m_nForceBone; // 0x082C
    uint32_t m_bClientSideFrameReset; // 0x086C
    float m_fadeMinDist; // 0x08B0
    float m_fadeMaxDist; // 0x08B4
    float m_flFadeScale; // 0x08B8
    float m_flModelScale; // 0x091C
    float m_flModelWidthScale; // 0x091C
    uintptr_t m_flPoseParameter[24]; // 0x0920
    uintptr_t m_flEncodedController[4]; // 0x0A68
    uint32_t m_bClientSideAnimation; // 0x0AD8
    uint32_t m_nNewSequenceParity; // 0x0ADC
    uint32_t m_nResetEventsParity; // 0x0AE0
    uint32_t m_nSequence; // 0x0B08
    float m_flCycle; // 0x0B10
    uint32_t m_hLightingOrigin; // 0x0BD8
    uint32_t m_hLightingOriginRelative; // 0x0BDC
    uint32_t m_nMuzzleFlashParity; // 0x0BE0
    uint32_t m_iReapplyProvisionParity; // 0x0C88
    uint32_t m_hOuter; // 0x0C8C
    uint32_t m_ProviderType; // 0x0C94
    uint32_t m_iItemDefinitionIndex; // 0x0D10
    uint32_t m_iEntityQuality; // 0x0D14
    uint32_t m_iEntityLevel; // 0x0D18
    uint32_t m_iItemIDHigh; // 0x0D28
    uint32_t m_iItemIDLow; // 0x0D2C
    uint32_t m_iAccountID; // 0x0D30
    uint32_t m_iTeamNumber; // 0x0D98
    uint32_t m_bInitialized; // 0x0D9C
    uint32_t lengthprop20; // 0x0DE8
    uint32_t m_iAttributeDefinitionIndex; // 0x0DF0
    uint32_t m_iRawValue32; // 0x0DF4
    float m_flValue; // 0x0DF4
    uint32_t m_nRefundableCurrency; // 0x0DF8
    uint32_t m_bOnlyIterateItemViewAttributes; // 0x0E18
    uint32_t m_bValidatedAttachedEntity; // 0x0E20
    uint32_t m_hOwner; // 0x0E90
    uint32_t m_nViewModelIndex; // 0x0EA0
    float m_flNextPrimaryAttack; // 0x0EA4
    float m_flNextSecondaryAttack; // 0x0EA8
    float m_flTimeWeaponIdle; // 0x0EAC
    uint32_t m_iViewModelIndex; // 0x0EB4
    uint32_t m_iWorldModelIndex; // 0x0EB8
    uint32_t m_iState; // 0x0ED8
    uint32_t m_iPrimaryAmmoType; // 0x0EE8
    uint32_t m_iSecondaryAmmoType; // 0x0EEC
    uint32_t m_iClip1; // 0x0EF0
    uint32_t m_iClip2; // 0x0EF4
    uint32_t m_bFlipViewModel; // 0x0F20
    uint32_t m_nCustomViewmodelModelIndex; // 0x0F44
    float m_flEffectBarRegenTime; // 0x0F80
    uint32_t m_iReloadMode; // 0x0F88
    float m_flReloadPriorNextFire; // 0x0F8C
    uint32_t m_bLowered; // 0x0FA8
    float m_flLastCritCheckTime; // 0x0FB8
    uint32_t m_bResetParity; // 0x104C
    uint32_t m_bReloadedThroughAnimEvent; // 0x1064
    float m_flEnergy; // 0x1068
    uint32_t m_iConsecutiveShots; // 0x106C
    uint32_t m_bDisguiseWeapon; // 0x1070
    float m_flLastFireTime; // 0x1074
    uint32_t m_hExtraWearable; // 0x1078
    uint32_t m_hExtraWearableViewModel; // 0x107C
    float m_flObservedCritChance; // 0x1080
    uint32_t m_bBeingRepurposedForTaunt; // 0x1084
    uint32_t m_nKillComboClass; // 0x1088
    uint32_t m_nKillComboCount; // 0x108C
    float m_flInspectAnimEndTime; // 0x1090
    uint32_t m_nInspectStage; // 0x1094
    float m_flChargeBeginTime; // 0x10B8
};

class CTFSyringeGun // parent CBaseEntity {
public:
    uint32_t movecollide; // 0x0000
    uint32_t movetype; // 0x0000
    uint32_t m_nRenderFX; // 0x008C
    uint32_t m_clrRender; // 0x0090
    uint32_t m_flAnimTime; // 0x00A0
    uint32_t m_flSimulationTime; // 0x00A8
    uint32_t m_ubInterpolationFrame; // 0x00B4
    uint32_t m_fEffects; // 0x00B8
    uint32_t m_nRenderMode; // 0x00BC
    uint32_t m_nNextThinkTick; // 0x00C4
    uint32_t m_nModelIndex; // 0x00CC
    uintptr_t m_nModelIndexOverrides[4]; // 0x00D0
    uint32_t m_iTeamNum; // 0x00EC
    uint32_t m_PredictableID; // 0x00F0
    float m_flGravity; // 0x020C
    uint32_t m_iParentAttachment; // 0x0226
    uint32_t moveparent; // 0x023C
    fVector3 m_vecMinsPreScaled; // 0x0260
    fVector3 m_vecMaxsPreScaled; // 0x026C
    fVector3 m_vecMins; // 0x0278
    fVector3 m_vecMaxs; // 0x0284
    uint32_t m_usSolidFlags; // 0x0294
    uint32_t m_nSurroundType; // 0x0298
    uint32_t m_nSolidType; // 0x0299
    uint32_t m_triggerBloat; // 0x029A
    uint32_t m_bUniformTriggerBloat; // 0x029B
    fVector3 m_vecSpecifiedSurroundingMinsPreScaled; // 0x029C
    fVector3 m_vecSpecifiedSurroundingMaxsPreScaled; // 0x02A8
    fVector3 m_vecSpecifiedSurroundingMins; // 0x02B4
    fVector3 m_vecSpecifiedSurroundingMaxs; // 0x02C0
    float m_flElasticity; // 0x0320
    float m_flShadowCastDistance; // 0x0324
    fVector3 m_vecOrigin; // 0x0458
    fVector3 m_angRotation; // 0x0464
    uint32_t m_CollisionGroup; // 0x0474
    uint32_t m_bIsPlayerSimulated; // 0x0754
    uint32_t m_bSimulatedEveryTick; // 0x0755
    uint32_t m_bAnimatedEveryTick; // 0x0756
    uint32_t m_bAlternateSorting; // 0x0757
    uint32_t m_iTextureFrameIndex; // 0x0758
    uint32_t m_hOwnerEntity; // 0x0764
    uint32_t m_hEffectEntity; // 0x0768
    uint32_t m_nSkin; // 0x07D0
    uint32_t m_nBody; // 0x07D4
    uint32_t m_nHitboxSet; // 0x07D8
    float m_flPlaybackRate; // 0x080C
    fVector3 m_vecForce; // 0x0820
    uint32_t m_nForceBone; // 0x082C
    uint32_t m_bClientSideFrameReset; // 0x086C
    float m_fadeMinDist; // 0x08B0
    float m_fadeMaxDist; // 0x08B4
    float m_flFadeScale; // 0x08B8
    float m_flModelScale; // 0x091C
    float m_flModelWidthScale; // 0x091C
    uintptr_t m_flPoseParameter[24]; // 0x0920
    uintptr_t m_flEncodedController[4]; // 0x0A68
    uint32_t m_bClientSideAnimation; // 0x0AD8
    uint32_t m_nNewSequenceParity; // 0x0ADC
    uint32_t m_nResetEventsParity; // 0x0AE0
    uint32_t m_nSequence; // 0x0B08
    float m_flCycle; // 0x0B10
    uint32_t m_hLightingOrigin; // 0x0BD8
    uint32_t m_hLightingOriginRelative; // 0x0BDC
    uint32_t m_nMuzzleFlashParity; // 0x0BE0
    uint32_t m_iReapplyProvisionParity; // 0x0C88
    uint32_t m_hOuter; // 0x0C8C
    uint32_t m_ProviderType; // 0x0C94
    uint32_t m_iItemDefinitionIndex; // 0x0D10
    uint32_t m_iEntityQuality; // 0x0D14
    uint32_t m_iEntityLevel; // 0x0D18
    uint32_t m_iItemIDHigh; // 0x0D28
    uint32_t m_iItemIDLow; // 0x0D2C
    uint32_t m_iAccountID; // 0x0D30
    uint32_t m_iTeamNumber; // 0x0D98
    uint32_t m_bInitialized; // 0x0D9C
    uint32_t lengthprop20; // 0x0DE8
    uint32_t m_iAttributeDefinitionIndex; // 0x0DF0
    float m_flValue; // 0x0DF4
    uint32_t m_iRawValue32; // 0x0DF4
    uint32_t m_nRefundableCurrency; // 0x0DF8
    uint32_t m_bOnlyIterateItemViewAttributes; // 0x0E18
    uint32_t m_bValidatedAttachedEntity; // 0x0E20
    uint32_t m_hOwner; // 0x0E90
    uint32_t m_nViewModelIndex; // 0x0EA0
    float m_flNextPrimaryAttack; // 0x0EA4
    float m_flNextSecondaryAttack; // 0x0EA8
    float m_flTimeWeaponIdle; // 0x0EAC
    uint32_t m_iViewModelIndex; // 0x0EB4
    uint32_t m_iWorldModelIndex; // 0x0EB8
    uint32_t m_iState; // 0x0ED8
    uint32_t m_iPrimaryAmmoType; // 0x0EE8
    uint32_t m_iSecondaryAmmoType; // 0x0EEC
    uint32_t m_iClip1; // 0x0EF0
    uint32_t m_iClip2; // 0x0EF4
    uint32_t m_bFlipViewModel; // 0x0F20
    uint32_t m_nCustomViewmodelModelIndex; // 0x0F44
    float m_flEffectBarRegenTime; // 0x0F80
    uint32_t m_iReloadMode; // 0x0F88
    float m_flReloadPriorNextFire; // 0x0F8C
    uint32_t m_bLowered; // 0x0FA8
    float m_flLastCritCheckTime; // 0x0FB8
    uint32_t m_bResetParity; // 0x104C
    uint32_t m_bReloadedThroughAnimEvent; // 0x1064
    float m_flEnergy; // 0x1068
    uint32_t m_iConsecutiveShots; // 0x106C
    uint32_t m_bDisguiseWeapon; // 0x1070
    float m_flLastFireTime; // 0x1074
    uint32_t m_hExtraWearable; // 0x1078
    uint32_t m_hExtraWearableViewModel; // 0x107C
    float m_flObservedCritChance; // 0x1080
    uint32_t m_bBeingRepurposedForTaunt; // 0x1084
    uint32_t m_nKillComboClass; // 0x1088
    uint32_t m_nKillComboCount; // 0x108C
    float m_flInspectAnimEndTime; // 0x1090
    uint32_t m_nInspectStage; // 0x1094
};

class CFuncMonitor // parent CBaseEntity {
public:
    uint32_t movetype; // 0x0000
    uint32_t movecollide; // 0x0000
    uint32_t m_nRenderFX; // 0x008C
    uint32_t m_clrRender; // 0x0090
    uint32_t m_flAnimTime; // 0x00A0
    uint32_t m_flSimulationTime; // 0x00A8
    uint32_t m_ubInterpolationFrame; // 0x00B4
    uint32_t m_fEffects; // 0x00B8
    uint32_t m_nRenderMode; // 0x00BC
    uint32_t m_nModelIndex; // 0x00CC
    uintptr_t m_nModelIndexOverrides[4]; // 0x00D0
    uint32_t m_iTeamNum; // 0x00EC
    uint32_t m_PredictableID; // 0x00F0
    float m_flGravity; // 0x020C
    uint32_t m_iParentAttachment; // 0x0226
    uint32_t moveparent; // 0x023C
    fVector3 m_vecMinsPreScaled; // 0x0260
    fVector3 m_vecMaxsPreScaled; // 0x026C
    fVector3 m_vecMins; // 0x0278
    fVector3 m_vecMaxs; // 0x0284
    uint32_t m_usSolidFlags; // 0x0294
    uint32_t m_nSurroundType; // 0x0298
    uint32_t m_nSolidType; // 0x0299
    uint32_t m_triggerBloat; // 0x029A
    uint32_t m_bUniformTriggerBloat; // 0x029B
    fVector3 m_vecSpecifiedSurroundingMinsPreScaled; // 0x029C
    fVector3 m_vecSpecifiedSurroundingMaxsPreScaled; // 0x02A8
    fVector3 m_vecSpecifiedSurroundingMins; // 0x02B4
    fVector3 m_vecSpecifiedSurroundingMaxs; // 0x02C0
    float m_flElasticity; // 0x0320
    float m_flShadowCastDistance; // 0x0324
    fVector3 m_vecOrigin; // 0x0458
    fVector3 m_angRotation; // 0x0464
    uint32_t m_CollisionGroup; // 0x0474
    uint32_t m_bIsPlayerSimulated; // 0x0754
    uint32_t m_bSimulatedEveryTick; // 0x0755
    uint32_t m_bAnimatedEveryTick; // 0x0756
    uint32_t m_bAlternateSorting; // 0x0757
    uint32_t m_iTextureFrameIndex; // 0x0758
    uint32_t m_hOwnerEntity; // 0x0764
    uint32_t m_hEffectEntity; // 0x0768
};

class CTFKatana // parent CBaseEntity {
public:
    uint32_t movecollide; // 0x0000
    uint32_t movetype; // 0x0000
    uint32_t m_nRenderFX; // 0x008C
    uint32_t m_clrRender; // 0x0090
    uint32_t m_flAnimTime; // 0x00A0
    uint32_t m_flSimulationTime; // 0x00A8
    uint32_t m_ubInterpolationFrame; // 0x00B4
    uint32_t m_fEffects; // 0x00B8
    uint32_t m_nRenderMode; // 0x00BC
    uint32_t m_nNextThinkTick; // 0x00C4
    uint32_t m_nModelIndex; // 0x00CC
    uintptr_t m_nModelIndexOverrides[4]; // 0x00D0
    uint32_t m_iTeamNum; // 0x00EC
    uint32_t m_PredictableID; // 0x00F0
    float m_flGravity; // 0x020C
    uint32_t m_iParentAttachment; // 0x0226
    uint32_t moveparent; // 0x023C
    fVector3 m_vecMinsPreScaled; // 0x0260
    fVector3 m_vecMaxsPreScaled; // 0x026C
    fVector3 m_vecMins; // 0x0278
    fVector3 m_vecMaxs; // 0x0284
    uint32_t m_usSolidFlags; // 0x0294
    uint32_t m_nSurroundType; // 0x0298
    uint32_t m_nSolidType; // 0x0299
    uint32_t m_triggerBloat; // 0x029A
    uint32_t m_bUniformTriggerBloat; // 0x029B
    fVector3 m_vecSpecifiedSurroundingMinsPreScaled; // 0x029C
    fVector3 m_vecSpecifiedSurroundingMaxsPreScaled; // 0x02A8
    fVector3 m_vecSpecifiedSurroundingMins; // 0x02B4
    fVector3 m_vecSpecifiedSurroundingMaxs; // 0x02C0
    float m_flElasticity; // 0x0320
    float m_flShadowCastDistance; // 0x0324
    fVector3 m_vecOrigin; // 0x0458
    fVector3 m_angRotation; // 0x0464
    uint32_t m_CollisionGroup; // 0x0474
    uint32_t m_bIsPlayerSimulated; // 0x0754
    uint32_t m_bSimulatedEveryTick; // 0x0755
    uint32_t m_bAnimatedEveryTick; // 0x0756
    uint32_t m_bAlternateSorting; // 0x0757
    uint32_t m_iTextureFrameIndex; // 0x0758
    uint32_t m_hOwnerEntity; // 0x0764
    uint32_t m_hEffectEntity; // 0x0768
    uint32_t m_nSkin; // 0x07D0
    uint32_t m_nBody; // 0x07D4
    uint32_t m_nHitboxSet; // 0x07D8
    float m_flPlaybackRate; // 0x080C
    fVector3 m_vecForce; // 0x0820
    uint32_t m_nForceBone; // 0x082C
    uint32_t m_bClientSideFrameReset; // 0x086C
    float m_fadeMinDist; // 0x08B0
    float m_fadeMaxDist; // 0x08B4
    float m_flFadeScale; // 0x08B8
    float m_flModelScale; // 0x091C
    float m_flModelWidthScale; // 0x091C
    uintptr_t m_flPoseParameter[24]; // 0x0920
    uintptr_t m_flEncodedController[4]; // 0x0A68
    uint32_t m_bClientSideAnimation; // 0x0AD8
    uint32_t m_nNewSequenceParity; // 0x0ADC
    uint32_t m_nResetEventsParity; // 0x0AE0
    uint32_t m_nSequence; // 0x0B08
    float m_flCycle; // 0x0B10
    uint32_t m_hLightingOrigin; // 0x0BD8
    uint32_t m_hLightingOriginRelative; // 0x0BDC
    uint32_t m_nMuzzleFlashParity; // 0x0BE0
    uint32_t m_iReapplyProvisionParity; // 0x0C88
    uint32_t m_hOuter; // 0x0C8C
    uint32_t m_ProviderType; // 0x0C94
    uint32_t m_iItemDefinitionIndex; // 0x0D10
    uint32_t m_iEntityQuality; // 0x0D14
    uint32_t m_iEntityLevel; // 0x0D18
    uint32_t m_iItemIDHigh; // 0x0D28
    uint32_t m_iItemIDLow; // 0x0D2C
    uint32_t m_iAccountID; // 0x0D30
    uint32_t m_iTeamNumber; // 0x0D98
    uint32_t m_bInitialized; // 0x0D9C
    uint32_t lengthprop20; // 0x0DE8
    uint32_t m_iAttributeDefinitionIndex; // 0x0DF0
    uint32_t m_iRawValue32; // 0x0DF4
    float m_flValue; // 0x0DF4
    uint32_t m_nRefundableCurrency; // 0x0DF8
    uint32_t m_bOnlyIterateItemViewAttributes; // 0x0E18
    uint32_t m_bValidatedAttachedEntity; // 0x0E20
    uint32_t m_hOwner; // 0x0E90
    uint32_t m_nViewModelIndex; // 0x0EA0
    float m_flNextPrimaryAttack; // 0x0EA4
    float m_flNextSecondaryAttack; // 0x0EA8
    float m_flTimeWeaponIdle; // 0x0EAC
    uint32_t m_iViewModelIndex; // 0x0EB4
    uint32_t m_iWorldModelIndex; // 0x0EB8
    uint32_t m_iState; // 0x0ED8
    uint32_t m_iPrimaryAmmoType; // 0x0EE8
    uint32_t m_iSecondaryAmmoType; // 0x0EEC
    uint32_t m_iClip1; // 0x0EF0
    uint32_t m_iClip2; // 0x0EF4
    uint32_t m_bFlipViewModel; // 0x0F20
    uint32_t m_nCustomViewmodelModelIndex; // 0x0F44
    float m_flEffectBarRegenTime; // 0x0F80
    uint32_t m_iReloadMode; // 0x0F88
    float m_flReloadPriorNextFire; // 0x0F8C
    uint32_t m_bLowered; // 0x0FA8
    float m_flLastCritCheckTime; // 0x0FB8
    uint32_t m_bResetParity; // 0x104C
    uint32_t m_bReloadedThroughAnimEvent; // 0x1064
    float m_flEnergy; // 0x1068
    uint32_t m_iConsecutiveShots; // 0x106C
    uint32_t m_bDisguiseWeapon; // 0x1070
    float m_flLastFireTime; // 0x1074
    uint32_t m_hExtraWearable; // 0x1078
    uint32_t m_hExtraWearableViewModel; // 0x107C
    float m_flObservedCritChance; // 0x1080
    uint32_t m_bBeingRepurposedForTaunt; // 0x1084
    uint32_t m_nKillComboClass; // 0x1088
    uint32_t m_nKillComboCount; // 0x108C
    float m_flInspectAnimEndTime; // 0x1090
    uint32_t m_nInspectStage; // 0x1094
    uint32_t m_bIsBloody; // 0x10C0
};

class CTFParachute_Secondary // parent CBaseEntity {
public:
    uint32_t movecollide; // 0x0000
    uint32_t movetype; // 0x0000
    uint32_t m_nRenderFX; // 0x008C
    uint32_t m_clrRender; // 0x0090
    uint32_t m_flAnimTime; // 0x00A0
    uint32_t m_flSimulationTime; // 0x00A8
    uint32_t m_ubInterpolationFrame; // 0x00B4
    uint32_t m_fEffects; // 0x00B8
    uint32_t m_nRenderMode; // 0x00BC
    uint32_t m_nNextThinkTick; // 0x00C4
    uint32_t m_nModelIndex; // 0x00CC
    uintptr_t m_nModelIndexOverrides[4]; // 0x00D0
    uint32_t m_iTeamNum; // 0x00EC
    uint32_t m_PredictableID; // 0x00F0
    float m_flGravity; // 0x020C
    uint32_t m_iParentAttachment; // 0x0226
    uint32_t moveparent; // 0x023C
    fVector3 m_vecMinsPreScaled; // 0x0260
    fVector3 m_vecMaxsPreScaled; // 0x026C
    fVector3 m_vecMins; // 0x0278
    fVector3 m_vecMaxs; // 0x0284
    uint32_t m_usSolidFlags; // 0x0294
    uint32_t m_nSurroundType; // 0x0298
    uint32_t m_nSolidType; // 0x0299
    uint32_t m_triggerBloat; // 0x029A
    uint32_t m_bUniformTriggerBloat; // 0x029B
    fVector3 m_vecSpecifiedSurroundingMinsPreScaled; // 0x029C
    fVector3 m_vecSpecifiedSurroundingMaxsPreScaled; // 0x02A8
    fVector3 m_vecSpecifiedSurroundingMins; // 0x02B4
    fVector3 m_vecSpecifiedSurroundingMaxs; // 0x02C0
    float m_flElasticity; // 0x0320
    float m_flShadowCastDistance; // 0x0324
    fVector3 m_vecOrigin; // 0x0458
    fVector3 m_angRotation; // 0x0464
    uint32_t m_CollisionGroup; // 0x0474
    uint32_t m_bIsPlayerSimulated; // 0x0754
    uint32_t m_bSimulatedEveryTick; // 0x0755
    uint32_t m_bAnimatedEveryTick; // 0x0756
    uint32_t m_bAlternateSorting; // 0x0757
    uint32_t m_iTextureFrameIndex; // 0x0758
    uint32_t m_hOwnerEntity; // 0x0764
    uint32_t m_hEffectEntity; // 0x0768
    uint32_t m_nSkin; // 0x07D0
    uint32_t m_nBody; // 0x07D4
    uint32_t m_nHitboxSet; // 0x07D8
    float m_flPlaybackRate; // 0x080C
    fVector3 m_vecForce; // 0x0820
    uint32_t m_nForceBone; // 0x082C
    uint32_t m_bClientSideFrameReset; // 0x086C
    float m_fadeMinDist; // 0x08B0
    float m_fadeMaxDist; // 0x08B4
    float m_flFadeScale; // 0x08B8
    float m_flModelScale; // 0x091C
    float m_flModelWidthScale; // 0x091C
    uintptr_t m_flPoseParameter[24]; // 0x0920
    uintptr_t m_flEncodedController[4]; // 0x0A68
    uint32_t m_bClientSideAnimation; // 0x0AD8
    uint32_t m_nNewSequenceParity; // 0x0ADC
    uint32_t m_nResetEventsParity; // 0x0AE0
    uint32_t m_nSequence; // 0x0B08
    float m_flCycle; // 0x0B10
    uint32_t m_hLightingOrigin; // 0x0BD8
    uint32_t m_hLightingOriginRelative; // 0x0BDC
    uint32_t m_nMuzzleFlashParity; // 0x0BE0
    uint32_t m_iReapplyProvisionParity; // 0x0C88
    uint32_t m_hOuter; // 0x0C8C
    uint32_t m_ProviderType; // 0x0C94
    uint32_t m_iItemDefinitionIndex; // 0x0D10
    uint32_t m_iEntityQuality; // 0x0D14
    uint32_t m_iEntityLevel; // 0x0D18
    uint32_t m_iItemIDHigh; // 0x0D28
    uint32_t m_iItemIDLow; // 0x0D2C
    uint32_t m_iAccountID; // 0x0D30
    uint32_t m_iTeamNumber; // 0x0D98
    uint32_t m_bInitialized; // 0x0D9C
    uint32_t lengthprop20; // 0x0DE8
    uint32_t m_iAttributeDefinitionIndex; // 0x0DF0
    float m_flValue; // 0x0DF4
    uint32_t m_iRawValue32; // 0x0DF4
    uint32_t m_nRefundableCurrency; // 0x0DF8
    uint32_t m_bOnlyIterateItemViewAttributes; // 0x0E18
    uint32_t m_bValidatedAttachedEntity; // 0x0E20
    uint32_t m_hOwner; // 0x0E90
    uint32_t m_nViewModelIndex; // 0x0EA0
    float m_flNextPrimaryAttack; // 0x0EA4
    float m_flNextSecondaryAttack; // 0x0EA8
    float m_flTimeWeaponIdle; // 0x0EAC
    uint32_t m_iViewModelIndex; // 0x0EB4
    uint32_t m_iWorldModelIndex; // 0x0EB8
    uint32_t m_iState; // 0x0ED8
    uint32_t m_iPrimaryAmmoType; // 0x0EE8
    uint32_t m_iSecondaryAmmoType; // 0x0EEC
    uint32_t m_iClip1; // 0x0EF0
    uint32_t m_iClip2; // 0x0EF4
    uint32_t m_bFlipViewModel; // 0x0F20
    uint32_t m_nCustomViewmodelModelIndex; // 0x0F44
    float m_flEffectBarRegenTime; // 0x0F80
    uint32_t m_iReloadMode; // 0x0F88
    float m_flReloadPriorNextFire; // 0x0F8C
    uint32_t m_bLowered; // 0x0FA8
    float m_flLastCritCheckTime; // 0x0FB8
    uint32_t m_bResetParity; // 0x104C
    uint32_t m_bReloadedThroughAnimEvent; // 0x1064
    float m_flEnergy; // 0x1068
    uint32_t m_iConsecutiveShots; // 0x106C
    uint32_t m_bDisguiseWeapon; // 0x1070
    float m_flLastFireTime; // 0x1074
    uint32_t m_hExtraWearable; // 0x1078
    uint32_t m_hExtraWearableViewModel; // 0x107C
    float m_flObservedCritChance; // 0x1080
    uint32_t m_bBeingRepurposedForTaunt; // 0x1084
    uint32_t m_nKillComboClass; // 0x1088
    uint32_t m_nKillComboCount; // 0x108C
    float m_flInspectAnimEndTime; // 0x1090
    uint32_t m_nInspectStage; // 0x1094
};

class CSniperDot // parent CBaseEntity {
public:
    uint32_t movetype; // 0x0000
    uint32_t movecollide; // 0x0000
    uint32_t m_nRenderFX; // 0x008C
    uint32_t m_clrRender; // 0x0090
    uint32_t m_flAnimTime; // 0x00A0
    uint32_t m_flSimulationTime; // 0x00A8
    uint32_t m_ubInterpolationFrame; // 0x00B4
    uint32_t m_fEffects; // 0x00B8
    uint32_t m_nRenderMode; // 0x00BC
    uint32_t m_nModelIndex; // 0x00CC
    uintptr_t m_nModelIndexOverrides[4]; // 0x00D0
    uint32_t m_iTeamNum; // 0x00EC
    uint32_t m_PredictableID; // 0x00F0
    float m_flGravity; // 0x020C
    uint32_t m_iParentAttachment; // 0x0226
    uint32_t moveparent; // 0x023C
    fVector3 m_vecMinsPreScaled; // 0x0260
    fVector3 m_vecMaxsPreScaled; // 0x026C
    fVector3 m_vecMins; // 0x0278
    fVector3 m_vecMaxs; // 0x0284
    uint32_t m_usSolidFlags; // 0x0294
    uint32_t m_nSurroundType; // 0x0298
    uint32_t m_nSolidType; // 0x0299
    uint32_t m_triggerBloat; // 0x029A
    uint32_t m_bUniformTriggerBloat; // 0x029B
    fVector3 m_vecSpecifiedSurroundingMinsPreScaled; // 0x029C
    fVector3 m_vecSpecifiedSurroundingMaxsPreScaled; // 0x02A8
    fVector3 m_vecSpecifiedSurroundingMins; // 0x02B4
    fVector3 m_vecSpecifiedSurroundingMaxs; // 0x02C0
    float m_flElasticity; // 0x0320
    float m_flShadowCastDistance; // 0x0324
    fVector3 m_vecOrigin; // 0x0458
    fVector3 m_angRotation; // 0x0464
    uint32_t m_CollisionGroup; // 0x0474
    uint32_t m_bIsPlayerSimulated; // 0x0754
    uint32_t m_bSimulatedEveryTick; // 0x0755
    uint32_t m_bAnimatedEveryTick; // 0x0756
    uint32_t m_bAlternateSorting; // 0x0757
    uint32_t m_iTextureFrameIndex; // 0x0758
    uint32_t m_hOwnerEntity; // 0x0764
    uint32_t m_hEffectEntity; // 0x0768
    float m_flChargeStartTime; // 0x07F0
};

class CTFSniperRifleDecap // parent CBaseEntity {
public:
    uint32_t movecollide; // 0x0000
    uint32_t movetype; // 0x0000
    uint32_t m_nRenderFX; // 0x008C
    uint32_t m_clrRender; // 0x0090
    uint32_t m_flAnimTime; // 0x00A0
    uint32_t m_flSimulationTime; // 0x00A8
    uint32_t m_ubInterpolationFrame; // 0x00B4
    uint32_t m_fEffects; // 0x00B8
    uint32_t m_nRenderMode; // 0x00BC
    uint32_t m_nNextThinkTick; // 0x00C4
    uint32_t m_nModelIndex; // 0x00CC
    uintptr_t m_nModelIndexOverrides[4]; // 0x00D0
    uint32_t m_iTeamNum; // 0x00EC
    uint32_t m_PredictableID; // 0x00F0
    float m_flGravity; // 0x020C
    uint32_t m_iParentAttachment; // 0x0226
    uint32_t moveparent; // 0x023C
    fVector3 m_vecMinsPreScaled; // 0x0260
    fVector3 m_vecMaxsPreScaled; // 0x026C
    fVector3 m_vecMins; // 0x0278
    fVector3 m_vecMaxs; // 0x0284
    uint32_t m_usSolidFlags; // 0x0294
    uint32_t m_nSurroundType; // 0x0298
    uint32_t m_nSolidType; // 0x0299
    uint32_t m_triggerBloat; // 0x029A
    uint32_t m_bUniformTriggerBloat; // 0x029B
    fVector3 m_vecSpecifiedSurroundingMinsPreScaled; // 0x029C
    fVector3 m_vecSpecifiedSurroundingMaxsPreScaled; // 0x02A8
    fVector3 m_vecSpecifiedSurroundingMins; // 0x02B4
    fVector3 m_vecSpecifiedSurroundingMaxs; // 0x02C0
    float m_flElasticity; // 0x0320
    float m_flShadowCastDistance; // 0x0324
    fVector3 m_vecOrigin; // 0x0458
    fVector3 m_angRotation; // 0x0464
    uint32_t m_CollisionGroup; // 0x0474
    uint32_t m_bIsPlayerSimulated; // 0x0754
    uint32_t m_bSimulatedEveryTick; // 0x0755
    uint32_t m_bAnimatedEveryTick; // 0x0756
    uint32_t m_bAlternateSorting; // 0x0757
    uint32_t m_iTextureFrameIndex; // 0x0758
    uint32_t m_hOwnerEntity; // 0x0764
    uint32_t m_hEffectEntity; // 0x0768
    uint32_t m_nSkin; // 0x07D0
    uint32_t m_nBody; // 0x07D4
    uint32_t m_nHitboxSet; // 0x07D8
    float m_flPlaybackRate; // 0x080C
    fVector3 m_vecForce; // 0x0820
    uint32_t m_nForceBone; // 0x082C
    uint32_t m_bClientSideFrameReset; // 0x086C
    float m_fadeMinDist; // 0x08B0
    float m_fadeMaxDist; // 0x08B4
    float m_flFadeScale; // 0x08B8
    float m_flModelScale; // 0x091C
    float m_flModelWidthScale; // 0x091C
    uintptr_t m_flPoseParameter[24]; // 0x0920
    uintptr_t m_flEncodedController[4]; // 0x0A68
    uint32_t m_bClientSideAnimation; // 0x0AD8
    uint32_t m_nNewSequenceParity; // 0x0ADC
    uint32_t m_nResetEventsParity; // 0x0AE0
    uint32_t m_nSequence; // 0x0B08
    float m_flCycle; // 0x0B10
    uint32_t m_hLightingOrigin; // 0x0BD8
    uint32_t m_hLightingOriginRelative; // 0x0BDC
    uint32_t m_nMuzzleFlashParity; // 0x0BE0
    uint32_t m_iReapplyProvisionParity; // 0x0C88
    uint32_t m_hOuter; // 0x0C8C
    uint32_t m_ProviderType; // 0x0C94
    uint32_t m_iItemDefinitionIndex; // 0x0D10
    uint32_t m_iEntityQuality; // 0x0D14
    uint32_t m_iEntityLevel; // 0x0D18
    uint32_t m_iItemIDHigh; // 0x0D28
    uint32_t m_iItemIDLow; // 0x0D2C
    uint32_t m_iAccountID; // 0x0D30
    uint32_t m_iTeamNumber; // 0x0D98
    uint32_t m_bInitialized; // 0x0D9C
    uint32_t lengthprop20; // 0x0DE8
    uint32_t m_iAttributeDefinitionIndex; // 0x0DF0
    uint32_t m_iRawValue32; // 0x0DF4
    float m_flValue; // 0x0DF4
    uint32_t m_nRefundableCurrency; // 0x0DF8
    uint32_t m_bOnlyIterateItemViewAttributes; // 0x0E18
    uint32_t m_bValidatedAttachedEntity; // 0x0E20
    uint32_t m_hOwner; // 0x0E90
    uint32_t m_nViewModelIndex; // 0x0EA0
    float m_flNextPrimaryAttack; // 0x0EA4
    float m_flNextSecondaryAttack; // 0x0EA8
    float m_flTimeWeaponIdle; // 0x0EAC
    uint32_t m_iViewModelIndex; // 0x0EB4
    uint32_t m_iWorldModelIndex; // 0x0EB8
    uint32_t m_iState; // 0x0ED8
    uint32_t m_iPrimaryAmmoType; // 0x0EE8
    uint32_t m_iSecondaryAmmoType; // 0x0EEC
    uint32_t m_iClip1; // 0x0EF0
    uint32_t m_iClip2; // 0x0EF4
    uint32_t m_bFlipViewModel; // 0x0F20
    uint32_t m_nCustomViewmodelModelIndex; // 0x0F44
    float m_flEffectBarRegenTime; // 0x0F80
    uint32_t m_iReloadMode; // 0x0F88
    float m_flReloadPriorNextFire; // 0x0F8C
    uint32_t m_bLowered; // 0x0FA8
    float m_flLastCritCheckTime; // 0x0FB8
    uint32_t m_bResetParity; // 0x104C
    uint32_t m_bReloadedThroughAnimEvent; // 0x1064
    float m_flEnergy; // 0x1068
    uint32_t m_iConsecutiveShots; // 0x106C
    uint32_t m_bDisguiseWeapon; // 0x1070
    float m_flLastFireTime; // 0x1074
    uint32_t m_hExtraWearable; // 0x1078
    uint32_t m_hExtraWearableViewModel; // 0x107C
    float m_flObservedCritChance; // 0x1080
    uint32_t m_bBeingRepurposedForTaunt; // 0x1084
    uint32_t m_nKillComboClass; // 0x1088
    uint32_t m_nKillComboCount; // 0x108C
    float m_flInspectAnimEndTime; // 0x1090
    uint32_t m_nInspectStage; // 0x1094
    float m_flChargedDamage; // 0x10AC
};

class CShadowControl // parent CBaseEntity {
public:
    uint32_t movecollide; // 0x0000
    uint32_t movetype; // 0x0000
    uint32_t m_nRenderFX; // 0x008C
    uint32_t m_clrRender; // 0x0090
    uint32_t m_flAnimTime; // 0x00A0
    uint32_t m_flSimulationTime; // 0x00A8
    uint32_t m_ubInterpolationFrame; // 0x00B4
    uint32_t m_fEffects; // 0x00B8
    uint32_t m_nRenderMode; // 0x00BC
    uint32_t m_nModelIndex; // 0x00CC
    uintptr_t m_nModelIndexOverrides[4]; // 0x00D0
    uint32_t m_iTeamNum; // 0x00EC
    uint32_t m_PredictableID; // 0x00F0
    float m_flGravity; // 0x020C
    uint32_t m_iParentAttachment; // 0x0226
    uint32_t moveparent; // 0x023C
    fVector3 m_vecMinsPreScaled; // 0x0260
    fVector3 m_vecMaxsPreScaled; // 0x026C
    fVector3 m_vecMins; // 0x0278
    fVector3 m_vecMaxs; // 0x0284
    uint32_t m_usSolidFlags; // 0x0294
    uint32_t m_nSurroundType; // 0x0298
    uint32_t m_nSolidType; // 0x0299
    uint32_t m_triggerBloat; // 0x029A
    uint32_t m_bUniformTriggerBloat; // 0x029B
    fVector3 m_vecSpecifiedSurroundingMinsPreScaled; // 0x029C
    fVector3 m_vecSpecifiedSurroundingMaxsPreScaled; // 0x02A8
    fVector3 m_vecSpecifiedSurroundingMins; // 0x02B4
    fVector3 m_vecSpecifiedSurroundingMaxs; // 0x02C0
    float m_flElasticity; // 0x0320
    float m_flShadowCastDistance; // 0x0324
    fVector3 m_vecOrigin; // 0x0458
    fVector3 m_angRotation; // 0x0464
    uint32_t m_CollisionGroup; // 0x0474
    uint32_t m_bIsPlayerSimulated; // 0x0754
    uint32_t m_bSimulatedEveryTick; // 0x0755
    uint32_t m_bAnimatedEveryTick; // 0x0756
    uint32_t m_bAlternateSorting; // 0x0757
    uint32_t m_iTextureFrameIndex; // 0x0758
    uint32_t m_hOwnerEntity; // 0x0764
    uint32_t m_hEffectEntity; // 0x0768
    fVector3 m_shadowDirection; // 0x07C0
    uint32_t m_shadowColor; // 0x07CC
    float m_flShadowMaxDist; // 0x07D0
    uint32_t m_bDisableShadows; // 0x07D4
};

class CTFGameRulesProxy // parent CGameRulesProxy {
public:
    uint32_t m_iRoundState; // 0x0070
    uint32_t m_bInOvertime; // 0x0074
    uint32_t m_bInSetup; // 0x0075
    uint32_t m_bSwitchedTeamsThisRound; // 0x0076
    uint32_t m_iWinningTeam; // 0x0078
    uint32_t m_bInWaitingForPlayers; // 0x0080
    uint32_t m_bAwaitingReadyRestart; // 0x0081
    float m_flRestartRoundTime; // 0x0084
    float m_flMapResetTime; // 0x0088
    uintptr_t m_flNextRespawnWave[32]; // 0x008C
    uintptr_t m_bTeamReady[32]; // 0x010C
    uint32_t m_bStopWatch; // 0x012C
    uint32_t m_bMultipleTrains; // 0x012D
    uintptr_t m_bPlayerReady[102]; // 0x012E
    uint32_t m_bCheatsEnabledDuringLevel; // 0x0194
    uint32_t m_nRoundsPlayed; // 0x0198
    float m_flCountdownTime; // 0x019C
    float m_flStateTransitionTime; // 0x01A0
    uintptr_t m_TeamRespawnWaveTimes[32]; // 0x01A4
    uint32_t m_nGameType; // 0x026C
    uint32_t m_nStopWatchState; // 0x0270
    const char* m_pszTeamGoalStringRed; // 0x0274
    const char* m_pszTeamGoalStringBlue; // 0x0374
    float m_flCapturePointEnableTime; // 0x0474
    uint32_t m_nHudType; // 0x047C
    uint32_t m_bIsInTraining; // 0x0480
    uint32_t m_bAllowTrainingAchievements; // 0x0481
    uint32_t m_bIsWaitingForTrainingContinue; // 0x0482
    uint32_t m_bIsTrainingHUDVisible; // 0x0483
    uint32_t m_bIsInItemTestingMode; // 0x0484
    uint32_t m_hBonusLogic; // 0x0494
    uint32_t m_bPlayingKoth; // 0x0498
    uint32_t m_bPowerupMode; // 0x0499
    uint32_t m_bPlayingRobotDestructionMode; // 0x049A
    uint32_t m_bPlayingMedieval; // 0x049B
    uint32_t m_bPlayingHybrid_CTF_CP; // 0x049C
    uint32_t m_bPlayingSpecialDeliveryMode; // 0x049D
    uint32_t m_bPlayingMannVsMachine; // 0x049E
    uint32_t m_bMannVsMachineAlarmStatus; // 0x049F
    uint32_t m_bHaveMinPlayersToEnableReady; // 0x04A0
    uint32_t m_bBountyModeEnabled; // 0x04A1
    uint32_t m_bCompetitiveMode; // 0x04A2
    uint32_t m_nMatchGroupType; // 0x04A8
    uint32_t m_bMatchEnded; // 0x04AC
    uint32_t m_bHelltowerPlayersInHell; // 0x04AD
    uint32_t m_bIsUsingSpells; // 0x04AE
    uint32_t m_bTruceActive; // 0x04AF
    uint32_t m_bTeamsSwitched; // 0x04B0
    uint32_t m_bRopesHolidayLightsAllowed; // 0x04B1
    uint32_t m_hRedKothTimer; // 0x04B4
    uint32_t m_hBlueKothTimer; // 0x04B8
    uint32_t m_nMapHolidayType; // 0x04BC
    const char* m_pszCustomUpgradesFile; // 0x04C0
    uint32_t m_bShowMatchSummary; // 0x05C4
    uint32_t "m_bShowCompetitiveMatchSummary"; // 0x05C4
    uint32_t m_bMapHasMatchSummaryStage; // 0x05C5
    uint32_t m_bPlayersAreOnMatchSummaryStage; // 0x05C6
    uint32_t m_bStopWatchWinner; // 0x05C7
    uintptr_t m_ePlayerWantsRematch[102]; // 0x05C8
    uint32_t m_eRematchState; // 0x0760
    uintptr_t m_nNextMapVoteOptions[3]; // 0x0764
    uint32_t m_nBossHealth; // 0x08DC
    uint32_t m_nMaxBossHealth; // 0x08E0
    uint32_t m_fBossNormalizedTravelDistance; // 0x08E4
    uint32_t m_itHandle; // 0x08E8
    uint32_t m_hBirthdayPlayer; // 0x08EC
    uint32_t m_nHalloweenEffect; // 0x08F0
    float m_fHalloweenEffectStartTime; // 0x08F4
    float m_fHalloweenEffectDuration; // 0x08F8
    uint32_t m_halloweenScenario; // 0x08FC
    uint32_t m_nForceUpgrades; // 0x0900
    uint32_t m_nForceEscortPushLogic; // 0x0904
};

class CTFSniperRifle // parent CBaseEntity {
public:
    uint32_t movecollide; // 0x0000
    uint32_t movetype; // 0x0000
    uint32_t m_nRenderFX; // 0x008C
    uint32_t m_clrRender; // 0x0090
    uint32_t m_flAnimTime; // 0x00A0
    uint32_t m_flSimulationTime; // 0x00A8
    uint32_t m_ubInterpolationFrame; // 0x00B4
    uint32_t m_fEffects; // 0x00B8
    uint32_t m_nRenderMode; // 0x00BC
    uint32_t m_nNextThinkTick; // 0x00C4
    uint32_t m_nModelIndex; // 0x00CC
    uintptr_t m_nModelIndexOverrides[4]; // 0x00D0
    uint32_t m_iTeamNum; // 0x00EC
    uint32_t m_PredictableID; // 0x00F0
    float m_flGravity; // 0x020C
    uint32_t m_iParentAttachment; // 0x0226
    uint32_t moveparent; // 0x023C
    fVector3 m_vecMinsPreScaled; // 0x0260
    fVector3 m_vecMaxsPreScaled; // 0x026C
    fVector3 m_vecMins; // 0x0278
    fVector3 m_vecMaxs; // 0x0284
    uint32_t m_usSolidFlags; // 0x0294
    uint32_t m_nSurroundType; // 0x0298
    uint32_t m_nSolidType; // 0x0299
    uint32_t m_triggerBloat; // 0x029A
    uint32_t m_bUniformTriggerBloat; // 0x029B
    fVector3 m_vecSpecifiedSurroundingMinsPreScaled; // 0x029C
    fVector3 m_vecSpecifiedSurroundingMaxsPreScaled; // 0x02A8
    fVector3 m_vecSpecifiedSurroundingMins; // 0x02B4
    fVector3 m_vecSpecifiedSurroundingMaxs; // 0x02C0
    float m_flElasticity; // 0x0320
    float m_flShadowCastDistance; // 0x0324
    fVector3 m_vecOrigin; // 0x0458
    fVector3 m_angRotation; // 0x0464
    uint32_t m_CollisionGroup; // 0x0474
    uint32_t m_bIsPlayerSimulated; // 0x0754
    uint32_t m_bSimulatedEveryTick; // 0x0755
    uint32_t m_bAnimatedEveryTick; // 0x0756
    uint32_t m_bAlternateSorting; // 0x0757
    uint32_t m_iTextureFrameIndex; // 0x0758
    uint32_t m_hOwnerEntity; // 0x0764
    uint32_t m_hEffectEntity; // 0x0768
    uint32_t m_nSkin; // 0x07D0
    uint32_t m_nBody; // 0x07D4
    uint32_t m_nHitboxSet; // 0x07D8
    float m_flPlaybackRate; // 0x080C
    fVector3 m_vecForce; // 0x0820
    uint32_t m_nForceBone; // 0x082C
    uint32_t m_bClientSideFrameReset; // 0x086C
    float m_fadeMinDist; // 0x08B0
    float m_fadeMaxDist; // 0x08B4
    float m_flFadeScale; // 0x08B8
    float m_flModelScale; // 0x091C
    float m_flModelWidthScale; // 0x091C
    uintptr_t m_flPoseParameter[24]; // 0x0920
    uintptr_t m_flEncodedController[4]; // 0x0A68
    uint32_t m_bClientSideAnimation; // 0x0AD8
    uint32_t m_nNewSequenceParity; // 0x0ADC
    uint32_t m_nResetEventsParity; // 0x0AE0
    uint32_t m_nSequence; // 0x0B08
    float m_flCycle; // 0x0B10
    uint32_t m_hLightingOrigin; // 0x0BD8
    uint32_t m_hLightingOriginRelative; // 0x0BDC
    uint32_t m_nMuzzleFlashParity; // 0x0BE0
    uint32_t m_iReapplyProvisionParity; // 0x0C88
    uint32_t m_hOuter; // 0x0C8C
    uint32_t m_ProviderType; // 0x0C94
    uint32_t m_iItemDefinitionIndex; // 0x0D10
    uint32_t m_iEntityQuality; // 0x0D14
    uint32_t m_iEntityLevel; // 0x0D18
    uint32_t m_iItemIDHigh; // 0x0D28
    uint32_t m_iItemIDLow; // 0x0D2C
    uint32_t m_iAccountID; // 0x0D30
    uint32_t m_iTeamNumber; // 0x0D98
    uint32_t m_bInitialized; // 0x0D9C
    uint32_t lengthprop20; // 0x0DE8
    uint32_t m_iAttributeDefinitionIndex; // 0x0DF0
    uint32_t m_iRawValue32; // 0x0DF4
    float m_flValue; // 0x0DF4
    uint32_t m_nRefundableCurrency; // 0x0DF8
    uint32_t m_bOnlyIterateItemViewAttributes; // 0x0E18
    uint32_t m_bValidatedAttachedEntity; // 0x0E20
    uint32_t m_hOwner; // 0x0E90
    uint32_t m_nViewModelIndex; // 0x0EA0
    float m_flNextPrimaryAttack; // 0x0EA4
    float m_flNextSecondaryAttack; // 0x0EA8
    float m_flTimeWeaponIdle; // 0x0EAC
    uint32_t m_iViewModelIndex; // 0x0EB4
    uint32_t m_iWorldModelIndex; // 0x0EB8
    uint32_t m_iState; // 0x0ED8
    uint32_t m_iPrimaryAmmoType; // 0x0EE8
    uint32_t m_iSecondaryAmmoType; // 0x0EEC
    uint32_t m_iClip1; // 0x0EF0
    uint32_t m_iClip2; // 0x0EF4
    uint32_t m_bFlipViewModel; // 0x0F20
    uint32_t m_nCustomViewmodelModelIndex; // 0x0F44
    float m_flEffectBarRegenTime; // 0x0F80
    uint32_t m_iReloadMode; // 0x0F88
    float m_flReloadPriorNextFire; // 0x0F8C
    uint32_t m_bLowered; // 0x0FA8
    float m_flLastCritCheckTime; // 0x0FB8
    uint32_t m_bResetParity; // 0x104C
    uint32_t m_bReloadedThroughAnimEvent; // 0x1064
    float m_flEnergy; // 0x1068
    uint32_t m_iConsecutiveShots; // 0x106C
    uint32_t m_bDisguiseWeapon; // 0x1070
    float m_flLastFireTime; // 0x1074
    uint32_t m_hExtraWearable; // 0x1078
    uint32_t m_hExtraWearableViewModel; // 0x107C
    float m_flObservedCritChance; // 0x1080
    uint32_t m_bBeingRepurposedForTaunt; // 0x1084
    uint32_t m_nKillComboClass; // 0x1088
    uint32_t m_nKillComboCount; // 0x108C
    float m_flInspectAnimEndTime; // 0x1090
    uint32_t m_nInspectStage; // 0x1094
    float m_flChargedDamage; // 0x10AC
};

class CTFSMG // parent CBaseEntity {
public:
    uint32_t movecollide; // 0x0000
    uint32_t movetype; // 0x0000
    uint32_t m_nRenderFX; // 0x008C
    uint32_t m_clrRender; // 0x0090
    uint32_t m_flAnimTime; // 0x00A0
    uint32_t m_flSimulationTime; // 0x00A8
    uint32_t m_ubInterpolationFrame; // 0x00B4
    uint32_t m_fEffects; // 0x00B8
    uint32_t m_nRenderMode; // 0x00BC
    uint32_t m_nNextThinkTick; // 0x00C4
    uint32_t m_nModelIndex; // 0x00CC
    uintptr_t m_nModelIndexOverrides[4]; // 0x00D0
    uint32_t m_iTeamNum; // 0x00EC
    uint32_t m_PredictableID; // 0x00F0
    float m_flGravity; // 0x020C
    uint32_t m_iParentAttachment; // 0x0226
    uint32_t moveparent; // 0x023C
    fVector3 m_vecMinsPreScaled; // 0x0260
    fVector3 m_vecMaxsPreScaled; // 0x026C
    fVector3 m_vecMins; // 0x0278
    fVector3 m_vecMaxs; // 0x0284
    uint32_t m_usSolidFlags; // 0x0294
    uint32_t m_nSurroundType; // 0x0298
    uint32_t m_nSolidType; // 0x0299
    uint32_t m_triggerBloat; // 0x029A
    uint32_t m_bUniformTriggerBloat; // 0x029B
    fVector3 m_vecSpecifiedSurroundingMinsPreScaled; // 0x029C
    fVector3 m_vecSpecifiedSurroundingMaxsPreScaled; // 0x02A8
    fVector3 m_vecSpecifiedSurroundingMins; // 0x02B4
    fVector3 m_vecSpecifiedSurroundingMaxs; // 0x02C0
    float m_flElasticity; // 0x0320
    float m_flShadowCastDistance; // 0x0324
    fVector3 m_vecOrigin; // 0x0458
    fVector3 m_angRotation; // 0x0464
    uint32_t m_CollisionGroup; // 0x0474
    uint32_t m_bIsPlayerSimulated; // 0x0754
    uint32_t m_bSimulatedEveryTick; // 0x0755
    uint32_t m_bAnimatedEveryTick; // 0x0756
    uint32_t m_bAlternateSorting; // 0x0757
    uint32_t m_iTextureFrameIndex; // 0x0758
    uint32_t m_hOwnerEntity; // 0x0764
    uint32_t m_hEffectEntity; // 0x0768
    uint32_t m_nSkin; // 0x07D0
    uint32_t m_nBody; // 0x07D4
    uint32_t m_nHitboxSet; // 0x07D8
    float m_flPlaybackRate; // 0x080C
    fVector3 m_vecForce; // 0x0820
    uint32_t m_nForceBone; // 0x082C
    uint32_t m_bClientSideFrameReset; // 0x086C
    float m_fadeMinDist; // 0x08B0
    float m_fadeMaxDist; // 0x08B4
    float m_flFadeScale; // 0x08B8
    float m_flModelScale; // 0x091C
    float m_flModelWidthScale; // 0x091C
    uintptr_t m_flPoseParameter[24]; // 0x0920
    uintptr_t m_flEncodedController[4]; // 0x0A68
    uint32_t m_bClientSideAnimation; // 0x0AD8
    uint32_t m_nNewSequenceParity; // 0x0ADC
    uint32_t m_nResetEventsParity; // 0x0AE0
    uint32_t m_nSequence; // 0x0B08
    float m_flCycle; // 0x0B10
    uint32_t m_hLightingOrigin; // 0x0BD8
    uint32_t m_hLightingOriginRelative; // 0x0BDC
    uint32_t m_nMuzzleFlashParity; // 0x0BE0
    uint32_t m_iReapplyProvisionParity; // 0x0C88
    uint32_t m_hOuter; // 0x0C8C
    uint32_t m_ProviderType; // 0x0C94
    uint32_t m_iItemDefinitionIndex; // 0x0D10
    uint32_t m_iEntityQuality; // 0x0D14
    uint32_t m_iEntityLevel; // 0x0D18
    uint32_t m_iItemIDHigh; // 0x0D28
    uint32_t m_iItemIDLow; // 0x0D2C
    uint32_t m_iAccountID; // 0x0D30
    uint32_t m_iTeamNumber; // 0x0D98
    uint32_t m_bInitialized; // 0x0D9C
    uint32_t lengthprop20; // 0x0DE8
    uint32_t m_iAttributeDefinitionIndex; // 0x0DF0
    float m_flValue; // 0x0DF4
    uint32_t m_iRawValue32; // 0x0DF4
    uint32_t m_nRefundableCurrency; // 0x0DF8
    uint32_t m_bOnlyIterateItemViewAttributes; // 0x0E18
    uint32_t m_bValidatedAttachedEntity; // 0x0E20
    uint32_t m_hOwner; // 0x0E90
    uint32_t m_nViewModelIndex; // 0x0EA0
    float m_flNextPrimaryAttack; // 0x0EA4
    float m_flNextSecondaryAttack; // 0x0EA8
    float m_flTimeWeaponIdle; // 0x0EAC
    uint32_t m_iViewModelIndex; // 0x0EB4
    uint32_t m_iWorldModelIndex; // 0x0EB8
    uint32_t m_iState; // 0x0ED8
    uint32_t m_iPrimaryAmmoType; // 0x0EE8
    uint32_t m_iSecondaryAmmoType; // 0x0EEC
    uint32_t m_iClip1; // 0x0EF0
    uint32_t m_iClip2; // 0x0EF4
    uint32_t m_bFlipViewModel; // 0x0F20
    uint32_t m_nCustomViewmodelModelIndex; // 0x0F44
    float m_flEffectBarRegenTime; // 0x0F80
    uint32_t m_iReloadMode; // 0x0F88
    float m_flReloadPriorNextFire; // 0x0F8C
    uint32_t m_bLowered; // 0x0FA8
    float m_flLastCritCheckTime; // 0x0FB8
    uint32_t m_bResetParity; // 0x104C
    uint32_t m_bReloadedThroughAnimEvent; // 0x1064
    float m_flEnergy; // 0x1068
    uint32_t m_iConsecutiveShots; // 0x106C
    uint32_t m_bDisguiseWeapon; // 0x1070
    float m_flLastFireTime; // 0x1074
    uint32_t m_hExtraWearable; // 0x1078
    uint32_t m_hExtraWearableViewModel; // 0x107C
    float m_flObservedCritChance; // 0x1080
    uint32_t m_bBeingRepurposedForTaunt; // 0x1084
    uint32_t m_nKillComboClass; // 0x1088
    uint32_t m_nKillComboCount; // 0x108C
    float m_flInspectAnimEndTime; // 0x1090
    uint32_t m_nInspectStage; // 0x1094
};

class CTFSlap // parent CBaseEntity {
public:
    uint32_t movecollide; // 0x0000
    uint32_t movetype; // 0x0000
    uint32_t m_nRenderFX; // 0x008C
    uint32_t m_clrRender; // 0x0090
    uint32_t m_flAnimTime; // 0x00A0
    uint32_t m_flSimulationTime; // 0x00A8
    uint32_t m_ubInterpolationFrame; // 0x00B4
    uint32_t m_fEffects; // 0x00B8
    uint32_t m_nRenderMode; // 0x00BC
    uint32_t m_nNextThinkTick; // 0x00C4
    uint32_t m_nModelIndex; // 0x00CC
    uintptr_t m_nModelIndexOverrides[4]; // 0x00D0
    uint32_t m_iTeamNum; // 0x00EC
    uint32_t m_PredictableID; // 0x00F0
    float m_flGravity; // 0x020C
    uint32_t m_iParentAttachment; // 0x0226
    uint32_t moveparent; // 0x023C
    fVector3 m_vecMinsPreScaled; // 0x0260
    fVector3 m_vecMaxsPreScaled; // 0x026C
    fVector3 m_vecMins; // 0x0278
    fVector3 m_vecMaxs; // 0x0284
    uint32_t m_usSolidFlags; // 0x0294
    uint32_t m_nSurroundType; // 0x0298
    uint32_t m_nSolidType; // 0x0299
    uint32_t m_triggerBloat; // 0x029A
    uint32_t m_bUniformTriggerBloat; // 0x029B
    fVector3 m_vecSpecifiedSurroundingMinsPreScaled; // 0x029C
    fVector3 m_vecSpecifiedSurroundingMaxsPreScaled; // 0x02A8
    fVector3 m_vecSpecifiedSurroundingMins; // 0x02B4
    fVector3 m_vecSpecifiedSurroundingMaxs; // 0x02C0
    float m_flElasticity; // 0x0320
    float m_flShadowCastDistance; // 0x0324
    fVector3 m_vecOrigin; // 0x0458
    fVector3 m_angRotation; // 0x0464
    uint32_t m_CollisionGroup; // 0x0474
    uint32_t m_bIsPlayerSimulated; // 0x0754
    uint32_t m_bSimulatedEveryTick; // 0x0755
    uint32_t m_bAnimatedEveryTick; // 0x0756
    uint32_t m_bAlternateSorting; // 0x0757
    uint32_t m_iTextureFrameIndex; // 0x0758
    uint32_t m_hOwnerEntity; // 0x0764
    uint32_t m_hEffectEntity; // 0x0768
    uint32_t m_nSkin; // 0x07D0
    uint32_t m_nBody; // 0x07D4
    uint32_t m_nHitboxSet; // 0x07D8
    float m_flPlaybackRate; // 0x080C
    fVector3 m_vecForce; // 0x0820
    uint32_t m_nForceBone; // 0x082C
    uint32_t m_bClientSideFrameReset; // 0x086C
    float m_fadeMinDist; // 0x08B0
    float m_fadeMaxDist; // 0x08B4
    float m_flFadeScale; // 0x08B8
    float m_flModelScale; // 0x091C
    float m_flModelWidthScale; // 0x091C
    uintptr_t m_flPoseParameter[24]; // 0x0920
    uintptr_t m_flEncodedController[4]; // 0x0A68
    uint32_t m_bClientSideAnimation; // 0x0AD8
    uint32_t m_nNewSequenceParity; // 0x0ADC
    uint32_t m_nResetEventsParity; // 0x0AE0
    uint32_t m_nSequence; // 0x0B08
    float m_flCycle; // 0x0B10
    uint32_t m_hLightingOrigin; // 0x0BD8
    uint32_t m_hLightingOriginRelative; // 0x0BDC
    uint32_t m_nMuzzleFlashParity; // 0x0BE0
    uint32_t m_iReapplyProvisionParity; // 0x0C88
    uint32_t m_hOuter; // 0x0C8C
    uint32_t m_ProviderType; // 0x0C94
    uint32_t m_iItemDefinitionIndex; // 0x0D10
    uint32_t m_iEntityQuality; // 0x0D14
    uint32_t m_iEntityLevel; // 0x0D18
    uint32_t m_iItemIDHigh; // 0x0D28
    uint32_t m_iItemIDLow; // 0x0D2C
    uint32_t m_iAccountID; // 0x0D30
    uint32_t m_iTeamNumber; // 0x0D98
    uint32_t m_bInitialized; // 0x0D9C
    uint32_t lengthprop20; // 0x0DE8
    uint32_t m_iAttributeDefinitionIndex; // 0x0DF0
    uint32_t m_iRawValue32; // 0x0DF4
    float m_flValue; // 0x0DF4
    uint32_t m_nRefundableCurrency; // 0x0DF8
    uint32_t m_bOnlyIterateItemViewAttributes; // 0x0E18
    uint32_t m_bValidatedAttachedEntity; // 0x0E20
    uint32_t m_hOwner; // 0x0E90
    uint32_t m_nViewModelIndex; // 0x0EA0
    float m_flNextPrimaryAttack; // 0x0EA4
    float m_flNextSecondaryAttack; // 0x0EA8
    float m_flTimeWeaponIdle; // 0x0EAC
    uint32_t m_iViewModelIndex; // 0x0EB4
    uint32_t m_iWorldModelIndex; // 0x0EB8
    uint32_t m_iState; // 0x0ED8
    uint32_t m_iPrimaryAmmoType; // 0x0EE8
    uint32_t m_iSecondaryAmmoType; // 0x0EEC
    uint32_t m_iClip1; // 0x0EF0
    uint32_t m_iClip2; // 0x0EF4
    uint32_t m_bFlipViewModel; // 0x0F20
    uint32_t m_nCustomViewmodelModelIndex; // 0x0F44
    float m_flEffectBarRegenTime; // 0x0F80
    uint32_t m_iReloadMode; // 0x0F88
    float m_flReloadPriorNextFire; // 0x0F8C
    uint32_t m_bLowered; // 0x0FA8
    float m_flLastCritCheckTime; // 0x0FB8
    uint32_t m_bResetParity; // 0x104C
    uint32_t m_bReloadedThroughAnimEvent; // 0x1064
    float m_flEnergy; // 0x1068
    uint32_t m_iConsecutiveShots; // 0x106C
    uint32_t m_bDisguiseWeapon; // 0x1070
    float m_flLastFireTime; // 0x1074
    uint32_t m_hExtraWearable; // 0x1078
    uint32_t m_hExtraWearableViewModel; // 0x107C
    float m_flObservedCritChance; // 0x1080
    uint32_t m_bBeingRepurposedForTaunt; // 0x1084
    uint32_t m_nKillComboClass; // 0x1088
    uint32_t m_nKillComboCount; // 0x108C
    float m_flInspectAnimEndTime; // 0x1090
    uint32_t m_nInspectStage; // 0x1094
    uint32_t m_bFirstHit; // 0x10B8
    uint32_t m_nNumKills; // 0x10BC
};

class CTFSpellBook // parent CBaseEntity {
public:
    uint32_t movetype; // 0x0000
    uint32_t movecollide; // 0x0000
    uint32_t m_nRenderFX; // 0x008C
    uint32_t m_clrRender; // 0x0090
    uint32_t m_flAnimTime; // 0x00A0
    uint32_t m_flSimulationTime; // 0x00A8
    uint32_t m_ubInterpolationFrame; // 0x00B4
    uint32_t m_fEffects; // 0x00B8
    uint32_t m_nRenderMode; // 0x00BC
    uint32_t m_nNextThinkTick; // 0x00C4
    uint32_t m_nModelIndex; // 0x00CC
    uintptr_t m_nModelIndexOverrides[4]; // 0x00D0
    uint32_t m_iTeamNum; // 0x00EC
    uint32_t m_PredictableID; // 0x00F0
    float m_flGravity; // 0x020C
    uint32_t m_iParentAttachment; // 0x0226
    uint32_t moveparent; // 0x023C
    fVector3 m_vecMinsPreScaled; // 0x0260
    fVector3 m_vecMaxsPreScaled; // 0x026C
    fVector3 m_vecMins; // 0x0278
    fVector3 m_vecMaxs; // 0x0284
    uint32_t m_usSolidFlags; // 0x0294
    uint32_t m_nSurroundType; // 0x0298
    uint32_t m_nSolidType; // 0x0299
    uint32_t m_triggerBloat; // 0x029A
    uint32_t m_bUniformTriggerBloat; // 0x029B
    fVector3 m_vecSpecifiedSurroundingMinsPreScaled; // 0x029C
    fVector3 m_vecSpecifiedSurroundingMaxsPreScaled; // 0x02A8
    fVector3 m_vecSpecifiedSurroundingMins; // 0x02B4
    fVector3 m_vecSpecifiedSurroundingMaxs; // 0x02C0
    float m_flElasticity; // 0x0320
    float m_flShadowCastDistance; // 0x0324
    fVector3 m_vecOrigin; // 0x0458
    fVector3 m_angRotation; // 0x0464
    uint32_t m_CollisionGroup; // 0x0474
    uint32_t m_bIsPlayerSimulated; // 0x0754
    uint32_t m_bSimulatedEveryTick; // 0x0755
    uint32_t m_bAnimatedEveryTick; // 0x0756
    uint32_t m_bAlternateSorting; // 0x0757
    uint32_t m_iTextureFrameIndex; // 0x0758
    uint32_t m_hOwnerEntity; // 0x0764
    uint32_t m_hEffectEntity; // 0x0768
    uint32_t m_nSkin; // 0x07D0
    uint32_t m_nBody; // 0x07D4
    uint32_t m_nHitboxSet; // 0x07D8
    float m_flPlaybackRate; // 0x080C
    fVector3 m_vecForce; // 0x0820
    uint32_t m_nForceBone; // 0x082C
    uint32_t m_bClientSideFrameReset; // 0x086C
    float m_fadeMinDist; // 0x08B0
    float m_fadeMaxDist; // 0x08B4
    float m_flFadeScale; // 0x08B8
    float m_flModelScale; // 0x091C
    float m_flModelWidthScale; // 0x091C
    uintptr_t m_flPoseParameter[24]; // 0x0920
    uintptr_t m_flEncodedController[4]; // 0x0A68
    uint32_t m_bClientSideAnimation; // 0x0AD8
    uint32_t m_nNewSequenceParity; // 0x0ADC
    uint32_t m_nResetEventsParity; // 0x0AE0
    uint32_t m_nSequence; // 0x0B08
    float m_flCycle; // 0x0B10
    uint32_t m_hLightingOrigin; // 0x0BD8
    uint32_t m_hLightingOriginRelative; // 0x0BDC
    uint32_t m_nMuzzleFlashParity; // 0x0BE0
    uint32_t m_iReapplyProvisionParity; // 0x0C88
    uint32_t m_hOuter; // 0x0C8C
    uint32_t m_ProviderType; // 0x0C94
    uint32_t m_iItemDefinitionIndex; // 0x0D10
    uint32_t m_iEntityQuality; // 0x0D14
    uint32_t m_iEntityLevel; // 0x0D18
    uint32_t m_iItemIDHigh; // 0x0D28
    uint32_t m_iItemIDLow; // 0x0D2C
    uint32_t m_iAccountID; // 0x0D30
    uint32_t m_iTeamNumber; // 0x0D98
    uint32_t m_bInitialized; // 0x0D9C
    uint32_t lengthprop20; // 0x0DE8
    uint32_t m_iAttributeDefinitionIndex; // 0x0DF0
    uint32_t m_iRawValue32; // 0x0DF4
    float m_flValue; // 0x0DF4
    uint32_t m_nRefundableCurrency; // 0x0DF8
    uint32_t m_bOnlyIterateItemViewAttributes; // 0x0E18
    uint32_t m_bValidatedAttachedEntity; // 0x0E20
    uint32_t m_hOwner; // 0x0E90
    uint32_t m_nViewModelIndex; // 0x0EA0
    float m_flNextPrimaryAttack; // 0x0EA4
    float m_flNextSecondaryAttack; // 0x0EA8
    float m_flTimeWeaponIdle; // 0x0EAC
    uint32_t m_iViewModelIndex; // 0x0EB4
    uint32_t m_iWorldModelIndex; // 0x0EB8
    uint32_t m_iState; // 0x0ED8
    uint32_t m_iPrimaryAmmoType; // 0x0EE8
    uint32_t m_iSecondaryAmmoType; // 0x0EEC
    uint32_t m_iClip1; // 0x0EF0
    uint32_t m_iClip2; // 0x0EF4
    uint32_t m_bFlipViewModel; // 0x0F20
    uint32_t m_nCustomViewmodelModelIndex; // 0x0F44
    float m_flEffectBarRegenTime; // 0x0F80
    uint32_t m_iReloadMode; // 0x0F88
    float m_flReloadPriorNextFire; // 0x0F8C
    uint32_t m_bLowered; // 0x0FA8
    float m_flLastCritCheckTime; // 0x0FB8
    uint32_t m_bResetParity; // 0x104C
    uint32_t m_bReloadedThroughAnimEvent; // 0x1064
    float m_flEnergy; // 0x1068
    uint32_t m_iConsecutiveShots; // 0x106C
    uint32_t m_bDisguiseWeapon; // 0x1070
    float m_flLastFireTime; // 0x1074
    uint32_t m_hExtraWearable; // 0x1078
    uint32_t m_hExtraWearableViewModel; // 0x107C
    float m_flObservedCritChance; // 0x1080
    uint32_t m_bBeingRepurposedForTaunt; // 0x1084
    uint32_t m_nKillComboClass; // 0x1088
    uint32_t m_nKillComboCount; // 0x108C
    float m_flInspectAnimEndTime; // 0x1090
    uint32_t m_nInspectStage; // 0x1094
    float m_flChargeBeginTime; // 0x10B8
    float m_flTimeNextSpell; // 0x10E0
    uint32_t m_iSelectedSpellIndex; // 0x10E4
    uint32_t m_iSpellCharges; // 0x10E8
    uint32_t m_bFiredAttack; // 0x10EC
};

class CTFPistol // parent CBaseEntity {
public:
    uint32_t movecollide; // 0x0000
    uint32_t movetype; // 0x0000
    uint32_t m_nRenderFX; // 0x008C
    uint32_t m_clrRender; // 0x0090
    uint32_t m_flAnimTime; // 0x00A0
    uint32_t m_flSimulationTime; // 0x00A8
    uint32_t m_ubInterpolationFrame; // 0x00B4
    uint32_t m_fEffects; // 0x00B8
    uint32_t m_nRenderMode; // 0x00BC
    uint32_t m_nNextThinkTick; // 0x00C4
    uint32_t m_nModelIndex; // 0x00CC
    uintptr_t m_nModelIndexOverrides[4]; // 0x00D0
    uint32_t m_iTeamNum; // 0x00EC
    uint32_t m_PredictableID; // 0x00F0
    float m_flGravity; // 0x020C
    uint32_t m_iParentAttachment; // 0x0226
    uint32_t moveparent; // 0x023C
    fVector3 m_vecMinsPreScaled; // 0x0260
    fVector3 m_vecMaxsPreScaled; // 0x026C
    fVector3 m_vecMins; // 0x0278
    fVector3 m_vecMaxs; // 0x0284
    uint32_t m_usSolidFlags; // 0x0294
    uint32_t m_nSurroundType; // 0x0298
    uint32_t m_nSolidType; // 0x0299
    uint32_t m_triggerBloat; // 0x029A
    uint32_t m_bUniformTriggerBloat; // 0x029B
    fVector3 m_vecSpecifiedSurroundingMinsPreScaled; // 0x029C
    fVector3 m_vecSpecifiedSurroundingMaxsPreScaled; // 0x02A8
    fVector3 m_vecSpecifiedSurroundingMins; // 0x02B4
    fVector3 m_vecSpecifiedSurroundingMaxs; // 0x02C0
    float m_flElasticity; // 0x0320
    float m_flShadowCastDistance; // 0x0324
    fVector3 m_vecOrigin; // 0x0458
    fVector3 m_angRotation; // 0x0464
    uint32_t m_CollisionGroup; // 0x0474
    uint32_t m_bIsPlayerSimulated; // 0x0754
    uint32_t m_bSimulatedEveryTick; // 0x0755
    uint32_t m_bAnimatedEveryTick; // 0x0756
    uint32_t m_bAlternateSorting; // 0x0757
    uint32_t m_iTextureFrameIndex; // 0x0758
    uint32_t m_hOwnerEntity; // 0x0764
    uint32_t m_hEffectEntity; // 0x0768
    uint32_t m_nSkin; // 0x07D0
    uint32_t m_nBody; // 0x07D4
    uint32_t m_nHitboxSet; // 0x07D8
    float m_flPlaybackRate; // 0x080C
    fVector3 m_vecForce; // 0x0820
    uint32_t m_nForceBone; // 0x082C
    uint32_t m_bClientSideFrameReset; // 0x086C
    float m_fadeMinDist; // 0x08B0
    float m_fadeMaxDist; // 0x08B4
    float m_flFadeScale; // 0x08B8
    float m_flModelScale; // 0x091C
    float m_flModelWidthScale; // 0x091C
    uintptr_t m_flPoseParameter[24]; // 0x0920
    uintptr_t m_flEncodedController[4]; // 0x0A68
    uint32_t m_bClientSideAnimation; // 0x0AD8
    uint32_t m_nNewSequenceParity; // 0x0ADC
    uint32_t m_nResetEventsParity; // 0x0AE0
    uint32_t m_nSequence; // 0x0B08
    float m_flCycle; // 0x0B10
    uint32_t m_hLightingOrigin; // 0x0BD8
    uint32_t m_hLightingOriginRelative; // 0x0BDC
    uint32_t m_nMuzzleFlashParity; // 0x0BE0
    uint32_t m_iReapplyProvisionParity; // 0x0C88
    uint32_t m_hOuter; // 0x0C8C
    uint32_t m_ProviderType; // 0x0C94
    uint32_t m_iItemDefinitionIndex; // 0x0D10
    uint32_t m_iEntityQuality; // 0x0D14
    uint32_t m_iEntityLevel; // 0x0D18
    uint32_t m_iItemIDHigh; // 0x0D28
    uint32_t m_iItemIDLow; // 0x0D2C
    uint32_t m_iAccountID; // 0x0D30
    uint32_t m_iTeamNumber; // 0x0D98
    uint32_t m_bInitialized; // 0x0D9C
    uint32_t lengthprop20; // 0x0DE8
    uint32_t m_iAttributeDefinitionIndex; // 0x0DF0
    float m_flValue; // 0x0DF4
    uint32_t m_iRawValue32; // 0x0DF4
    uint32_t m_nRefundableCurrency; // 0x0DF8
    uint32_t m_bOnlyIterateItemViewAttributes; // 0x0E18
    uint32_t m_bValidatedAttachedEntity; // 0x0E20
    uint32_t m_hOwner; // 0x0E90
    uint32_t m_nViewModelIndex; // 0x0EA0
    float m_flNextPrimaryAttack; // 0x0EA4
    float m_flNextSecondaryAttack; // 0x0EA8
    float m_flTimeWeaponIdle; // 0x0EAC
    uint32_t m_iViewModelIndex; // 0x0EB4
    uint32_t m_iWorldModelIndex; // 0x0EB8
    uint32_t m_iState; // 0x0ED8
    uint32_t m_iPrimaryAmmoType; // 0x0EE8
    uint32_t m_iSecondaryAmmoType; // 0x0EEC
    uint32_t m_iClip1; // 0x0EF0
    uint32_t m_iClip2; // 0x0EF4
    uint32_t m_bFlipViewModel; // 0x0F20
    uint32_t m_nCustomViewmodelModelIndex; // 0x0F44
    float m_flEffectBarRegenTime; // 0x0F80
    uint32_t m_iReloadMode; // 0x0F88
    float m_flReloadPriorNextFire; // 0x0F8C
    uint32_t m_bLowered; // 0x0FA8
    float m_flLastCritCheckTime; // 0x0FB8
    uint32_t m_bResetParity; // 0x104C
    uint32_t m_bReloadedThroughAnimEvent; // 0x1064
    float m_flEnergy; // 0x1068
    uint32_t m_iConsecutiveShots; // 0x106C
    uint32_t m_bDisguiseWeapon; // 0x1070
    float m_flLastFireTime; // 0x1074
    uint32_t m_hExtraWearable; // 0x1078
    uint32_t m_hExtraWearableViewModel; // 0x107C
    float m_flObservedCritChance; // 0x1080
    uint32_t m_bBeingRepurposedForTaunt; // 0x1084
    uint32_t m_nKillComboClass; // 0x1088
    uint32_t m_nKillComboCount; // 0x108C
    float m_flInspectAnimEndTime; // 0x1090
    uint32_t m_nInspectStage; // 0x1094
};

class CTFRevolver // parent CBaseEntity {
public:
    uint32_t movecollide; // 0x0000
    uint32_t movetype; // 0x0000
    uint32_t m_nRenderFX; // 0x008C
    uint32_t m_clrRender; // 0x0090
    uint32_t m_flAnimTime; // 0x00A0
    uint32_t m_flSimulationTime; // 0x00A8
    uint32_t m_ubInterpolationFrame; // 0x00B4
    uint32_t m_fEffects; // 0x00B8
    uint32_t m_nRenderMode; // 0x00BC
    uint32_t m_nNextThinkTick; // 0x00C4
    uint32_t m_nModelIndex; // 0x00CC
    uintptr_t m_nModelIndexOverrides[4]; // 0x00D0
    uint32_t m_iTeamNum; // 0x00EC
    uint32_t m_PredictableID; // 0x00F0
    float m_flGravity; // 0x020C
    uint32_t m_iParentAttachment; // 0x0226
    uint32_t moveparent; // 0x023C
    fVector3 m_vecMinsPreScaled; // 0x0260
    fVector3 m_vecMaxsPreScaled; // 0x026C
    fVector3 m_vecMins; // 0x0278
    fVector3 m_vecMaxs; // 0x0284
    uint32_t m_usSolidFlags; // 0x0294
    uint32_t m_nSurroundType; // 0x0298
    uint32_t m_nSolidType; // 0x0299
    uint32_t m_triggerBloat; // 0x029A
    uint32_t m_bUniformTriggerBloat; // 0x029B
    fVector3 m_vecSpecifiedSurroundingMinsPreScaled; // 0x029C
    fVector3 m_vecSpecifiedSurroundingMaxsPreScaled; // 0x02A8
    fVector3 m_vecSpecifiedSurroundingMins; // 0x02B4
    fVector3 m_vecSpecifiedSurroundingMaxs; // 0x02C0
    float m_flElasticity; // 0x0320
    float m_flShadowCastDistance; // 0x0324
    fVector3 m_vecOrigin; // 0x0458
    fVector3 m_angRotation; // 0x0464
    uint32_t m_CollisionGroup; // 0x0474
    uint32_t m_bIsPlayerSimulated; // 0x0754
    uint32_t m_bSimulatedEveryTick; // 0x0755
    uint32_t m_bAnimatedEveryTick; // 0x0756
    uint32_t m_bAlternateSorting; // 0x0757
    uint32_t m_iTextureFrameIndex; // 0x0758
    uint32_t m_hOwnerEntity; // 0x0764
    uint32_t m_hEffectEntity; // 0x0768
    uint32_t m_nSkin; // 0x07D0
    uint32_t m_nBody; // 0x07D4
    uint32_t m_nHitboxSet; // 0x07D8
    float m_flPlaybackRate; // 0x080C
    fVector3 m_vecForce; // 0x0820
    uint32_t m_nForceBone; // 0x082C
    uint32_t m_bClientSideFrameReset; // 0x086C
    float m_fadeMinDist; // 0x08B0
    float m_fadeMaxDist; // 0x08B4
    float m_flFadeScale; // 0x08B8
    float m_flModelScale; // 0x091C
    float m_flModelWidthScale; // 0x091C
    uintptr_t m_flPoseParameter[24]; // 0x0920
    uintptr_t m_flEncodedController[4]; // 0x0A68
    uint32_t m_bClientSideAnimation; // 0x0AD8
    uint32_t m_nNewSequenceParity; // 0x0ADC
    uint32_t m_nResetEventsParity; // 0x0AE0
    uint32_t m_nSequence; // 0x0B08
    float m_flCycle; // 0x0B10
    uint32_t m_hLightingOrigin; // 0x0BD8
    uint32_t m_hLightingOriginRelative; // 0x0BDC
    uint32_t m_nMuzzleFlashParity; // 0x0BE0
    uint32_t m_iReapplyProvisionParity; // 0x0C88
    uint32_t m_hOuter; // 0x0C8C
    uint32_t m_ProviderType; // 0x0C94
    uint32_t m_iItemDefinitionIndex; // 0x0D10
    uint32_t m_iEntityQuality; // 0x0D14
    uint32_t m_iEntityLevel; // 0x0D18
    uint32_t m_iItemIDHigh; // 0x0D28
    uint32_t m_iItemIDLow; // 0x0D2C
    uint32_t m_iAccountID; // 0x0D30
    uint32_t m_iTeamNumber; // 0x0D98
    uint32_t m_bInitialized; // 0x0D9C
    uint32_t lengthprop20; // 0x0DE8
    uint32_t m_iAttributeDefinitionIndex; // 0x0DF0
    float m_flValue; // 0x0DF4
    uint32_t m_iRawValue32; // 0x0DF4
    uint32_t m_nRefundableCurrency; // 0x0DF8
    uint32_t m_bOnlyIterateItemViewAttributes; // 0x0E18
    uint32_t m_bValidatedAttachedEntity; // 0x0E20
    uint32_t m_hOwner; // 0x0E90
    uint32_t m_nViewModelIndex; // 0x0EA0
    float m_flNextPrimaryAttack; // 0x0EA4
    float m_flNextSecondaryAttack; // 0x0EA8
    float m_flTimeWeaponIdle; // 0x0EAC
    uint32_t m_iViewModelIndex; // 0x0EB4
    uint32_t m_iWorldModelIndex; // 0x0EB8
    uint32_t m_iState; // 0x0ED8
    uint32_t m_iPrimaryAmmoType; // 0x0EE8
    uint32_t m_iSecondaryAmmoType; // 0x0EEC
    uint32_t m_iClip1; // 0x0EF0
    uint32_t m_iClip2; // 0x0EF4
    uint32_t m_bFlipViewModel; // 0x0F20
    uint32_t m_nCustomViewmodelModelIndex; // 0x0F44
    float m_flEffectBarRegenTime; // 0x0F80
    uint32_t m_iReloadMode; // 0x0F88
    float m_flReloadPriorNextFire; // 0x0F8C
    uint32_t m_bLowered; // 0x0FA8
    float m_flLastCritCheckTime; // 0x0FB8
    uint32_t m_bResetParity; // 0x104C
    uint32_t m_bReloadedThroughAnimEvent; // 0x1064
    float m_flEnergy; // 0x1068
    uint32_t m_iConsecutiveShots; // 0x106C
    uint32_t m_bDisguiseWeapon; // 0x1070
    float m_flLastFireTime; // 0x1074
    uint32_t m_hExtraWearable; // 0x1078
    uint32_t m_hExtraWearableViewModel; // 0x107C
    float m_flObservedCritChance; // 0x1080
    uint32_t m_bBeingRepurposedForTaunt; // 0x1084
    uint32_t m_nKillComboClass; // 0x1088
    uint32_t m_nKillComboCount; // 0x108C
    float m_flInspectAnimEndTime; // 0x1090
    uint32_t m_nInspectStage; // 0x1094
};

class CPhysBox // parent CBaseEntity {
public:
    uint32_t movetype; // 0x0000
    uint32_t movecollide; // 0x0000
    uint32_t m_nRenderFX; // 0x008C
    uint32_t m_clrRender; // 0x0090
    uint32_t m_flAnimTime; // 0x00A0
    uint32_t m_flSimulationTime; // 0x00A8
    uint32_t m_ubInterpolationFrame; // 0x00B4
    uint32_t m_fEffects; // 0x00B8
    uint32_t m_nRenderMode; // 0x00BC
    uint32_t m_nModelIndex; // 0x00CC
    uintptr_t m_nModelIndexOverrides[4]; // 0x00D0
    uint32_t m_iTeamNum; // 0x00EC
    uint32_t m_PredictableID; // 0x00F0
    float m_flGravity; // 0x020C
    uint32_t m_iParentAttachment; // 0x0226
    uint32_t moveparent; // 0x023C
    fVector3 m_vecMinsPreScaled; // 0x0260
    fVector3 m_vecMaxsPreScaled; // 0x026C
    fVector3 m_vecMins; // 0x0278
    fVector3 m_vecMaxs; // 0x0284
    uint32_t m_usSolidFlags; // 0x0294
    uint32_t m_nSurroundType; // 0x0298
    uint32_t m_nSolidType; // 0x0299
    uint32_t m_triggerBloat; // 0x029A
    uint32_t m_bUniformTriggerBloat; // 0x029B
    fVector3 m_vecSpecifiedSurroundingMinsPreScaled; // 0x029C
    fVector3 m_vecSpecifiedSurroundingMaxsPreScaled; // 0x02A8
    fVector3 m_vecSpecifiedSurroundingMins; // 0x02B4
    fVector3 m_vecSpecifiedSurroundingMaxs; // 0x02C0
    float m_flElasticity; // 0x0320
    float m_flShadowCastDistance; // 0x0324
    fVector3 m_vecOrigin; // 0x0458
    fVector3 m_angRotation; // 0x0464
    uint32_t m_CollisionGroup; // 0x0474
    uint32_t m_bIsPlayerSimulated; // 0x0754
    uint32_t m_bSimulatedEveryTick; // 0x0755
    uint32_t m_bAnimatedEveryTick; // 0x0756
    uint32_t m_bAlternateSorting; // 0x0757
    uint32_t m_iTextureFrameIndex; // 0x0758
    uint32_t m_hOwnerEntity; // 0x0764
    uint32_t m_hEffectEntity; // 0x0768
    float m_mass; // 0x07C0
};

class CTFShotgun_Soldier // parent CBaseEntity {
public:
    uint32_t movecollide; // 0x0000
    uint32_t movetype; // 0x0000
    uint32_t m_nRenderFX; // 0x008C
    uint32_t m_clrRender; // 0x0090
    uint32_t m_flAnimTime; // 0x00A0
    uint32_t m_flSimulationTime; // 0x00A8
    uint32_t m_ubInterpolationFrame; // 0x00B4
    uint32_t m_fEffects; // 0x00B8
    uint32_t m_nRenderMode; // 0x00BC
    uint32_t m_nNextThinkTick; // 0x00C4
    uint32_t m_nModelIndex; // 0x00CC
    uintptr_t m_nModelIndexOverrides[4]; // 0x00D0
    uint32_t m_iTeamNum; // 0x00EC
    uint32_t m_PredictableID; // 0x00F0
    float m_flGravity; // 0x020C
    uint32_t m_iParentAttachment; // 0x0226
    uint32_t moveparent; // 0x023C
    fVector3 m_vecMinsPreScaled; // 0x0260
    fVector3 m_vecMaxsPreScaled; // 0x026C
    fVector3 m_vecMins; // 0x0278
    fVector3 m_vecMaxs; // 0x0284
    uint32_t m_usSolidFlags; // 0x0294
    uint32_t m_nSurroundType; // 0x0298
    uint32_t m_nSolidType; // 0x0299
    uint32_t m_triggerBloat; // 0x029A
    uint32_t m_bUniformTriggerBloat; // 0x029B
    fVector3 m_vecSpecifiedSurroundingMinsPreScaled; // 0x029C
    fVector3 m_vecSpecifiedSurroundingMaxsPreScaled; // 0x02A8
    fVector3 m_vecSpecifiedSurroundingMins; // 0x02B4
    fVector3 m_vecSpecifiedSurroundingMaxs; // 0x02C0
    float m_flElasticity; // 0x0320
    float m_flShadowCastDistance; // 0x0324
    fVector3 m_vecOrigin; // 0x0458
    fVector3 m_angRotation; // 0x0464
    uint32_t m_CollisionGroup; // 0x0474
    uint32_t m_bIsPlayerSimulated; // 0x0754
    uint32_t m_bSimulatedEveryTick; // 0x0755
    uint32_t m_bAnimatedEveryTick; // 0x0756
    uint32_t m_bAlternateSorting; // 0x0757
    uint32_t m_iTextureFrameIndex; // 0x0758
    uint32_t m_hOwnerEntity; // 0x0764
    uint32_t m_hEffectEntity; // 0x0768
    uint32_t m_nSkin; // 0x07D0
    uint32_t m_nBody; // 0x07D4
    uint32_t m_nHitboxSet; // 0x07D8
    float m_flPlaybackRate; // 0x080C
    fVector3 m_vecForce; // 0x0820
    uint32_t m_nForceBone; // 0x082C
    uint32_t m_bClientSideFrameReset; // 0x086C
    float m_fadeMinDist; // 0x08B0
    float m_fadeMaxDist; // 0x08B4
    float m_flFadeScale; // 0x08B8
    float m_flModelScale; // 0x091C
    float m_flModelWidthScale; // 0x091C
    uintptr_t m_flPoseParameter[24]; // 0x0920
    uintptr_t m_flEncodedController[4]; // 0x0A68
    uint32_t m_bClientSideAnimation; // 0x0AD8
    uint32_t m_nNewSequenceParity; // 0x0ADC
    uint32_t m_nResetEventsParity; // 0x0AE0
    uint32_t m_nSequence; // 0x0B08
    float m_flCycle; // 0x0B10
    uint32_t m_hLightingOrigin; // 0x0BD8
    uint32_t m_hLightingOriginRelative; // 0x0BDC
    uint32_t m_nMuzzleFlashParity; // 0x0BE0
    uint32_t m_iReapplyProvisionParity; // 0x0C88
    uint32_t m_hOuter; // 0x0C8C
    uint32_t m_ProviderType; // 0x0C94
    uint32_t m_iItemDefinitionIndex; // 0x0D10
    uint32_t m_iEntityQuality; // 0x0D14
    uint32_t m_iEntityLevel; // 0x0D18
    uint32_t m_iItemIDHigh; // 0x0D28
    uint32_t m_iItemIDLow; // 0x0D2C
    uint32_t m_iAccountID; // 0x0D30
    uint32_t m_iTeamNumber; // 0x0D98
    uint32_t m_bInitialized; // 0x0D9C
    uint32_t lengthprop20; // 0x0DE8
    uint32_t m_iAttributeDefinitionIndex; // 0x0DF0
    float m_flValue; // 0x0DF4
    uint32_t m_iRawValue32; // 0x0DF4
    uint32_t m_nRefundableCurrency; // 0x0DF8
    uint32_t m_bOnlyIterateItemViewAttributes; // 0x0E18
    uint32_t m_bValidatedAttachedEntity; // 0x0E20
    uint32_t m_hOwner; // 0x0E90
    uint32_t m_nViewModelIndex; // 0x0EA0
    float m_flNextPrimaryAttack; // 0x0EA4
    float m_flNextSecondaryAttack; // 0x0EA8
    float m_flTimeWeaponIdle; // 0x0EAC
    uint32_t m_iViewModelIndex; // 0x0EB4
    uint32_t m_iWorldModelIndex; // 0x0EB8
    uint32_t m_iState; // 0x0ED8
    uint32_t m_iPrimaryAmmoType; // 0x0EE8
    uint32_t m_iSecondaryAmmoType; // 0x0EEC
    uint32_t m_iClip1; // 0x0EF0
    uint32_t m_iClip2; // 0x0EF4
    uint32_t m_bFlipViewModel; // 0x0F20
    uint32_t m_nCustomViewmodelModelIndex; // 0x0F44
    float m_flEffectBarRegenTime; // 0x0F80
    uint32_t m_iReloadMode; // 0x0F88
    float m_flReloadPriorNextFire; // 0x0F8C
    uint32_t m_bLowered; // 0x0FA8
    float m_flLastCritCheckTime; // 0x0FB8
    uint32_t m_bResetParity; // 0x104C
    uint32_t m_bReloadedThroughAnimEvent; // 0x1064
    float m_flEnergy; // 0x1068
    uint32_t m_iConsecutiveShots; // 0x106C
    uint32_t m_bDisguiseWeapon; // 0x1070
    float m_flLastFireTime; // 0x1074
    uint32_t m_hExtraWearable; // 0x1078
    uint32_t m_hExtraWearableViewModel; // 0x107C
    float m_flObservedCritChance; // 0x1080
    uint32_t m_bBeingRepurposedForTaunt; // 0x1084
    uint32_t m_nKillComboClass; // 0x1088
    uint32_t m_nKillComboCount; // 0x108C
    float m_flInspectAnimEndTime; // 0x1090
    uint32_t m_nInspectStage; // 0x1094
};

class CTFShovel // parent CBaseEntity {
public:
    uint32_t movecollide; // 0x0000
    uint32_t movetype; // 0x0000
    uint32_t m_nRenderFX; // 0x008C
    uint32_t m_clrRender; // 0x0090
    uint32_t m_flAnimTime; // 0x00A0
    uint32_t m_flSimulationTime; // 0x00A8
    uint32_t m_ubInterpolationFrame; // 0x00B4
    uint32_t m_fEffects; // 0x00B8
    uint32_t m_nRenderMode; // 0x00BC
    uint32_t m_nNextThinkTick; // 0x00C4
    uint32_t m_nModelIndex; // 0x00CC
    uintptr_t m_nModelIndexOverrides[4]; // 0x00D0
    uint32_t m_iTeamNum; // 0x00EC
    uint32_t m_PredictableID; // 0x00F0
    float m_flGravity; // 0x020C
    uint32_t m_iParentAttachment; // 0x0226
    uint32_t moveparent; // 0x023C
    fVector3 m_vecMinsPreScaled; // 0x0260
    fVector3 m_vecMaxsPreScaled; // 0x026C
    fVector3 m_vecMins; // 0x0278
    fVector3 m_vecMaxs; // 0x0284
    uint32_t m_usSolidFlags; // 0x0294
    uint32_t m_nSurroundType; // 0x0298
    uint32_t m_nSolidType; // 0x0299
    uint32_t m_triggerBloat; // 0x029A
    uint32_t m_bUniformTriggerBloat; // 0x029B
    fVector3 m_vecSpecifiedSurroundingMinsPreScaled; // 0x029C
    fVector3 m_vecSpecifiedSurroundingMaxsPreScaled; // 0x02A8
    fVector3 m_vecSpecifiedSurroundingMins; // 0x02B4
    fVector3 m_vecSpecifiedSurroundingMaxs; // 0x02C0
    float m_flElasticity; // 0x0320
    float m_flShadowCastDistance; // 0x0324
    fVector3 m_vecOrigin; // 0x0458
    fVector3 m_angRotation; // 0x0464
    uint32_t m_CollisionGroup; // 0x0474
    uint32_t m_bIsPlayerSimulated; // 0x0754
    uint32_t m_bSimulatedEveryTick; // 0x0755
    uint32_t m_bAnimatedEveryTick; // 0x0756
    uint32_t m_bAlternateSorting; // 0x0757
    uint32_t m_iTextureFrameIndex; // 0x0758
    uint32_t m_hOwnerEntity; // 0x0764
    uint32_t m_hEffectEntity; // 0x0768
    uint32_t m_nSkin; // 0x07D0
    uint32_t m_nBody; // 0x07D4
    uint32_t m_nHitboxSet; // 0x07D8
    float m_flPlaybackRate; // 0x080C
    fVector3 m_vecForce; // 0x0820
    uint32_t m_nForceBone; // 0x082C
    uint32_t m_bClientSideFrameReset; // 0x086C
    float m_fadeMinDist; // 0x08B0
    float m_fadeMaxDist; // 0x08B4
    float m_flFadeScale; // 0x08B8
    float m_flModelScale; // 0x091C
    float m_flModelWidthScale; // 0x091C
    uintptr_t m_flPoseParameter[24]; // 0x0920
    uintptr_t m_flEncodedController[4]; // 0x0A68
    uint32_t m_bClientSideAnimation; // 0x0AD8
    uint32_t m_nNewSequenceParity; // 0x0ADC
    uint32_t m_nResetEventsParity; // 0x0AE0
    uint32_t m_nSequence; // 0x0B08
    float m_flCycle; // 0x0B10
    uint32_t m_hLightingOrigin; // 0x0BD8
    uint32_t m_hLightingOriginRelative; // 0x0BDC
    uint32_t m_nMuzzleFlashParity; // 0x0BE0
    uint32_t m_iReapplyProvisionParity; // 0x0C88
    uint32_t m_hOuter; // 0x0C8C
    uint32_t m_ProviderType; // 0x0C94
    uint32_t m_iItemDefinitionIndex; // 0x0D10
    uint32_t m_iEntityQuality; // 0x0D14
    uint32_t m_iEntityLevel; // 0x0D18
    uint32_t m_iItemIDHigh; // 0x0D28
    uint32_t m_iItemIDLow; // 0x0D2C
    uint32_t m_iAccountID; // 0x0D30
    uint32_t m_iTeamNumber; // 0x0D98
    uint32_t m_bInitialized; // 0x0D9C
    uint32_t lengthprop20; // 0x0DE8
    uint32_t m_iAttributeDefinitionIndex; // 0x0DF0
    float m_flValue; // 0x0DF4
    uint32_t m_iRawValue32; // 0x0DF4
    uint32_t m_nRefundableCurrency; // 0x0DF8
    uint32_t m_bOnlyIterateItemViewAttributes; // 0x0E18
    uint32_t m_bValidatedAttachedEntity; // 0x0E20
    uint32_t m_hOwner; // 0x0E90
    uint32_t m_nViewModelIndex; // 0x0EA0
    float m_flNextPrimaryAttack; // 0x0EA4
    float m_flNextSecondaryAttack; // 0x0EA8
    float m_flTimeWeaponIdle; // 0x0EAC
    uint32_t m_iViewModelIndex; // 0x0EB4
    uint32_t m_iWorldModelIndex; // 0x0EB8
    uint32_t m_iState; // 0x0ED8
    uint32_t m_iPrimaryAmmoType; // 0x0EE8
    uint32_t m_iSecondaryAmmoType; // 0x0EEC
    uint32_t m_iClip1; // 0x0EF0
    uint32_t m_iClip2; // 0x0EF4
    uint32_t m_bFlipViewModel; // 0x0F20
    uint32_t m_nCustomViewmodelModelIndex; // 0x0F44
    float m_flEffectBarRegenTime; // 0x0F80
    uint32_t m_iReloadMode; // 0x0F88
    float m_flReloadPriorNextFire; // 0x0F8C
    uint32_t m_bLowered; // 0x0FA8
    float m_flLastCritCheckTime; // 0x0FB8
    uint32_t m_bResetParity; // 0x104C
    uint32_t m_bReloadedThroughAnimEvent; // 0x1064
    float m_flEnergy; // 0x1068
    uint32_t m_iConsecutiveShots; // 0x106C
    uint32_t m_bDisguiseWeapon; // 0x1070
    float m_flLastFireTime; // 0x1074
    uint32_t m_hExtraWearable; // 0x1078
    uint32_t m_hExtraWearableViewModel; // 0x107C
    float m_flObservedCritChance; // 0x1080
    uint32_t m_bBeingRepurposedForTaunt; // 0x1084
    uint32_t m_nKillComboClass; // 0x1088
    uint32_t m_nKillComboCount; // 0x108C
    float m_flInspectAnimEndTime; // 0x1090
    uint32_t m_nInspectStage; // 0x1094
};

class CTFShotgunBuildingRescue // parent CBaseEntity {
public:
    uint32_t movecollide; // 0x0000
    uint32_t movetype; // 0x0000
    uint32_t m_nRenderFX; // 0x008C
    uint32_t m_clrRender; // 0x0090
    uint32_t m_flAnimTime; // 0x00A0
    uint32_t m_flSimulationTime; // 0x00A8
    uint32_t m_ubInterpolationFrame; // 0x00B4
    uint32_t m_fEffects; // 0x00B8
    uint32_t m_nRenderMode; // 0x00BC
    uint32_t m_nNextThinkTick; // 0x00C4
    uint32_t m_nModelIndex; // 0x00CC
    uintptr_t m_nModelIndexOverrides[4]; // 0x00D0
    uint32_t m_iTeamNum; // 0x00EC
    uint32_t m_PredictableID; // 0x00F0
    float m_flGravity; // 0x020C
    uint32_t m_iParentAttachment; // 0x0226
    uint32_t moveparent; // 0x023C
    fVector3 m_vecMinsPreScaled; // 0x0260
    fVector3 m_vecMaxsPreScaled; // 0x026C
    fVector3 m_vecMins; // 0x0278
    fVector3 m_vecMaxs; // 0x0284
    uint32_t m_usSolidFlags; // 0x0294
    uint32_t m_nSurroundType; // 0x0298
    uint32_t m_nSolidType; // 0x0299
    uint32_t m_triggerBloat; // 0x029A
    uint32_t m_bUniformTriggerBloat; // 0x029B
    fVector3 m_vecSpecifiedSurroundingMinsPreScaled; // 0x029C
    fVector3 m_vecSpecifiedSurroundingMaxsPreScaled; // 0x02A8
    fVector3 m_vecSpecifiedSurroundingMins; // 0x02B4
    fVector3 m_vecSpecifiedSurroundingMaxs; // 0x02C0
    float m_flElasticity; // 0x0320
    float m_flShadowCastDistance; // 0x0324
    fVector3 m_vecOrigin; // 0x0458
    fVector3 m_angRotation; // 0x0464
    uint32_t m_CollisionGroup; // 0x0474
    uint32_t m_bIsPlayerSimulated; // 0x0754
    uint32_t m_bSimulatedEveryTick; // 0x0755
    uint32_t m_bAnimatedEveryTick; // 0x0756
    uint32_t m_bAlternateSorting; // 0x0757
    uint32_t m_iTextureFrameIndex; // 0x0758
    uint32_t m_hOwnerEntity; // 0x0764
    uint32_t m_hEffectEntity; // 0x0768
    uint32_t m_nSkin; // 0x07D0
    uint32_t m_nBody; // 0x07D4
    uint32_t m_nHitboxSet; // 0x07D8
    float m_flPlaybackRate; // 0x080C
    fVector3 m_vecForce; // 0x0820
    uint32_t m_nForceBone; // 0x082C
    uint32_t m_bClientSideFrameReset; // 0x086C
    float m_fadeMinDist; // 0x08B0
    float m_fadeMaxDist; // 0x08B4
    float m_flFadeScale; // 0x08B8
    float m_flModelScale; // 0x091C
    float m_flModelWidthScale; // 0x091C
    uintptr_t m_flPoseParameter[24]; // 0x0920
    uintptr_t m_flEncodedController[4]; // 0x0A68
    uint32_t m_bClientSideAnimation; // 0x0AD8
    uint32_t m_nNewSequenceParity; // 0x0ADC
    uint32_t m_nResetEventsParity; // 0x0AE0
    uint32_t m_nSequence; // 0x0B08
    float m_flCycle; // 0x0B10
    uint32_t m_hLightingOrigin; // 0x0BD8
    uint32_t m_hLightingOriginRelative; // 0x0BDC
    uint32_t m_nMuzzleFlashParity; // 0x0BE0
    uint32_t m_iReapplyProvisionParity; // 0x0C88
    uint32_t m_hOuter; // 0x0C8C
    uint32_t m_ProviderType; // 0x0C94
    uint32_t m_iItemDefinitionIndex; // 0x0D10
    uint32_t m_iEntityQuality; // 0x0D14
    uint32_t m_iEntityLevel; // 0x0D18
    uint32_t m_iItemIDHigh; // 0x0D28
    uint32_t m_iItemIDLow; // 0x0D2C
    uint32_t m_iAccountID; // 0x0D30
    uint32_t m_iTeamNumber; // 0x0D98
    uint32_t m_bInitialized; // 0x0D9C
    uint32_t lengthprop20; // 0x0DE8
    uint32_t m_iAttributeDefinitionIndex; // 0x0DF0
    float m_flValue; // 0x0DF4
    uint32_t m_iRawValue32; // 0x0DF4
    uint32_t m_nRefundableCurrency; // 0x0DF8
    uint32_t m_bOnlyIterateItemViewAttributes; // 0x0E18
    uint32_t m_bValidatedAttachedEntity; // 0x0E20
    uint32_t m_hOwner; // 0x0E90
    uint32_t m_nViewModelIndex; // 0x0EA0
    float m_flNextPrimaryAttack; // 0x0EA4
    float m_flNextSecondaryAttack; // 0x0EA8
    float m_flTimeWeaponIdle; // 0x0EAC
    uint32_t m_iViewModelIndex; // 0x0EB4
    uint32_t m_iWorldModelIndex; // 0x0EB8
    uint32_t m_iState; // 0x0ED8
    uint32_t m_iPrimaryAmmoType; // 0x0EE8
    uint32_t m_iSecondaryAmmoType; // 0x0EEC
    uint32_t m_iClip1; // 0x0EF0
    uint32_t m_iClip2; // 0x0EF4
    uint32_t m_bFlipViewModel; // 0x0F20
    uint32_t m_nCustomViewmodelModelIndex; // 0x0F44
    float m_flEffectBarRegenTime; // 0x0F80
    uint32_t m_iReloadMode; // 0x0F88
    float m_flReloadPriorNextFire; // 0x0F8C
    uint32_t m_bLowered; // 0x0FA8
    float m_flLastCritCheckTime; // 0x0FB8
    uint32_t m_bResetParity; // 0x104C
    uint32_t m_bReloadedThroughAnimEvent; // 0x1064
    float m_flEnergy; // 0x1068
    uint32_t m_iConsecutiveShots; // 0x106C
    uint32_t m_bDisguiseWeapon; // 0x1070
    float m_flLastFireTime; // 0x1074
    uint32_t m_hExtraWearable; // 0x1078
    uint32_t m_hExtraWearableViewModel; // 0x107C
    float m_flObservedCritChance; // 0x1080
    uint32_t m_bBeingRepurposedForTaunt; // 0x1084
    uint32_t m_nKillComboClass; // 0x1088
    uint32_t m_nKillComboCount; // 0x108C
    float m_flInspectAnimEndTime; // 0x1090
    uint32_t m_nInspectStage; // 0x1094
};

class CTFPEPBrawlerBlaster // parent CBaseEntity {
public:
    uint32_t movecollide; // 0x0000
    uint32_t movetype; // 0x0000
    uint32_t m_nRenderFX; // 0x008C
    uint32_t m_clrRender; // 0x0090
    uint32_t m_flAnimTime; // 0x00A0
    uint32_t m_flSimulationTime; // 0x00A8
    uint32_t m_ubInterpolationFrame; // 0x00B4
    uint32_t m_fEffects; // 0x00B8
    uint32_t m_nRenderMode; // 0x00BC
    uint32_t m_nNextThinkTick; // 0x00C4
    uint32_t m_nModelIndex; // 0x00CC
    uintptr_t m_nModelIndexOverrides[4]; // 0x00D0
    uint32_t m_iTeamNum; // 0x00EC
    uint32_t m_PredictableID; // 0x00F0
    float m_flGravity; // 0x020C
    uint32_t m_iParentAttachment; // 0x0226
    uint32_t moveparent; // 0x023C
    fVector3 m_vecMinsPreScaled; // 0x0260
    fVector3 m_vecMaxsPreScaled; // 0x026C
    fVector3 m_vecMins; // 0x0278
    fVector3 m_vecMaxs; // 0x0284
    uint32_t m_usSolidFlags; // 0x0294
    uint32_t m_nSurroundType; // 0x0298
    uint32_t m_nSolidType; // 0x0299
    uint32_t m_triggerBloat; // 0x029A
    uint32_t m_bUniformTriggerBloat; // 0x029B
    fVector3 m_vecSpecifiedSurroundingMinsPreScaled; // 0x029C
    fVector3 m_vecSpecifiedSurroundingMaxsPreScaled; // 0x02A8
    fVector3 m_vecSpecifiedSurroundingMins; // 0x02B4
    fVector3 m_vecSpecifiedSurroundingMaxs; // 0x02C0
    float m_flElasticity; // 0x0320
    float m_flShadowCastDistance; // 0x0324
    fVector3 m_vecOrigin; // 0x0458
    fVector3 m_angRotation; // 0x0464
    uint32_t m_CollisionGroup; // 0x0474
    uint32_t m_bIsPlayerSimulated; // 0x0754
    uint32_t m_bSimulatedEveryTick; // 0x0755
    uint32_t m_bAnimatedEveryTick; // 0x0756
    uint32_t m_bAlternateSorting; // 0x0757
    uint32_t m_iTextureFrameIndex; // 0x0758
    uint32_t m_hOwnerEntity; // 0x0764
    uint32_t m_hEffectEntity; // 0x0768
    uint32_t m_nSkin; // 0x07D0
    uint32_t m_nBody; // 0x07D4
    uint32_t m_nHitboxSet; // 0x07D8
    float m_flPlaybackRate; // 0x080C
    fVector3 m_vecForce; // 0x0820
    uint32_t m_nForceBone; // 0x082C
    uint32_t m_bClientSideFrameReset; // 0x086C
    float m_fadeMinDist; // 0x08B0
    float m_fadeMaxDist; // 0x08B4
    float m_flFadeScale; // 0x08B8
    float m_flModelScale; // 0x091C
    float m_flModelWidthScale; // 0x091C
    uintptr_t m_flPoseParameter[24]; // 0x0920
    uintptr_t m_flEncodedController[4]; // 0x0A68
    uint32_t m_bClientSideAnimation; // 0x0AD8
    uint32_t m_nNewSequenceParity; // 0x0ADC
    uint32_t m_nResetEventsParity; // 0x0AE0
    uint32_t m_nSequence; // 0x0B08
    float m_flCycle; // 0x0B10
    uint32_t m_hLightingOrigin; // 0x0BD8
    uint32_t m_hLightingOriginRelative; // 0x0BDC
    uint32_t m_nMuzzleFlashParity; // 0x0BE0
    uint32_t m_iReapplyProvisionParity; // 0x0C88
    uint32_t m_hOuter; // 0x0C8C
    uint32_t m_ProviderType; // 0x0C94
    uint32_t m_iItemDefinitionIndex; // 0x0D10
    uint32_t m_iEntityQuality; // 0x0D14
    uint32_t m_iEntityLevel; // 0x0D18
    uint32_t m_iItemIDHigh; // 0x0D28
    uint32_t m_iItemIDLow; // 0x0D2C
    uint32_t m_iAccountID; // 0x0D30
    uint32_t m_iTeamNumber; // 0x0D98
    uint32_t m_bInitialized; // 0x0D9C
    uint32_t lengthprop20; // 0x0DE8
    uint32_t m_iAttributeDefinitionIndex; // 0x0DF0
    float m_flValue; // 0x0DF4
    uint32_t m_iRawValue32; // 0x0DF4
    uint32_t m_nRefundableCurrency; // 0x0DF8
    uint32_t m_bOnlyIterateItemViewAttributes; // 0x0E18
    uint32_t m_bValidatedAttachedEntity; // 0x0E20
    uint32_t m_hOwner; // 0x0E90
    uint32_t m_nViewModelIndex; // 0x0EA0
    float m_flNextPrimaryAttack; // 0x0EA4
    float m_flNextSecondaryAttack; // 0x0EA8
    float m_flTimeWeaponIdle; // 0x0EAC
    uint32_t m_iViewModelIndex; // 0x0EB4
    uint32_t m_iWorldModelIndex; // 0x0EB8
    uint32_t m_iState; // 0x0ED8
    uint32_t m_iPrimaryAmmoType; // 0x0EE8
    uint32_t m_iSecondaryAmmoType; // 0x0EEC
    uint32_t m_iClip1; // 0x0EF0
    uint32_t m_iClip2; // 0x0EF4
    uint32_t m_bFlipViewModel; // 0x0F20
    uint32_t m_nCustomViewmodelModelIndex; // 0x0F44
    float m_flEffectBarRegenTime; // 0x0F80
    uint32_t m_iReloadMode; // 0x0F88
    float m_flReloadPriorNextFire; // 0x0F8C
    uint32_t m_bLowered; // 0x0FA8
    float m_flLastCritCheckTime; // 0x0FB8
    uint32_t m_bResetParity; // 0x104C
    uint32_t m_bReloadedThroughAnimEvent; // 0x1064
    float m_flEnergy; // 0x1068
    uint32_t m_iConsecutiveShots; // 0x106C
    uint32_t m_bDisguiseWeapon; // 0x1070
    float m_flLastFireTime; // 0x1074
    uint32_t m_hExtraWearable; // 0x1078
    uint32_t m_hExtraWearableViewModel; // 0x107C
    float m_flObservedCritChance; // 0x1080
    uint32_t m_bBeingRepurposedForTaunt; // 0x1084
    uint32_t m_nKillComboClass; // 0x1088
    uint32_t m_nKillComboCount; // 0x108C
    float m_flInspectAnimEndTime; // 0x1090
    uint32_t m_nInspectStage; // 0x1094
};

class CTFMinigun // parent CBaseEntity {
public:
    uint32_t movecollide; // 0x0000
    uint32_t movetype; // 0x0000
    uint32_t m_nRenderFX; // 0x008C
    uint32_t m_clrRender; // 0x0090
    uint32_t m_flAnimTime; // 0x00A0
    uint32_t m_flSimulationTime; // 0x00A8
    uint32_t m_ubInterpolationFrame; // 0x00B4
    uint32_t m_fEffects; // 0x00B8
    uint32_t m_nRenderMode; // 0x00BC
    uint32_t m_nNextThinkTick; // 0x00C4
    uint32_t m_nModelIndex; // 0x00CC
    uintptr_t m_nModelIndexOverrides[4]; // 0x00D0
    uint32_t m_iTeamNum; // 0x00EC
    uint32_t m_PredictableID; // 0x00F0
    float m_flGravity; // 0x020C
    uint32_t m_iParentAttachment; // 0x0226
    uint32_t moveparent; // 0x023C
    fVector3 m_vecMinsPreScaled; // 0x0260
    fVector3 m_vecMaxsPreScaled; // 0x026C
    fVector3 m_vecMins; // 0x0278
    fVector3 m_vecMaxs; // 0x0284
    uint32_t m_usSolidFlags; // 0x0294
    uint32_t m_nSurroundType; // 0x0298
    uint32_t m_nSolidType; // 0x0299
    uint32_t m_triggerBloat; // 0x029A
    uint32_t m_bUniformTriggerBloat; // 0x029B
    fVector3 m_vecSpecifiedSurroundingMinsPreScaled; // 0x029C
    fVector3 m_vecSpecifiedSurroundingMaxsPreScaled; // 0x02A8
    fVector3 m_vecSpecifiedSurroundingMins; // 0x02B4
    fVector3 m_vecSpecifiedSurroundingMaxs; // 0x02C0
    float m_flElasticity; // 0x0320
    float m_flShadowCastDistance; // 0x0324
    fVector3 m_vecOrigin; // 0x0458
    fVector3 m_angRotation; // 0x0464
    uint32_t m_CollisionGroup; // 0x0474
    uint32_t m_bIsPlayerSimulated; // 0x0754
    uint32_t m_bSimulatedEveryTick; // 0x0755
    uint32_t m_bAnimatedEveryTick; // 0x0756
    uint32_t m_bAlternateSorting; // 0x0757
    uint32_t m_iTextureFrameIndex; // 0x0758
    uint32_t m_hOwnerEntity; // 0x0764
    uint32_t m_hEffectEntity; // 0x0768
    uint32_t m_nSkin; // 0x07D0
    uint32_t m_nBody; // 0x07D4
    uint32_t m_nHitboxSet; // 0x07D8
    float m_flPlaybackRate; // 0x080C
    fVector3 m_vecForce; // 0x0820
    uint32_t m_nForceBone; // 0x082C
    uint32_t m_bClientSideFrameReset; // 0x086C
    float m_fadeMinDist; // 0x08B0
    float m_fadeMaxDist; // 0x08B4
    float m_flFadeScale; // 0x08B8
    float m_flModelScale; // 0x091C
    float m_flModelWidthScale; // 0x091C
    uintptr_t m_flPoseParameter[24]; // 0x0920
    uintptr_t m_flEncodedController[4]; // 0x0A68
    uint32_t m_bClientSideAnimation; // 0x0AD8
    uint32_t m_nNewSequenceParity; // 0x0ADC
    uint32_t m_nResetEventsParity; // 0x0AE0
    uint32_t m_nSequence; // 0x0B08
    float m_flCycle; // 0x0B10
    uint32_t m_hLightingOrigin; // 0x0BD8
    uint32_t m_hLightingOriginRelative; // 0x0BDC
    uint32_t m_nMuzzleFlashParity; // 0x0BE0
    uint32_t m_iReapplyProvisionParity; // 0x0C88
    uint32_t m_hOuter; // 0x0C8C
    uint32_t m_ProviderType; // 0x0C94
    uint32_t m_iItemDefinitionIndex; // 0x0D10
    uint32_t m_iEntityQuality; // 0x0D14
    uint32_t m_iEntityLevel; // 0x0D18
    uint32_t m_iItemIDHigh; // 0x0D28
    uint32_t m_iItemIDLow; // 0x0D2C
    uint32_t m_iAccountID; // 0x0D30
    uint32_t m_iTeamNumber; // 0x0D98
    uint32_t m_bInitialized; // 0x0D9C
    uint32_t lengthprop20; // 0x0DE8
    uint32_t m_iAttributeDefinitionIndex; // 0x0DF0
    uint32_t m_iRawValue32; // 0x0DF4
    float m_flValue; // 0x0DF4
    uint32_t m_nRefundableCurrency; // 0x0DF8
    uint32_t m_bOnlyIterateItemViewAttributes; // 0x0E18
    uint32_t m_bValidatedAttachedEntity; // 0x0E20
    uint32_t m_hOwner; // 0x0E90
    uint32_t m_nViewModelIndex; // 0x0EA0
    float m_flNextPrimaryAttack; // 0x0EA4
    float m_flNextSecondaryAttack; // 0x0EA8
    float m_flTimeWeaponIdle; // 0x0EAC
    uint32_t m_iViewModelIndex; // 0x0EB4
    uint32_t m_iWorldModelIndex; // 0x0EB8
    uint32_t m_iState; // 0x0ED8
    uint32_t m_iPrimaryAmmoType; // 0x0EE8
    uint32_t m_iSecondaryAmmoType; // 0x0EEC
    uint32_t m_iClip1; // 0x0EF0
    uint32_t m_iClip2; // 0x0EF4
    uint32_t m_bFlipViewModel; // 0x0F20
    uint32_t m_nCustomViewmodelModelIndex; // 0x0F44
    float m_flEffectBarRegenTime; // 0x0F80
    uint32_t m_iReloadMode; // 0x0F88
    float m_flReloadPriorNextFire; // 0x0F8C
    uint32_t m_bLowered; // 0x0FA8
    float m_flLastCritCheckTime; // 0x0FB8
    uint32_t m_bResetParity; // 0x104C
    uint32_t m_bReloadedThroughAnimEvent; // 0x1064
    float m_flEnergy; // 0x1068
    uint32_t m_iConsecutiveShots; // 0x106C
    uint32_t m_bDisguiseWeapon; // 0x1070
    float m_flLastFireTime; // 0x1074
    uint32_t m_hExtraWearable; // 0x1078
    uint32_t m_hExtraWearableViewModel; // 0x107C
    float m_flObservedCritChance; // 0x1080
    uint32_t m_bBeingRepurposedForTaunt; // 0x1084
    uint32_t m_nKillComboClass; // 0x1088
    uint32_t m_nKillComboCount; // 0x108C
    float m_flInspectAnimEndTime; // 0x1090
    uint32_t m_nInspectStage; // 0x1094
    uint32_t m_iWeaponState; // 0x10A8
    uint32_t m_bCritShot; // 0x10AC
};

class CTFSodaPopper // parent CBaseEntity {
public:
    uint32_t movecollide; // 0x0000
    uint32_t movetype; // 0x0000
    uint32_t m_nRenderFX; // 0x008C
    uint32_t m_clrRender; // 0x0090
    uint32_t m_flAnimTime; // 0x00A0
    uint32_t m_flSimulationTime; // 0x00A8
    uint32_t m_ubInterpolationFrame; // 0x00B4
    uint32_t m_fEffects; // 0x00B8
    uint32_t m_nRenderMode; // 0x00BC
    uint32_t m_nNextThinkTick; // 0x00C4
    uint32_t m_nModelIndex; // 0x00CC
    uintptr_t m_nModelIndexOverrides[4]; // 0x00D0
    uint32_t m_iTeamNum; // 0x00EC
    uint32_t m_PredictableID; // 0x00F0
    float m_flGravity; // 0x020C
    uint32_t m_iParentAttachment; // 0x0226
    uint32_t moveparent; // 0x023C
    fVector3 m_vecMinsPreScaled; // 0x0260
    fVector3 m_vecMaxsPreScaled; // 0x026C
    fVector3 m_vecMins; // 0x0278
    fVector3 m_vecMaxs; // 0x0284
    uint32_t m_usSolidFlags; // 0x0294
    uint32_t m_nSurroundType; // 0x0298
    uint32_t m_nSolidType; // 0x0299
    uint32_t m_triggerBloat; // 0x029A
    uint32_t m_bUniformTriggerBloat; // 0x029B
    fVector3 m_vecSpecifiedSurroundingMinsPreScaled; // 0x029C
    fVector3 m_vecSpecifiedSurroundingMaxsPreScaled; // 0x02A8
    fVector3 m_vecSpecifiedSurroundingMins; // 0x02B4
    fVector3 m_vecSpecifiedSurroundingMaxs; // 0x02C0
    float m_flElasticity; // 0x0320
    float m_flShadowCastDistance; // 0x0324
    fVector3 m_vecOrigin; // 0x0458
    fVector3 m_angRotation; // 0x0464
    uint32_t m_CollisionGroup; // 0x0474
    uint32_t m_bIsPlayerSimulated; // 0x0754
    uint32_t m_bSimulatedEveryTick; // 0x0755
    uint32_t m_bAnimatedEveryTick; // 0x0756
    uint32_t m_bAlternateSorting; // 0x0757
    uint32_t m_iTextureFrameIndex; // 0x0758
    uint32_t m_hOwnerEntity; // 0x0764
    uint32_t m_hEffectEntity; // 0x0768
    uint32_t m_nSkin; // 0x07D0
    uint32_t m_nBody; // 0x07D4
    uint32_t m_nHitboxSet; // 0x07D8
    float m_flPlaybackRate; // 0x080C
    fVector3 m_vecForce; // 0x0820
    uint32_t m_nForceBone; // 0x082C
    uint32_t m_bClientSideFrameReset; // 0x086C
    float m_fadeMinDist; // 0x08B0
    float m_fadeMaxDist; // 0x08B4
    float m_flFadeScale; // 0x08B8
    float m_flModelScale; // 0x091C
    float m_flModelWidthScale; // 0x091C
    uintptr_t m_flPoseParameter[24]; // 0x0920
    uintptr_t m_flEncodedController[4]; // 0x0A68
    uint32_t m_bClientSideAnimation; // 0x0AD8
    uint32_t m_nNewSequenceParity; // 0x0ADC
    uint32_t m_nResetEventsParity; // 0x0AE0
    uint32_t m_nSequence; // 0x0B08
    float m_flCycle; // 0x0B10
    uint32_t m_hLightingOrigin; // 0x0BD8
    uint32_t m_hLightingOriginRelative; // 0x0BDC
    uint32_t m_nMuzzleFlashParity; // 0x0BE0
    uint32_t m_iReapplyProvisionParity; // 0x0C88
    uint32_t m_hOuter; // 0x0C8C
    uint32_t m_ProviderType; // 0x0C94
    uint32_t m_iItemDefinitionIndex; // 0x0D10
    uint32_t m_iEntityQuality; // 0x0D14
    uint32_t m_iEntityLevel; // 0x0D18
    uint32_t m_iItemIDHigh; // 0x0D28
    uint32_t m_iItemIDLow; // 0x0D2C
    uint32_t m_iAccountID; // 0x0D30
    uint32_t m_iTeamNumber; // 0x0D98
    uint32_t m_bInitialized; // 0x0D9C
    uint32_t lengthprop20; // 0x0DE8
    uint32_t m_iAttributeDefinitionIndex; // 0x0DF0
    float m_flValue; // 0x0DF4
    uint32_t m_iRawValue32; // 0x0DF4
    uint32_t m_nRefundableCurrency; // 0x0DF8
    uint32_t m_bOnlyIterateItemViewAttributes; // 0x0E18
    uint32_t m_bValidatedAttachedEntity; // 0x0E20
    uint32_t m_hOwner; // 0x0E90
    uint32_t m_nViewModelIndex; // 0x0EA0
    float m_flNextPrimaryAttack; // 0x0EA4
    float m_flNextSecondaryAttack; // 0x0EA8
    float m_flTimeWeaponIdle; // 0x0EAC
    uint32_t m_iViewModelIndex; // 0x0EB4
    uint32_t m_iWorldModelIndex; // 0x0EB8
    uint32_t m_iState; // 0x0ED8
    uint32_t m_iPrimaryAmmoType; // 0x0EE8
    uint32_t m_iSecondaryAmmoType; // 0x0EEC
    uint32_t m_iClip1; // 0x0EF0
    uint32_t m_iClip2; // 0x0EF4
    uint32_t m_bFlipViewModel; // 0x0F20
    uint32_t m_nCustomViewmodelModelIndex; // 0x0F44
    float m_flEffectBarRegenTime; // 0x0F80
    uint32_t m_iReloadMode; // 0x0F88
    float m_flReloadPriorNextFire; // 0x0F8C
    uint32_t m_bLowered; // 0x0FA8
    float m_flLastCritCheckTime; // 0x0FB8
    uint32_t m_bResetParity; // 0x104C
    uint32_t m_bReloadedThroughAnimEvent; // 0x1064
    float m_flEnergy; // 0x1068
    uint32_t m_iConsecutiveShots; // 0x106C
    uint32_t m_bDisguiseWeapon; // 0x1070
    float m_flLastFireTime; // 0x1074
    uint32_t m_hExtraWearable; // 0x1078
    uint32_t m_hExtraWearableViewModel; // 0x107C
    float m_flObservedCritChance; // 0x1080
    uint32_t m_bBeingRepurposedForTaunt; // 0x1084
    uint32_t m_nKillComboClass; // 0x1088
    uint32_t m_nKillComboCount; // 0x108C
    float m_flInspectAnimEndTime; // 0x1090
    uint32_t m_nInspectStage; // 0x1094
};

class CTFShotgun_Revenge // parent CBaseEntity {
public:
    uint32_t movecollide; // 0x0000
    uint32_t movetype; // 0x0000
    uint32_t m_nRenderFX; // 0x008C
    uint32_t m_clrRender; // 0x0090
    uint32_t m_flAnimTime; // 0x00A0
    uint32_t m_flSimulationTime; // 0x00A8
    uint32_t m_ubInterpolationFrame; // 0x00B4
    uint32_t m_fEffects; // 0x00B8
    uint32_t m_nRenderMode; // 0x00BC
    uint32_t m_nNextThinkTick; // 0x00C4
    uint32_t m_nModelIndex; // 0x00CC
    uintptr_t m_nModelIndexOverrides[4]; // 0x00D0
    uint32_t m_iTeamNum; // 0x00EC
    uint32_t m_PredictableID; // 0x00F0
    float m_flGravity; // 0x020C
    uint32_t m_iParentAttachment; // 0x0226
    uint32_t moveparent; // 0x023C
    fVector3 m_vecMinsPreScaled; // 0x0260
    fVector3 m_vecMaxsPreScaled; // 0x026C
    fVector3 m_vecMins; // 0x0278
    fVector3 m_vecMaxs; // 0x0284
    uint32_t m_usSolidFlags; // 0x0294
    uint32_t m_nSurroundType; // 0x0298
    uint32_t m_nSolidType; // 0x0299
    uint32_t m_triggerBloat; // 0x029A
    uint32_t m_bUniformTriggerBloat; // 0x029B
    fVector3 m_vecSpecifiedSurroundingMinsPreScaled; // 0x029C
    fVector3 m_vecSpecifiedSurroundingMaxsPreScaled; // 0x02A8
    fVector3 m_vecSpecifiedSurroundingMins; // 0x02B4
    fVector3 m_vecSpecifiedSurroundingMaxs; // 0x02C0
    float m_flElasticity; // 0x0320
    float m_flShadowCastDistance; // 0x0324
    fVector3 m_vecOrigin; // 0x0458
    fVector3 m_angRotation; // 0x0464
    uint32_t m_CollisionGroup; // 0x0474
    uint32_t m_bIsPlayerSimulated; // 0x0754
    uint32_t m_bSimulatedEveryTick; // 0x0755
    uint32_t m_bAnimatedEveryTick; // 0x0756
    uint32_t m_bAlternateSorting; // 0x0757
    uint32_t m_iTextureFrameIndex; // 0x0758
    uint32_t m_hOwnerEntity; // 0x0764
    uint32_t m_hEffectEntity; // 0x0768
    uint32_t m_nSkin; // 0x07D0
    uint32_t m_nBody; // 0x07D4
    uint32_t m_nHitboxSet; // 0x07D8
    float m_flPlaybackRate; // 0x080C
    fVector3 m_vecForce; // 0x0820
    uint32_t m_nForceBone; // 0x082C
    uint32_t m_bClientSideFrameReset; // 0x086C
    float m_fadeMinDist; // 0x08B0
    float m_fadeMaxDist; // 0x08B4
    float m_flFadeScale; // 0x08B8
    float m_flModelScale; // 0x091C
    float m_flModelWidthScale; // 0x091C
    uintptr_t m_flPoseParameter[24]; // 0x0920
    uintptr_t m_flEncodedController[4]; // 0x0A68
    uint32_t m_bClientSideAnimation; // 0x0AD8
    uint32_t m_nNewSequenceParity; // 0x0ADC
    uint32_t m_nResetEventsParity; // 0x0AE0
    uint32_t m_nSequence; // 0x0B08
    float m_flCycle; // 0x0B10
    uint32_t m_hLightingOrigin; // 0x0BD8
    uint32_t m_hLightingOriginRelative; // 0x0BDC
    uint32_t m_nMuzzleFlashParity; // 0x0BE0
    uint32_t m_iReapplyProvisionParity; // 0x0C88
    uint32_t m_hOuter; // 0x0C8C
    uint32_t m_ProviderType; // 0x0C94
    uint32_t m_iItemDefinitionIndex; // 0x0D10
    uint32_t m_iEntityQuality; // 0x0D14
    uint32_t m_iEntityLevel; // 0x0D18
    uint32_t m_iItemIDHigh; // 0x0D28
    uint32_t m_iItemIDLow; // 0x0D2C
    uint32_t m_iAccountID; // 0x0D30
    uint32_t m_iTeamNumber; // 0x0D98
    uint32_t m_bInitialized; // 0x0D9C
    uint32_t lengthprop20; // 0x0DE8
    uint32_t m_iAttributeDefinitionIndex; // 0x0DF0
    float m_flValue; // 0x0DF4
    uint32_t m_iRawValue32; // 0x0DF4
    uint32_t m_nRefundableCurrency; // 0x0DF8
    uint32_t m_bOnlyIterateItemViewAttributes; // 0x0E18
    uint32_t m_bValidatedAttachedEntity; // 0x0E20
    uint32_t m_hOwner; // 0x0E90
    uint32_t m_nViewModelIndex; // 0x0EA0
    float m_flNextPrimaryAttack; // 0x0EA4
    float m_flNextSecondaryAttack; // 0x0EA8
    float m_flTimeWeaponIdle; // 0x0EAC
    uint32_t m_iViewModelIndex; // 0x0EB4
    uint32_t m_iWorldModelIndex; // 0x0EB8
    uint32_t m_iState; // 0x0ED8
    uint32_t m_iPrimaryAmmoType; // 0x0EE8
    uint32_t m_iSecondaryAmmoType; // 0x0EEC
    uint32_t m_iClip1; // 0x0EF0
    uint32_t m_iClip2; // 0x0EF4
    uint32_t m_bFlipViewModel; // 0x0F20
    uint32_t m_nCustomViewmodelModelIndex; // 0x0F44
    float m_flEffectBarRegenTime; // 0x0F80
    uint32_t m_iReloadMode; // 0x0F88
    float m_flReloadPriorNextFire; // 0x0F8C
    uint32_t m_bLowered; // 0x0FA8
    float m_flLastCritCheckTime; // 0x0FB8
    uint32_t m_bResetParity; // 0x104C
    uint32_t m_bReloadedThroughAnimEvent; // 0x1064
    float m_flEnergy; // 0x1068
    uint32_t m_iConsecutiveShots; // 0x106C
    uint32_t m_bDisguiseWeapon; // 0x1070
    float m_flLastFireTime; // 0x1074
    uint32_t m_hExtraWearable; // 0x1078
    uint32_t m_hExtraWearableViewModel; // 0x107C
    float m_flObservedCritChance; // 0x1080
    uint32_t m_bBeingRepurposedForTaunt; // 0x1084
    uint32_t m_nKillComboClass; // 0x1088
    uint32_t m_nKillComboCount; // 0x108C
    float m_flInspectAnimEndTime; // 0x1090
    uint32_t m_nInspectStage; // 0x1094
};

class CTFScatterGun // parent CBaseEntity {
public:
    uint32_t movecollide; // 0x0000
    uint32_t movetype; // 0x0000
    uint32_t m_nRenderFX; // 0x008C
    uint32_t m_clrRender; // 0x0090
    uint32_t m_flAnimTime; // 0x00A0
    uint32_t m_flSimulationTime; // 0x00A8
    uint32_t m_ubInterpolationFrame; // 0x00B4
    uint32_t m_fEffects; // 0x00B8
    uint32_t m_nRenderMode; // 0x00BC
    uint32_t m_nNextThinkTick; // 0x00C4
    uint32_t m_nModelIndex; // 0x00CC
    uintptr_t m_nModelIndexOverrides[4]; // 0x00D0
    uint32_t m_iTeamNum; // 0x00EC
    uint32_t m_PredictableID; // 0x00F0
    float m_flGravity; // 0x020C
    uint32_t m_iParentAttachment; // 0x0226
    uint32_t moveparent; // 0x023C
    fVector3 m_vecMinsPreScaled; // 0x0260
    fVector3 m_vecMaxsPreScaled; // 0x026C
    fVector3 m_vecMins; // 0x0278
    fVector3 m_vecMaxs; // 0x0284
    uint32_t m_usSolidFlags; // 0x0294
    uint32_t m_nSurroundType; // 0x0298
    uint32_t m_nSolidType; // 0x0299
    uint32_t m_triggerBloat; // 0x029A
    uint32_t m_bUniformTriggerBloat; // 0x029B
    fVector3 m_vecSpecifiedSurroundingMinsPreScaled; // 0x029C
    fVector3 m_vecSpecifiedSurroundingMaxsPreScaled; // 0x02A8
    fVector3 m_vecSpecifiedSurroundingMins; // 0x02B4
    fVector3 m_vecSpecifiedSurroundingMaxs; // 0x02C0
    float m_flElasticity; // 0x0320
    float m_flShadowCastDistance; // 0x0324
    fVector3 m_vecOrigin; // 0x0458
    fVector3 m_angRotation; // 0x0464
    uint32_t m_CollisionGroup; // 0x0474
    uint32_t m_bIsPlayerSimulated; // 0x0754
    uint32_t m_bSimulatedEveryTick; // 0x0755
    uint32_t m_bAnimatedEveryTick; // 0x0756
    uint32_t m_bAlternateSorting; // 0x0757
    uint32_t m_iTextureFrameIndex; // 0x0758
    uint32_t m_hOwnerEntity; // 0x0764
    uint32_t m_hEffectEntity; // 0x0768
    uint32_t m_nSkin; // 0x07D0
    uint32_t m_nBody; // 0x07D4
    uint32_t m_nHitboxSet; // 0x07D8
    float m_flPlaybackRate; // 0x080C
    fVector3 m_vecForce; // 0x0820
    uint32_t m_nForceBone; // 0x082C
    uint32_t m_bClientSideFrameReset; // 0x086C
    float m_fadeMinDist; // 0x08B0
    float m_fadeMaxDist; // 0x08B4
    float m_flFadeScale; // 0x08B8
    float m_flModelScale; // 0x091C
    float m_flModelWidthScale; // 0x091C
    uintptr_t m_flPoseParameter[24]; // 0x0920
    uintptr_t m_flEncodedController[4]; // 0x0A68
    uint32_t m_bClientSideAnimation; // 0x0AD8
    uint32_t m_nNewSequenceParity; // 0x0ADC
    uint32_t m_nResetEventsParity; // 0x0AE0
    uint32_t m_nSequence; // 0x0B08
    float m_flCycle; // 0x0B10
    uint32_t m_hLightingOrigin; // 0x0BD8
    uint32_t m_hLightingOriginRelative; // 0x0BDC
    uint32_t m_nMuzzleFlashParity; // 0x0BE0
    uint32_t m_iReapplyProvisionParity; // 0x0C88
    uint32_t m_hOuter; // 0x0C8C
    uint32_t m_ProviderType; // 0x0C94
    uint32_t m_iItemDefinitionIndex; // 0x0D10
    uint32_t m_iEntityQuality; // 0x0D14
    uint32_t m_iEntityLevel; // 0x0D18
    uint32_t m_iItemIDHigh; // 0x0D28
    uint32_t m_iItemIDLow; // 0x0D2C
    uint32_t m_iAccountID; // 0x0D30
    uint32_t m_iTeamNumber; // 0x0D98
    uint32_t m_bInitialized; // 0x0D9C
    uint32_t lengthprop20; // 0x0DE8
    uint32_t m_iAttributeDefinitionIndex; // 0x0DF0
    float m_flValue; // 0x0DF4
    uint32_t m_iRawValue32; // 0x0DF4
    uint32_t m_nRefundableCurrency; // 0x0DF8
    uint32_t m_bOnlyIterateItemViewAttributes; // 0x0E18
    uint32_t m_bValidatedAttachedEntity; // 0x0E20
    uint32_t m_hOwner; // 0x0E90
    uint32_t m_nViewModelIndex; // 0x0EA0
    float m_flNextPrimaryAttack; // 0x0EA4
    float m_flNextSecondaryAttack; // 0x0EA8
    float m_flTimeWeaponIdle; // 0x0EAC
    uint32_t m_iViewModelIndex; // 0x0EB4
    uint32_t m_iWorldModelIndex; // 0x0EB8
    uint32_t m_iState; // 0x0ED8
    uint32_t m_iPrimaryAmmoType; // 0x0EE8
    uint32_t m_iSecondaryAmmoType; // 0x0EEC
    uint32_t m_iClip1; // 0x0EF0
    uint32_t m_iClip2; // 0x0EF4
    uint32_t m_bFlipViewModel; // 0x0F20
    uint32_t m_nCustomViewmodelModelIndex; // 0x0F44
    float m_flEffectBarRegenTime; // 0x0F80
    uint32_t m_iReloadMode; // 0x0F88
    float m_flReloadPriorNextFire; // 0x0F8C
    uint32_t m_bLowered; // 0x0FA8
    float m_flLastCritCheckTime; // 0x0FB8
    uint32_t m_bResetParity; // 0x104C
    uint32_t m_bReloadedThroughAnimEvent; // 0x1064
    float m_flEnergy; // 0x1068
    uint32_t m_iConsecutiveShots; // 0x106C
    uint32_t m_bDisguiseWeapon; // 0x1070
    float m_flLastFireTime; // 0x1074
    uint32_t m_hExtraWearable; // 0x1078
    uint32_t m_hExtraWearableViewModel; // 0x107C
    float m_flObservedCritChance; // 0x1080
    uint32_t m_bBeingRepurposedForTaunt; // 0x1084
    uint32_t m_nKillComboClass; // 0x1088
    uint32_t m_nKillComboCount; // 0x108C
    float m_flInspectAnimEndTime; // 0x1090
    uint32_t m_nInspectStage; // 0x1094
};

class CTFShotgun_Pyro // parent CBaseEntity {
public:
    uint32_t movecollide; // 0x0000
    uint32_t movetype; // 0x0000
    uint32_t m_nRenderFX; // 0x008C
    uint32_t m_clrRender; // 0x0090
    uint32_t m_flAnimTime; // 0x00A0
    uint32_t m_flSimulationTime; // 0x00A8
    uint32_t m_ubInterpolationFrame; // 0x00B4
    uint32_t m_fEffects; // 0x00B8
    uint32_t m_nRenderMode; // 0x00BC
    uint32_t m_nNextThinkTick; // 0x00C4
    uint32_t m_nModelIndex; // 0x00CC
    uintptr_t m_nModelIndexOverrides[4]; // 0x00D0
    uint32_t m_iTeamNum; // 0x00EC
    uint32_t m_PredictableID; // 0x00F0
    float m_flGravity; // 0x020C
    uint32_t m_iParentAttachment; // 0x0226
    uint32_t moveparent; // 0x023C
    fVector3 m_vecMinsPreScaled; // 0x0260
    fVector3 m_vecMaxsPreScaled; // 0x026C
    fVector3 m_vecMins; // 0x0278
    fVector3 m_vecMaxs; // 0x0284
    uint32_t m_usSolidFlags; // 0x0294
    uint32_t m_nSurroundType; // 0x0298
    uint32_t m_nSolidType; // 0x0299
    uint32_t m_triggerBloat; // 0x029A
    uint32_t m_bUniformTriggerBloat; // 0x029B
    fVector3 m_vecSpecifiedSurroundingMinsPreScaled; // 0x029C
    fVector3 m_vecSpecifiedSurroundingMaxsPreScaled; // 0x02A8
    fVector3 m_vecSpecifiedSurroundingMins; // 0x02B4
    fVector3 m_vecSpecifiedSurroundingMaxs; // 0x02C0
    float m_flElasticity; // 0x0320
    float m_flShadowCastDistance; // 0x0324
    fVector3 m_vecOrigin; // 0x0458
    fVector3 m_angRotation; // 0x0464
    uint32_t m_CollisionGroup; // 0x0474
    uint32_t m_bIsPlayerSimulated; // 0x0754
    uint32_t m_bSimulatedEveryTick; // 0x0755
    uint32_t m_bAnimatedEveryTick; // 0x0756
    uint32_t m_bAlternateSorting; // 0x0757
    uint32_t m_iTextureFrameIndex; // 0x0758
    uint32_t m_hOwnerEntity; // 0x0764
    uint32_t m_hEffectEntity; // 0x0768
    uint32_t m_nSkin; // 0x07D0
    uint32_t m_nBody; // 0x07D4
    uint32_t m_nHitboxSet; // 0x07D8
    float m_flPlaybackRate; // 0x080C
    fVector3 m_vecForce; // 0x0820
    uint32_t m_nForceBone; // 0x082C
    uint32_t m_bClientSideFrameReset; // 0x086C
    float m_fadeMinDist; // 0x08B0
    float m_fadeMaxDist; // 0x08B4
    float m_flFadeScale; // 0x08B8
    float m_flModelScale; // 0x091C
    float m_flModelWidthScale; // 0x091C
    uintptr_t m_flPoseParameter[24]; // 0x0920
    uintptr_t m_flEncodedController[4]; // 0x0A68
    uint32_t m_bClientSideAnimation; // 0x0AD8
    uint32_t m_nNewSequenceParity; // 0x0ADC
    uint32_t m_nResetEventsParity; // 0x0AE0
    uint32_t m_nSequence; // 0x0B08
    float m_flCycle; // 0x0B10
    uint32_t m_hLightingOrigin; // 0x0BD8
    uint32_t m_hLightingOriginRelative; // 0x0BDC
    uint32_t m_nMuzzleFlashParity; // 0x0BE0
    uint32_t m_iReapplyProvisionParity; // 0x0C88
    uint32_t m_hOuter; // 0x0C8C
    uint32_t m_ProviderType; // 0x0C94
    uint32_t m_iItemDefinitionIndex; // 0x0D10
    uint32_t m_iEntityQuality; // 0x0D14
    uint32_t m_iEntityLevel; // 0x0D18
    uint32_t m_iItemIDHigh; // 0x0D28
    uint32_t m_iItemIDLow; // 0x0D2C
    uint32_t m_iAccountID; // 0x0D30
    uint32_t m_iTeamNumber; // 0x0D98
    uint32_t m_bInitialized; // 0x0D9C
    uint32_t lengthprop20; // 0x0DE8
    uint32_t m_iAttributeDefinitionIndex; // 0x0DF0
    float m_flValue; // 0x0DF4
    uint32_t m_iRawValue32; // 0x0DF4
    uint32_t m_nRefundableCurrency; // 0x0DF8
    uint32_t m_bOnlyIterateItemViewAttributes; // 0x0E18
    uint32_t m_bValidatedAttachedEntity; // 0x0E20
    uint32_t m_hOwner; // 0x0E90
    uint32_t m_nViewModelIndex; // 0x0EA0
    float m_flNextPrimaryAttack; // 0x0EA4
    float m_flNextSecondaryAttack; // 0x0EA8
    float m_flTimeWeaponIdle; // 0x0EAC
    uint32_t m_iViewModelIndex; // 0x0EB4
    uint32_t m_iWorldModelIndex; // 0x0EB8
    uint32_t m_iState; // 0x0ED8
    uint32_t m_iPrimaryAmmoType; // 0x0EE8
    uint32_t m_iSecondaryAmmoType; // 0x0EEC
    uint32_t m_iClip1; // 0x0EF0
    uint32_t m_iClip2; // 0x0EF4
    uint32_t m_bFlipViewModel; // 0x0F20
    uint32_t m_nCustomViewmodelModelIndex; // 0x0F44
    float m_flEffectBarRegenTime; // 0x0F80
    uint32_t m_iReloadMode; // 0x0F88
    float m_flReloadPriorNextFire; // 0x0F8C
    uint32_t m_bLowered; // 0x0FA8
    float m_flLastCritCheckTime; // 0x0FB8
    uint32_t m_bResetParity; // 0x104C
    uint32_t m_bReloadedThroughAnimEvent; // 0x1064
    float m_flEnergy; // 0x1068
    uint32_t m_iConsecutiveShots; // 0x106C
    uint32_t m_bDisguiseWeapon; // 0x1070
    float m_flLastFireTime; // 0x1074
    uint32_t m_hExtraWearable; // 0x1078
    uint32_t m_hExtraWearableViewModel; // 0x107C
    float m_flObservedCritChance; // 0x1080
    uint32_t m_bBeingRepurposedForTaunt; // 0x1084
    uint32_t m_nKillComboClass; // 0x1088
    uint32_t m_nKillComboCount; // 0x108C
    float m_flInspectAnimEndTime; // 0x1090
    uint32_t m_nInspectStage; // 0x1094
};

class CTFParticleCannon // parent CBaseEntity {
public:
    uint32_t movecollide; // 0x0000
    uint32_t movetype; // 0x0000
    uint32_t m_nRenderFX; // 0x008C
    uint32_t m_clrRender; // 0x0090
    uint32_t m_flAnimTime; // 0x00A0
    uint32_t m_flSimulationTime; // 0x00A8
    uint32_t m_ubInterpolationFrame; // 0x00B4
    uint32_t m_fEffects; // 0x00B8
    uint32_t m_nRenderMode; // 0x00BC
    uint32_t m_nNextThinkTick; // 0x00C4
    uint32_t m_nModelIndex; // 0x00CC
    uintptr_t m_nModelIndexOverrides[4]; // 0x00D0
    uint32_t m_iTeamNum; // 0x00EC
    uint32_t m_PredictableID; // 0x00F0
    float m_flGravity; // 0x020C
    uint32_t m_iParentAttachment; // 0x0226
    uint32_t moveparent; // 0x023C
    fVector3 m_vecMinsPreScaled; // 0x0260
    fVector3 m_vecMaxsPreScaled; // 0x026C
    fVector3 m_vecMins; // 0x0278
    fVector3 m_vecMaxs; // 0x0284
    uint32_t m_usSolidFlags; // 0x0294
    uint32_t m_nSurroundType; // 0x0298
    uint32_t m_nSolidType; // 0x0299
    uint32_t m_triggerBloat; // 0x029A
    uint32_t m_bUniformTriggerBloat; // 0x029B
    fVector3 m_vecSpecifiedSurroundingMinsPreScaled; // 0x029C
    fVector3 m_vecSpecifiedSurroundingMaxsPreScaled; // 0x02A8
    fVector3 m_vecSpecifiedSurroundingMins; // 0x02B4
    fVector3 m_vecSpecifiedSurroundingMaxs; // 0x02C0
    float m_flElasticity; // 0x0320
    float m_flShadowCastDistance; // 0x0324
    fVector3 m_vecOrigin; // 0x0458
    fVector3 m_angRotation; // 0x0464
    uint32_t m_CollisionGroup; // 0x0474
    uint32_t m_bIsPlayerSimulated; // 0x0754
    uint32_t m_bSimulatedEveryTick; // 0x0755
    uint32_t m_bAnimatedEveryTick; // 0x0756
    uint32_t m_bAlternateSorting; // 0x0757
    uint32_t m_iTextureFrameIndex; // 0x0758
    uint32_t m_hOwnerEntity; // 0x0764
    uint32_t m_hEffectEntity; // 0x0768
    uint32_t m_nSkin; // 0x07D0
    uint32_t m_nBody; // 0x07D4
    uint32_t m_nHitboxSet; // 0x07D8
    float m_flPlaybackRate; // 0x080C
    fVector3 m_vecForce; // 0x0820
    uint32_t m_nForceBone; // 0x082C
    uint32_t m_bClientSideFrameReset; // 0x086C
    float m_fadeMinDist; // 0x08B0
    float m_fadeMaxDist; // 0x08B4
    float m_flFadeScale; // 0x08B8
    float m_flModelScale; // 0x091C
    float m_flModelWidthScale; // 0x091C
    uintptr_t m_flPoseParameter[24]; // 0x0920
    uintptr_t m_flEncodedController[4]; // 0x0A68
    uint32_t m_bClientSideAnimation; // 0x0AD8
    uint32_t m_nNewSequenceParity; // 0x0ADC
    uint32_t m_nResetEventsParity; // 0x0AE0
    uint32_t m_nSequence; // 0x0B08
    float m_flCycle; // 0x0B10
    uint32_t m_hLightingOrigin; // 0x0BD8
    uint32_t m_hLightingOriginRelative; // 0x0BDC
    uint32_t m_nMuzzleFlashParity; // 0x0BE0
    uint32_t m_iReapplyProvisionParity; // 0x0C88
    uint32_t m_hOuter; // 0x0C8C
    uint32_t m_ProviderType; // 0x0C94
    uint32_t m_iItemDefinitionIndex; // 0x0D10
    uint32_t m_iEntityQuality; // 0x0D14
    uint32_t m_iEntityLevel; // 0x0D18
    uint32_t m_iItemIDHigh; // 0x0D28
    uint32_t m_iItemIDLow; // 0x0D2C
    uint32_t m_iAccountID; // 0x0D30
    uint32_t m_iTeamNumber; // 0x0D98
    uint32_t m_bInitialized; // 0x0D9C
    uint32_t lengthprop20; // 0x0DE8
    uint32_t m_iAttributeDefinitionIndex; // 0x0DF0
    uint32_t m_iRawValue32; // 0x0DF4
    float m_flValue; // 0x0DF4
    uint32_t m_nRefundableCurrency; // 0x0DF8
    uint32_t m_bOnlyIterateItemViewAttributes; // 0x0E18
    uint32_t m_bValidatedAttachedEntity; // 0x0E20
    uint32_t m_hOwner; // 0x0E90
    uint32_t m_nViewModelIndex; // 0x0EA0
    float m_flNextPrimaryAttack; // 0x0EA4
    float m_flNextSecondaryAttack; // 0x0EA8
    float m_flTimeWeaponIdle; // 0x0EAC
    uint32_t m_iViewModelIndex; // 0x0EB4
    uint32_t m_iWorldModelIndex; // 0x0EB8
    uint32_t m_iState; // 0x0ED8
    uint32_t m_iPrimaryAmmoType; // 0x0EE8
    uint32_t m_iSecondaryAmmoType; // 0x0EEC
    uint32_t m_iClip1; // 0x0EF0
    uint32_t m_iClip2; // 0x0EF4
    uint32_t m_bFlipViewModel; // 0x0F20
    uint32_t m_nCustomViewmodelModelIndex; // 0x0F44
    float m_flEffectBarRegenTime; // 0x0F80
    uint32_t m_iReloadMode; // 0x0F88
    float m_flReloadPriorNextFire; // 0x0F8C
    uint32_t m_bLowered; // 0x0FA8
    float m_flLastCritCheckTime; // 0x0FB8
    uint32_t m_bResetParity; // 0x104C
    uint32_t m_bReloadedThroughAnimEvent; // 0x1064
    float m_flEnergy; // 0x1068
    uint32_t m_iConsecutiveShots; // 0x106C
    uint32_t m_bDisguiseWeapon; // 0x1070
    float m_flLastFireTime; // 0x1074
    uint32_t m_hExtraWearable; // 0x1078
    uint32_t m_hExtraWearableViewModel; // 0x107C
    float m_flObservedCritChance; // 0x1080
    uint32_t m_bBeingRepurposedForTaunt; // 0x1084
    uint32_t m_nKillComboClass; // 0x1088
    uint32_t m_nKillComboCount; // 0x108C
    float m_flInspectAnimEndTime; // 0x1090
    uint32_t m_nInspectStage; // 0x1094
    float m_flChargeBeginTime; // 0x10B0
    uint32_t m_iChargeEffect; // 0x10B4
};

class CBaseViewModel {
public:
    void* m_flPoseParameter; // 0x0000
    uint32_t m_fEffects; // 0x00B8
    uint32_t m_nModelIndex; // 0x00CC
    uint32_t m_nSkin; // 0x07D0
    uint32_t m_nBody; // 0x07D4
    float m_flPlaybackRate; // 0x080C
    uint32_t m_nNewSequenceParity; // 0x0ADC
    uint32_t m_nResetEventsParity; // 0x0AE0
    uint32_t m_nSequence; // 0x0B08
    uint32_t m_nMuzzleFlashParity; // 0x0BE0
    uint32_t m_nViewModelIndex; // 0x0C2C
    uint32_t m_hOwner; // 0x0C30
    uint32_t m_nAnimationParity; // 0x0C3C
    uint32_t m_hWeapon; // 0x0C54
};

class CTFShotgun_HWG // parent CBaseEntity {
public:
    uint32_t movecollide; // 0x0000
    uint32_t movetype; // 0x0000
    uint32_t m_nRenderFX; // 0x008C
    uint32_t m_clrRender; // 0x0090
    uint32_t m_flAnimTime; // 0x00A0
    uint32_t m_flSimulationTime; // 0x00A8
    uint32_t m_ubInterpolationFrame; // 0x00B4
    uint32_t m_fEffects; // 0x00B8
    uint32_t m_nRenderMode; // 0x00BC
    uint32_t m_nNextThinkTick; // 0x00C4
    uint32_t m_nModelIndex; // 0x00CC
    uintptr_t m_nModelIndexOverrides[4]; // 0x00D0
    uint32_t m_iTeamNum; // 0x00EC
    uint32_t m_PredictableID; // 0x00F0
    float m_flGravity; // 0x020C
    uint32_t m_iParentAttachment; // 0x0226
    uint32_t moveparent; // 0x023C
    fVector3 m_vecMinsPreScaled; // 0x0260
    fVector3 m_vecMaxsPreScaled; // 0x026C
    fVector3 m_vecMins; // 0x0278
    fVector3 m_vecMaxs; // 0x0284
    uint32_t m_usSolidFlags; // 0x0294
    uint32_t m_nSurroundType; // 0x0298
    uint32_t m_nSolidType; // 0x0299
    uint32_t m_triggerBloat; // 0x029A
    uint32_t m_bUniformTriggerBloat; // 0x029B
    fVector3 m_vecSpecifiedSurroundingMinsPreScaled; // 0x029C
    fVector3 m_vecSpecifiedSurroundingMaxsPreScaled; // 0x02A8
    fVector3 m_vecSpecifiedSurroundingMins; // 0x02B4
    fVector3 m_vecSpecifiedSurroundingMaxs; // 0x02C0
    float m_flElasticity; // 0x0320
    float m_flShadowCastDistance; // 0x0324
    fVector3 m_vecOrigin; // 0x0458
    fVector3 m_angRotation; // 0x0464
    uint32_t m_CollisionGroup; // 0x0474
    uint32_t m_bIsPlayerSimulated; // 0x0754
    uint32_t m_bSimulatedEveryTick; // 0x0755
    uint32_t m_bAnimatedEveryTick; // 0x0756
    uint32_t m_bAlternateSorting; // 0x0757
    uint32_t m_iTextureFrameIndex; // 0x0758
    uint32_t m_hOwnerEntity; // 0x0764
    uint32_t m_hEffectEntity; // 0x0768
    uint32_t m_nSkin; // 0x07D0
    uint32_t m_nBody; // 0x07D4
    uint32_t m_nHitboxSet; // 0x07D8
    float m_flPlaybackRate; // 0x080C
    fVector3 m_vecForce; // 0x0820
    uint32_t m_nForceBone; // 0x082C
    uint32_t m_bClientSideFrameReset; // 0x086C
    float m_fadeMinDist; // 0x08B0
    float m_fadeMaxDist; // 0x08B4
    float m_flFadeScale; // 0x08B8
    float m_flModelScale; // 0x091C
    float m_flModelWidthScale; // 0x091C
    uintptr_t m_flPoseParameter[24]; // 0x0920
    uintptr_t m_flEncodedController[4]; // 0x0A68
    uint32_t m_bClientSideAnimation; // 0x0AD8
    uint32_t m_nNewSequenceParity; // 0x0ADC
    uint32_t m_nResetEventsParity; // 0x0AE0
    uint32_t m_nSequence; // 0x0B08
    float m_flCycle; // 0x0B10
    uint32_t m_hLightingOrigin; // 0x0BD8
    uint32_t m_hLightingOriginRelative; // 0x0BDC
    uint32_t m_nMuzzleFlashParity; // 0x0BE0
    uint32_t m_iReapplyProvisionParity; // 0x0C88
    uint32_t m_hOuter; // 0x0C8C
    uint32_t m_ProviderType; // 0x0C94
    uint32_t m_iItemDefinitionIndex; // 0x0D10
    uint32_t m_iEntityQuality; // 0x0D14
    uint32_t m_iEntityLevel; // 0x0D18
    uint32_t m_iItemIDHigh; // 0x0D28
    uint32_t m_iItemIDLow; // 0x0D2C
    uint32_t m_iAccountID; // 0x0D30
    uint32_t m_iTeamNumber; // 0x0D98
    uint32_t m_bInitialized; // 0x0D9C
    uint32_t lengthprop20; // 0x0DE8
    uint32_t m_iAttributeDefinitionIndex; // 0x0DF0
    float m_flValue; // 0x0DF4
    uint32_t m_iRawValue32; // 0x0DF4
    uint32_t m_nRefundableCurrency; // 0x0DF8
    uint32_t m_bOnlyIterateItemViewAttributes; // 0x0E18
    uint32_t m_bValidatedAttachedEntity; // 0x0E20
    uint32_t m_hOwner; // 0x0E90
    uint32_t m_nViewModelIndex; // 0x0EA0
    float m_flNextPrimaryAttack; // 0x0EA4
    float m_flNextSecondaryAttack; // 0x0EA8
    float m_flTimeWeaponIdle; // 0x0EAC
    uint32_t m_iViewModelIndex; // 0x0EB4
    uint32_t m_iWorldModelIndex; // 0x0EB8
    uint32_t m_iState; // 0x0ED8
    uint32_t m_iPrimaryAmmoType; // 0x0EE8
    uint32_t m_iSecondaryAmmoType; // 0x0EEC
    uint32_t m_iClip1; // 0x0EF0
    uint32_t m_iClip2; // 0x0EF4
    uint32_t m_bFlipViewModel; // 0x0F20
    uint32_t m_nCustomViewmodelModelIndex; // 0x0F44
    float m_flEffectBarRegenTime; // 0x0F80
    uint32_t m_iReloadMode; // 0x0F88
    float m_flReloadPriorNextFire; // 0x0F8C
    uint32_t m_bLowered; // 0x0FA8
    float m_flLastCritCheckTime; // 0x0FB8
    uint32_t m_bResetParity; // 0x104C
    uint32_t m_bReloadedThroughAnimEvent; // 0x1064
    float m_flEnergy; // 0x1068
    uint32_t m_iConsecutiveShots; // 0x106C
    uint32_t m_bDisguiseWeapon; // 0x1070
    float m_flLastFireTime; // 0x1074
    uint32_t m_hExtraWearable; // 0x1078
    uint32_t m_hExtraWearableViewModel; // 0x107C
    float m_flObservedCritChance; // 0x1080
    uint32_t m_bBeingRepurposedForTaunt; // 0x1084
    uint32_t m_nKillComboClass; // 0x1088
    uint32_t m_nKillComboCount; // 0x108C
    float m_flInspectAnimEndTime; // 0x1090
    uint32_t m_nInspectStage; // 0x1094
};

class CTFPistol_ScoutSecondary // parent CBaseEntity {
public:
    uint32_t movecollide; // 0x0000
    uint32_t movetype; // 0x0000
    uint32_t m_nRenderFX; // 0x008C
    uint32_t m_clrRender; // 0x0090
    uint32_t m_flAnimTime; // 0x00A0
    uint32_t m_flSimulationTime; // 0x00A8
    uint32_t m_ubInterpolationFrame; // 0x00B4
    uint32_t m_fEffects; // 0x00B8
    uint32_t m_nRenderMode; // 0x00BC
    uint32_t m_nNextThinkTick; // 0x00C4
    uint32_t m_nModelIndex; // 0x00CC
    uintptr_t m_nModelIndexOverrides[4]; // 0x00D0
    uint32_t m_iTeamNum; // 0x00EC
    uint32_t m_PredictableID; // 0x00F0
    float m_flGravity; // 0x020C
    uint32_t m_iParentAttachment; // 0x0226
    uint32_t moveparent; // 0x023C
    fVector3 m_vecMinsPreScaled; // 0x0260
    fVector3 m_vecMaxsPreScaled; // 0x026C
    fVector3 m_vecMins; // 0x0278
    fVector3 m_vecMaxs; // 0x0284
    uint32_t m_usSolidFlags; // 0x0294
    uint32_t m_nSurroundType; // 0x0298
    uint32_t m_nSolidType; // 0x0299
    uint32_t m_triggerBloat; // 0x029A
    uint32_t m_bUniformTriggerBloat; // 0x029B
    fVector3 m_vecSpecifiedSurroundingMinsPreScaled; // 0x029C
    fVector3 m_vecSpecifiedSurroundingMaxsPreScaled; // 0x02A8
    fVector3 m_vecSpecifiedSurroundingMins; // 0x02B4
    fVector3 m_vecSpecifiedSurroundingMaxs; // 0x02C0
    float m_flElasticity; // 0x0320
    float m_flShadowCastDistance; // 0x0324
    fVector3 m_vecOrigin; // 0x0458
    fVector3 m_angRotation; // 0x0464
    uint32_t m_CollisionGroup; // 0x0474
    uint32_t m_bIsPlayerSimulated; // 0x0754
    uint32_t m_bSimulatedEveryTick; // 0x0755
    uint32_t m_bAnimatedEveryTick; // 0x0756
    uint32_t m_bAlternateSorting; // 0x0757
    uint32_t m_iTextureFrameIndex; // 0x0758
    uint32_t m_hOwnerEntity; // 0x0764
    uint32_t m_hEffectEntity; // 0x0768
    uint32_t m_nSkin; // 0x07D0
    uint32_t m_nBody; // 0x07D4
    uint32_t m_nHitboxSet; // 0x07D8
    float m_flPlaybackRate; // 0x080C
    fVector3 m_vecForce; // 0x0820
    uint32_t m_nForceBone; // 0x082C
    uint32_t m_bClientSideFrameReset; // 0x086C
    float m_fadeMinDist; // 0x08B0
    float m_fadeMaxDist; // 0x08B4
    float m_flFadeScale; // 0x08B8
    float m_flModelScale; // 0x091C
    float m_flModelWidthScale; // 0x091C
    uintptr_t m_flPoseParameter[24]; // 0x0920
    uintptr_t m_flEncodedController[4]; // 0x0A68
    uint32_t m_bClientSideAnimation; // 0x0AD8
    uint32_t m_nNewSequenceParity; // 0x0ADC
    uint32_t m_nResetEventsParity; // 0x0AE0
    uint32_t m_nSequence; // 0x0B08
    float m_flCycle; // 0x0B10
    uint32_t m_hLightingOrigin; // 0x0BD8
    uint32_t m_hLightingOriginRelative; // 0x0BDC
    uint32_t m_nMuzzleFlashParity; // 0x0BE0
    uint32_t m_iReapplyProvisionParity; // 0x0C88
    uint32_t m_hOuter; // 0x0C8C
    uint32_t m_ProviderType; // 0x0C94
    uint32_t m_iItemDefinitionIndex; // 0x0D10
    uint32_t m_iEntityQuality; // 0x0D14
    uint32_t m_iEntityLevel; // 0x0D18
    uint32_t m_iItemIDHigh; // 0x0D28
    uint32_t m_iItemIDLow; // 0x0D2C
    uint32_t m_iAccountID; // 0x0D30
    uint32_t m_iTeamNumber; // 0x0D98
    uint32_t m_bInitialized; // 0x0D9C
    uint32_t lengthprop20; // 0x0DE8
    uint32_t m_iAttributeDefinitionIndex; // 0x0DF0
    float m_flValue; // 0x0DF4
    uint32_t m_iRawValue32; // 0x0DF4
    uint32_t m_nRefundableCurrency; // 0x0DF8
    uint32_t m_bOnlyIterateItemViewAttributes; // 0x0E18
    uint32_t m_bValidatedAttachedEntity; // 0x0E20
    uint32_t m_hOwner; // 0x0E90
    uint32_t m_nViewModelIndex; // 0x0EA0
    float m_flNextPrimaryAttack; // 0x0EA4
    float m_flNextSecondaryAttack; // 0x0EA8
    float m_flTimeWeaponIdle; // 0x0EAC
    uint32_t m_iViewModelIndex; // 0x0EB4
    uint32_t m_iWorldModelIndex; // 0x0EB8
    uint32_t m_iState; // 0x0ED8
    uint32_t m_iPrimaryAmmoType; // 0x0EE8
    uint32_t m_iSecondaryAmmoType; // 0x0EEC
    uint32_t m_iClip1; // 0x0EF0
    uint32_t m_iClip2; // 0x0EF4
    uint32_t m_bFlipViewModel; // 0x0F20
    uint32_t m_nCustomViewmodelModelIndex; // 0x0F44
    float m_flEffectBarRegenTime; // 0x0F80
    uint32_t m_iReloadMode; // 0x0F88
    float m_flReloadPriorNextFire; // 0x0F8C
    uint32_t m_bLowered; // 0x0FA8
    float m_flLastCritCheckTime; // 0x0FB8
    uint32_t m_bResetParity; // 0x104C
    uint32_t m_bReloadedThroughAnimEvent; // 0x1064
    float m_flEnergy; // 0x1068
    uint32_t m_iConsecutiveShots; // 0x106C
    uint32_t m_bDisguiseWeapon; // 0x1070
    float m_flLastFireTime; // 0x1074
    uint32_t m_hExtraWearable; // 0x1078
    uint32_t m_hExtraWearableViewModel; // 0x107C
    float m_flObservedCritChance; // 0x1080
    uint32_t m_bBeingRepurposedForTaunt; // 0x1084
    uint32_t m_nKillComboClass; // 0x1088
    uint32_t m_nKillComboCount; // 0x108C
    float m_flInspectAnimEndTime; // 0x1090
    uint32_t m_nInspectStage; // 0x1094
};

class CTFRocketLauncher_Mortar // parent CBaseEntity {
public:
    uint32_t movecollide; // 0x0000
    uint32_t movetype; // 0x0000
    uint32_t m_nRenderFX; // 0x008C
    uint32_t m_clrRender; // 0x0090
    uint32_t m_flAnimTime; // 0x00A0
    uint32_t m_flSimulationTime; // 0x00A8
    uint32_t m_ubInterpolationFrame; // 0x00B4
    uint32_t m_fEffects; // 0x00B8
    uint32_t m_nRenderMode; // 0x00BC
    uint32_t m_nNextThinkTick; // 0x00C4
    uint32_t m_nModelIndex; // 0x00CC
    uintptr_t m_nModelIndexOverrides[4]; // 0x00D0
    uint32_t m_iTeamNum; // 0x00EC
    uint32_t m_PredictableID; // 0x00F0
    float m_flGravity; // 0x020C
    uint32_t m_iParentAttachment; // 0x0226
    uint32_t moveparent; // 0x023C
    fVector3 m_vecMinsPreScaled; // 0x0260
    fVector3 m_vecMaxsPreScaled; // 0x026C
    fVector3 m_vecMins; // 0x0278
    fVector3 m_vecMaxs; // 0x0284
    uint32_t m_usSolidFlags; // 0x0294
    uint32_t m_nSurroundType; // 0x0298
    uint32_t m_nSolidType; // 0x0299
    uint32_t m_triggerBloat; // 0x029A
    uint32_t m_bUniformTriggerBloat; // 0x029B
    fVector3 m_vecSpecifiedSurroundingMinsPreScaled; // 0x029C
    fVector3 m_vecSpecifiedSurroundingMaxsPreScaled; // 0x02A8
    fVector3 m_vecSpecifiedSurroundingMins; // 0x02B4
    fVector3 m_vecSpecifiedSurroundingMaxs; // 0x02C0
    float m_flElasticity; // 0x0320
    float m_flShadowCastDistance; // 0x0324
    fVector3 m_vecOrigin; // 0x0458
    fVector3 m_angRotation; // 0x0464
    uint32_t m_CollisionGroup; // 0x0474
    uint32_t m_bIsPlayerSimulated; // 0x0754
    uint32_t m_bSimulatedEveryTick; // 0x0755
    uint32_t m_bAnimatedEveryTick; // 0x0756
    uint32_t m_bAlternateSorting; // 0x0757
    uint32_t m_iTextureFrameIndex; // 0x0758
    uint32_t m_hOwnerEntity; // 0x0764
    uint32_t m_hEffectEntity; // 0x0768
    uint32_t m_nSkin; // 0x07D0
    uint32_t m_nBody; // 0x07D4
    uint32_t m_nHitboxSet; // 0x07D8
    float m_flPlaybackRate; // 0x080C
    fVector3 m_vecForce; // 0x0820
    uint32_t m_nForceBone; // 0x082C
    uint32_t m_bClientSideFrameReset; // 0x086C
    float m_fadeMinDist; // 0x08B0
    float m_fadeMaxDist; // 0x08B4
    float m_flFadeScale; // 0x08B8
    float m_flModelScale; // 0x091C
    float m_flModelWidthScale; // 0x091C
    uintptr_t m_flPoseParameter[24]; // 0x0920
    uintptr_t m_flEncodedController[4]; // 0x0A68
    uint32_t m_bClientSideAnimation; // 0x0AD8
    uint32_t m_nNewSequenceParity; // 0x0ADC
    uint32_t m_nResetEventsParity; // 0x0AE0
    uint32_t m_nSequence; // 0x0B08
    float m_flCycle; // 0x0B10
    uint32_t m_hLightingOrigin; // 0x0BD8
    uint32_t m_hLightingOriginRelative; // 0x0BDC
    uint32_t m_nMuzzleFlashParity; // 0x0BE0
    uint32_t m_iReapplyProvisionParity; // 0x0C88
    uint32_t m_hOuter; // 0x0C8C
    uint32_t m_ProviderType; // 0x0C94
    uint32_t m_iItemDefinitionIndex; // 0x0D10
    uint32_t m_iEntityQuality; // 0x0D14
    uint32_t m_iEntityLevel; // 0x0D18
    uint32_t m_iItemIDHigh; // 0x0D28
    uint32_t m_iItemIDLow; // 0x0D2C
    uint32_t m_iAccountID; // 0x0D30
    uint32_t m_iTeamNumber; // 0x0D98
    uint32_t m_bInitialized; // 0x0D9C
    uint32_t lengthprop20; // 0x0DE8
    uint32_t m_iAttributeDefinitionIndex; // 0x0DF0
    float m_flValue; // 0x0DF4
    uint32_t m_iRawValue32; // 0x0DF4
    uint32_t m_nRefundableCurrency; // 0x0DF8
    uint32_t m_bOnlyIterateItemViewAttributes; // 0x0E18
    uint32_t m_bValidatedAttachedEntity; // 0x0E20
    uint32_t m_hOwner; // 0x0E90
    uint32_t m_nViewModelIndex; // 0x0EA0
    float m_flNextPrimaryAttack; // 0x0EA4
    float m_flNextSecondaryAttack; // 0x0EA8
    float m_flTimeWeaponIdle; // 0x0EAC
    uint32_t m_iViewModelIndex; // 0x0EB4
    uint32_t m_iWorldModelIndex; // 0x0EB8
    uint32_t m_iState; // 0x0ED8
    uint32_t m_iPrimaryAmmoType; // 0x0EE8
    uint32_t m_iSecondaryAmmoType; // 0x0EEC
    uint32_t m_iClip1; // 0x0EF0
    uint32_t m_iClip2; // 0x0EF4
    uint32_t m_bFlipViewModel; // 0x0F20
    uint32_t m_nCustomViewmodelModelIndex; // 0x0F44
    float m_flEffectBarRegenTime; // 0x0F80
    uint32_t m_iReloadMode; // 0x0F88
    float m_flReloadPriorNextFire; // 0x0F8C
    uint32_t m_bLowered; // 0x0FA8
    float m_flLastCritCheckTime; // 0x0FB8
    uint32_t m_bResetParity; // 0x104C
    uint32_t m_bReloadedThroughAnimEvent; // 0x1064
    float m_flEnergy; // 0x1068
    uint32_t m_iConsecutiveShots; // 0x106C
    uint32_t m_bDisguiseWeapon; // 0x1070
    float m_flLastFireTime; // 0x1074
    uint32_t m_hExtraWearable; // 0x1078
    uint32_t m_hExtraWearableViewModel; // 0x107C
    float m_flObservedCritChance; // 0x1080
    uint32_t m_bBeingRepurposedForTaunt; // 0x1084
    uint32_t m_nKillComboClass; // 0x1088
    uint32_t m_nKillComboCount; // 0x108C
    float m_flInspectAnimEndTime; // 0x1090
    uint32_t m_nInspectStage; // 0x1094
};

class CTFRocketLauncher_AirStrike // parent CBaseEntity {
public:
    uint32_t movecollide; // 0x0000
    uint32_t movetype; // 0x0000
    uint32_t m_nRenderFX; // 0x008C
    uint32_t m_clrRender; // 0x0090
    uint32_t m_flAnimTime; // 0x00A0
    uint32_t m_flSimulationTime; // 0x00A8
    uint32_t m_ubInterpolationFrame; // 0x00B4
    uint32_t m_fEffects; // 0x00B8
    uint32_t m_nRenderMode; // 0x00BC
    uint32_t m_nNextThinkTick; // 0x00C4
    uint32_t m_nModelIndex; // 0x00CC
    uintptr_t m_nModelIndexOverrides[4]; // 0x00D0
    uint32_t m_iTeamNum; // 0x00EC
    uint32_t m_PredictableID; // 0x00F0
    float m_flGravity; // 0x020C
    uint32_t m_iParentAttachment; // 0x0226
    uint32_t moveparent; // 0x023C
    fVector3 m_vecMinsPreScaled; // 0x0260
    fVector3 m_vecMaxsPreScaled; // 0x026C
    fVector3 m_vecMins; // 0x0278
    fVector3 m_vecMaxs; // 0x0284
    uint32_t m_usSolidFlags; // 0x0294
    uint32_t m_nSurroundType; // 0x0298
    uint32_t m_nSolidType; // 0x0299
    uint32_t m_triggerBloat; // 0x029A
    uint32_t m_bUniformTriggerBloat; // 0x029B
    fVector3 m_vecSpecifiedSurroundingMinsPreScaled; // 0x029C
    fVector3 m_vecSpecifiedSurroundingMaxsPreScaled; // 0x02A8
    fVector3 m_vecSpecifiedSurroundingMins; // 0x02B4
    fVector3 m_vecSpecifiedSurroundingMaxs; // 0x02C0
    float m_flElasticity; // 0x0320
    float m_flShadowCastDistance; // 0x0324
    fVector3 m_vecOrigin; // 0x0458
    fVector3 m_angRotation; // 0x0464
    uint32_t m_CollisionGroup; // 0x0474
    uint32_t m_bIsPlayerSimulated; // 0x0754
    uint32_t m_bSimulatedEveryTick; // 0x0755
    uint32_t m_bAnimatedEveryTick; // 0x0756
    uint32_t m_bAlternateSorting; // 0x0757
    uint32_t m_iTextureFrameIndex; // 0x0758
    uint32_t m_hOwnerEntity; // 0x0764
    uint32_t m_hEffectEntity; // 0x0768
    uint32_t m_nSkin; // 0x07D0
    uint32_t m_nBody; // 0x07D4
    uint32_t m_nHitboxSet; // 0x07D8
    float m_flPlaybackRate; // 0x080C
    fVector3 m_vecForce; // 0x0820
    uint32_t m_nForceBone; // 0x082C
    uint32_t m_bClientSideFrameReset; // 0x086C
    float m_fadeMinDist; // 0x08B0
    float m_fadeMaxDist; // 0x08B4
    float m_flFadeScale; // 0x08B8
    float m_flModelScale; // 0x091C
    float m_flModelWidthScale; // 0x091C
    uintptr_t m_flPoseParameter[24]; // 0x0920
    uintptr_t m_flEncodedController[4]; // 0x0A68
    uint32_t m_bClientSideAnimation; // 0x0AD8
    uint32_t m_nNewSequenceParity; // 0x0ADC
    uint32_t m_nResetEventsParity; // 0x0AE0
    uint32_t m_nSequence; // 0x0B08
    float m_flCycle; // 0x0B10
    uint32_t m_hLightingOrigin; // 0x0BD8
    uint32_t m_hLightingOriginRelative; // 0x0BDC
    uint32_t m_nMuzzleFlashParity; // 0x0BE0
    uint32_t m_iReapplyProvisionParity; // 0x0C88
    uint32_t m_hOuter; // 0x0C8C
    uint32_t m_ProviderType; // 0x0C94
    uint32_t m_iItemDefinitionIndex; // 0x0D10
    uint32_t m_iEntityQuality; // 0x0D14
    uint32_t m_iEntityLevel; // 0x0D18
    uint32_t m_iItemIDHigh; // 0x0D28
    uint32_t m_iItemIDLow; // 0x0D2C
    uint32_t m_iAccountID; // 0x0D30
    uint32_t m_iTeamNumber; // 0x0D98
    uint32_t m_bInitialized; // 0x0D9C
    uint32_t lengthprop20; // 0x0DE8
    uint32_t m_iAttributeDefinitionIndex; // 0x0DF0
    float m_flValue; // 0x0DF4
    uint32_t m_iRawValue32; // 0x0DF4
    uint32_t m_nRefundableCurrency; // 0x0DF8
    uint32_t m_bOnlyIterateItemViewAttributes; // 0x0E18
    uint32_t m_bValidatedAttachedEntity; // 0x0E20
    uint32_t m_hOwner; // 0x0E90
    uint32_t m_nViewModelIndex; // 0x0EA0
    float m_flNextPrimaryAttack; // 0x0EA4
    float m_flNextSecondaryAttack; // 0x0EA8
    float m_flTimeWeaponIdle; // 0x0EAC
    uint32_t m_iViewModelIndex; // 0x0EB4
    uint32_t m_iWorldModelIndex; // 0x0EB8
    uint32_t m_iState; // 0x0ED8
    uint32_t m_iPrimaryAmmoType; // 0x0EE8
    uint32_t m_iSecondaryAmmoType; // 0x0EEC
    uint32_t m_iClip1; // 0x0EF0
    uint32_t m_iClip2; // 0x0EF4
    uint32_t m_bFlipViewModel; // 0x0F20
    uint32_t m_nCustomViewmodelModelIndex; // 0x0F44
    float m_flEffectBarRegenTime; // 0x0F80
    uint32_t m_iReloadMode; // 0x0F88
    float m_flReloadPriorNextFire; // 0x0F8C
    uint32_t m_bLowered; // 0x0FA8
    float m_flLastCritCheckTime; // 0x0FB8
    uint32_t m_bResetParity; // 0x104C
    uint32_t m_bReloadedThroughAnimEvent; // 0x1064
    float m_flEnergy; // 0x1068
    uint32_t m_iConsecutiveShots; // 0x106C
    uint32_t m_bDisguiseWeapon; // 0x1070
    float m_flLastFireTime; // 0x1074
    uint32_t m_hExtraWearable; // 0x1078
    uint32_t m_hExtraWearableViewModel; // 0x107C
    float m_flObservedCritChance; // 0x1080
    uint32_t m_bBeingRepurposedForTaunt; // 0x1084
    uint32_t m_nKillComboClass; // 0x1088
    uint32_t m_nKillComboCount; // 0x108C
    float m_flInspectAnimEndTime; // 0x1090
    uint32_t m_nInspectStage; // 0x1094
};

class CTFRocketLauncher_DirectHit // parent CBaseEntity {
public:
    uint32_t movecollide; // 0x0000
    uint32_t movetype; // 0x0000
    uint32_t m_nRenderFX; // 0x008C
    uint32_t m_clrRender; // 0x0090
    uint32_t m_flAnimTime; // 0x00A0
