class CTESoundDispatch {
public:
    uint32_t m_targetEnt; // 0x0028
    float m_seek; // 0x003C
    int64_t m_soundID; // 0x0030
    uint32_t m_soundIsStart; // 0x0038
};

class CTEEffectDispatch {
public:
    fVector3 m_vAngles; // 0x004C
    float m_vStart.x; // 0x0034
    float m_vOrigin.x; // 0x0028
    float m_vStart.y; // 0x0038
    float m_vOrigin.y; // 0x002C
    float m_vStart.z; // 0x003C
    float m_vOrigin.z; // 0x0030
    fVector3 m_vNormal; // 0x0040
    uint32_t m_effectFlags; // 0x0058
    float m_flMagnitude; // 0x0074
    float m_flScale; // 0x0070
    uint32_t m_nAttachmentIndex; // 0x007C
    uint32_t m_attachmentIndexForViewmodel; // 0x0080
    uint32_t m_nSurfaceProp; // 0x0084
    uint32_t entindex; // 0x0028
    uint32_t m_iEffectName; // 0x00A4
    uint32_t m_nDamageType; // 0x0088
    uint32_t m_sharedInt32_A; // 0x0094
    uint32_t otherentindex; // 0x0028
    uint32_t m_nOtherEntIndex; // 0x008C
    uint32_t m_sharedInt32_B; // 0x0098
    uint32_t m_iImpactEffectTableIndex; // 0x009C
    uint32_t m_nColor; // 0x00A0
    float m_flRadius; // 0x0078
};

class CRopeKeyframe {
public:
    uint32_t m_nChangeCount; // 0x1230
    uint32_t m_hEndPoint; // 0x1210
    uint32_t m_parentAttachmentHitbox; // 0x078C
    uint32_t m_iRopeMaterialModelIndex; // 0x0CBC
    uint32_t m_hStartPoint; // 0x120C
    uint32_t m_fLockedPoints; // 0x122C
    uint32_t moveparent; // 0x001C
    uint32_t m_iEndAttachment; // 0x121A
    uint32_t m_hPrevPoint; // 0x1214
    uint32_t m_iStartAttachment; // 0x1218
    uint32_t m_Slack; // 0x1224
    uint32_t m_RopeLength; // 0x1220
    float m_wiggleEndTime; // 0x0C70
    uint32_t m_RopeFlags; // 0x0CB8
    float m_TextureScale; // 0x1228
    float m_wiggleSpeed; // 0x0C7C
    uint32_t m_nSegments; // 0x1208
    uint32_t m_bConstrainBetweenEndpoints; // 0x12C0
    uint32_t m_parentAttachmentType; // 0x0020
    uint32_t m_Subdiv; // 0x121C
    float m_wiggleFadeStartTime; // 0x0C6C
    float m_Width; // 0x1234
    float m_flScrollSpeed; // 0x0CB4
    float m_ziplineAutoDetachDistance; // 0x0B38
    uint32_t m_ziplineSagEnable; // 0x0B3C
    float m_ziplineSagHeight; // 0x0B40
    float m_ziplineMoveSpeedScale; // 0x0C68
    float m_wiggleMaxLen; // 0x0C74
    float m_wiggleMagnitude; // 0x0C78
    fVector3 m_localOrigin; // 0x0004
    uint32_t m_visibilityFlags; // 0x0398
    uint32_t m_parentAttachmentIndex; // 0x0788
    uint32_t m_parentAttachmentModel; // 0x0790
    uint32_t m_hOwnerEntity; // 0x03E0
};

class CScriptNetData_SNDC_TITAN_SOUL {
public:
    uint32_t m_entities[0]; // 0x0C08
    uint32_t m_bools[0]; // 0x0BC0
    void* m_entities; // 0x0000
    void* m_bools; // 0x0000
    uint32_t m_ranges[0]; // 0x0BC8
    void* m_ranges; // 0x0000
    float m_times[0]; // 0x0BE8
    void* m_times; // 0x0000
    uint32_t m_hOwnerEntity; // 0x03E0
};

class CTEParticleSystem {
public:
    float m_vecOrigin[0]; // 0x0028
    float m_vecOrigin[1]; // 0x002C
    float m_vecOrigin[2]; // 0x0030
};

class CTEProjectileTrail {
public:
    uint32_t m_owner; // 0x0028
    fVector3 m_startPos; // 0x002C
    uint32_t m_overrideMods; // 0x004C
    fVector3 m_endPos; // 0x0038
    uint32_t m_weaponClassIndex; // 0x0044
    uint32_t m_projectileTrailIndex; // 0x0050
    uint32_t m_modBitfield; // 0x0048
};

class CPredictedFirstPersonProxy {
public:
    float m_animEndTime; // 0x0BD0
    uint32_t m_viewModelOwner; // 0x1230
    float m_animBeginTime; // 0x0BCC
    uint32_t m_sequenceTransitionerLayerActive; // 0x0D60
    float m_lockedAnimDeltaYaw; // 0x1024
    uint32_t m_camoIndex; // 0x0F88
    fVector3 002; // 0x01B4
    uint32_t m_predictedAnimEventCount; // 0x0CA8
    fVector3 m_attachmentLerpStartOrigin; // 0x076C
    uint32_t m_animSequence; // 0x001C
    uint32_t m_animModelIndex; // 0x0018
    fVector3 m_animInitialPos; // 0x0B6C
    uint32_t m_bCanUseFastPathFromServer; // 0x1019
    uint32_t 061; // 0x0A2C
    uint32_t m_nForceBone; // 0x0FB8
    fVector3 010; // 0x0214
    uint32_t m_useLockedAnimDeltaYaw; // 0x1021
    uint32_t m_sequenceTransitionerLayerModelIndex; // 0x0D64
    uint32_t m_bSequenceFinished; // 0x1020
    fVector3 m_vecForce; // 0x0088
    fVector3 m_animEntityToRefOffset; // 0x0BB0
    uint32_t 045; // 0x09EC
    uint32_t m_nSkin; // 0x0F80
    fVector3 006; // 0x01E4
    uint32_t m_bossPlayer; // 0x0104
    uint32_t m_nBody; // 0x0F84
    float m_sequenceTransitionerLayerStartTime; // 0x0D78
    float m_flModelScale; // 0x102C
    float m_animPlaybackRate; // 0x0010
    uint32_t m_animActive; // 0x0B64
    uint32_t m_animFrozen; // 0x0014
    float m_flSkyScaleEndValue; // 0x0CD4
    uint32_t m_bClientSideRagdoll; // 0x0084
    uint32_t m_passThroughThickness; // 0x03AC
    uint32_t m_syncingWithEntity; // 0x0C5C
    uint32_t m_nRagdollImpactFXTableId; // 0x0CCC
    float m_usableRadius; // 0x086C
    float m_flSkyScaleStartValue; // 0x0CD0
    float m_flSkyScaleStartTime; // 0x0CD8
    float m_flSkyScaleEndTime; // 0x0CDC
    uint32_t m_nNewSequenceParity; // 0x0020
    uint32_t m_passDamageToParent; // 0x06EC
    float m_flEstIkOffset; // 0x0094
    uint32_t m_animMotionMode; // 0x0BE0
    fVector4 m_animInitialRot; // 0x0B84
    uint32_t m_animCollisionEnabled; // 0x0B67
    uint32_t m_animNetworkFlags; // 0x0B60
    const char* m_iName; // 0x04B9
    fVector3 m_animInitialVel; // 0x0B78
    uint32_t m_predictedAnimEventSequence; // 0x0CB0
    uint32_t m_predictedAnimEventTarget; // 0x0CAC
    fVector3 004; // 0x01CC
    uint32_t m_predictedAnimEventModel; // 0x0CB4
    float m_sequenceTransitionerLayerPlaybackRate; // 0x0D74
    uint32_t m_CollisionGroup; // 0x0838
    float m_predictedAnimEventsReadyToFireTime; // 0x0CB8
    fVector3 000; // 0x019C
    fVector3 001; // 0x01A8
    fVector3 003; // 0x01C0
    uint32_t 056; // 0x0A18
    fVector3 m_animInitialCorrectPos; // 0x0B94
    fVector3 005; // 0x01D8
    fVector3 007; // 0x01F0
    uint32_t m_spottedByTeams; // 0x0880
    float m_usePromptSize; // 0x0874
    fVector4 m_animInitialCorrectRot; // 0x0BA0
    fVector4 m_animEntityToRefRotation; // 0x0BBC
    uint32_t m_animScriptSequence; // 0x0BD4
    uint32_t m_animScriptModel; // 0x0BD8
    uint32_t m_animIgnoreParentRot; // 0x0BDC
    uint32_t m_sequenceTransitionerLayerCount; // 0x0E98
    float m_sequenceTransitionerLayerStartCycle; // 0x0D68
    uint32_t 034; // 0x09C0
    uint32_t m_sequenceTransitionerLayerSequence; // 0x0D6C
    float m_sequenceTransitionerLayerFadeOutDuration; // 0x0D7C
    float m_animStartTime; // 0x0008
    float m_animStartCycle; // 0x000C
    uint32_t 052; // 0x0A08
    uint32_t m_nResetEventsParity; // 0x0F90
    fVector3 008; // 0x01FC
    fVector3 009; // 0x0208
    fVector3 011; // 0x0220
    fVector3 012; // 0x022C
    fVector3 013; // 0x0238
    fVector3 014; // 0x0244
    fVector3 015; // 0x0250
    uint32_t 016; // 0x0978
    uint32_t 017; // 0x097C
    uint32_t 018; // 0x0980
    uint32_t 019; // 0x0984
    uint32_t 020; // 0x0988
    uint32_t 021; // 0x098C
    uint32_t m_instanceNameIndex; // 0x05C4
    uint32_t 022; // 0x0990
    uint32_t 023; // 0x0994
    uint32_t m_cellX; // 0x0034
    uint32_t m_cellY; // 0x0038
    uint32_t m_parentAttachmentModel; // 0x0790
    uint32_t m_cellZ; // 0x003C
    fVector3 m_localOrigin; // 0x0040
    fVector3 m_localAngles; // 0x03CC
    uint32_t m_nModelIndex; // 0x004C
    uint32_t m_fEffects; // 0x0030
    uint32_t m_nRenderMode; // 0x03F1
    uint32_t m_nRenderFX; // 0x03E5
    uint32_t m_forceVisibleInPhaseShift; // 0x06E4
    uint32_t m_clrRender; // 0x0048
    uint32_t m_bRenderWithViewModels; // 0x03E4
    uint32_t m_iTeamNum; // 0x03A4
    uint32_t 063; // 0x0A34
    uint32_t m_passThroughFlags; // 0x03A8
    float m_passThroughDirection; // 0x03B0
    uint32_t m_contents; // 0x083C
    uint32_t m_hOwnerEntity; // 0x03E0
    uint32_t m_shieldHealth; // 0x0150
    uint32_t m_dissolveEffectEntityHandle; // 0x0858
    uint32_t movetype; // 0x0000
    uint32_t moveparent; // 0x001C
    uint32_t m_parentAttachmentIndex; // 0x0788
    float m_attachmentLerpStartTime; // 0x0764
    float m_attachmentLerpEndTime; // 0x0768
    fVector3 m_attachmentLerpStartAngles; // 0x0778
    uint32_t m_scriptNameIndex; // 0x05C0
    const char* m_holdUsePrompt; // 0x0648
    uint32_t 046; // 0x09F0
    const char* m_pressUsePrompt; // 0x0650
    const char* m_iSignifierName; // 0x04B0
    uint32_t movecollide; // 0x0000
    float m_fadeDist; // 0x0798
    uint32_t m_visibilityFlags; // 0x0398
    uint32_t m_scriptVisible; // 0x039C
    uint32_t m_usableType; // 0x0864
    uint32_t 051; // 0x0A04
    uint32_t m_usablePriority; // 0x0868
    float m_usableFOV; // 0x0870
    uint32_t m_baseTakeDamage; // 0x06E5
    uint32_t m_invulnerableToDamageCount; // 0x06E8
    uint32_t m_shieldHealthMax; // 0x0154
    uint32_t m_highlightIsNetworked; // 0x0198
    uint32_t m_areEntityLinksNetworked; // 0x092F
    uint32_t m_networkedFlags; // 0x0350
    uint32_t m_debugBrokenInterpolation; // 0x092C
    uint32_t m_entitiesLinkedFromMeCount; // 0x0930
    uint32_t m_entitiesLinkedToMeCount; // 0x0934
    uint32_t 024; // 0x0998
    uint32_t 025; // 0x099C
    uint32_t 026; // 0x09A0
    uint32_t 027; // 0x09A4
    uint32_t 028; // 0x09A8
    uint32_t 029; // 0x09AC
    uint32_t 030; // 0x09B0
    uint32_t 031; // 0x09B4
    uint32_t 032; // 0x09B8
    uint32_t 033; // 0x09BC
    uint32_t 035; // 0x09C4
    uint32_t 036; // 0x09C8
    uint32_t 037; // 0x09CC
    uint32_t 038; // 0x09D0
    uint32_t 039; // 0x09D4
    uint32_t 040; // 0x09D8
    uint32_t 041; // 0x09DC
    uint32_t 042; // 0x09E0
    uint32_t 043; // 0x09E4
    uint32_t 044; // 0x09E8
    uint32_t 047; // 0x09F4
    uint32_t 048; // 0x09F8
    uint32_t 049; // 0x09FC
    uint32_t 050; // 0x0A00
    uint32_t 053; // 0x0A0C
    uint32_t 054; // 0x0A10
    uint32_t 055; // 0x0A14
    uint32_t 057; // 0x0A1C
    uint32_t 058; // 0x0A20
    uint32_t 059; // 0x0A24
    uint32_t 060; // 0x0A28
    uint32_t 062; // 0x0A30
    uint32_t m_highlightServerContextID; // 0x032C
    uint32_t m_highlightTeamBits; // 0x0338
    uint32_t m_PredictableID; // 0x06F4
    fVector3 m_vecMins; // 0x0408
    fVector3 m_vecMaxs; // 0x0414
    uint32_t m_nSolidType; // 0x0424
    uint32_t m_usSolidFlags; // 0x0420
    uint32_t m_nSurroundType; // 0x0436
    uint32_t m_triggerBloat; // 0x0425
    fVector3 m_vecSpecifiedSurroundingMins; // 0x043C
    fVector3 m_vecSpecifiedSurroundingMaxs; // 0x0448
};

class CTEBeamSpline {
public:
    uint32_t m_nPoints; // 0x00E8
    fVector3 m_vecPoints[0]; // 0x0028
    void* m_vecPoints; // 0x0000
};

class CTEScriptParticleSystemOnEntityWithPos {
public:
    fVector3 m_origin; // 0x0040
    fVector3 m_angles; // 0x004C
    uint32_t m_effectIndex; // 0x0028
    uint32_t m_attachmentIndex2; // 0x003C
    uint32_t m_attachType2; // 0x0038
    uint32_t m_ent; // 0x002C
    uint32_t m_attachmentIndex; // 0x0034
    uint32_t m_attachType; // 0x0030
};

class CTEPhysicsProp {
public:
    float m_angRotation[2]; // 0x003C
    fVector3 m_vecOrigin; // 0x0028
    float m_angRotation[0]; // 0x0034
    uint32_t m_nSkin; // 0x0050
    float m_angRotation[1]; // 0x0038
    uint32_t m_nModelIndex; // 0x004C
    fVector3 m_vecVelocity; // 0x0040
    uint32_t m_nFlags; // 0x0054
    uint32_t m_nEffects; // 0x0058
};

class CTEBreakModel {
public:
    float m_angRotation[2]; // 0x003C
    fVector3 m_vecOrigin; // 0x0028
    float m_angRotation[0]; // 0x0034
    fVector3 m_vecSize; // 0x0040
    float m_angRotation[1]; // 0x0038
    uint32_t m_nModelIndex; // 0x005C
    fVector3 m_vecVelocity; // 0x004C
    uint32_t m_nRandomization; // 0x0058
    uint32_t m_nCount; // 0x0060
    float m_fTime; // 0x0064
    uint32_t m_nFlags; // 0x0068
};

class CTEShatterSurface {
public:
    fVector3 m_vecOrigin; // 0x0028
    float m_flWidth; // 0x0058
    fVector3 m_vecAngles; // 0x0034
    fVector3 m_vecForce; // 0x0040
    fVector3 m_vecForcePos; // 0x004C
    uint32_t m_nSurfaceType; // 0x0070
    float m_flShardSize; // 0x0060
    float m_flHeight; // 0x005C
};

class CScriptNetData_SNDC_PLAYER_EXCLUSIVE {
public:
    uint32_t m_entities[0]; // 0x0C10
    uint32_t m_bools[0]; // 0x0BC0
    void* m_entities; // 0x0000
    void* m_bools; // 0x0000
    uint32_t m_ranges[0]; // 0x0BD0
    void* m_ranges; // 0x0000
    float m_times[0]; // 0x0BF0
    void* m_times; // 0x0000
    uint32_t m_hOwnerEntity; // 0x03E0
};

class CCascadeLight {
public:
    uint32_t m_LightColor; // 0x0B67
    uint32_t m_bRenderWithViewModels; // 0x03E4
    uint32_t m_bEnabled; // 0x0B64
    uint32_t m_CollisionGroup; // 0x0838
    float m_passThroughDirection; // 0x03B0
    fVector3 m_shadowDirection; // 0x0B38
    const char* m_iSignifierName; // 0x04B0
    fVector3 m_envLightShadowDirection; // 0x0B50
    const char* m_cloudMaskName; // 0x0B6B
    uint32_t m_bEnableShadows; // 0x0B65
    const char* m_holdUsePrompt; // 0x0648
    fVector3 m_cloudOffset; // 0x0C70
    uint32_t moveparent; // 0x001C
    uint32_t movetype; // 0x0000
    float m_cloudScale; // 0x0C7C
    float m_usableRadius; // 0x086C
    uint32_t m_cellX; // 0x0034
    uint32_t m_cellY; // 0x0038
    uint32_t m_cellZ; // 0x003C
    uint32_t m_parentAttachmentModel; // 0x0790
    fVector3 m_localOrigin; // 0x0040
    uint32_t m_shieldHealthMax; // 0x0154
    fVector3 m_localAngles; // 0x03CC
    uint32_t m_nModelIndex; // 0x004C
    uint32_t m_fEffects; // 0x0030
    uint32_t m_nRenderMode; // 0x03F1
    const char* m_iName; // 0x04B9
    uint32_t m_nRenderFX; // 0x03E5
    uint32_t m_clrRender; // 0x0048
    uint32_t m_forceVisibleInPhaseShift; // 0x06E4
    uint32_t 063; // 0x0A34
    uint32_t m_passThroughFlags; // 0x03A8
    uint32_t m_iTeamNum; // 0x03A4
    uint32_t m_passThroughThickness; // 0x03AC
    float m_fadeDist; // 0x0798
    fVector3 m_attachmentLerpStartAngles; // 0x0778
    uint32_t m_contents; // 0x083C
    uint32_t m_hOwnerEntity; // 0x03E0
    uint32_t m_dissolveEffectEntityHandle; // 0x0858
    uint32_t m_shieldHealth; // 0x0150
    uint32_t m_visibilityFlags; // 0x0398
    uint32_t m_parentAttachmentIndex; // 0x0788
    float m_attachmentLerpStartTime; // 0x0764
    float m_attachmentLerpEndTime; // 0x0768
    uint32_t 051; // 0x0A04
    uint32_t m_usablePriority; // 0x0868
    fVector3 m_attachmentLerpStartOrigin; // 0x076C
    fVector3 000; // 0x019C
    uint32_t m_scriptNameIndex; // 0x05C0
    uint32_t 022; // 0x0990
    uint32_t m_instanceNameIndex; // 0x05C4
    uint32_t m_debugBrokenInterpolation; // 0x092C
    uint32_t 046; // 0x09F0
    const char* m_pressUsePrompt; // 0x0650
    uint32_t movecollide; // 0x0000
    uint32_t m_scriptVisible; // 0x039C
    uint32_t m_usableType; // 0x0864
    uint32_t m_bossPlayer; // 0x0104
    uint32_t m_entitiesLinkedFromMeCount; // 0x0930
    float m_usableFOV; // 0x0870
    float m_usePromptSize; // 0x0874
    uint32_t m_spottedByTeams; // 0x0880
    uint32_t m_baseTakeDamage; // 0x06E5
    uint32_t m_invulnerableToDamageCount; // 0x06E8
    uint32_t m_areEntityLinksNetworked; // 0x092F
    uint32_t m_highlightIsNetworked; // 0x0198
    uint32_t m_networkedFlags; // 0x0350
    uint32_t m_entitiesLinkedToMeCount; // 0x0934
    fVector3 001; // 0x01A8
    fVector3 002; // 0x01B4
    fVector3 003; // 0x01C0
    fVector3 004; // 0x01CC
    fVector3 005; // 0x01D8
    fVector3 006; // 0x01E4
    fVector3 007; // 0x01F0
    fVector3 008; // 0x01FC
    fVector3 009; // 0x0208
    fVector3 010; // 0x0214
    fVector3 011; // 0x0220
    fVector3 012; // 0x022C
    fVector3 013; // 0x0238
    fVector3 014; // 0x0244
    fVector3 015; // 0x0250
    uint32_t 016; // 0x0978
    uint32_t 017; // 0x097C
    uint32_t 018; // 0x0980
    uint32_t 019; // 0x0984
    uint32_t 020; // 0x0988
    uint32_t 021; // 0x098C
    uint32_t 023; // 0x0994
    uint32_t 024; // 0x0998
    uint32_t 025; // 0x099C
    uint32_t 026; // 0x09A0
    uint32_t 027; // 0x09A4
    uint32_t 028; // 0x09A8
    uint32_t 029; // 0x09AC
    uint32_t 030; // 0x09B0
    uint32_t 031; // 0x09B4
    uint32_t 032; // 0x09B8
    uint32_t 033; // 0x09BC
    uint32_t 034; // 0x09C0
    uint32_t 035; // 0x09C4
    uint32_t 036; // 0x09C8
    uint32_t 037; // 0x09CC
    uint32_t 038; // 0x09D0
    uint32_t 039; // 0x09D4
    uint32_t 040; // 0x09D8
    uint32_t 041; // 0x09DC
    uint32_t 042; // 0x09E0
    uint32_t 043; // 0x09E4
    uint32_t 044; // 0x09E8
    uint32_t 045; // 0x09EC
    uint32_t 047; // 0x09F4
    uint32_t 048; // 0x09F8
    uint32_t 049; // 0x09FC
    uint32_t 050; // 0x0A00
    uint32_t 052; // 0x0A08
    uint32_t 053; // 0x0A0C
    uint32_t 054; // 0x0A10
    uint32_t 055; // 0x0A14
    uint32_t 056; // 0x0A18
    uint32_t 057; // 0x0A1C
    uint32_t 058; // 0x0A20
    uint32_t 059; // 0x0A24
    uint32_t 060; // 0x0A28
    uint32_t 061; // 0x0A2C
    uint32_t 062; // 0x0A30
    uint32_t m_highlightServerContextID; // 0x032C
    uint32_t m_highlightTeamBits; // 0x0338
    uint32_t m_PredictableID; // 0x06F4
    fVector3 m_vecMins; // 0x0408
    fVector3 m_vecMaxs; // 0x0414
    uint32_t m_nSolidType; // 0x0424
    uint32_t m_usSolidFlags; // 0x0420
    uint32_t m_nSurroundType; // 0x0436
    uint32_t m_triggerBloat; // 0x0425
    fVector3 m_vecSpecifiedSurroundingMins; // 0x043C
    fVector3 m_vecSpecifiedSurroundingMaxs; // 0x0448
};

class CTEExplosion {
public:
    float m_fScale; // 0x0038
    uint32_t m_nFlags; // 0x0040
    uint32_t m_nFrameRate; // 0x003C
    fVector3 m_vecNormal; // 0x0044
    uint32_t m_chMaterialType; // 0x0050
    uint32_t m_nRadius; // 0x0054
    uint32_t m_nInnerRadius; // 0x0058
    uint32_t m_nMagnitude; // 0x005C
    uint32_t m_impactEffectTableIndex; // 0x0060
    uint32_t m_surfaceProp; // 0x0064
    uint32_t m_owner; // 0x0068
    float m_vecOrigin[2]; // 0x0030
    uint32_t m_victim; // 0x006C
    float m_vecOrigin[0]; // 0x0028
    float m_vecOrigin[1]; // 0x002C
};

class CTEBeamRingPoint {
public:
    fVector3 m_vecCenter; // 0x0068
    float m_fLife; // 0x0038
    float m_flStartRadius; // 0x0074
    uint32_t m_nModelIndex; // 0x0028
    float m_flEndRadius; // 0x0078
    uint32_t m_nHaloIndex; // 0x002C
    uint32_t m_nFrameRate; // 0x0034
    uint32_t m_nFlags; // 0x0060
    uint32_t m_nStartFrame; // 0x0030
    float m_fWidth; // 0x003C
    float m_fEndWidth; // 0x0040
    uint32_t m_nFadeLength; // 0x0044
    float m_fAmplitude; // 0x0048
    uint32_t a; // 0x0058
    uint32_t m_nSpeed; // 0x005C
    uint32_t r; // 0x004C
    uint32_t g; // 0x0050
    uint32_t b; // 0x0054
};

class CTriggerNoGrapple {
public:
    fVector3 m_vecFinalDest; // 0x0B4C
    float m_usePromptSize; // 0x0874
    uint32_t m_spottedByTeams; // 0x0880
    uint32_t m_spawnflags; // 0x0744
    float m_fadeDist; // 0x0798
    fVector3 m_attachmentLerpStartAngles; // 0x0778
    uint32_t m_contents; // 0x083C
    uint32_t m_bClientSidePredicted; // 0x0B68
    uint32_t m_movementType; // 0x0B58
    uint32_t m_nRenderMode; // 0x03F1
    float m_flMoveTargetTime; // 0x0B5C
    float m_usableRadius; // 0x086C
    uint32_t m_cellX; // 0x0034
    uint32_t m_cellY; // 0x0038
    uint32_t m_cellZ; // 0x003C
    uint32_t m_parentAttachmentModel; // 0x0790
    fVector3 m_localOrigin; // 0x0040
    uint32_t m_shieldHealthMax; // 0x0154
    fVector3 m_localAngles; // 0x03CC
    uint32_t m_nModelIndex; // 0x004C
    uint32_t m_fEffects; // 0x0030
    const char* m_iName; // 0x04B9
    uint32_t m_nRenderFX; // 0x03E5
    uint32_t m_clrRender; // 0x0048
    uint32_t m_forceVisibleInPhaseShift; // 0x06E4
    uint32_t 063; // 0x0A34
    uint32_t m_passThroughFlags; // 0x03A8
    uint32_t m_bRenderWithViewModels; // 0x03E4
    uint32_t m_iTeamNum; // 0x03A4
    uint32_t m_passThroughThickness; // 0x03AC
    uint32_t m_CollisionGroup; // 0x0838
    float m_passThroughDirection; // 0x03B0
    uint32_t m_hOwnerEntity; // 0x03E0
    uint32_t m_dissolveEffectEntityHandle; // 0x0858
    uint32_t m_shieldHealth; // 0x0150
    uint32_t moveparent; // 0x001C
    uint32_t movetype; // 0x0000
    uint32_t m_visibilityFlags; // 0x0398
    uint32_t m_parentAttachmentIndex; // 0x0788
    fVector3 003; // 0x01C0
    float m_attachmentLerpStartTime; // 0x0764
    float m_attachmentLerpEndTime; // 0x0768
    fVector3 002; // 0x01B4
    uint32_t 051; // 0x0A04
    uint32_t m_usablePriority; // 0x0868
    fVector3 m_attachmentLerpStartOrigin; // 0x076C
    fVector3 000; // 0x019C
    uint32_t m_scriptNameIndex; // 0x05C0
    uint32_t 022; // 0x0990
    uint32_t m_instanceNameIndex; // 0x05C4
    const char* m_holdUsePrompt; // 0x0648
    uint32_t m_debugBrokenInterpolation; // 0x092C
    uint32_t 046; // 0x09F0
    const char* m_pressUsePrompt; // 0x0650
    const char* m_iSignifierName; // 0x04B0
    uint32_t movecollide; // 0x0000
    uint32_t m_scriptVisible; // 0x039C
    uint32_t m_usableType; // 0x0864
    uint32_t m_bossPlayer; // 0x0104
    uint32_t m_entitiesLinkedFromMeCount; // 0x0930
    float m_usableFOV; // 0x0870
    uint32_t m_baseTakeDamage; // 0x06E5
    uint32_t m_invulnerableToDamageCount; // 0x06E8
    uint32_t m_areEntityLinksNetworked; // 0x092F
    uint32_t m_highlightIsNetworked; // 0x0198
    uint32_t m_networkedFlags; // 0x0350
    uint32_t m_entitiesLinkedToMeCount; // 0x0934
    fVector3 001; // 0x01A8
    fVector3 004; // 0x01CC
    fVector3 005; // 0x01D8
    fVector3 006; // 0x01E4
    fVector3 007; // 0x01F0
    fVector3 008; // 0x01FC
    fVector3 009; // 0x0208
    fVector3 010; // 0x0214
    fVector3 011; // 0x0220
    fVector3 012; // 0x022C
    fVector3 013; // 0x0238
    fVector3 014; // 0x0244
    fVector3 015; // 0x0250
    uint32_t 016; // 0x0978
    uint32_t 017; // 0x097C
    uint32_t 018; // 0x0980
    uint32_t 019; // 0x0984
    uint32_t 020; // 0x0988
    uint32_t 021; // 0x098C
    uint32_t 023; // 0x0994
    uint32_t 024; // 0x0998
    uint32_t 025; // 0x099C
    uint32_t 026; // 0x09A0
    uint32_t 027; // 0x09A4
    uint32_t 028; // 0x09A8
    uint32_t 029; // 0x09AC
    uint32_t 030; // 0x09B0
    uint32_t 031; // 0x09B4
    uint32_t 032; // 0x09B8
    uint32_t 033; // 0x09BC
    uint32_t 034; // 0x09C0
    uint32_t 035; // 0x09C4
    uint32_t 036; // 0x09C8
    uint32_t 037; // 0x09CC
    uint32_t 038; // 0x09D0
    uint32_t 039; // 0x09D4
    uint32_t 040; // 0x09D8
    uint32_t 041; // 0x09DC
    uint32_t 042; // 0x09E0
    uint32_t 043; // 0x09E4
    uint32_t 044; // 0x09E8
    uint32_t 045; // 0x09EC
    uint32_t 047; // 0x09F4
    uint32_t 048; // 0x09F8
    uint32_t 049; // 0x09FC
    uint32_t 050; // 0x0A00
    uint32_t 052; // 0x0A08
    uint32_t 053; // 0x0A0C
    uint32_t 054; // 0x0A10
    uint32_t 055; // 0x0A14
    uint32_t 056; // 0x0A18
    uint32_t 057; // 0x0A1C
    uint32_t 058; // 0x0A20
    uint32_t 059; // 0x0A24
    uint32_t 060; // 0x0A28
    uint32_t 061; // 0x0A2C
    uint32_t 062; // 0x0A30
    uint32_t m_highlightServerContextID; // 0x032C
    uint32_t m_highlightTeamBits; // 0x0338
    uint32_t m_PredictableID; // 0x06F4
    fVector3 m_vecMins; // 0x0408
    fVector3 m_vecMaxs; // 0x0414
    uint32_t m_nSolidType; // 0x0424
    uint32_t m_usSolidFlags; // 0x0420
    uint32_t m_nSurroundType; // 0x0436
    uint32_t m_triggerBloat; // 0x0425
    fVector3 m_vecSpecifiedSurroundingMins; // 0x043C
    fVector3 m_vecSpecifiedSurroundingMaxs; // 0x0448
};

class CTEBeamRing {
public:
    uint32_t m_nStartEntity; // 0x0068
    uint32_t m_nEndEntity; // 0x006C
    uint32_t m_nModelIndex; // 0x0028
    uint32_t m_nHaloIndex; // 0x002C
    uint32_t m_nFrameRate; // 0x0034
    uint32_t m_nFlags; // 0x0060
    uint32_t m_nStartFrame; // 0x0030
    float m_fWidth; // 0x003C
    float m_fLife; // 0x0038
    float m_fEndWidth; // 0x0040
    uint32_t m_nFadeLength; // 0x0044
    float m_fAmplitude; // 0x0048
    uint32_t a; // 0x0058
    uint32_t m_nSpeed; // 0x005C
    uint32_t r; // 0x004C
    uint32_t g; // 0x0050
    uint32_t b; // 0x0054
};

class ScriptMoverLightweight {
public:
    uint32_t m_cellX; // 0x0034
    uint32_t moveparent; // 0x001C
    uint32_t m_cellY; // 0x0038
    fVector3 m_vecAngVelocity; // 0x0108
    uint32_t m_parentAttachmentModel; // 0x0790
    uint32_t m_cellZ; // 0x003C
    uint32_t m_parentAttachmentHitbox; // 0x078C
    fVector3 m_vecVelocity; // 0x03C0
    fVector3 m_localOrigin; // 0x0040
    fVector3 m_localAngles; // 0x03CC
    uint32_t m_parentAttachmentType; // 0x0020
    uint32_t m_parentAttachmentIndex; // 0x0788
    uint32_t m_nModelIndex; // 0x004C
    float m_fadeDist; // 0x0798
    uint32_t m_fEffects; // 0x0030
    uint32_t m_networkedFlags; // 0x0350
    uint32_t m_bCanUseFastPathFromServer; // 0x1019
};

class CTEBeamPoints {
public:
    uint32_t m_nFadeLength; // 0x0044
    fVector3 m_vecStartPoint; // 0x0068
    fVector3 m_vecEndPoint; // 0x0074
    uint32_t m_nModelIndex; // 0x0028
    uint32_t m_nHaloIndex; // 0x002C
    uint32_t m_nFrameRate; // 0x0034
    uint32_t m_nFlags; // 0x0060
    uint32_t m_nStartFrame; // 0x0030
    float m_fWidth; // 0x003C
    float m_fLife; // 0x0038
    float m_fEndWidth; // 0x0040
    float m_fAmplitude; // 0x0048
    uint32_t a; // 0x0058
    uint32_t m_nSpeed; // 0x005C
    uint32_t r; // 0x004C
    uint32_t g; // 0x0050
    uint32_t b; // 0x0054
};

class CPlayerDecoy {
public:
    float m_flSkyScaleStartTime; // 0x0CD8
    float m_cloakFlickerEndTime; // 0x0190
    uint32_t m_currentState; // 0x1230
    fVector3 m_animInitialPos; // 0x0B6C
    uint32_t m_bCanUseFastPathFromServer; // 0x1019
    uint32_t m_decoyFlags; // 0x1234
    uint32_t m_iTeamNum; // 0x03A4
    float m_lastPulseTime; // 0x123C
    float m_flSkyScaleEndTime; // 0x0CDC
    float m_cloakFadeInEndTime; // 0x0180
    uint32_t m_iHealth; // 0x0390
    uint32_t m_passDamageToParent; // 0x06EC
    uint32_t m_iMaxHealth; // 0x04A8
    uint32_t m_fEffects; // 0x0030
    float m_cloakEndTime; // 0x017C
    fVector3 m_animEntityToRefOffset; // 0x0BB0
    uint32_t 045; // 0x09EC
    uint32_t m_nSkin; // 0x0F80
    fVector3 009; // 0x0208
    float m_cloakFadeOutStartTime; // 0x0184
    float m_cloakFadeInDuration; // 0x0188
    fVector3 003; // 0x01C0
    float m_cloakFlickerAmount; // 0x018C
    uint32_t m_camoIndex; // 0x0F88
    uint32_t m_nameVisibilityFlags; // 0x08A8
    fVector3 002; // 0x01B4
    uint32_t m_predictedAnimEventCount; // 0x0CA8
    fVector3 m_attachmentLerpStartOrigin; // 0x076C
    uint32_t m_animSequence; // 0x001C
    uint32_t m_animModelIndex; // 0x0018
    uint32_t m_bSequenceFinished; // 0x1020
    uint32_t 061; // 0x0A2C
    uint32_t m_nForceBone; // 0x0FB8
    fVector3 010; // 0x0214
    uint32_t m_useLockedAnimDeltaYaw; // 0x1021
    float m_lockedAnimDeltaYaw; // 0x1024
    fVector3 m_vecForce; // 0x0088
    fVector3 006; // 0x01E4
    uint32_t m_bossPlayer; // 0x0104
    uint32_t m_nBody; // 0x0F84
    float m_flModelScale; // 0x102C
    float m_animPlaybackRate; // 0x0010
    uint32_t m_animActive; // 0x0B64
    uint32_t m_animFrozen; // 0x0014
    float m_flSkyScaleEndValue; // 0x0CD4
    uint32_t m_bClientSideRagdoll; // 0x0084
    uint32_t m_passThroughThickness; // 0x03AC
    uint32_t m_syncingWithEntity; // 0x0C5C
    uint32_t m_nRagdollImpactFXTableId; // 0x0CCC
    float m_usableRadius; // 0x086C
    float m_flSkyScaleStartValue; // 0x0CD0
    uint32_t m_nNewSequenceParity; // 0x0020
    float m_flEstIkOffset; // 0x0094
    fVector4 m_animInitialRot; // 0x0B84
    uint32_t m_animCollisionEnabled; // 0x0B67
    uint32_t m_animNetworkFlags; // 0x0B60
    const char* m_iName; // 0x04B9
    fVector3 m_animInitialVel; // 0x0B78
    uint32_t m_predictedAnimEventSequence; // 0x0CB0
    uint32_t m_predictedAnimEventTarget; // 0x0CAC
    fVector3 004; // 0x01CC
    uint32_t m_predictedAnimEventModel; // 0x0CB4
    uint32_t m_CollisionGroup; // 0x0838
    float m_predictedAnimEventsReadyToFireTime; // 0x0CB8
    fVector3 000; // 0x019C
    fVector3 001; // 0x01A8
    uint32_t 056; // 0x0A18
    fVector3 m_animInitialCorrectPos; // 0x0B94
    fVector3 005; // 0x01D8
    fVector3 007; // 0x01F0
    uint32_t m_spottedByTeams; // 0x0880
    float m_usePromptSize; // 0x0874
    fVector4 m_animInitialCorrectRot; // 0x0BA0
    fVector4 m_animEntityToRefRotation; // 0x0BBC
    float m_animEndTime; // 0x0BD0
    float m_animBeginTime; // 0x0BCC
    uint32_t m_animScriptSequence; // 0x0BD4
    uint32_t m_animScriptModel; // 0x0BD8
    uint32_t m_animIgnoreParentRot; // 0x0BDC
    uint32_t m_animMotionMode; // 0x0BE0
    uint32_t m_sequenceTransitionerLayerCount; // 0x0E98
    uint32_t m_sequenceTransitionerLayerActive; // 0x0D60
    uint32_t m_sequenceTransitionerLayerModelIndex; // 0x0D64
    float m_sequenceTransitionerLayerStartCycle; // 0x0D68
    uint32_t 034; // 0x09C0
    uint32_t m_sequenceTransitionerLayerSequence; // 0x0D6C
    float m_sequenceTransitionerLayerPlaybackRate; // 0x0D74
    float m_sequenceTransitionerLayerStartTime; // 0x0D78
    float m_sequenceTransitionerLayerFadeOutDuration; // 0x0D7C
    float m_animStartTime; // 0x0008
    float m_animStartCycle; // 0x000C
    uint32_t 052; // 0x0A08
    uint32_t m_nResetEventsParity; // 0x0F90
    fVector3 008; // 0x01FC
    fVector3 011; // 0x0220
    fVector3 012; // 0x022C
    fVector3 013; // 0x0238
    fVector3 014; // 0x0244
    fVector3 015; // 0x0250
    uint32_t 016; // 0x0978
    uint32_t 017; // 0x097C
    uint32_t 018; // 0x0980
    uint32_t 019; // 0x0984
    uint32_t 020; // 0x0988
    uint32_t 021; // 0x098C
    uint32_t m_instanceNameIndex; // 0x05C4
    uint32_t 022; // 0x0990
    uint32_t 023; // 0x0994
    uint32_t m_cellX; // 0x0034
    uint32_t m_cellY; // 0x0038
    uint32_t m_parentAttachmentModel; // 0x0790
    uint32_t m_cellZ; // 0x003C
    fVector3 m_localOrigin; // 0x0040
    fVector3 m_localAngles; // 0x03CC
    uint32_t m_nModelIndex; // 0x004C
    uint32_t m_nRenderMode; // 0x03F1
    uint32_t m_nRenderFX; // 0x03E5
    uint32_t m_forceVisibleInPhaseShift; // 0x06E4
    uint32_t m_clrRender; // 0x0048
    uint32_t m_bRenderWithViewModels; // 0x03E4
    uint32_t 063; // 0x0A34
    uint32_t m_passThroughFlags; // 0x03A8
    float m_passThroughDirection; // 0x03B0
    uint32_t m_contents; // 0x083C
    uint32_t m_hOwnerEntity; // 0x03E0
    uint32_t m_shieldHealth; // 0x0150
    uint32_t m_dissolveEffectEntityHandle; // 0x0858
    uint32_t movetype; // 0x0000
    uint32_t moveparent; // 0x001C
    uint32_t m_parentAttachmentIndex; // 0x0788
    float m_attachmentLerpStartTime; // 0x0764
    float m_attachmentLerpEndTime; // 0x0768
    fVector3 m_attachmentLerpStartAngles; // 0x0778
    uint32_t m_scriptNameIndex; // 0x05C0
    const char* m_holdUsePrompt; // 0x0648
    uint32_t 046; // 0x09F0
    const char* m_pressUsePrompt; // 0x0650
    const char* m_iSignifierName; // 0x04B0
    uint32_t movecollide; // 0x0000
    float m_fadeDist; // 0x0798
    uint32_t m_visibilityFlags; // 0x0398
    uint32_t m_scriptVisible; // 0x039C
    uint32_t m_usableType; // 0x0864
    uint32_t 051; // 0x0A04
    uint32_t m_usablePriority; // 0x0868
    float m_usableFOV; // 0x0870
    uint32_t m_baseTakeDamage; // 0x06E5
    uint32_t m_invulnerableToDamageCount; // 0x06E8
    uint32_t m_shieldHealthMax; // 0x0154
    uint32_t m_highlightIsNetworked; // 0x0198
    uint32_t m_areEntityLinksNetworked; // 0x092F
    uint32_t m_networkedFlags; // 0x0350
    uint32_t m_debugBrokenInterpolation; // 0x092C
    uint32_t m_entitiesLinkedFromMeCount; // 0x0930
    uint32_t m_entitiesLinkedToMeCount; // 0x0934
    uint32_t 024; // 0x0998
    uint32_t 025; // 0x099C
    uint32_t 026; // 0x09A0
    uint32_t 027; // 0x09A4
    uint32_t 028; // 0x09A8
    uint32_t 029; // 0x09AC
    uint32_t 030; // 0x09B0
    uint32_t 031; // 0x09B4
    uint32_t 032; // 0x09B8
    uint32_t 033; // 0x09BC
    uint32_t 035; // 0x09C4
    uint32_t 036; // 0x09C8
    uint32_t 037; // 0x09CC
    uint32_t 038; // 0x09D0
    uint32_t 039; // 0x09D4
    uint32_t 040; // 0x09D8
    uint32_t 041; // 0x09DC
    uint32_t 042; // 0x09E0
    uint32_t 043; // 0x09E4
    uint32_t 044; // 0x09E8
    uint32_t 047; // 0x09F4
    uint32_t 048; // 0x09F8
    uint32_t 049; // 0x09FC
    uint32_t 050; // 0x0A00
    uint32_t 053; // 0x0A0C
    uint32_t 054; // 0x0A10
    uint32_t 055; // 0x0A14
    uint32_t 057; // 0x0A1C
    uint32_t 058; // 0x0A20
    uint32_t 059; // 0x0A24
    uint32_t 060; // 0x0A28
    uint32_t 062; // 0x0A30
    uint32_t m_highlightServerContextID; // 0x032C
    uint32_t m_highlightTeamBits; // 0x0338
    uint32_t m_PredictableID; // 0x06F4
    fVector3 m_vecMins; // 0x0408
    fVector3 m_vecMaxs; // 0x0414
    uint32_t m_nSolidType; // 0x0424
    uint32_t m_usSolidFlags; // 0x0420
    uint32_t m_nSurroundType; // 0x0436
    uint32_t m_triggerBloat; // 0x0425
    fVector3 m_vecSpecifiedSurroundingMins; // 0x043C
    fVector3 m_vecSpecifiedSurroundingMaxs; // 0x0448
};

class CTEBeamLaser {
public:
    uint32_t m_nStartEntity; // 0x0068
    uint32_t m_nEndEntity; // 0x006C
    uint32_t m_nModelIndex; // 0x0028
    uint32_t m_nHaloIndex; // 0x002C
    uint32_t m_nFrameRate; // 0x0034
    uint32_t m_nFlags; // 0x0060
    uint32_t m_nStartFrame; // 0x0030
    float m_fWidth; // 0x003C
    float m_fLife; // 0x0038
    float m_fEndWidth; // 0x0040
    uint32_t m_nFadeLength; // 0x0044
    float m_fAmplitude; // 0x0048
    uint32_t a; // 0x0058
    uint32_t m_nSpeed; // 0x005C
    uint32_t r; // 0x004C
    uint32_t g; // 0x0050
    uint32_t b; // 0x0054
};

class CAI_BaseNPC {
public:
    uint32_t m_isHologram; // 0x17E0
    uint32_t m_iHealth; // 0x0390
    float objectScale; // 0x08A4
    uint32_t m_lifeState; // 0x06C8
    float m_flSkyScaleEndValue; // 0x0CD4
    uint32_t m_fireteamSlotIndex; // 0x1698
    uint32_t m_iMaxHealth; // 0x04A8
    uint32_t m_lastCycleSlot; // 0x157C
    uint32_t 024; // 0x0998
    const char* m_title; // 0x17E1
    int64_t visibilityShowFlag; // 0x0890
    uint32_t m_aiSettingsIndex; // 0x1804
    float m_cloakFlickerEndTime; // 0x0190
    uint32_t m_subclass; // 0x1808
    uint32_t m_aiSprinting; // 0x17BA
    fVector3 007; // 0x01F0
    uint32_t m_aiNetworkFlags; // 0x17DC
    fVector3 m_localOrigin; // 0x0040
    fVector3 m_localAngles; // 0x03CC
    uint32_t 035; // 0x09C4
    uint32_t customState; // 0x08A0
    fVector3 m_meleeExecutionUnstuckPosition; // 0x15D4
    uint32_t m_hGroundEntity; // 0x038C
    fVector3 004; // 0x01CC
    uint32_t m_latestNonOffhandWeapon; // 0x1578
    uint32_t seComboVars; // 0x16A8
    uint32_t m_fEffects; // 0x0030
    float m_cloakEndTime; // 0x017C
    float seTimeEnd; // 0x16AC
    uint32_t m_nameVisibilityFlags; // 0x08A8
    float seEaseOut; // 0x16B0
    uint32_t activeWeapon; // 0x1588
    float m_raiseFromMeleeEndTime; // 0x1518
    uint32_t m_selectedWeapon; // 0x1570
    uint32_t flags; // 0x0898
    float m_lastSharedEnergyRegenTime; // 0x1524
    uint32_t 030; // 0x09B0
    uint32_t m_latestPrimaryWeapon; // 0x1574
    uint32_t 061; // 0x0A2C
    uint32_t m_nForceBone; // 0x0FB8
    uint32_t m_weaponGettingSwitchedOut; // 0x0008
    uint32_t 055; // 0x0A14
    float m_vecViewOffset[2]; // 0x002C
    uint32_t m_weaponDisabled; // 0x15A5
    uint32_t m_showNewWeapon3p; // 0x000C
    fVector3 m_animInitialPos; // 0x0B6C
    uint32_t m_weaponPermission; // 0x1580
    uint32_t m_contextAction; // 0x15B4
    uint32_t m_hudInfo_visibilityTestAlwaysPasses; // 0x15A6
    uint32_t zOrder; // 0x089C
    uint32_t m_networkedFlags; // 0x0350
    uint32_t 058; // 0x0A20
    uint32_t m_sharedEnergyTotal; // 0x1520
    float m_lastFiredTime; // 0x1514
    float m_phaseShiftTimeStart; // 0x15E4
    uint32_t m_nSurroundType; // 0x0436
    uint32_t m_sharedEnergyCount; // 0x151C
    float m_sharedEnergyRegenRate; // 0x1528
    fVector3 001; // 0x01A8
    float m_sharedEnergyRegenDelay; // 0x152C
    float m_lastSharedEnergyTakeTime; // 0x1530
    float m_phaseShiftTimeEnd; // 0x15E8
    float m_flNextAttack; // 0x1510
    fVector3 014; // 0x0244
    float m_vecViewOffset[1]; // 0x0028
    float m_cloakFadeInEndTime; // 0x0180
    fVector3 009; // 0x0208
    float m_cloakFadeOutStartTime; // 0x0184
    float m_cloakFadeInDuration; // 0x0188
    fVector3 003; // 0x01C0
    float m_cloakFlickerAmount; // 0x018C
    uint32_t m_baseTakeDamage; // 0x06E5
    fVector3 m_deathVelocity; // 0x03B4
    float m_vecViewOffset[0]; // 0x0024
    float m_sequenceTransitionerLayerPlaybackRate; // 0x0D74
    const char* m_targetInfoIconName; // 0x1634
    uint32_t m_numRodeoSlots; // 0x0024
    fVector3 000; // 0x019C
    fVector3 002; // 0x01B4
    int64_t visibilityDefaultFlag; // 0x0888
    fVector3 005; // 0x01D8
    fVector3 006; // 0x01E4
    uint32_t m_AnimOverlayCount; // 0x12F8
    fVector3 m_attachmentLerpStartOrigin; // 0x076C
    uint32_t m_animSequence; // 0x001C
    uint32_t m_animModelIndex; // 0x0018
    uint32_t m_bSequenceFinished; // 0x1020
    fVector3 010; // 0x0214
    uint32_t m_useLockedAnimDeltaYaw; // 0x1021
    float m_lockedAnimDeltaYaw; // 0x1024
    uint32_t m_bCanUseFastPathFromServer; // 0x1019
    fVector3 m_vecForce; // 0x0088
    uint32_t 045; // 0x09EC
    uint32_t m_nSkin; // 0x0F80
    uint32_t m_bossPlayer; // 0x0104
    uint32_t m_nBody; // 0x0F84
    float m_flModelScale; // 0x102C
    float m_animPlaybackRate; // 0x0010
    uint32_t m_animFrozen; // 0x0014
    uint32_t m_bClientSideRagdoll; // 0x0084
    uint32_t m_nRagdollImpactFXTableId; // 0x0CCC
    float m_usableRadius; // 0x086C
    float m_flSkyScaleStartValue; // 0x0CD0
    float m_flSkyScaleStartTime; // 0x0CD8
    float m_flSkyScaleEndTime; // 0x0CDC
    uint32_t m_nNewSequenceParity; // 0x0020
    uint32_t m_passDamageToParent; // 0x06EC
    float m_flEstIkOffset; // 0x0094
    uint32_t m_animActive; // 0x0B64
    uint32_t m_animCollisionEnabled; // 0x0B67
    uint32_t m_animNetworkFlags; // 0x0B60
    uint32_t m_passThroughThickness; // 0x03AC
    uint32_t m_syncingWithEntity; // 0x0C5C
    uint32_t m_predictedAnimEventCount; // 0x0CA8
    uint32_t m_predictedAnimEventTarget; // 0x0CAC
    uint32_t m_predictedAnimEventSequence; // 0x0CB0
    uint32_t m_predictedAnimEventModel; // 0x0CB4
    uint32_t m_CollisionGroup; // 0x0838
    float m_predictedAnimEventsReadyToFireTime; // 0x0CB8
    const char* m_iName; // 0x04B9
    fVector3 m_animInitialVel; // 0x0B78
    fVector4 m_animInitialRot; // 0x0B84
    uint32_t 056; // 0x0A18
    fVector3 m_animInitialCorrectPos; // 0x0B94
    uint32_t m_spottedByTeams; // 0x0880
    float m_usePromptSize; // 0x0874
    fVector4 m_animInitialCorrectRot; // 0x0BA0
    fVector3 m_animEntityToRefOffset; // 0x0BB0
    fVector4 m_animEntityToRefRotation; // 0x0BBC
    float m_animBeginTime; // 0x0BCC
    float m_animEndTime; // 0x0BD0
    uint32_t m_animScriptSequence; // 0x0BD4
    uint32_t m_animScriptModel; // 0x0BD8
    uint32_t m_animIgnoreParentRot; // 0x0BDC
    uint32_t m_animMotionMode; // 0x0BE0
    uint32_t m_sequenceTransitionerLayerCount; // 0x0E98
    uint32_t m_sequenceTransitionerLayerActive; // 0x0D60
    uint32_t m_sequenceTransitionerLayerModelIndex; // 0x0D64
    float m_sequenceTransitionerLayerStartCycle; // 0x0D68
    uint32_t 034; // 0x09C0
    uint32_t m_sequenceTransitionerLayerSequence; // 0x0D6C
    float m_sequenceTransitionerLayerStartTime; // 0x0D78
    float m_sequenceTransitionerLayerFadeOutDuration; // 0x0D7C
    float m_animStartTime; // 0x0008
    float m_animStartCycle; // 0x000C
    uint32_t 052; // 0x0A08
    uint32_t m_nResetEventsParity; // 0x0F90
    fVector3 008; // 0x01FC
    fVector3 011; // 0x0220
    fVector3 012; // 0x022C
    fVector3 013; // 0x0238
    fVector3 015; // 0x0250
    uint32_t 016; // 0x0978
    uint32_t 017; // 0x097C
    uint32_t 018; // 0x0980
    uint32_t 019; // 0x0984
    uint32_t 020; // 0x0988
    uint32_t 021; // 0x098C
    uint32_t m_instanceNameIndex; // 0x05C4
    uint32_t 022; // 0x0990
    uint32_t 023; // 0x0994
    uint32_t m_cellX; // 0x0034
    uint32_t m_cellY; // 0x0038
    uint32_t m_parentAttachmentModel; // 0x0790
    uint32_t m_cellZ; // 0x003C
    uint32_t m_nModelIndex; // 0x004C
    uint32_t m_nRenderMode; // 0x03F1
    uint32_t m_nRenderFX; // 0x03E5
    uint32_t m_forceVisibleInPhaseShift; // 0x06E4
    uint32_t m_clrRender; // 0x0048
    uint32_t m_bRenderWithViewModels; // 0x03E4
    uint32_t m_iTeamNum; // 0x03A4
    uint32_t 063; // 0x0A34
    uint32_t m_passThroughFlags; // 0x03A8
    float m_passThroughDirection; // 0x03B0
    uint32_t m_contents; // 0x083C
    uint32_t m_hOwnerEntity; // 0x03E0
    uint32_t m_shieldHealth; // 0x0150
    uint32_t m_dissolveEffectEntityHandle; // 0x0858
    uint32_t movetype; // 0x0000
    uint32_t moveparent; // 0x001C
    uint32_t m_parentAttachmentIndex; // 0x0788
    float m_attachmentLerpStartTime; // 0x0764
    float m_attachmentLerpEndTime; // 0x0768
    fVector3 m_attachmentLerpStartAngles; // 0x0778
    uint32_t m_scriptNameIndex; // 0x05C0
    const char* m_holdUsePrompt; // 0x0648
    uint32_t 046; // 0x09F0
    const char* m_pressUsePrompt; // 0x0650
    const char* m_iSignifierName; // 0x04B0
    uint32_t movecollide; // 0x0000
    float m_fadeDist; // 0x0798
    uint32_t m_visibilityFlags; // 0x0398
    uint32_t m_scriptVisible; // 0x039C
    uint32_t m_usableType; // 0x0864
    uint32_t 051; // 0x0A04
    uint32_t m_usablePriority; // 0x0868
    float m_usableFOV; // 0x0870
    uint32_t m_invulnerableToDamageCount; // 0x06E8
    uint32_t m_shieldHealthMax; // 0x0154
    uint32_t m_highlightIsNetworked; // 0x0198
    uint32_t m_areEntityLinksNetworked; // 0x092F
    uint32_t m_debugBrokenInterpolation; // 0x092C
    uint32_t m_entitiesLinkedFromMeCount; // 0x0930
    uint32_t m_entitiesLinkedToMeCount; // 0x0934
    uint32_t 025; // 0x099C
    uint32_t 026; // 0x09A0
    uint32_t 027; // 0x09A4
    uint32_t 028; // 0x09A8
    uint32_t 029; // 0x09AC
    uint32_t 031; // 0x09B4
    uint32_t 032; // 0x09B8
    uint32_t 033; // 0x09BC
    uint32_t 036; // 0x09C8
    uint32_t 037; // 0x09CC
    uint32_t 038; // 0x09D0
    uint32_t 039; // 0x09D4
    uint32_t 040; // 0x09D8
    uint32_t 041; // 0x09DC
    uint32_t 042; // 0x09E0
    uint32_t 043; // 0x09E4
    uint32_t 044; // 0x09E8
    uint32_t 047; // 0x09F4
    uint32_t 048; // 0x09F8
    uint32_t 049; // 0x09FC
    uint32_t 050; // 0x0A00
    uint32_t 053; // 0x0A0C
    uint32_t 054; // 0x0A10
    uint32_t 057; // 0x0A1C
    uint32_t 059; // 0x0A24
    uint32_t 060; // 0x0A28
    uint32_t 062; // 0x0A30
    uint32_t m_highlightServerContextID; // 0x032C
    uint32_t m_highlightTeamBits; // 0x0338
    uint32_t m_PredictableID; // 0x06F4
    fVector3 m_vecMins; // 0x0408
    fVector3 m_vecMaxs; // 0x0414
    uint32_t m_nSolidType; // 0x0424
    uint32_t m_usSolidFlags; // 0x0420
    uint32_t m_triggerBloat; // 0x0425
    fVector3 m_vecSpecifiedSurroundingMins; // 0x043C
    fVector3 m_vecSpecifiedSurroundingMaxs; // 0x0448
};

class CTEBaseBeam {
public:
    float m_fEndWidth; // 0x0040
    uint32_t m_nModelIndex; // 0x0028
    uint32_t m_nHaloIndex; // 0x002C
    uint32_t m_nFrameRate; // 0x0034
    uint32_t m_nFlags; // 0x0060
    uint32_t m_nStartFrame; // 0x0030
    float m_fWidth; // 0x003C
    float m_fLife; // 0x0038
    uint32_t m_nFadeLength; // 0x0044
    float m_fAmplitude; // 0x0048
    uint32_t a; // 0x0058
    uint32_t m_nSpeed; // 0x005C
    uint32_t r; // 0x004C
    uint32_t g; // 0x0050
    uint32_t b; // 0x0054
};

class CTEBeamFollow {
public:
    uint32_t m_iEntIndex; // 0x0068
    float m_fEndWidth; // 0x0040
    uint32_t m_nModelIndex; // 0x0028
    uint32_t m_nHaloIndex; // 0x002C
    uint32_t m_nFrameRate; // 0x0034
    uint32_t m_nFlags; // 0x0060
    uint32_t m_nStartFrame; // 0x0030
    float m_fWidth; // 0x003C
    float m_fLife; // 0x0038
    uint32_t m_nFadeLength; // 0x0044
    float m_fAmplitude; // 0x0048
    uint32_t a; // 0x0058
    uint32_t m_nSpeed; // 0x005C
    uint32_t r; // 0x004C
    uint32_t g; // 0x0050
    uint32_t b; // 0x0054
};

class CHardPointEntity {
public:
    fVector3 m_localOrigin; // 0x0004
    uint32_t m_iTeamNum; // 0x03A4
    int64_t visibilityShowFlag; // 0x0890
    uint32_t m_teamMilitiaAICount; // 0x0B48
    uint32_t m_state; // 0x0B3C
    float m_estimatedCaptureTime; // 0x0B40
    uint32_t m_teamMilitiaPlayerCount; // 0x0B50
    uint32_t zOrder; // 0x089C
    float m_progressRefPoint; // 0x0B44
    uint32_t m_teamIMCAICount; // 0x0B4C
    uint32_t m_teamIMCPlayerCount; // 0x0B54
    uint32_t m_teamMilitiaPlayerTitanCount; // 0x0B58
    uint32_t m_teamIMCPlayerTitanCount; // 0x0B5C
    uint32_t m_hardpointID; // 0x0B60
    uint32_t m_terminal; // 0x0B68
    int64_t visibilityDefaultFlag; // 0x0888
    uint32_t flags; // 0x0898
    uint32_t customState; // 0x08A0
    float objectScale; // 0x08A4
};

class CHealthKit {
public:
    float m_flSkyScaleEndValue; // 0x0CD4
    uint32_t m_bClientSideRagdoll; // 0x0084
    float objectScale; // 0x08A4
    uint32_t m_animScriptModel; // 0x0BD8
    int64_t visibilityDefaultFlag; // 0x0888
    float m_flModelScale; // 0x102C
    int64_t visibilityShowFlag; // 0x0890
    uint32_t m_sequenceTransitionerLayerCount; // 0x0E98
    uint32_t flags; // 0x0898
    uint32_t zOrder; // 0x089C
    uint32_t m_animModelIndex; // 0x0018
    uint32_t m_animIgnoreParentRot; // 0x0BDC
    uint32_t 035; // 0x09C4
    uint32_t customState; // 0x08A0
    fVector3 002; // 0x01B4
    uint32_t m_predictedAnimEventCount; // 0x0CA8
    fVector3 m_attachmentLerpStartOrigin; // 0x076C
    uint32_t m_animSequence; // 0x001C
    uint32_t m_sequenceTransitionerLayerModelIndex; // 0x0D64
    uint32_t m_bSequenceFinished; // 0x1020
    uint32_t 061; // 0x0A2C
    uint32_t m_nForceBone; // 0x0FB8
    fVector3 010; // 0x0214
    uint32_t m_useLockedAnimDeltaYaw; // 0x1021
    uint32_t m_sequenceTransitionerLayerActive; // 0x0D60
    float m_lockedAnimDeltaYaw; // 0x1024
    fVector3 m_animInitialPos; // 0x0B6C
    uint32_t m_bCanUseFastPathFromServer; // 0x1019
    fVector3 m_vecForce; // 0x0088
    fVector3 m_animEntityToRefOffset; // 0x0BB0
    uint32_t 045; // 0x09EC
    uint32_t m_nSkin; // 0x0F80
    fVector3 006; // 0x01E4
    uint32_t m_bossPlayer; // 0x0104
    uint32_t m_nBody; // 0x0F84
    float m_animPlaybackRate; // 0x0010
    uint32_t m_animActive; // 0x0B64
    uint32_t m_animFrozen; // 0x0014
    uint32_t m_passThroughThickness; // 0x03AC
    uint32_t m_syncingWithEntity; // 0x0C5C
    uint32_t m_nRagdollImpactFXTableId; // 0x0CCC
    float m_usableRadius; // 0x086C
    float m_flSkyScaleStartValue; // 0x0CD0
    float m_flSkyScaleStartTime; // 0x0CD8
    float m_flSkyScaleEndTime; // 0x0CDC
    uint32_t m_nNewSequenceParity; // 0x0020
    uint32_t m_passDamageToParent; // 0x06EC
    float m_flEstIkOffset; // 0x0094
    uint32_t m_animMotionMode; // 0x0BE0
    fVector4 m_animInitialRot; // 0x0B84
    uint32_t m_animCollisionEnabled; // 0x0B67
    uint32_t m_animNetworkFlags; // 0x0B60
    const char* m_iName; // 0x04B9
    fVector3 m_animInitialVel; // 0x0B78
    uint32_t m_predictedAnimEventSequence; // 0x0CB0
    uint32_t m_predictedAnimEventTarget; // 0x0CAC
    fVector3 004; // 0x01CC
    uint32_t m_predictedAnimEventModel; // 0x0CB4
    float m_sequenceTransitionerLayerPlaybackRate; // 0x0D74
    uint32_t m_CollisionGroup; // 0x0838
    float m_predictedAnimEventsReadyToFireTime; // 0x0CB8
    fVector3 000; // 0x019C
    fVector3 001; // 0x01A8
    fVector3 003; // 0x01C0
    uint32_t 056; // 0x0A18
    fVector3 m_animInitialCorrectPos; // 0x0B94
    fVector3 005; // 0x01D8
    fVector3 007; // 0x01F0
    uint32_t m_spottedByTeams; // 0x0880
    float m_usePromptSize; // 0x0874
    fVector4 m_animInitialCorrectRot; // 0x0BA0
    fVector4 m_animEntityToRefRotation; // 0x0BBC
    float m_animEndTime; // 0x0BD0
    float m_animBeginTime; // 0x0BCC
    uint32_t m_animScriptSequence; // 0x0BD4
    float m_sequenceTransitionerLayerStartCycle; // 0x0D68
    uint32_t 034; // 0x09C0
    uint32_t m_sequenceTransitionerLayerSequence; // 0x0D6C
    float m_sequenceTransitionerLayerStartTime; // 0x0D78
    float m_sequenceTransitionerLayerFadeOutDuration; // 0x0D7C
    float m_animStartTime; // 0x0008
    float m_animStartCycle; // 0x000C
    uint32_t 052; // 0x0A08
    uint32_t m_nResetEventsParity; // 0x0F90
    fVector3 008; // 0x01FC
    fVector3 009; // 0x0208
    fVector3 011; // 0x0220
    fVector3 012; // 0x022C
    fVector3 013; // 0x0238
    fVector3 014; // 0x0244
    fVector3 015; // 0x0250
    uint32_t 016; // 0x0978
    uint32_t 017; // 0x097C
    uint32_t 018; // 0x0980
    uint32_t 019; // 0x0984
    uint32_t 020; // 0x0988
    uint32_t 021; // 0x098C
    uint32_t m_instanceNameIndex; // 0x05C4
    uint32_t 022; // 0x0990
    uint32_t 023; // 0x0994
    uint32_t m_cellX; // 0x0034
    uint32_t m_cellY; // 0x0038
    uint32_t m_parentAttachmentModel; // 0x0790
    uint32_t m_cellZ; // 0x003C
    fVector3 m_localOrigin; // 0x0040
    fVector3 m_localAngles; // 0x03CC
    uint32_t m_nModelIndex; // 0x004C
    uint32_t m_fEffects; // 0x0030
    uint32_t m_nRenderMode; // 0x03F1
    uint32_t m_nRenderFX; // 0x03E5
    uint32_t m_forceVisibleInPhaseShift; // 0x06E4
    uint32_t m_clrRender; // 0x0048
    uint32_t m_bRenderWithViewModels; // 0x03E4
    uint32_t m_iTeamNum; // 0x03A4
    uint32_t 063; // 0x0A34
    uint32_t m_passThroughFlags; // 0x03A8
    float m_passThroughDirection; // 0x03B0
    uint32_t m_contents; // 0x083C
    uint32_t m_hOwnerEntity; // 0x03E0
    uint32_t m_shieldHealth; // 0x0150
    uint32_t m_dissolveEffectEntityHandle; // 0x0858
    uint32_t movetype; // 0x0000
    uint32_t moveparent; // 0x001C
    uint32_t m_parentAttachmentIndex; // 0x0788
    float m_attachmentLerpStartTime; // 0x0764
    float m_attachmentLerpEndTime; // 0x0768
    fVector3 m_attachmentLerpStartAngles; // 0x0778
    uint32_t m_scriptNameIndex; // 0x05C0
    const char* m_holdUsePrompt; // 0x0648
    uint32_t 046; // 0x09F0
    const char* m_pressUsePrompt; // 0x0650
    const char* m_iSignifierName; // 0x04B0
    uint32_t movecollide; // 0x0000
    float m_fadeDist; // 0x0798
    uint32_t m_visibilityFlags; // 0x0398
    uint32_t m_scriptVisible; // 0x039C
    uint32_t m_usableType; // 0x0864
    uint32_t 051; // 0x0A04
    uint32_t m_usablePriority; // 0x0868
    float m_usableFOV; // 0x0870
    uint32_t m_baseTakeDamage; // 0x06E5
    uint32_t m_invulnerableToDamageCount; // 0x06E8
    uint32_t m_shieldHealthMax; // 0x0154
    uint32_t m_highlightIsNetworked; // 0x0198
    uint32_t m_areEntityLinksNetworked; // 0x092F
    uint32_t m_networkedFlags; // 0x0350
    uint32_t m_debugBrokenInterpolation; // 0x092C
    uint32_t m_entitiesLinkedFromMeCount; // 0x0930
    uint32_t m_entitiesLinkedToMeCount; // 0x0934
    uint32_t 024; // 0x0998
    uint32_t 025; // 0x099C
    uint32_t 026; // 0x09A0
    uint32_t 027; // 0x09A4
    uint32_t 028; // 0x09A8
    uint32_t 029; // 0x09AC
    uint32_t 030; // 0x09B0
    uint32_t 031; // 0x09B4
    uint32_t 032; // 0x09B8
    uint32_t 033; // 0x09BC
    uint32_t 036; // 0x09C8
    uint32_t 037; // 0x09CC
    uint32_t 038; // 0x09D0
    uint32_t 039; // 0x09D4
    uint32_t 040; // 0x09D8
    uint32_t 041; // 0x09DC
    uint32_t 042; // 0x09E0
    uint32_t 043; // 0x09E4
    uint32_t 044; // 0x09E8
    uint32_t 047; // 0x09F4
    uint32_t 048; // 0x09F8
    uint32_t 049; // 0x09FC
    uint32_t 050; // 0x0A00
    uint32_t 053; // 0x0A0C
    uint32_t 054; // 0x0A10
    uint32_t 055; // 0x0A14
    uint32_t 057; // 0x0A1C
    uint32_t 058; // 0x0A20
    uint32_t 059; // 0x0A24
    uint32_t 060; // 0x0A28
    uint32_t 062; // 0x0A30
    uint32_t m_highlightServerContextID; // 0x032C
    uint32_t m_highlightTeamBits; // 0x0338
    uint32_t m_PredictableID; // 0x06F4
    fVector3 m_vecMins; // 0x0408
    fVector3 m_vecMaxs; // 0x0414
    uint32_t m_nSolidType; // 0x0424
    uint32_t m_usSolidFlags; // 0x0420
    uint32_t m_nSurroundType; // 0x0436
    uint32_t m_triggerBloat; // 0x0425
    fVector3 m_vecSpecifiedSurroundingMins; // 0x043C
    fVector3 m_vecSpecifiedSurroundingMaxs; // 0x0448
};

class CTurret {
public:
    uint32_t m_settingsIndex; // 0x16A0
    uint32_t m_driver; // 0x16B8
    uint32_t m_iHealth; // 0x0390
    fVector3 m_vecSpecifiedSurroundingMins; // 0x043C
    float m_forceAimYaw; // 0x16CC
    uint32_t m_iMaxHealth; // 0x04A8
    uint32_t m_lastCycleSlot; // 0x157C
    uint32_t 024; // 0x0998
    const char* m_title; // 0x16D4
    uint32_t m_animCollisionEnabled; // 0x0B67
    float m_forceAimPitch; // 0x16C8
    fVector3 010; // 0x0214
    float m_driverTimeStart; // 0x16D0
    uint32_t m_useLockedAnimDeltaYaw; // 0x1021
    uint32_t 061; // 0x0A2C
    uint32_t m_nForceBone; // 0x0FB8
    uint32_t m_weaponGettingSwitchedOut; // 0x0008
    uint32_t activeWeapon; // 0x1588
    float m_raiseFromMeleeEndTime; // 0x1518
    fVector3 000; // 0x019C
    float m_sharedEnergyRegenDelay; // 0x152C
    fVector3 001; // 0x01A8
    fVector3 m_attachmentLerpStartOrigin; // 0x076C
    uint32_t m_animSequence; // 0x001C
    fVector3 002; // 0x01B4
    fVector3 003; // 0x01C0
    float m_cloakFadeInDuration; // 0x0188
    uint32_t m_latestNonOffhandWeapon; // 0x1578
    fVector3 004; // 0x01CC
    fVector3 005; // 0x01D8
    uint32_t m_selectedWeapon; // 0x1570
    uint32_t flags; // 0x0898
    float m_lastSharedEnergyRegenTime; // 0x1524
    uint32_t 030; // 0x09B0
    uint32_t m_latestPrimaryWeapon; // 0x1574
    fVector3 006; // 0x01E4
    uint32_t 055; // 0x0A14
    float m_vecViewOffset[2]; // 0x002C
    uint32_t m_weaponDisabled; // 0x15A5
    uint32_t m_showNewWeapon3p; // 0x000C
    fVector3 m_animInitialPos; // 0x0B6C
    uint32_t m_weaponPermission; // 0x1580
    uint32_t m_contextAction; // 0x15B4
    uint32_t m_hudInfo_visibilityTestAlwaysPasses; // 0x15A6
    uint32_t 035; // 0x09C4
    uint32_t customState; // 0x08A0
    fVector3 m_meleeExecutionUnstuckPosition; // 0x15D4
    uint32_t zOrder; // 0x089C
    uint32_t m_networkedFlags; // 0x0350
    uint32_t m_nameVisibilityFlags; // 0x08A8
    uint32_t 058; // 0x0A20
    uint32_t m_sharedEnergyTotal; // 0x1520
    float m_lastFiredTime; // 0x1514
    float m_phaseShiftTimeStart; // 0x15E4
    uint32_t m_nSurroundType; // 0x0436
    uint32_t m_sharedEnergyCount; // 0x151C
    float m_sharedEnergyRegenRate; // 0x1528
    float m_lastSharedEnergyTakeTime; // 0x1530
    float m_phaseShiftTimeEnd; // 0x15E8
    uint32_t m_fEffects; // 0x0030
    float m_cloakEndTime; // 0x017C
    float m_flNextAttack; // 0x1510
    fVector3 014; // 0x0244
    float m_vecViewOffset[1]; // 0x0028
    float m_cloakFadeInEndTime; // 0x0180
    fVector3 009; // 0x0208
    float m_cloakFadeOutStartTime; // 0x0184
    float m_cloakFlickerAmount; // 0x018C
    uint32_t m_AnimOverlayCount; // 0x12F8
    float m_cloakFlickerEndTime; // 0x0190
    uint32_t m_baseTakeDamage; // 0x06E5
    fVector3 m_deathVelocity; // 0x03B4
    float m_vecViewOffset[0]; // 0x0024
    float m_sequenceTransitionerLayerPlaybackRate; // 0x0D74
    const char* m_targetInfoIconName; // 0x1634
    uint32_t m_numRodeoSlots; // 0x0024
    int64_t visibilityDefaultFlag; // 0x0888
    int64_t visibilityShowFlag; // 0x0890
    float objectScale; // 0x08A4
    fVector3 007; // 0x01F0
    uint32_t m_animModelIndex; // 0x0018
    uint32_t m_bSequenceFinished; // 0x1020
    float m_lockedAnimDeltaYaw; // 0x1024
    uint32_t m_bCanUseFastPathFromServer; // 0x1019
    fVector3 m_vecForce; // 0x0088
    uint32_t 045; // 0x09EC
    uint32_t m_nSkin; // 0x0F80
    uint32_t m_bossPlayer; // 0x0104
    uint32_t m_nBody; // 0x0F84
    float m_flModelScale; // 0x102C
    float m_animPlaybackRate; // 0x0010
    uint32_t m_animFrozen; // 0x0014
    uint32_t m_bClientSideRagdoll; // 0x0084
    uint32_t m_nRagdollImpactFXTableId; // 0x0CCC
    float m_usableRadius; // 0x086C
    float m_flSkyScaleStartValue; // 0x0CD0
    float m_flSkyScaleEndValue; // 0x0CD4
    float m_flSkyScaleStartTime; // 0x0CD8
    float m_flSkyScaleEndTime; // 0x0CDC
    uint32_t m_nNewSequenceParity; // 0x0020
    uint32_t m_passDamageToParent; // 0x06EC
    float m_flEstIkOffset; // 0x0094
    uint32_t m_animActive; // 0x0B64
    uint32_t m_animNetworkFlags; // 0x0B60
    uint32_t m_passThroughThickness; // 0x03AC
    uint32_t m_syncingWithEntity; // 0x0C5C
    uint32_t m_predictedAnimEventCount; // 0x0CA8
    uint32_t m_predictedAnimEventTarget; // 0x0CAC
    uint32_t m_predictedAnimEventSequence; // 0x0CB0
    uint32_t m_predictedAnimEventModel; // 0x0CB4
    uint32_t m_CollisionGroup; // 0x0838
    float m_predictedAnimEventsReadyToFireTime; // 0x0CB8
    const char* m_iName; // 0x04B9
    fVector3 m_animInitialVel; // 0x0B78
    fVector4 m_animInitialRot; // 0x0B84
    uint32_t 056; // 0x0A18
    fVector3 m_animInitialCorrectPos; // 0x0B94
    uint32_t m_spottedByTeams; // 0x0880
    float m_usePromptSize; // 0x0874
    fVector4 m_animInitialCorrectRot; // 0x0BA0
    fVector3 m_animEntityToRefOffset; // 0x0BB0
    fVector4 m_animEntityToRefRotation; // 0x0BBC
    float m_animBeginTime; // 0x0BCC
    float m_animEndTime; // 0x0BD0
    uint32_t m_animScriptSequence; // 0x0BD4
    uint32_t m_animScriptModel; // 0x0BD8
    uint32_t m_animIgnoreParentRot; // 0x0BDC
    uint32_t m_animMotionMode; // 0x0BE0
    uint32_t m_sequenceTransitionerLayerCount; // 0x0E98
    uint32_t m_sequenceTransitionerLayerActive; // 0x0D60
    uint32_t m_sequenceTransitionerLayerModelIndex; // 0x0D64
    float m_sequenceTransitionerLayerStartCycle; // 0x0D68
    uint32_t 034; // 0x09C0
    uint32_t m_sequenceTransitionerLayerSequence; // 0x0D6C
    float m_sequenceTransitionerLayerStartTime; // 0x0D78
    float m_sequenceTransitionerLayerFadeOutDuration; // 0x0D7C
    float m_animStartTime; // 0x0008
    float m_animStartCycle; // 0x000C
    uint32_t 052; // 0x0A08
    uint32_t m_nResetEventsParity; // 0x0F90
    fVector3 008; // 0x01FC
    fVector3 011; // 0x0220
    fVector3 012; // 0x022C
    fVector3 013; // 0x0238
    fVector3 015; // 0x0250
    uint32_t 016; // 0x0978
    uint32_t 017; // 0x097C
    uint32_t 018; // 0x0980
    uint32_t 019; // 0x0984
    uint32_t 020; // 0x0988
    uint32_t 021; // 0x098C
    uint32_t m_instanceNameIndex; // 0x05C4
    uint32_t 022; // 0x0990
    uint32_t 023; // 0x0994
    uint32_t m_cellX; // 0x0034
    uint32_t m_cellY; // 0x0038
    uint32_t m_parentAttachmentModel; // 0x0790
    uint32_t m_cellZ; // 0x003C
    fVector3 m_localOrigin; // 0x0040
    fVector3 m_localAngles; // 0x03CC
    uint32_t m_nModelIndex; // 0x004C
    uint32_t m_nRenderMode; // 0x03F1
    uint32_t m_nRenderFX; // 0x03E5
    uint32_t m_forceVisibleInPhaseShift; // 0x06E4
    uint32_t m_clrRender; // 0x0048
    uint32_t m_bRenderWithViewModels; // 0x03E4
    uint32_t m_iTeamNum; // 0x03A4
    uint32_t 063; // 0x0A34
    uint32_t m_passThroughFlags; // 0x03A8
    float m_passThroughDirection; // 0x03B0
    uint32_t m_contents; // 0x083C
    uint32_t m_hOwnerEntity; // 0x03E0
    uint32_t m_shieldHealth; // 0x0150
    uint32_t m_dissolveEffectEntityHandle; // 0x0858
    uint32_t movetype; // 0x0000
    uint32_t moveparent; // 0x001C
    uint32_t m_parentAttachmentIndex; // 0x0788
    float m_attachmentLerpStartTime; // 0x0764
    float m_attachmentLerpEndTime; // 0x0768
    fVector3 m_attachmentLerpStartAngles; // 0x0778
    uint32_t m_scriptNameIndex; // 0x05C0
    const char* m_holdUsePrompt; // 0x0648
    uint32_t 046; // 0x09F0
    const char* m_pressUsePrompt; // 0x0650
    const char* m_iSignifierName; // 0x04B0
    uint32_t movecollide; // 0x0000
    float m_fadeDist; // 0x0798
    uint32_t m_visibilityFlags; // 0x0398
    uint32_t m_scriptVisible; // 0x039C
    uint32_t m_usableType; // 0x0864
    uint32_t 051; // 0x0A04
    uint32_t m_usablePriority; // 0x0868
    float m_usableFOV; // 0x0870
    uint32_t m_invulnerableToDamageCount; // 0x06E8
    uint32_t m_shieldHealthMax; // 0x0154
    uint32_t m_highlightIsNetworked; // 0x0198
    uint32_t m_areEntityLinksNetworked; // 0x092F
    uint32_t m_debugBrokenInterpolation; // 0x092C
    uint32_t m_entitiesLinkedFromMeCount; // 0x0930
    uint32_t m_entitiesLinkedToMeCount; // 0x0934
    uint32_t 025; // 0x099C
    uint32_t 026; // 0x09A0
    uint32_t 027; // 0x09A4
    uint32_t 028; // 0x09A8
    uint32_t 029; // 0x09AC
    uint32_t 031; // 0x09B4
    uint32_t 032; // 0x09B8
    uint32_t 033; // 0x09BC
    uint32_t 036; // 0x09C8
    uint32_t 037; // 0x09CC
    uint32_t 038; // 0x09D0
    uint32_t 039; // 0x09D4
    uint32_t 040; // 0x09D8
    uint32_t 041; // 0x09DC
    uint32_t 042; // 0x09E0
    uint32_t 043; // 0x09E4
    uint32_t 044; // 0x09E8
    uint32_t 047; // 0x09F4
    uint32_t 048; // 0x09F8
    uint32_t 049; // 0x09FC
    uint32_t 050; // 0x0A00
    uint32_t 053; // 0x0A0C
    uint32_t 054; // 0x0A10
    uint32_t 057; // 0x0A1C
    uint32_t 059; // 0x0A24
    uint32_t 060; // 0x0A28
    uint32_t 062; // 0x0A30
    uint32_t m_highlightServerContextID; // 0x032C
    uint32_t m_highlightTeamBits; // 0x0338
    uint32_t m_PredictableID; // 0x06F4
    fVector3 m_vecMins; // 0x0408
    fVector3 m_vecMaxs; // 0x0414
    uint32_t m_nSolidType; // 0x0424
    uint32_t m_usSolidFlags; // 0x0420
    uint32_t m_triggerBloat; // 0x0425
    fVector3 m_vecSpecifiedSurroundingMaxs; // 0x0448
};

class CTEBeamEnts {
public:
    uint32_t m_nStartEntity; // 0x0068
    uint32_t m_nEndEntity; // 0x006C
    uint32_t m_nModelIndex; // 0x0028
    uint32_t m_nHaloIndex; // 0x002C
    uint32_t m_nFrameRate; // 0x0034
    uint32_t m_nFlags; // 0x0060
    uint32_t m_nStartFrame; // 0x0030
    float m_fWidth; // 0x003C
    float m_fLife; // 0x0038
    float m_fEndWidth; // 0x0040
    uint32_t m_nFadeLength; // 0x0044
    float m_fAmplitude; // 0x0048
    uint32_t a; // 0x0058
    uint32_t m_nSpeed; // 0x005C
    uint32_t r; // 0x004C
    uint32_t g; // 0x0050
    uint32_t b; // 0x0054
};

class CTitanSoul {
public:
    float seTimeEnd; // 0x0D0C
    uint32_t m_titan; // 0x0B38
    float m_lastRodeoHitTime; // 0x0CD8
    uint32_t m_shieldHealth; // 0x0150
    float m_coreChargeExpireTime; // 0x0CE8
    uint32_t m_shieldHealthMax; // 0x0154
    uint32_t m_doomed; // 0x0E9C
    uint32_t m_stance; // 0x0E98
    uint32_t m_playerSettingsNum; // 0x0EA0
    uint32_t m_invalidHealthBarEnt; // 0x0EA4
    uint32_t m_bEjecting; // 0x0EA5
    uint32_t m_isValidRodeoTarget; // 0x0EA6
    float m_nextCoreChargeAvailable; // 0x0CE0
    float m_coreChargeStartTime; // 0x0CF0
    float m_coreUseDuration; // 0x0CF4
    float m_damageComboLatestUpdateTime; // 0x0CF8
    uint32_t m_damageComboStartHealth; // 0x0CFC
    uint32_t m_bossPlayer; // 0x0104
    uint32_t m_titanSoulScriptNetData; // 0x0B40
    uint32_t m_networkedFlags; // 0x0350
    uint32_t seComboVars; // 0x0D08
    float seEaseOut; // 0x0D10
};

class CBaseButton {
public:
    const char* m_holdUsePrompt; // 0x0648
    uint32_t m_usable; // 0x0B68
    fVector3 m_vecFinalDest; // 0x0B4C
    uint32_t m_movementType; // 0x0B58
    uint32_t m_nRenderMode; // 0x03F1
    float m_flMoveTargetTime; // 0x0B5C
    float m_usableRadius; // 0x086C
    uint32_t m_cellX; // 0x0034
    uint32_t m_cellY; // 0x0038
    uint32_t m_cellZ; // 0x003C
    uint32_t m_parentAttachmentModel; // 0x0790
    fVector3 m_localOrigin; // 0x0040
    uint32_t m_shieldHealthMax; // 0x0154
    fVector3 m_localAngles; // 0x03CC
    uint32_t m_nModelIndex; // 0x004C
    uint32_t m_fEffects; // 0x0030
    const char* m_iName; // 0x04B9
    uint32_t m_nRenderFX; // 0x03E5
    uint32_t m_clrRender; // 0x0048
    uint32_t m_forceVisibleInPhaseShift; // 0x06E4
    uint32_t 063; // 0x0A34
    uint32_t m_passThroughFlags; // 0x03A8
    uint32_t m_bRenderWithViewModels; // 0x03E4
    uint32_t m_iTeamNum; // 0x03A4
    uint32_t m_passThroughThickness; // 0x03AC
    uint32_t m_CollisionGroup; // 0x0838
    float m_passThroughDirection; // 0x03B0
    float m_fadeDist; // 0x0798
    fVector3 m_attachmentLerpStartAngles; // 0x0778
    uint32_t m_contents; // 0x083C
    uint32_t m_hOwnerEntity; // 0x03E0
    uint32_t m_dissolveEffectEntityHandle; // 0x0858
    uint32_t m_shieldHealth; // 0x0150
    uint32_t moveparent; // 0x001C
    uint32_t movetype; // 0x0000
    uint32_t m_visibilityFlags; // 0x0398
    uint32_t m_parentAttachmentIndex; // 0x0788
    fVector3 003; // 0x01C0
    float m_attachmentLerpStartTime; // 0x0764
    float m_attachmentLerpEndTime; // 0x0768
    fVector3 002; // 0x01B4
    uint32_t 051; // 0x0A04
    uint32_t m_usablePriority; // 0x0868
    fVector3 m_attachmentLerpStartOrigin; // 0x076C
    fVector3 000; // 0x019C
    uint32_t m_scriptNameIndex; // 0x05C0
    uint32_t 022; // 0x0990
    uint32_t m_instanceNameIndex; // 0x05C4
    uint32_t m_debugBrokenInterpolation; // 0x092C
    uint32_t 046; // 0x09F0
    const char* m_pressUsePrompt; // 0x0650
    const char* m_iSignifierName; // 0x04B0
    uint32_t movecollide; // 0x0000
    uint32_t m_scriptVisible; // 0x039C
    uint32_t m_usableType; // 0x0864
    uint32_t m_bossPlayer; // 0x0104
    uint32_t m_entitiesLinkedFromMeCount; // 0x0930
    float m_usableFOV; // 0x0870
    float m_usePromptSize; // 0x0874
    uint32_t m_spottedByTeams; // 0x0880
    uint32_t m_baseTakeDamage; // 0x06E5
    uint32_t m_invulnerableToDamageCount; // 0x06E8
    uint32_t m_areEntityLinksNetworked; // 0x092F
    uint32_t m_highlightIsNetworked; // 0x0198
    uint32_t m_networkedFlags; // 0x0350
    uint32_t m_entitiesLinkedToMeCount; // 0x0934
    fVector3 001; // 0x01A8
    fVector3 004; // 0x01CC
    fVector3 005; // 0x01D8
    fVector3 006; // 0x01E4
    fVector3 007; // 0x01F0
    fVector3 008; // 0x01FC
    fVector3 009; // 0x0208
    fVector3 010; // 0x0214
    fVector3 011; // 0x0220
    fVector3 012; // 0x022C
    fVector3 013; // 0x0238
    fVector3 014; // 0x0244
    fVector3 015; // 0x0250
    uint32_t 016; // 0x0978
    uint32_t 017; // 0x097C
    uint32_t 018; // 0x0980
    uint32_t 019; // 0x0984
    uint32_t 020; // 0x0988
    uint32_t 021; // 0x098C
    uint32_t 023; // 0x0994
    uint32_t 024; // 0x0998
    uint32_t 025; // 0x099C
    uint32_t 026; // 0x09A0
    uint32_t 027; // 0x09A4
    uint32_t 028; // 0x09A8
    uint32_t 029; // 0x09AC
    uint32_t 030; // 0x09B0
    uint32_t 031; // 0x09B4
    uint32_t 032; // 0x09B8
    uint32_t 033; // 0x09BC
    uint32_t 034; // 0x09C0
    uint32_t 035; // 0x09C4
    uint32_t 036; // 0x09C8
    uint32_t 037; // 0x09CC
    uint32_t 038; // 0x09D0
    uint32_t 039; // 0x09D4
    uint32_t 040; // 0x09D8
    uint32_t 041; // 0x09DC
    uint32_t 042; // 0x09E0
    uint32_t 043; // 0x09E4
    uint32_t 044; // 0x09E8
    uint32_t 045; // 0x09EC
    uint32_t 047; // 0x09F4
    uint32_t 048; // 0x09F8
    uint32_t 049; // 0x09FC
    uint32_t 050; // 0x0A00
    uint32_t 052; // 0x0A08
    uint32_t 053; // 0x0A0C
    uint32_t 054; // 0x0A10
    uint32_t 055; // 0x0A14
    uint32_t 056; // 0x0A18
    uint32_t 057; // 0x0A1C
    uint32_t 058; // 0x0A20
    uint32_t 059; // 0x0A24
    uint32_t 060; // 0x0A28
    uint32_t 061; // 0x0A2C
    uint32_t 062; // 0x0A30
    uint32_t m_highlightServerContextID; // 0x032C
    uint32_t m_highlightTeamBits; // 0x0338
    uint32_t m_PredictableID; // 0x06F4
    fVector3 m_vecMins; // 0x0408
    fVector3 m_vecMaxs; // 0x0414
    uint32_t m_nSolidType; // 0x0424
    uint32_t m_usSolidFlags; // 0x0420
    uint32_t m_nSurroundType; // 0x0436
    uint32_t m_triggerBloat; // 0x0425
    fVector3 m_vecSpecifiedSurroundingMins; // 0x043C
    fVector3 m_vecSpecifiedSurroundingMaxs; // 0x0448
};

class CTEBeamEntPoint {
public:
    uint32_t m_nStartEntity; // 0x0068
    fVector3 m_vecEndPoint; // 0x007C
    uint32_t m_nEndEntity; // 0x006C
    uint32_t m_nFadeLength; // 0x0044
    fVector3 m_vecStartPoint; // 0x0070
    uint32_t m_nModelIndex; // 0x0028
    uint32_t m_nHaloIndex; // 0x002C
    uint32_t m_nFrameRate; // 0x0034
    uint32_t m_nFlags; // 0x0060
    uint32_t m_nStartFrame; // 0x0030
    float m_fLife; // 0x0038
    float m_fWidth; // 0x003C
    float m_fEndWidth; // 0x0040
    float m_fAmplitude; // 0x0048
    uint32_t a; // 0x0058
    uint32_t m_nSpeed; // 0x005C
    uint32_t r; // 0x004C
    uint32_t g; // 0x0050
    uint32_t b; // 0x0054
};

class CEnvWind {
public:
    uint32_t m_iGustDirChange; // 0x0B68
    uint32_t m_nRenderMode; // 0x03F1
    uint32_t m_CollisionGroup; // 0x0838
    float m_passThroughDirection; // 0x03B0
    uint32_t m_iMinWind; // 0x0B48
    uint32_t m_iMaxWind; // 0x0B4C
    uint32_t 022; // 0x0990
    uint32_t m_instanceNameIndex; // 0x05C4
    uint32_t m_iMinGust; // 0x0B54
    float m_flMaxGustDelay; // 0x0B60
    uint32_t m_iMaxGust; // 0x0B58
    uint32_t 051; // 0x0A04
    uint32_t m_usablePriority; // 0x0868
    fVector3 m_attachmentLerpStartOrigin; // 0x076C
    float m_flMinGustDelay; // 0x0B5C
    float m_usePromptSize; // 0x0874
    uint32_t m_spottedByTeams; // 0x0880
    uint32_t m_iWindSeed; // 0x0B44
    uint32_t m_iInitialWindDir; // 0x0BA8
    uint32_t m_nModelIndex; // 0x004C
    float m_flInitialWindSpeed; // 0x0BAC
    float m_flStartTime; // 0x0B40
    uint32_t m_clrRender; // 0x0048
    uint32_t m_forceVisibleInPhaseShift; // 0x06E4
    uint32_t 063; // 0x0A34
    float m_flGustDuration; // 0x0B64
    uint32_t m_passThroughFlags; // 0x03A8
    float m_usableRadius; // 0x086C
    uint32_t m_cellX; // 0x0034
    uint32_t m_cellY; // 0x0038
    uint32_t m_cellZ; // 0x003C
    uint32_t m_parentAttachmentModel; // 0x0790
    fVector3 m_localOrigin; // 0x0040
    uint32_t m_shieldHealthMax; // 0x0154
    fVector3 m_localAngles; // 0x03CC
    uint32_t m_fEffects; // 0x0030
    const char* m_iName; // 0x04B9
    uint32_t m_nRenderFX; // 0x03E5
    uint32_t m_bRenderWithViewModels; // 0x03E4
    uint32_t m_iTeamNum; // 0x03A4
    uint32_t m_passThroughThickness; // 0x03AC
    float m_fadeDist; // 0x0798
    fVector3 m_attachmentLerpStartAngles; // 0x0778
    uint32_t m_contents; // 0x083C
    uint32_t m_hOwnerEntity; // 0x03E0
    uint32_t m_dissolveEffectEntityHandle; // 0x0858
    uint32_t m_shieldHealth; // 0x0150
    uint32_t moveparent; // 0x001C
    uint32_t movetype; // 0x0000
    uint32_t m_visibilityFlags; // 0x0398
    uint32_t m_parentAttachmentIndex; // 0x0788
    float m_attachmentLerpStartTime; // 0x0764
    float m_attachmentLerpEndTime; // 0x0768
    uint32_t m_scriptNameIndex; // 0x05C0
    const char* m_holdUsePrompt; // 0x0648
    uint32_t 046; // 0x09F0
    const char* m_pressUsePrompt; // 0x0650
    const char* m_iSignifierName; // 0x04B0
    uint32_t movecollide; // 0x0000
    uint32_t m_scriptVisible; // 0x039C
    uint32_t m_usableType; // 0x0864
    uint32_t m_bossPlayer; // 0x0104
    float m_usableFOV; // 0x0870
    uint32_t m_baseTakeDamage; // 0x06E5
    uint32_t m_invulnerableToDamageCount; // 0x06E8
    uint32_t m_areEntityLinksNetworked; // 0x092F
    uint32_t m_highlightIsNetworked; // 0x0198
    uint32_t m_networkedFlags; // 0x0350
    uint32_t m_debugBrokenInterpolation; // 0x092C
    uint32_t m_entitiesLinkedFromMeCount; // 0x0930
    uint32_t m_entitiesLinkedToMeCount; // 0x0934
    fVector3 000; // 0x019C
    fVector3 001; // 0x01A8
    fVector3 002; // 0x01B4
    fVector3 003; // 0x01C0
    fVector3 004; // 0x01CC
    fVector3 005; // 0x01D8
    fVector3 006; // 0x01E4
    fVector3 007; // 0x01F0
    fVector3 008; // 0x01FC
    fVector3 009; // 0x0208
    fVector3 010; // 0x0214
    fVector3 011; // 0x0220
    fVector3 012; // 0x022C
    fVector3 013; // 0x0238
    fVector3 014; // 0x0244
    fVector3 015; // 0x0250
    uint32_t 016; // 0x0978
    uint32_t 017; // 0x097C
    uint32_t 018; // 0x0980
    uint32_t 019; // 0x0984
    uint32_t 020; // 0x0988
    uint32_t 021; // 0x098C
    uint32_t 023; // 0x0994
    uint32_t 024; // 0x0998
    uint32_t 025; // 0x099C
    uint32_t 026; // 0x09A0
    uint32_t 027; // 0x09A4
    uint32_t 028; // 0x09A8
    uint32_t 029; // 0x09AC
    uint32_t 030; // 0x09B0
    uint32_t 031; // 0x09B4
    uint32_t 032; // 0x09B8
    uint32_t 033; // 0x09BC
    uint32_t 034; // 0x09C0
    uint32_t 035; // 0x09C4
    uint32_t 036; // 0x09C8
    uint32_t 037; // 0x09CC
    uint32_t 038; // 0x09D0
    uint32_t 039; // 0x09D4
    uint32_t 040; // 0x09D8
    uint32_t 041; // 0x09DC
    uint32_t 042; // 0x09E0
    uint32_t 043; // 0x09E4
    uint32_t 044; // 0x09E8
    uint32_t 045; // 0x09EC
    uint32_t 047; // 0x09F4
    uint32_t 048; // 0x09F8
    uint32_t 049; // 0x09FC
    uint32_t 050; // 0x0A00
    uint32_t 052; // 0x0A08
    uint32_t 053; // 0x0A0C
    uint32_t 054; // 0x0A10
    uint32_t 055; // 0x0A14
    uint32_t 056; // 0x0A18
    uint32_t 057; // 0x0A1C
    uint32_t 058; // 0x0A20
    uint32_t 059; // 0x0A24
    uint32_t 060; // 0x0A28
    uint32_t 061; // 0x0A2C
    uint32_t 062; // 0x0A30
    uint32_t m_highlightServerContextID; // 0x032C
    uint32_t m_highlightTeamBits; // 0x0338
    uint32_t m_PredictableID; // 0x06F4
    fVector3 m_vecMins; // 0x0408
    fVector3 m_vecMaxs; // 0x0414
    uint32_t m_nSolidType; // 0x0424
    uint32_t m_usSolidFlags; // 0x0420
    uint32_t m_nSurroundType; // 0x0436
    uint32_t m_triggerBloat; // 0x0425
    fVector3 m_vecSpecifiedSurroundingMins; // 0x043C
    fVector3 m_vecSpecifiedSurroundingMaxs; // 0x0448
};

class CWeaponX {
public:
    float m_spread; // 0x12E0
    float m_nextReadyTime; // 0x1238
    uint32_t m_weaponNameIndex; // 0x15C8
    fVector3 015; // 0x0250
    uint32_t m_chargeAnimIndexOld; // 0x1330
    uint32_t m_weapState; // 0x12B8
    uint32_t m_scriptActivated; // 0x15C0
    uint32_t m_segmentedReloadEndSeqRequired; // 0x130F
    uint32_t m_modBitfieldCurrent; // 0x15B8
    uint32_t m_usSolidFlags; // 0x0420
    uint32_t m_isLoadoutPickup; // 0x15C1
    uint32_t movetype; // 0x0000
    uint32_t moveparent; // 0x001C
    uint32_t m_utilityEnt; // 0x15C4
    uint32_t m_allowedToUse; // 0x12BC
    float m_flTimeWeaponIdle; // 0x125C
    uint32_t m_discarded; // 0x12BD
    float m_animStartCycle; // 0x000C
    uint32_t m_forcedADS; // 0x12C0
    uint32_t m_segmentedReloadStartedOneHanded; // 0x1311
    float m_lastChargeFrac; // 0x158C
    uint32_t m_animMotionMode; // 0x0BE0
    uint32_t m_forceRelease; // 0x12C4
    uint32_t m_customActivity; // 0x12C8
    uint32_t 021; // 0x098C
    float m_kickScaleBase; // 0x12FC
    uint32_t m_skinOverrideIsValid; // 0x1580
    uint32_t m_customActivitySequence; // 0x12CC
    uint32_t m_customActivityOwner; // 0x12D0
    uint32_t numTargetEntities; // 0x1390
    uint32_t m_fEffects; // 0x0030
    float m_customActivityEndTime; // 0x12D4
    uint32_t m_PredictableID; // 0x06F4
    float m_proScreen_float0; // 0x1344
    uint32_t m_smartAmmoEnable; // 0x1380
    uint32_t m_needsReloadCheck; // 0x1578
    uint32_t m_needsEmptyCycleCheck; // 0x157A
    uint32_t m_needsCooldown; // 0x1579
    uint32_t m_burstFireIndex; // 0x15A4
    uint32_t m_pendingTriggerPull; // 0x1305
    uint32_t m_animSequencePredictingClientOnly; // 0x15D0
    uint32_t m_networkedFlags; // 0x0350
    fVector3 005; // 0x01D8
    uint32_t m_skinOverride; // 0x157C
    uint32_t 046; // 0x09F0
    const char* m_pressUsePrompt; // 0x0650
    uint32_t m_bClientSideAnimation; // 0x1110
    fVector3 003; // 0x01C0
    float m_chargeStartTime; // 0x1584
    uint32_t trackerCount; // 0x1498
    float m_spreadStartFracHip; // 0x12E8
    uint32_t m_sequenceTransitionerLayerActive; // 0x0D60
    float m_sustainedDischargeEndTime; // 0x15AC
    fVector3 000; // 0x019C
    uint32_t m_modBitfieldInternal; // 0x15B4
    uint32_t m_modBitfieldFromPlayer; // 0x15B0
    fVector3 002; // 0x01B4
    uint32_t m_curSharedEnergyCost; // 0x15BC
    float m_chargeEndTime; // 0x1588
    uint32_t m_customActivityAttachedModelAttachmentIndex; // 0x1318
    uint32_t m_camoIndex; // 0x0F88
    float m_lastRegenTime; // 0x1590
    uint32_t m_entitiesLinkedFromMeCount; // 0x0930
    uint32_t m_ActiveState; // 0x124C
    uint32_t m_proScreen_owner; // 0x1334
    uint32_t m_semiAutoTriggerDown; // 0x1304
    float m_semiAutoTriggerHoldTime; // 0x1300
    uint32_t m_stockPileWasDraining; // 0x1594
    float m_animStartTime; // 0x0008
    float m_kickSpreadHipfire; // 0x12F0
    const char* m_iSignifierName; // 0x04B0
    uint32_t m_lastChargeLevel; // 0x1598
    float m_zoomFOVLerpEndTime; // 0x136C
    float m_spreadStartFracADS; // 0x12EC
    uint32_t m_shotCount; // 0x15A8
    uint32_t m_chargeEnergyDepleteStepCounter; // 0x159C
    uint32_t m_burstFireCount; // 0x15A0
    uint32_t m_animModelIndexPredictingClientOnly; // 0x15CC
    float lastNewTargetTime; // 0x1494
    uint32_t m_offhandHybridNormalMode; // 0x1308
    fVector3 001; // 0x01A8
    fVector3 004; // 0x01CC
    uint32_t m_nNextThinkTick; // 0x04A4
    fVector3 006; // 0x01E4
    uint32_t m_droppedModelIndex; // 0x1248
    float m_kickTime; // 0x12F8
    fVector3 007; // 0x01F0
    float m_sequenceTransitionerLayerStartCycle; // 0x0D68
    float m_spreadStartTime; // 0x12E4
    uint32_t m_animScriptSequence; // 0x0BD4
    float m_kickSpreadADS; // 0x12F4
    fVector3 014; // 0x0244
    uint32_t m_semiAutoNeedsRechamber; // 0x1306
    uint32_t m_animFrozen; // 0x0014
    uint32_t m_pendingReloadAttempt; // 0x1307
    uint32_t m_pendingoffhandHybridToss; // 0x1309
    float m_flSkyScaleEndTime; // 0x0CDC
    uint32_t m_fastHolster; // 0x130A
    uint32_t 044; // 0x09E8
    uint32_t m_didFirstDeploy; // 0x130B
    uint32_t m_shouldCatch; // 0x130C
    uint32_t m_clipModelIsHidden; // 0x130D
    uint32_t m_customActivityPlayRaiseOnComplete; // 0x130E
    uint32_t 030; // 0x09B0
    uint32_t m_segmentedReloadStartedEmpty; // 0x1310
    uint32_t m_segmentedReloadCanRestartLoop; // 0x1312
    uint32_t m_proScreen_int0; // 0x1338
    float m_fireRateLerp_stopTime; // 0x1324
    uint32_t m_segmentedReloadLoopFireLocked; // 0x1313
    uint32_t m_customActivityAttachedModelIndex; // 0x1314
    float m_fireRateLerp_startTime; // 0x131C
    float m_fireRateLerp_startFraction; // 0x1320
    float m_fireRateLerp_stopFraction; // 0x1328
    fVector3 m_localAngles; // 0x03CC
    uint32_t m_chargeAnimIndex; // 0x132C
    uint32_t m_proScreen_int1; // 0x133C
    uint32_t m_proScreen_int2; // 0x1340
    float m_proScreen_float1; // 0x1348
    float m_proScreen_float2; // 0x134C
    float m_passThroughDirection; // 0x03B0
    uint32_t m_reloadMilestone; // 0x1350
    fVector3 m_localOrigin; // 0x0040
    float m_fullReloadStartTime; // 0x1354
    uint32_t m_passThroughThickness; // 0x03AC
    uint32_t m_syncingWithEntity; // 0x0C5C
    float m_scriptTime0; // 0x1358
    uint32_t m_scriptFlags0; // 0x135C
    float m_curZoomFOV; // 0x1360
    uint32_t m_highlightServerContextID; // 0x032C
    float m_targetZoomFOV; // 0x1364
    float m_zoomFOVLerpTime; // 0x1368
    uint32_t 058; // 0x0A20
    float m_latestDryfireTime; // 0x1370
    float m_flModelScale; // 0x102C
    float m_lastRequestedAttackTime; // 0x1374
    uint32_t 038; // 0x09D0
    uint32_t m_currentAltFireAnimIndex; // 0x1378
    uint32_t m_iWorldModelIndex; // 0x1240
    uint32_t m_holsterModelIndex; // 0x1244
    uint32_t m_weaponOwner; // 0x1234
    uint32_t m_weaponActivity; // 0x126C
    uint32_t m_nRenderFX; // 0x03E5
    uint32_t m_nIdealSequence; // 0x1274
    uint32_t m_IdealActivity; // 0x1278
    uint32_t m_ammoInClip; // 0x1250
    uint32_t m_ammoInStockpile; // 0x1254
    uint32_t m_lifetimeShots; // 0x1258
    uint32_t m_bInReload; // 0x1271
    float m_lastPrimaryAttack; // 0x1264
    float m_animPlaybackRate; // 0x0010
    float m_nextPrimaryAttackTime; // 0x123C
    fVector3 m_attachmentLerpStartOrigin; // 0x076C
    uint32_t m_animSequence; // 0x001C
    uint32_t m_animModelIndex; // 0x0018
    uint32_t m_bSequenceFinished; // 0x1020
    fVector3 010; // 0x0214
    uint32_t m_useLockedAnimDeltaYaw; // 0x1021
    float m_lockedAnimDeltaYaw; // 0x1024
    uint32_t m_bCanUseFastPathFromServer; // 0x1019
    uint32_t 061; // 0x0A2C
    uint32_t m_nForceBone; // 0x0FB8
    fVector3 m_vecForce; // 0x0088
    uint32_t 045; // 0x09EC
    uint32_t m_nSkin; // 0x0F80
    uint32_t m_bossPlayer; // 0x0104
    uint32_t m_nBody; // 0x0F84
    uint32_t m_bClientSideRagdoll; // 0x0084
    uint32_t m_nRagdollImpactFXTableId; // 0x0CCC
    float m_usableRadius; // 0x086C
    float m_flSkyScaleStartValue; // 0x0CD0
    float m_flSkyScaleEndValue; // 0x0CD4
    float m_flSkyScaleStartTime; // 0x0CD8
    uint32_t m_nNewSequenceParity; // 0x0020
    uint32_t m_passDamageToParent; // 0x06EC
    float m_flEstIkOffset; // 0x0094
    uint32_t m_animActive; // 0x0B64
    uint32_t m_animCollisionEnabled; // 0x0B67
    uint32_t m_animNetworkFlags; // 0x0B60
    uint32_t m_predictedAnimEventCount; // 0x0CA8
    uint32_t m_predictedAnimEventTarget; // 0x0CAC
    uint32_t m_predictedAnimEventSequence; // 0x0CB0
    uint32_t m_predictedAnimEventModel; // 0x0CB4
    uint32_t m_CollisionGroup; // 0x0838
    float m_predictedAnimEventsReadyToFireTime; // 0x0CB8
    fVector3 m_animInitialPos; // 0x0B6C
    const char* m_iName; // 0x04B9
    fVector3 m_animInitialVel; // 0x0B78
    fVector4 m_animInitialRot; // 0x0B84
    uint32_t 056; // 0x0A18
    fVector3 m_animInitialCorrectPos; // 0x0B94
    uint32_t m_spottedByTeams; // 0x0880
    float m_usePromptSize; // 0x0874
    fVector4 m_animInitialCorrectRot; // 0x0BA0
    fVector3 m_animEntityToRefOffset; // 0x0BB0
    fVector4 m_animEntityToRefRotation; // 0x0BBC
    float m_animBeginTime; // 0x0BCC
    float m_animEndTime; // 0x0BD0
    uint32_t m_animScriptModel; // 0x0BD8
    uint32_t m_animIgnoreParentRot; // 0x0BDC
    uint32_t m_sequenceTransitionerLayerCount; // 0x0E98
    uint32_t m_sequenceTransitionerLayerModelIndex; // 0x0D64
    uint32_t 034; // 0x09C0
    uint32_t m_sequenceTransitionerLayerSequence; // 0x0D6C
    float m_sequenceTransitionerLayerPlaybackRate; // 0x0D74
    float m_sequenceTransitionerLayerStartTime; // 0x0D78
    float m_sequenceTransitionerLayerFadeOutDuration; // 0x0D7C
    uint32_t 052; // 0x0A08
    uint32_t m_nResetEventsParity; // 0x0F90
    fVector3 008; // 0x01FC
    fVector3 009; // 0x0208
    fVector3 011; // 0x0220
    fVector3 012; // 0x022C
    fVector3 013; // 0x0238
    uint32_t 016; // 0x0978
    uint32_t 017; // 0x097C
    uint32_t 018; // 0x0980
    uint32_t 019; // 0x0984
    uint32_t 020; // 0x0988
    uint32_t m_instanceNameIndex; // 0x05C4
    uint32_t 022; // 0x0990
    uint32_t 023; // 0x0994
    uint32_t m_cellX; // 0x0034
    uint32_t m_cellY; // 0x0038
    uint32_t m_parentAttachmentModel; // 0x0790
    uint32_t m_cellZ; // 0x003C
    uint32_t m_nModelIndex; // 0x004C
    uint32_t m_nRenderMode; // 0x03F1
    uint32_t m_forceVisibleInPhaseShift; // 0x06E4
    uint32_t m_clrRender; // 0x0048
    uint32_t m_bRenderWithViewModels; // 0x03E4
    uint32_t m_iTeamNum; // 0x03A4
    uint32_t 063; // 0x0A34
    uint32_t m_passThroughFlags; // 0x03A8
    uint32_t m_contents; // 0x083C
    uint32_t m_hOwnerEntity; // 0x03E0
    uint32_t m_shieldHealth; // 0x0150
    uint32_t m_dissolveEffectEntityHandle; // 0x0858
    uint32_t m_parentAttachmentIndex; // 0x0788
    float m_attachmentLerpStartTime; // 0x0764
    float m_attachmentLerpEndTime; // 0x0768
    fVector3 m_attachmentLerpStartAngles; // 0x0778
    uint32_t m_scriptNameIndex; // 0x05C0
    const char* m_holdUsePrompt; // 0x0648
    uint32_t movecollide; // 0x0000
    float m_fadeDist; // 0x0798
    uint32_t m_visibilityFlags; // 0x0398
    uint32_t m_scriptVisible; // 0x039C
    uint32_t m_usableType; // 0x0864
    uint32_t 051; // 0x0A04
    uint32_t m_usablePriority; // 0x0868
    float m_usableFOV; // 0x0870
    uint32_t m_baseTakeDamage; // 0x06E5
    uint32_t m_invulnerableToDamageCount; // 0x06E8
    uint32_t m_shieldHealthMax; // 0x0154
    uint32_t m_highlightIsNetworked; // 0x0198
    uint32_t m_areEntityLinksNetworked; // 0x092F
    uint32_t m_debugBrokenInterpolation; // 0x092C
    uint32_t m_entitiesLinkedToMeCount; // 0x0934
    uint32_t 024; // 0x0998
    uint32_t 025; // 0x099C
    uint32_t 026; // 0x09A0
    uint32_t 027; // 0x09A4
    uint32_t 028; // 0x09A8
    uint32_t 029; // 0x09AC
    uint32_t 031; // 0x09B4
    uint32_t 032; // 0x09B8
    uint32_t 033; // 0x09BC
    uint32_t 035; // 0x09C4
    uint32_t 036; // 0x09C8
    uint32_t 037; // 0x09CC
    uint32_t 039; // 0x09D4
    uint32_t 040; // 0x09D8
    uint32_t 041; // 0x09DC
    uint32_t 042; // 0x09E0
    uint32_t 043; // 0x09E4
    uint32_t 047; // 0x09F4
    uint32_t 048; // 0x09F8
    uint32_t 049; // 0x09FC
    uint32_t 050; // 0x0A00
    uint32_t 053; // 0x0A0C
    uint32_t 054; // 0x0A10
    uint32_t 055; // 0x0A14
    uint32_t 057; // 0x0A1C
    uint32_t 059; // 0x0A24
    uint32_t 060; // 0x0A28
    uint32_t 062; // 0x0A30
    uint32_t m_highlightTeamBits; // 0x0338
    fVector3 m_vecMins; // 0x0408
    fVector3 m_vecMaxs; // 0x0414
    uint32_t m_nSolidType; // 0x0424
    uint32_t m_nSurroundType; // 0x0436
    uint32_t m_triggerBloat; // 0x0425
    fVector3 m_vecSpecifiedSurroundingMins; // 0x043C
    fVector3 m_vecSpecifiedSurroundingMaxs; // 0x0448
};

class CWorld {
public:
    fVector3 m_localOrigin; // 0x0040
    uint32_t m_worldFlags; // 0x0B6C
    uint32_t m_areEntityLinksNetworked; // 0x092F
    uint32_t m_highlightIsNetworked; // 0x0198
    uint32_t 021; // 0x098C
    fVector3 m_WorldMins; // 0x0B38
    uint32_t m_clrRender; // 0x0048
    uint32_t m_forceVisibleInPhaseShift; // 0x06E4
    uint32_t 063; // 0x0A34
    uint32_t m_passThroughFlags; // 0x03A8
    fVector3 m_WorldMaxs; // 0x0B44
    float m_usableRadius; // 0x086C
    uint32_t m_cellX; // 0x0034
    uint32_t m_bStartDark; // 0x0B50
    uint32_t m_statusEffectsGenerationNV; // 0x0B64
    const char* m_iSignifierName; // 0x04B0
    uint32_t m_spTitanLoadoutUnlocks; // 0x0B74
    uint32_t 051; // 0x0A04
    uint32_t m_usablePriority; // 0x0868
    fVector3 m_attachmentLerpStartOrigin; // 0x076C
    uint32_t m_timeshiftArmDeviceSkin; // 0x0B70
    uint32_t m_cellY; // 0x0038
    uint32_t m_cellZ; // 0x003C
    uint32_t m_parentAttachmentModel; // 0x0790
    uint32_t m_shieldHealthMax; // 0x0154
    fVector3 m_localAngles; // 0x03CC
    uint32_t m_nModelIndex; // 0x004C
    uint32_t m_fEffects; // 0x0030
    uint32_t m_nRenderMode; // 0x03F1
    const char* m_iName; // 0x04B9
    uint32_t m_nRenderFX; // 0x03E5
    uint32_t m_bRenderWithViewModels; // 0x03E4
    uint32_t m_iTeamNum; // 0x03A4
    uint32_t m_passThroughThickness; // 0x03AC
    uint32_t m_CollisionGroup; // 0x0838
    float m_passThroughDirection; // 0x03B0
    float m_fadeDist; // 0x0798
    fVector3 m_attachmentLerpStartAngles; // 0x0778
    uint32_t m_contents; // 0x083C
    uint32_t m_hOwnerEntity; // 0x03E0
    uint32_t m_dissolveEffectEntityHandle; // 0x0858
    uint32_t m_shieldHealth; // 0x0150
    uint32_t moveparent; // 0x001C
    uint32_t movetype; // 0x0000
    uint32_t m_visibilityFlags; // 0x0398
    uint32_t m_parentAttachmentIndex; // 0x0788
    float m_attachmentLerpStartTime; // 0x0764
    float m_attachmentLerpEndTime; // 0x0768
    fVector3 000; // 0x019C
    uint32_t m_scriptNameIndex; // 0x05C0
    uint32_t 022; // 0x0990
    uint32_t m_instanceNameIndex; // 0x05C4
    const char* m_holdUsePrompt; // 0x0648
    uint32_t m_debugBrokenInterpolation; // 0x092C
    uint32_t 046; // 0x09F0
    const char* m_pressUsePrompt; // 0x0650
    uint32_t movecollide; // 0x0000
    uint32_t m_scriptVisible; // 0x039C
    uint32_t m_usableType; // 0x0864
    uint32_t m_bossPlayer; // 0x0104
    uint32_t m_entitiesLinkedFromMeCount; // 0x0930
    float m_usableFOV; // 0x0870
    float m_usePromptSize; // 0x0874
    uint32_t m_spottedByTeams; // 0x0880
    uint32_t m_baseTakeDamage; // 0x06E5
    uint32_t m_invulnerableToDamageCount; // 0x06E8
    uint32_t m_networkedFlags; // 0x0350
    uint32_t m_entitiesLinkedToMeCount; // 0x0934
    fVector3 001; // 0x01A8
    fVector3 002; // 0x01B4
    fVector3 003; // 0x01C0
    fVector3 004; // 0x01CC
    fVector3 005; // 0x01D8
    fVector3 006; // 0x01E4
    fVector3 007; // 0x01F0
    fVector3 008; // 0x01FC
    fVector3 009; // 0x0208
    fVector3 010; // 0x0214
    fVector3 011; // 0x0220
    fVector3 012; // 0x022C
    fVector3 013; // 0x0238
    fVector3 014; // 0x0244
    fVector3 015; // 0x0250
    uint32_t 016; // 0x0978
    uint32_t 017; // 0x097C
    uint32_t 018; // 0x0980
    uint32_t 019; // 0x0984
    uint32_t 020; // 0x0988
    uint32_t 023; // 0x0994
    uint32_t 024; // 0x0998
    uint32_t 025; // 0x099C
    uint32_t 026; // 0x09A0
    uint32_t 027; // 0x09A4
    uint32_t 028; // 0x09A8
    uint32_t 029; // 0x09AC
    uint32_t 030; // 0x09B0
    uint32_t 031; // 0x09B4
    uint32_t 032; // 0x09B8
    uint32_t 033; // 0x09BC
    uint32_t 034; // 0x09C0
    uint32_t 035; // 0x09C4
    uint32_t 036; // 0x09C8
    uint32_t 037; // 0x09CC
    uint32_t 038; // 0x09D0
    uint32_t 039; // 0x09D4
    uint32_t 040; // 0x09D8
    uint32_t 041; // 0x09DC
    uint32_t 042; // 0x09E0
    uint32_t 043; // 0x09E4
    uint32_t 044; // 0x09E8
    uint32_t 045; // 0x09EC
    uint32_t 047; // 0x09F4
    uint32_t 048; // 0x09F8
    uint32_t 049; // 0x09FC
    uint32_t 050; // 0x0A00
    uint32_t 052; // 0x0A08
    uint32_t 053; // 0x0A0C
    uint32_t 054; // 0x0A10
    uint32_t 055; // 0x0A14
    uint32_t 056; // 0x0A18
    uint32_t 057; // 0x0A1C
    uint32_t 058; // 0x0A20
    uint32_t 059; // 0x0A24
    uint32_t 060; // 0x0A28
    uint32_t 061; // 0x0A2C
    uint32_t 062; // 0x0A30
    uint32_t m_highlightServerContextID; // 0x032C
    uint32_t m_highlightTeamBits; // 0x0338
    uint32_t m_PredictableID; // 0x06F4
    fVector3 m_vecMins; // 0x0408
    fVector3 m_vecMaxs; // 0x0414
    uint32_t m_nSolidType; // 0x0424
    uint32_t m_usSolidFlags; // 0x0420
    uint32_t m_nSurroundType; // 0x0436
    uint32_t m_triggerBloat; // 0x0425
    fVector3 m_vecSpecifiedSurroundingMins; // 0x043C
    fVector3 m_vecSpecifiedSurroundingMaxs; // 0x0448
};

class CMissile {
public:
    uint32_t m_hSpecificTarget; // 0x2188
    fVector3 m_targetPosition; // 0x2198
    fVector3 m_localOrigin; // 0x0040
    uint32_t m_useTargetPosition; // 0x21A4
    uint32_t m_cellX; // 0x0034
    uint32_t m_cellY; // 0x0038
    uint32_t m_cellZ; // 0x003C
    uint32_t m_overrideMods; // 0x1244
    uint32_t m_passThroughDepthTotal; // 0x123C
    fVector3 m_localAngles; // 0x03CC
    uint32_t m_nModelIndex; // 0x004C
    uint32_t m_CollisionGroup; // 0x0838
    uint32_t m_iTeamNum; // 0x03A4
    uint32_t m_PredictableID; // 0x06F4
    uint32_t m_hOwnerEntity; // 0x03E0
    uint32_t m_weaponDataIsSet; // 0x1230
    uint32_t m_forceAdjustToGunBarrelDisabled; // 0x1231
    uint32_t m_weaponClassIndex; // 0x1234
    float m_destructionDistance; // 0x1238
    uint32_t m_impactEffectTable; // 0x124C
    uint32_t m_reducedEffects; // 0x1250
    uint32_t m_modBitfield; // 0x1240
    uint32_t m_projectileTrailIndex; // 0x1248
    float m_projectileCreationTimeServer; // 0x1254
    fVector3 m_vecVelocity; // 0x03C0
    uint32_t m_networkedFlags; // 0x0350
};

class CCrossbowBolt {
public:
    uint32_t m_cellX; // 0x0034
    uint32_t m_cellY; // 0x0038
    uint32_t m_cellZ; // 0x003C
    uint32_t m_nModelIndex; // 0x004C
    fVector3 m_localOrigin; // 0x0040
    uint32_t m_overrideMods; // 0x1244
    uint32_t m_passThroughDepthTotal; // 0x123C
    fVector3 m_localAngles; // 0x03CC
    uint32_t m_CollisionGroup; // 0x0838
    uint32_t m_iTeamNum; // 0x03A4
    uint32_t m_PredictableID; // 0x06F4
    uint32_t m_hOwnerEntity; // 0x03E0
    uint32_t m_weaponDataIsSet; // 0x1230
    uint32_t m_forceAdjustToGunBarrelDisabled; // 0x1231
    uint32_t m_weaponClassIndex; // 0x1234
    float m_destructionDistance; // 0x1238
    uint32_t m_impactEffectTable; // 0x124C
    uint32_t m_reducedEffects; // 0x1250
    uint32_t m_modBitfield; // 0x1240
    uint32_t m_projectileTrailIndex; // 0x1248
    float m_projectileCreationTimeServer; // 0x1254
    fVector3 m_vecVelocity; // 0x03C0
    uint32_t m_networkedFlags; // 0x0350
};

class CVortexSphere {
public:
    uint32_t m_iTeamNum; // 0x03A4
    float m_radius; // 0x0B3C
    float m_usePromptSize; // 0x0874
    uint32_t m_spottedByTeams; // 0x0880
    uint32_t m_spawnflags; // 0x0744
    uint32_t m_enabled; // 0x0B38
    uint32_t 058; // 0x0A20
    float m_height; // 0x0B40
    uint32_t m_ownerWeapon; // 0x0B50
    float m_bulletFov; // 0x0B44
    uint32_t m_bulletAbsorbedCount; // 0x0B48
    uint32_t m_projectileAbsorbedCount; // 0x0B4C
    uint32_t m_vortexEffect; // 0x0B54
    uint32_t 046; // 0x09F0
    const char* m_pressUsePrompt; // 0x0650
    fVector3 m_vortexGunAngles; // 0x0B58
    const char* m_gunAttachment; // 0x0B68
    uint32_t movecollide; // 0x0000
    uint32_t m_iHealth; // 0x0390
    float m_usableRadius; // 0x086C
    uint32_t m_cellX; // 0x0034
    uint32_t m_cellY; // 0x0038
    uint32_t m_cellZ; // 0x003C
    uint32_t m_parentAttachmentModel; // 0x0790
    fVector3 m_localOrigin; // 0x0040
    uint32_t m_shieldHealthMax; // 0x0154
    fVector3 m_localAngles; // 0x03CC
    uint32_t m_nModelIndex; // 0x004C
    uint32_t m_fEffects; // 0x0030
    uint32_t m_nRenderMode; // 0x03F1
    const char* m_iName; // 0x04B9
    uint32_t m_nRenderFX; // 0x03E5
    uint32_t m_clrRender; // 0x0048
    uint32_t m_forceVisibleInPhaseShift; // 0x06E4
    uint32_t 063; // 0x0A34
    uint32_t m_passThroughFlags; // 0x03A8
    uint32_t m_bRenderWithViewModels; // 0x03E4
    uint32_t m_passThroughThickness; // 0x03AC
    uint32_t m_CollisionGroup; // 0x0838
    float m_passThroughDirection; // 0x03B0
    float m_fadeDist; // 0x0798
    fVector3 m_attachmentLerpStartAngles; // 0x0778
    uint32_t m_contents; // 0x083C
    uint32_t m_hOwnerEntity; // 0x03E0
    uint32_t m_dissolveEffectEntityHandle; // 0x0858
    uint32_t m_shieldHealth; // 0x0150
    uint32_t moveparent; // 0x001C
    uint32_t movetype; // 0x0000
    uint32_t m_visibilityFlags; // 0x0398
    uint32_t m_parentAttachmentIndex; // 0x0788
    float m_attachmentLerpStartTime; // 0x0764
    float m_attachmentLerpEndTime; // 0x0768
    uint32_t 051; // 0x0A04
    uint32_t m_usablePriority; // 0x0868
    fVector3 m_attachmentLerpStartOrigin; // 0x076C
    uint32_t m_scriptNameIndex; // 0x05C0
    uint32_t 022; // 0x0990
    uint32_t m_instanceNameIndex; // 0x05C4
    const char* m_holdUsePrompt; // 0x0648
    const char* m_iSignifierName; // 0x04B0
    uint32_t m_scriptVisible; // 0x039C
    uint32_t m_usableType; // 0x0864
    uint32_t m_bossPlayer; // 0x0104
    float m_usableFOV; // 0x0870
    uint32_t m_baseTakeDamage; // 0x06E5
    uint32_t m_invulnerableToDamageCount; // 0x06E8
    uint32_t m_areEntityLinksNetworked; // 0x092F
    uint32_t m_highlightIsNetworked; // 0x0198
    uint32_t m_networkedFlags; // 0x0350
    uint32_t m_debugBrokenInterpolation; // 0x092C
    uint32_t m_entitiesLinkedFromMeCount; // 0x0930
    uint32_t m_entitiesLinkedToMeCount; // 0x0934
    fVector3 000; // 0x019C
    fVector3 001; // 0x01A8
    fVector3 002; // 0x01B4
    fVector3 003; // 0x01C0
    fVector3 004; // 0x01CC
    fVector3 005; // 0x01D8
    fVector3 006; // 0x01E4
    fVector3 007; // 0x01F0
    fVector3 008; // 0x01FC
    fVector3 009; // 0x0208
    fVector3 010; // 0x0214
    fVector3 011; // 0x0220
    fVector3 012; // 0x022C
    fVector3 013; // 0x0238
    fVector3 014; // 0x0244
    fVector3 015; // 0x0250
    uint32_t 016; // 0x0978
    uint32_t 017; // 0x097C
    uint32_t 018; // 0x0980
    uint32_t 019; // 0x0984
    uint32_t 020; // 0x0988
    uint32_t 021; // 0x098C
    uint32_t 023; // 0x0994
    uint32_t 024; // 0x0998
    uint32_t 025; // 0x099C
    uint32_t 026; // 0x09A0
    uint32_t 027; // 0x09A4
    uint32_t 028; // 0x09A8
    uint32_t 029; // 0x09AC
    uint32_t 030; // 0x09B0
    uint32_t 031; // 0x09B4
    uint32_t 032; // 0x09B8
    uint32_t 033; // 0x09BC
    uint32_t 034; // 0x09C0
    uint32_t 035; // 0x09C4
    uint32_t 036; // 0x09C8
    uint32_t 037; // 0x09CC
    uint32_t 038; // 0x09D0
    uint32_t 039; // 0x09D4
    uint32_t 040; // 0x09D8
    uint32_t 041; // 0x09DC
    uint32_t 042; // 0x09E0
    uint32_t 043; // 0x09E4
    uint32_t 044; // 0x09E8
    uint32_t 045; // 0x09EC
    uint32_t 047; // 0x09F4
    uint32_t 048; // 0x09F8
    uint32_t 049; // 0x09FC
    uint32_t 050; // 0x0A00
    uint32_t 052; // 0x0A08
    uint32_t 053; // 0x0A0C
    uint32_t 054; // 0x0A10
    uint32_t 055; // 0x0A14
    uint32_t 056; // 0x0A18
    uint32_t 057; // 0x0A1C
    uint32_t 059; // 0x0A24
    uint32_t 060; // 0x0A28
    uint32_t 061; // 0x0A2C
    uint32_t 062; // 0x0A30
    uint32_t m_highlightServerContextID; // 0x032C
    uint32_t m_highlightTeamBits; // 0x0338
    uint32_t m_PredictableID; // 0x06F4
    fVector3 m_vecMins; // 0x0408
    fVector3 m_vecMaxs; // 0x0414
    uint32_t m_nSolidType; // 0x0424
    uint32_t m_usSolidFlags; // 0x0420
    uint32_t m_nSurroundType; // 0x0436
    uint32_t m_triggerBloat; // 0x0425
    fVector3 m_vecSpecifiedSurroundingMins; // 0x043C
    fVector3 m_vecSpecifiedSurroundingMaxs; // 0x0448
};

class CScriptTraceVolume {
public:
    float m_fadeDist; // 0x0798
    fVector3 m_attachmentLerpStartAngles; // 0x0778
    uint32_t m_contents; // 0x083C
    float m_sphereRadius; // 0x0B40
    uint32_t m_dissolveEffectEntityHandle; // 0x0858
    uint32_t m_shieldHealth; // 0x0150
    uint32_t m_highlightTeamBits; // 0x0338
    uint32_t m_shapeType; // 0x0B3C
    float m_usableRadius; // 0x086C
    uint32_t m_cellX; // 0x0034
    float m_attachmentLerpEndTime; // 0x0768
    fVector3 m_boxMins; // 0x0B44
    fVector3 m_boxMaxs; // 0x0B50
    uint32_t m_baseTakeDamage; // 0x06E5
    uint32_t 029; // 0x09AC
    uint32_t m_drawDebug; // 0x0B5C
    uint32_t m_cellY; // 0x0038
    uint32_t m_cellZ; // 0x003C
    uint32_t m_parentAttachmentModel; // 0x0790
    fVector3 m_localOrigin; // 0x0040
    uint32_t m_shieldHealthMax; // 0x0154
    fVector3 m_localAngles; // 0x03CC
    uint32_t m_nModelIndex; // 0x004C
    uint32_t m_fEffects; // 0x0030
    uint32_t m_nRenderMode; // 0x03F1
    const char* m_iName; // 0x04B9
    uint32_t m_nRenderFX; // 0x03E5
    uint32_t m_clrRender; // 0x0048
    uint32_t m_forceVisibleInPhaseShift; // 0x06E4
    uint32_t 063; // 0x0A34
    uint32_t m_passThroughFlags; // 0x03A8
    uint32_t m_bRenderWithViewModels; // 0x03E4
    uint32_t m_iTeamNum; // 0x03A4
    uint32_t m_passThroughThickness; // 0x03AC
    uint32_t m_CollisionGroup; // 0x0838
    float m_passThroughDirection; // 0x03B0
    uint32_t m_hOwnerEntity; // 0x03E0
    uint32_t moveparent; // 0x001C
    uint32_t movetype; // 0x0000
    uint32_t m_visibilityFlags; // 0x0398
    uint32_t m_parentAttachmentIndex; // 0x0788
    fVector3 003; // 0x01C0
    float m_attachmentLerpStartTime; // 0x0764
    fVector3 002; // 0x01B4
    uint32_t 051; // 0x0A04
    uint32_t m_usablePriority; // 0x0868
    fVector3 m_attachmentLerpStartOrigin; // 0x076C
    fVector3 000; // 0x019C
    uint32_t m_scriptNameIndex; // 0x05C0
    uint32_t 022; // 0x0990
    uint32_t m_instanceNameIndex; // 0x05C4
    const char* m_holdUsePrompt; // 0x0648
    uint32_t m_debugBrokenInterpolation; // 0x092C
    uint32_t 046; // 0x09F0
    const char* m_pressUsePrompt; // 0x0650
    const char* m_iSignifierName; // 0x04B0
    uint32_t movecollide; // 0x0000
    uint32_t m_scriptVisible; // 0x039C
    uint32_t m_usableType; // 0x0864
    uint32_t m_bossPlayer; // 0x0104
    uint32_t m_entitiesLinkedFromMeCount; // 0x0930
    float m_usableFOV; // 0x0870
    float m_usePromptSize; // 0x0874
    uint32_t m_spottedByTeams; // 0x0880
    uint32_t m_invulnerableToDamageCount; // 0x06E8
    uint32_t m_areEntityLinksNetworked; // 0x092F
    uint32_t m_highlightIsNetworked; // 0x0198
    uint32_t m_networkedFlags; // 0x0350
    uint32_t m_entitiesLinkedToMeCount; // 0x0934
    fVector3 001; // 0x01A8
    fVector3 004; // 0x01CC
    fVector3 005; // 0x01D8
    fVector3 006; // 0x01E4
    fVector3 007; // 0x01F0
    fVector3 008; // 0x01FC
    fVector3 009; // 0x0208
    fVector3 010; // 0x0214
    fVector3 011; // 0x0220
    fVector3 012; // 0x022C
    fVector3 013; // 0x0238
    fVector3 014; // 0x0244
    fVector3 015; // 0x0250
    uint32_t 016; // 0x0978
    uint32_t 017; // 0x097C
    uint32_t 018; // 0x0980
    uint32_t 019; // 0x0984
    uint32_t 020; // 0x0988
    uint32_t 021; // 0x098C
    uint32_t 023; // 0x0994
    uint32_t 024; // 0x0998
    uint32_t 025; // 0x099C
    uint32_t 026; // 0x09A0
    uint32_t 027; // 0x09A4
    uint32_t 028; // 0x09A8
    uint32_t 030; // 0x09B0
    uint32_t 031; // 0x09B4
    uint32_t 032; // 0x09B8
    uint32_t 033; // 0x09BC
    uint32_t 034; // 0x09C0
    uint32_t 035; // 0x09C4
    uint32_t 036; // 0x09C8
    uint32_t 037; // 0x09CC
    uint32_t 038; // 0x09D0
    uint32_t 039; // 0x09D4
    uint32_t 040; // 0x09D8
    uint32_t 041; // 0x09DC
    uint32_t 042; // 0x09E0
    uint32_t 043; // 0x09E4
    uint32_t 044; // 0x09E8
    uint32_t 045; // 0x09EC
    uint32_t 047; // 0x09F4
    uint32_t 048; // 0x09F8
    uint32_t 049; // 0x09FC
    uint32_t 050; // 0x0A00
    uint32_t 052; // 0x0A08
    uint32_t 053; // 0x0A0C
    uint32_t 054; // 0x0A10
    uint32_t 055; // 0x0A14
    uint32_t 056; // 0x0A18
    uint32_t 057; // 0x0A1C
    uint32_t 058; // 0x0A20
    uint32_t 059; // 0x0A24
    uint32_t 060; // 0x0A28
    uint32_t 061; // 0x0A2C
    uint32_t 062; // 0x0A30
    uint32_t m_highlightServerContextID; // 0x032C
    uint32_t m_PredictableID; // 0x06F4
    fVector3 m_vecMins; // 0x0408
    fVector3 m_vecMaxs; // 0x0414
    uint32_t m_nSolidType; // 0x0424
    uint32_t m_usSolidFlags; // 0x0420
    uint32_t m_nSurroundType; // 0x0436
    uint32_t m_triggerBloat; // 0x0425
    fVector3 m_vecSpecifiedSurroundingMins; // 0x043C
    fVector3 m_vecSpecifiedSurroundingMaxs; // 0x0448
};

class ScriptMover {
public:
    uint32_t m_passDamageToParent; // 0x06EC
    uint32_t m_iMaxHealth; // 0x04A8
    uint32_t m_parentAttachmentType; // 0x0020
    fVector3 m_localAngles; // 0x03CC
    uint32_t m_physDummyMotionEnabled; // 0x092D
    fVector3 m_vecVelocity; // 0x03C0
    uint32_t 032; // 0x09B8
    uint32_t m_parentAttachmentHitbox; // 0x078C
    fVector3 m_vecAngVelocity; // 0x0108
    uint32_t 024; // 0x0998
    const char* m_title; // 0x1280
    const char* m_footstepType; // 0x12A0
    uint32_t zOrder; // 0x089C
    uint32_t 031; // 0x09B4
    uint32_t m_renderColorFriendly; // 0x12E1
    uint32_t m_networkedFlags; // 0x0350
    uint32_t m_nameVisibilityFlags; // 0x08A8
    uint32_t m_iHealth; // 0x0390
    uint32_t m_renderColorFriendlyIsValid; // 0x12E0
    uint32_t m_predictedAnimEventSequence; // 0x0CB0
    uint32_t m_predictedAnimEventTarget; // 0x0CAC
    uint32_t m_armorType; // 0x12E8
    fVector3 003; // 0x01C0
    uint32_t 050; // 0x0A00
    uint32_t m_bUseHitboxesForRenderBox; // 0x1239
    uint32_t m_scriptPropFlags; // 0x12EC
    uint32_t m_scriptPropSmartAmmoLockType; // 0x12F0
    int64_t visibilityDefaultFlag; // 0x0888
    float m_flModelScale; // 0x102C
    int64_t visibilityShowFlag; // 0x0890
    uint32_t flags; // 0x0898
    uint32_t 035; // 0x09C4
    uint32_t customState; // 0x08A0
    float m_flSkyScaleEndValue; // 0x0CD4
    uint32_t m_bClientSideRagdoll; // 0x0084
    uint32_t m_lifeState; // 0x06C8
    float objectScale; // 0x08A4
    uint32_t m_iTeamNum; // 0x03A4
    uint32_t m_bPhysicsMotionEnabled; // 0x1230
    fVector3 002; // 0x01B4
    uint32_t m_predictedAnimEventCount; // 0x0CA8
    fVector3 m_attachmentLerpStartOrigin; // 0x076C
    uint32_t m_animSequence; // 0x001C
    uint32_t m_animModelIndex; // 0x0018
    uint32_t m_bSequenceFinished; // 0x1020
    uint32_t 061; // 0x0A2C
    uint32_t m_nForceBone; // 0x0FB8
    fVector3 010; // 0x0214
    uint32_t m_useLockedAnimDeltaYaw; // 0x1021
    float m_lockedAnimDeltaYaw; // 0x1024
    uint32_t m_bCanUseFastPathFromServer; // 0x1019
    fVector3 m_vecForce; // 0x0088
    uint32_t 045; // 0x09EC
    uint32_t m_nSkin; // 0x0F80
    uint32_t m_bossPlayer; // 0x0104
    uint32_t m_nBody; // 0x0F84
    float m_animPlaybackRate; // 0x0010
    uint32_t m_animActive; // 0x0B64
    uint32_t m_animFrozen; // 0x0014
    uint32_t m_passThroughThickness; // 0x03AC
    uint32_t m_syncingWithEntity; // 0x0C5C
    uint32_t m_nRagdollImpactFXTableId; // 0x0CCC
    float m_usableRadius; // 0x086C
    float m_flSkyScaleStartValue; // 0x0CD0
    float m_flSkyScaleStartTime; // 0x0CD8
    float m_flSkyScaleEndTime; // 0x0CDC
    uint32_t m_nNewSequenceParity; // 0x0020
    float m_flEstIkOffset; // 0x0094
    uint32_t m_animCollisionEnabled; // 0x0B67
    uint32_t m_animNetworkFlags; // 0x0B60
    fVector3 004; // 0x01CC
    uint32_t m_predictedAnimEventModel; // 0x0CB4
    uint32_t m_CollisionGroup; // 0x0838
    float m_predictedAnimEventsReadyToFireTime; // 0x0CB8
    fVector3 000; // 0x019C
    fVector3 001; // 0x01A8
    fVector3 005; // 0x01D8
    fVector3 006; // 0x01E4
    fVector3 007; // 0x01F0
    fVector3 m_animInitialPos; // 0x0B6C
    const char* m_iName; // 0x04B9
    fVector3 m_animInitialVel; // 0x0B78
    fVector4 m_animInitialRot; // 0x0B84
    uint32_t 056; // 0x0A18
    fVector3 m_animInitialCorrectPos; // 0x0B94
    uint32_t m_spottedByTeams; // 0x0880
    float m_usePromptSize; // 0x0874
    fVector4 m_animInitialCorrectRot; // 0x0BA0
    fVector3 m_animEntityToRefOffset; // 0x0BB0
    fVector4 m_animEntityToRefRotation; // 0x0BBC
    float m_animBeginTime; // 0x0BCC
    float m_animEndTime; // 0x0BD0
    uint32_t m_animScriptSequence; // 0x0BD4
    uint32_t m_animScriptModel; // 0x0BD8
    uint32_t m_animIgnoreParentRot; // 0x0BDC
    uint32_t m_animMotionMode; // 0x0BE0
    uint32_t m_sequenceTransitionerLayerCount; // 0x0E98
    uint32_t m_sequenceTransitionerLayerActive; // 0x0D60
    uint32_t m_sequenceTransitionerLayerModelIndex; // 0x0D64
    float m_sequenceTransitionerLayerStartCycle; // 0x0D68
    uint32_t 034; // 0x09C0
    uint32_t m_sequenceTransitionerLayerSequence; // 0x0D6C
    float m_sequenceTransitionerLayerPlaybackRate; // 0x0D74
    float m_sequenceTransitionerLayerStartTime; // 0x0D78
    float m_sequenceTransitionerLayerFadeOutDuration; // 0x0D7C
    float m_animStartTime; // 0x0008
    float m_animStartCycle; // 0x000C
    uint32_t 052; // 0x0A08
    uint32_t m_nResetEventsParity; // 0x0F90
    fVector3 008; // 0x01FC
    fVector3 009; // 0x0208
    fVector3 011; // 0x0220
    fVector3 012; // 0x022C
    fVector3 013; // 0x0238
    fVector3 014; // 0x0244
    fVector3 015; // 0x0250
    uint32_t 016; // 0x0978
    uint32_t 017; // 0x097C
    uint32_t 018; // 0x0980
    uint32_t 019; // 0x0984
    uint32_t 020; // 0x0988
    uint32_t 021; // 0x098C
    uint32_t m_instanceNameIndex; // 0x05C4
    uint32_t 022; // 0x0990
    uint32_t 023; // 0x0994
    uint32_t m_cellX; // 0x0034
    uint32_t m_cellY; // 0x0038
    uint32_t m_parentAttachmentModel; // 0x0790
    uint32_t m_cellZ; // 0x003C
    fVector3 m_localOrigin; // 0x0040
    uint32_t m_nModelIndex; // 0x004C
    uint32_t m_fEffects; // 0x0030
    uint32_t m_nRenderMode; // 0x03F1
    uint32_t m_nRenderFX; // 0x03E5
    uint32_t m_forceVisibleInPhaseShift; // 0x06E4
    uint32_t m_clrRender; // 0x0048
    uint32_t m_bRenderWithViewModels; // 0x03E4
    uint32_t 063; // 0x0A34
    uint32_t m_passThroughFlags; // 0x03A8
    float m_passThroughDirection; // 0x03B0
    uint32_t m_contents; // 0x083C
    uint32_t m_hOwnerEntity; // 0x03E0
    uint32_t m_shieldHealth; // 0x0150
    uint32_t m_dissolveEffectEntityHandle; // 0x0858
    uint32_t movetype; // 0x0000
    uint32_t moveparent; // 0x001C
    uint32_t m_parentAttachmentIndex; // 0x0788
    float m_attachmentLerpStartTime; // 0x0764
    float m_attachmentLerpEndTime; // 0x0768
    fVector3 m_attachmentLerpStartAngles; // 0x0778
    uint32_t m_scriptNameIndex; // 0x05C0
    const char* m_holdUsePrompt; // 0x0648
    uint32_t 046; // 0x09F0
    const char* m_pressUsePrompt; // 0x0650
    const char* m_iSignifierName; // 0x04B0
    uint32_t movecollide; // 0x0000
    float m_fadeDist; // 0x0798
    uint32_t m_visibilityFlags; // 0x0398
    uint32_t m_scriptVisible; // 0x039C
    uint32_t m_usableType; // 0x0864
    uint32_t 051; // 0x0A04
    uint32_t m_usablePriority; // 0x0868
    float m_usableFOV; // 0x0870
    uint32_t m_baseTakeDamage; // 0x06E5
    uint32_t m_invulnerableToDamageCount; // 0x06E8
    uint32_t m_shieldHealthMax; // 0x0154
    uint32_t m_highlightIsNetworked; // 0x0198
    uint32_t m_areEntityLinksNetworked; // 0x092F
    uint32_t m_debugBrokenInterpolation; // 0x092C
    uint32_t m_entitiesLinkedFromMeCount; // 0x0930
    uint32_t m_entitiesLinkedToMeCount; // 0x0934
    uint32_t 025; // 0x099C
    uint32_t 026; // 0x09A0
    uint32_t 027; // 0x09A4
    uint32_t 028; // 0x09A8
    uint32_t 029; // 0x09AC
    uint32_t 030; // 0x09B0
    uint32_t 033; // 0x09BC
    uint32_t 036; // 0x09C8
    uint32_t 037; // 0x09CC
    uint32_t 038; // 0x09D0
    uint32_t 039; // 0x09D4
    uint32_t 040; // 0x09D8
    uint32_t 041; // 0x09DC
    uint32_t 042; // 0x09E0
    uint32_t 043; // 0x09E4
    uint32_t 044; // 0x09E8
    uint32_t 047; // 0x09F4
    uint32_t 048; // 0x09F8
    uint32_t 049; // 0x09FC
    uint32_t 053; // 0x0A0C
    uint32_t 054; // 0x0A10
    uint32_t 055; // 0x0A14
    uint32_t 057; // 0x0A1C
    uint32_t 058; // 0x0A20
    uint32_t 059; // 0x0A24
    uint32_t 060; // 0x0A28
    uint32_t 062; // 0x0A30
    uint32_t m_highlightServerContextID; // 0x032C
    uint32_t m_highlightTeamBits; // 0x0338
    uint32_t m_PredictableID; // 0x06F4
    fVector3 m_vecMins; // 0x0408
    fVector3 m_vecMaxs; // 0x0414
    uint32_t m_nSolidType; // 0x0424
    uint32_t m_usSolidFlags; // 0x0420
    uint32_t m_nSurroundType; // 0x0436
    uint32_t m_triggerBloat; // 0x0425
    fVector3 m_vecSpecifiedSurroundingMins; // 0x043C
    fVector3 m_vecSpecifiedSurroundingMaxs; // 0x0448
};

class CProjectile {
public:
    uint32_t m_cellX; // 0x0034
    uint32_t m_cellY; // 0x0038
    uint32_t m_cellZ; // 0x003C
    uint32_t m_nModelIndex; // 0x004C
    fVector3 m_localOrigin; // 0x0040
    uint32_t m_overrideMods; // 0x1244
    uint32_t m_passThroughDepthTotal; // 0x123C
    fVector3 m_localAngles; // 0x03CC
    uint32_t m_CollisionGroup; // 0x0838
    uint32_t m_iTeamNum; // 0x03A4
    uint32_t m_PredictableID; // 0x06F4
    uint32_t m_hOwnerEntity; // 0x03E0
    uint32_t m_weaponDataIsSet; // 0x1230
    uint32_t m_forceAdjustToGunBarrelDisabled; // 0x1231
    uint32_t m_weaponClassIndex; // 0x1234
    float m_destructionDistance; // 0x1238
    uint32_t m_impactEffectTable; // 0x124C
    uint32_t m_reducedEffects; // 0x1250
    uint32_t m_modBitfield; // 0x1240
    uint32_t m_projectileTrailIndex; // 0x1248
    float m_projectileCreationTimeServer; // 0x1254
    fVector3 m_vecVelocity; // 0x03C0
    uint32_t m_networkedFlags; // 0x0350
};

class CGrappleHook {
public:
    uint32_t m_cellX; // 0x0034
    uint32_t moveparent; // 0x001C
    uint32_t m_cellY; // 0x0038
    uint32_t m_cellZ; // 0x003C
    fVector3 m_localOrigin; // 0x0040
    uint32_t m_parentAttachmentType; // 0x0020
    fVector3 m_localAngles; // 0x03CC
    uint32_t m_hOwnerEntity; // 0x03E0
    uint32_t m_parentAttachmentHitbox; // 0x078C
    uint32_t m_nModelIndex; // 0x004C
    uint32_t m_visibilityFlags; // 0x0398
};

class CVGuiScreen {
public:
    uint32_t m_hPlayerOwner; // 0x0BD8
    uint32_t m_usableType; // 0x0864
    uint32_t m_bossPlayer; // 0x0104
    uint32_t 055; // 0x0A14
    float m_flWidth; // 0x0B38
    uint32_t m_entitiesLinkedFromMeCount; // 0x0930
    float m_usableFOV; // 0x0870
    uint32_t m_nAttachmentIndex; // 0x0B64
    float m_flHeight; // 0x0B3C
    uint32_t m_cellY; // 0x0038
    uint32_t m_fScreenFlags; // 0x0B6C
    float m_attachmentLerpStartTime; // 0x0764
    fVector3 003; // 0x01C0
    uint32_t m_nPanelName; // 0x0B48
    uint32_t m_bRenderWithViewModels; // 0x03E4
    uint32_t m_nOverlayMaterial; // 0x0B68
    float m_usableRadius; // 0x086C
    uint32_t m_cellX; // 0x0034
    uint32_t m_cellZ; // 0x003C
    uint32_t m_parentAttachmentModel; // 0x0790
    fVector3 m_localOrigin; // 0x0040
    uint32_t m_shieldHealthMax; // 0x0154
    fVector3 m_localAngles; // 0x03CC
    uint32_t m_nModelIndex; // 0x004C
    uint32_t m_fEffects; // 0x0030
    uint32_t m_nRenderMode; // 0x03F1
    const char* m_iName; // 0x04B9
    uint32_t m_nRenderFX; // 0x03E5
    uint32_t m_clrRender; // 0x0048
    uint32_t m_forceVisibleInPhaseShift; // 0x06E4
    uint32_t 063; // 0x0A34
    uint32_t m_passThroughFlags; // 0x03A8
    uint32_t m_iTeamNum; // 0x03A4
    uint32_t m_passThroughThickness; // 0x03AC
    uint32_t m_CollisionGroup; // 0x0838
    float m_passThroughDirection; // 0x03B0
    float m_fadeDist; // 0x0798
    fVector3 m_attachmentLerpStartAngles; // 0x0778
    uint32_t m_contents; // 0x083C
    uint32_t m_hOwnerEntity; // 0x03E0
    uint32_t m_dissolveEffectEntityHandle; // 0x0858
    uint32_t m_shieldHealth; // 0x0150
    uint32_t moveparent; // 0x001C
    uint32_t movetype; // 0x0000
    uint32_t m_visibilityFlags; // 0x0398
    uint32_t m_parentAttachmentIndex; // 0x0788
    float m_attachmentLerpEndTime; // 0x0768
    uint32_t 051; // 0x0A04
    uint32_t m_usablePriority; // 0x0868
    fVector3 m_attachmentLerpStartOrigin; // 0x076C
    fVector3 000; // 0x019C
    uint32_t m_scriptNameIndex; // 0x05C0
    uint32_t 022; // 0x0990
    uint32_t m_instanceNameIndex; // 0x05C4
    const char* m_holdUsePrompt; // 0x0648
    uint32_t m_debugBrokenInterpolation; // 0x092C
    uint32_t 046; // 0x09F0
    const char* m_pressUsePrompt; // 0x0650
    const char* m_iSignifierName; // 0x04B0
    uint32_t movecollide; // 0x0000
    uint32_t m_scriptVisible; // 0x039C
    float m_usePromptSize; // 0x0874
    uint32_t m_spottedByTeams; // 0x0880
    uint32_t m_baseTakeDamage; // 0x06E5
    uint32_t m_invulnerableToDamageCount; // 0x06E8
    uint32_t m_areEntityLinksNetworked; // 0x092F
    uint32_t m_highlightIsNetworked; // 0x0198
    uint32_t m_networkedFlags; // 0x0350
    uint32_t m_entitiesLinkedToMeCount; // 0x0934
    fVector3 001; // 0x01A8
    fVector3 002; // 0x01B4
    fVector3 004; // 0x01CC
    fVector3 005; // 0x01D8
    fVector3 006; // 0x01E4
    fVector3 007; // 0x01F0
    fVector3 008; // 0x01FC
    fVector3 009; // 0x0208
    fVector3 010; // 0x0214
    fVector3 011; // 0x0220
    fVector3 012; // 0x022C
    fVector3 013; // 0x0238
    fVector3 014; // 0x0244
    fVector3 015; // 0x0250
    uint32_t 016; // 0x0978
    uint32_t 017; // 0x097C
    uint32_t 018; // 0x0980
    uint32_t 019; // 0x0984
    uint32_t 020; // 0x0988
    uint32_t 021; // 0x098C
    uint32_t 023; // 0x0994
    uint32_t 024; // 0x0998
    uint32_t 025; // 0x099C
    uint32_t 026; // 0x09A0
    uint32_t 027; // 0x09A4
    uint32_t 028; // 0x09A8
    uint32_t 029; // 0x09AC
    uint32_t 030; // 0x09B0
    uint32_t 031; // 0x09B4
    uint32_t 032; // 0x09B8
    uint32_t 033; // 0x09BC
    uint32_t 034; // 0x09C0
    uint32_t 035; // 0x09C4
    uint32_t 036; // 0x09C8
    uint32_t 037; // 0x09CC
    uint32_t 038; // 0x09D0
    uint32_t 039; // 0x09D4
    uint32_t 040; // 0x09D8
    uint32_t 041; // 0x09DC
    uint32_t 042; // 0x09E0
    uint32_t 043; // 0x09E4
    uint32_t 044; // 0x09E8
    uint32_t 045; // 0x09EC
    uint32_t 047; // 0x09F4
    uint32_t 048; // 0x09F8
    uint32_t 049; // 0x09FC
    uint32_t 050; // 0x0A00
    uint32_t 052; // 0x0A08
    uint32_t 053; // 0x0A0C
    uint32_t 054; // 0x0A10
    uint32_t 056; // 0x0A18
    uint32_t 057; // 0x0A1C
    uint32_t 058; // 0x0A20
    uint32_t 059; // 0x0A24
    uint32_t 060; // 0x0A28
    uint32_t 061; // 0x0A2C
    uint32_t 062; // 0x0A30
    uint32_t m_highlightServerContextID; // 0x032C
    uint32_t m_highlightTeamBits; // 0x0338
    uint32_t m_PredictableID; // 0x06F4
    fVector3 m_vecMins; // 0x0408
    fVector3 m_vecMaxs; // 0x0414
    uint32_t m_nSolidType; // 0x0424
    uint32_t m_usSolidFlags; // 0x0420
    uint32_t m_nSurroundType; // 0x0436
    uint32_t m_triggerBloat; // 0x0425
    fVector3 m_vecSpecifiedSurroundingMins; // 0x043C
    fVector3 m_vecSpecifiedSurroundingMaxs; // 0x0448
};

class CFirstPersonProxy {
public:
    float m_animEndTime; // 0x0BD0
    uint32_t m_viewModelOwner; // 0x1230
    float m_animBeginTime; // 0x0BCC
    uint32_t m_sequenceTransitionerLayerActive; // 0x0D60
    float m_lockedAnimDeltaYaw; // 0x1024
    uint32_t m_camoIndex; // 0x0F88
    fVector3 002; // 0x01B4
    uint32_t m_predictedAnimEventCount; // 0x0CA8
    fVector3 m_attachmentLerpStartOrigin; // 0x076C
    uint32_t m_animSequence; // 0x001C
    uint32_t m_animModelIndex; // 0x0018
    fVector3 m_animInitialPos; // 0x0B6C
    uint32_t m_bCanUseFastPathFromServer; // 0x1019
    uint32_t 061; // 0x0A2C
    uint32_t m_nForceBone; // 0x0FB8
    fVector3 010; // 0x0214
    uint32_t m_useLockedAnimDeltaYaw; // 0x1021
    uint32_t m_sequenceTransitionerLayerModelIndex; // 0x0D64
    uint32_t m_bSequenceFinished; // 0x1020
    fVector3 m_vecForce; // 0x0088
    fVector3 m_animEntityToRefOffset; // 0x0BB0
    uint32_t 045; // 0x09EC
    uint32_t m_nSkin; // 0x0F80
    fVector3 006; // 0x01E4
    uint32_t m_bossPlayer; // 0x0104
    uint32_t m_nBody; // 0x0F84
    float m_sequenceTransitionerLayerStartTime; // 0x0D78
    float m_flModelScale; // 0x102C
    float m_animPlaybackRate; // 0x0010
    uint32_t m_animActive; // 0x0B64
    uint32_t m_animFrozen; // 0x0014
    float m_flSkyScaleEndValue; // 0x0CD4
    uint32_t m_bClientSideRagdoll; // 0x0084
    uint32_t m_passThroughThickness; // 0x03AC
    uint32_t m_syncingWithEntity; // 0x0C5C
    uint32_t m_nRagdollImpactFXTableId; // 0x0CCC
    float m_usableRadius; // 0x086C
    float m_flSkyScaleStartValue; // 0x0CD0
    float m_flSkyScaleStartTime; // 0x0CD8
    float m_flSkyScaleEndTime; // 0x0CDC
    uint32_t m_nNewSequenceParity; // 0x0020
    uint32_t m_passDamageToParent; // 0x06EC
    float m_flEstIkOffset; // 0x0094
    uint32_t m_animMotionMode; // 0x0BE0
    fVector4 m_animInitialRot; // 0x0B84
    uint32_t m_animCollisionEnabled; // 0x0B67
    uint32_t m_animNetworkFlags; // 0x0B60
    const char* m_iName; // 0x04B9
    fVector3 m_animInitialVel; // 0x0B78
    uint32_t m_predictedAnimEventSequence; // 0x0CB0
    uint32_t m_predictedAnimEventTarget; // 0x0CAC
    fVector3 004; // 0x01CC
    uint32_t m_predictedAnimEventModel; // 0x0CB4
    float m_sequenceTransitionerLayerPlaybackRate; // 0x0D74
    uint32_t m_CollisionGroup; // 0x0838
    float m_predictedAnimEventsReadyToFireTime; // 0x0CB8
    fVector3 000; // 0x019C
    fVector3 001; // 0x01A8
    fVector3 003; // 0x01C0
    uint32_t 056; // 0x0A18
    fVector3 m_animInitialCorrectPos; // 0x0B94
    fVector3 005; // 0x01D8
    fVector3 007; // 0x01F0
    uint32_t m_spottedByTeams; // 0x0880
    float m_usePromptSize; // 0x0874
    fVector4 m_animInitialCorrectRot; // 0x0BA0
    fVector4 m_animEntityToRefRotation; // 0x0BBC
    uint32_t m_animScriptSequence; // 0x0BD4
    uint32_t m_animScriptModel; // 0x0BD8
    uint32_t m_animIgnoreParentRot; // 0x0BDC
    uint32_t m_sequenceTransitionerLayerCount; // 0x0E98
    float m_sequenceTransitionerLayerStartCycle; // 0x0D68
    uint32_t 034; // 0x09C0
    uint32_t m_sequenceTransitionerLayerSequence; // 0x0D6C
    float m_sequenceTransitionerLayerFadeOutDuration; // 0x0D7C
    float m_animStartTime; // 0x0008
    float m_animStartCycle; // 0x000C
    uint32_t 052; // 0x0A08
    uint32_t m_nResetEventsParity; // 0x0F90
    fVector3 008; // 0x01FC
    fVector3 009; // 0x0208
    fVector3 011; // 0x0220
    fVector3 012; // 0x022C
    fVector3 013; // 0x0238
    fVector3 014; // 0x0244
    fVector3 015; // 0x0250
    uint32_t 016; // 0x0978
    uint32_t 017; // 0x097C
    uint32_t 018; // 0x0980
    uint32_t 019; // 0x0984
    uint32_t 020; // 0x0988
    uint32_t 021; // 0x098C
    uint32_t m_instanceNameIndex; // 0x05C4
    uint32_t 022; // 0x0990
    uint32_t 023; // 0x0994
    uint32_t m_cellX; // 0x0034
    uint32_t m_cellY; // 0x0038
    uint32_t m_parentAttachmentModel; // 0x0790
    uint32_t m_cellZ; // 0x003C
    fVector3 m_localOrigin; // 0x0040
    fVector3 m_localAngles; // 0x03CC
    uint32_t m_nModelIndex; // 0x004C
    uint32_t m_fEffects; // 0x0030
    uint32_t m_nRenderMode; // 0x03F1
    uint32_t m_nRenderFX; // 0x03E5
    uint32_t m_forceVisibleInPhaseShift; // 0x06E4
    uint32_t m_clrRender; // 0x0048
    uint32_t m_bRenderWithViewModels; // 0x03E4
    uint32_t m_iTeamNum; // 0x03A4
    uint32_t 063; // 0x0A34
    uint32_t m_passThroughFlags; // 0x03A8
    float m_passThroughDirection; // 0x03B0
    uint32_t m_contents; // 0x083C
    uint32_t m_hOwnerEntity; // 0x03E0
    uint32_t m_shieldHealth; // 0x0150
    uint32_t m_dissolveEffectEntityHandle; // 0x0858
    uint32_t movetype; // 0x0000
    uint32_t moveparent; // 0x001C
    uint32_t m_parentAttachmentIndex; // 0x0788
    float m_attachmentLerpStartTime; // 0x0764
    float m_attachmentLerpEndTime; // 0x0768
    fVector3 m_attachmentLerpStartAngles; // 0x0778
    uint32_t m_scriptNameIndex; // 0x05C0
    const char* m_holdUsePrompt; // 0x0648
    uint32_t 046; // 0x09F0
    const char* m_pressUsePrompt; // 0x0650
    const char* m_iSignifierName; // 0x04B0
    uint32_t movecollide; // 0x0000
    float m_fadeDist; // 0x0798
    uint32_t m_visibilityFlags; // 0x0398
    uint32_t m_scriptVisible; // 0x039C
    uint32_t m_usableType; // 0x0864
    uint32_t 051; // 0x0A04
    uint32_t m_usablePriority; // 0x0868
    float m_usableFOV; // 0x0870
    uint32_t m_baseTakeDamage; // 0x06E5
    uint32_t m_invulnerableToDamageCount; // 0x06E8
    uint32_t m_shieldHealthMax; // 0x0154
    uint32_t m_highlightIsNetworked; // 0x0198
    uint32_t m_areEntityLinksNetworked; // 0x092F
    uint32_t m_networkedFlags; // 0x0350
    uint32_t m_debugBrokenInterpolation; // 0x092C
    uint32_t m_entitiesLinkedFromMeCount; // 0x0930
    uint32_t m_entitiesLinkedToMeCount; // 0x0934
    uint32_t 024; // 0x0998
    uint32_t 025; // 0x099C
    uint32_t 026; // 0x09A0
    uint32_t 027; // 0x09A4
    uint32_t 028; // 0x09A8
    uint32_t 029; // 0x09AC
    uint32_t 030; // 0x09B0
    uint32_t 031; // 0x09B4
    uint32_t 032; // 0x09B8
    uint32_t 033; // 0x09BC
    uint32_t 035; // 0x09C4
    uint32_t 036; // 0x09C8
    uint32_t 037; // 0x09CC
    uint32_t 038; // 0x09D0
    uint32_t 039; // 0x09D4
    uint32_t 040; // 0x09D8
    uint32_t 041; // 0x09DC
    uint32_t 042; // 0x09E0
    uint32_t 043; // 0x09E4
    uint32_t 044; // 0x09E8
    uint32_t 047; // 0x09F4
    uint32_t 048; // 0x09F8
    uint32_t 049; // 0x09FC
    uint32_t 050; // 0x0A00
    uint32_t 053; // 0x0A0C
    uint32_t 054; // 0x0A10
    uint32_t 055; // 0x0A14
    uint32_t 057; // 0x0A1C
    uint32_t 058; // 0x0A20
    uint32_t 059; // 0x0A24
    uint32_t 060; // 0x0A28
    uint32_t 062; // 0x0A30
    uint32_t m_highlightServerContextID; // 0x032C
    uint32_t m_highlightTeamBits; // 0x0338
    uint32_t m_PredictableID; // 0x06F4
    fVector3 m_vecMins; // 0x0408
    fVector3 m_vecMaxs; // 0x0414
    uint32_t m_nSolidType; // 0x0424
    uint32_t m_usSolidFlags; // 0x0420
    uint32_t m_nSurroundType; // 0x0436
    uint32_t m_triggerBloat; // 0x0425
    fVector3 m_vecSpecifiedSurroundingMins; // 0x043C
    fVector3 m_vecSpecifiedSurroundingMaxs; // 0x0448
};

class CTEScriptParticleSystemOnEntity {
public:
    uint32_t m_effectIndex; // 0x0028
    uint32_t m_attachmentIndex2; // 0x003C
    uint32_t m_attachType2; // 0x0038
    uint32_t m_ent; // 0x002C
    uint32_t m_attachmentIndex; // 0x0034
    uint32_t m_attachType; // 0x0030
};

class CSprite {
public:
    float m_flSpriteFramerate; // 0x0B58
    uint32_t m_cellZ; // 0x003C
    uint32_t m_parentAttachmentModel; // 0x0790
    uint32_t 051; // 0x0A04
    uint32_t m_usablePriority; // 0x0868
    fVector3 m_attachmentLerpStartOrigin; // 0x076C
    uint32_t m_hAttachedToEntity; // 0x0B50
    float m_flFrame; // 0x0B5C
    uint32_t 016; // 0x0978
    float m_flSpriteScale; // 0x0B70
    uint32_t m_cellY; // 0x0038
    uint32_t m_nAttachment; // 0x0B54
    float m_flScaleDuration; // 0x0B74
    float m_usableRadius; // 0x086C
    uint32_t m_cellX; // 0x0034
    float m_flGlowProxySize; // 0x0B7C
    uint32_t m_clrRenderFriendly; // 0x0B64
    float m_flHDRColorScale; // 0x0B80
    uint32_t m_shieldHealthMax; // 0x0154
    fVector3 m_localAngles; // 0x03CC
    uint32_t 045; // 0x09EC
    float m_flBrightnessDuration; // 0x0B6C
    uint32_t m_nBrightness; // 0x0B68
    uint32_t m_nRenderMode; // 0x03F1
    uint32_t m_iTeamNum; // 0x03A4
    uint32_t m_networkedFlags; // 0x0350
    uint32_t m_bWorldSpaceScale; // 0x0B78
    fVector3 m_localOrigin; // 0x0040
    uint32_t m_nModelIndex; // 0x004C
    uint32_t m_fEffects; // 0x0030
    const char* m_iName; // 0x04B9
    uint32_t m_nRenderFX; // 0x03E5
    uint32_t m_clrRender; // 0x0048
    uint32_t m_forceVisibleInPhaseShift; // 0x06E4
    uint32_t 063; // 0x0A34
    uint32_t m_passThroughFlags; // 0x03A8
    uint32_t m_bRenderWithViewModels; // 0x03E4
    uint32_t m_passThroughThickness; // 0x03AC
    uint32_t m_CollisionGroup; // 0x0838
    float m_passThroughDirection; // 0x03B0
    float m_fadeDist; // 0x0798
    fVector3 m_attachmentLerpStartAngles; // 0x0778
    uint32_t m_contents; // 0x083C
    uint32_t m_hOwnerEntity; // 0x03E0
    uint32_t m_dissolveEffectEntityHandle; // 0x0858
    uint32_t m_shieldHealth; // 0x0150
    uint32_t moveparent; // 0x001C
    uint32_t movetype; // 0x0000
    uint32_t m_visibilityFlags; // 0x0398
    uint32_t m_parentAttachmentIndex; // 0x0788
    float m_attachmentLerpStartTime; // 0x0764
    float m_attachmentLerpEndTime; // 0x0768
    uint32_t m_scriptNameIndex; // 0x05C0
    uint32_t 022; // 0x0990
    uint32_t m_instanceNameIndex; // 0x05C4
    const char* m_holdUsePrompt; // 0x0648
    uint32_t 046; // 0x09F0
    const char* m_pressUsePrompt; // 0x0650
    const char* m_iSignifierName; // 0x04B0
    uint32_t movecollide; // 0x0000
    uint32_t m_scriptVisible; // 0x039C
    uint32_t m_usableType; // 0x0864
    uint32_t m_bossPlayer; // 0x0104
    float m_usableFOV; // 0x0870
    float m_usePromptSize; // 0x0874
    uint32_t m_spottedByTeams; // 0x0880
    uint32_t m_baseTakeDamage; // 0x06E5
    uint32_t m_invulnerableToDamageCount; // 0x06E8
    uint32_t m_areEntityLinksNetworked; // 0x092F
    uint32_t m_highlightIsNetworked; // 0x0198
    uint32_t m_debugBrokenInterpolation; // 0x092C
    uint32_t m_entitiesLinkedFromMeCount; // 0x0930
    uint32_t m_entitiesLinkedToMeCount; // 0x0934
    fVector3 000; // 0x019C
    fVector3 001; // 0x01A8
    fVector3 002; // 0x01B4
    fVector3 003; // 0x01C0
    fVector3 004; // 0x01CC
    fVector3 005; // 0x01D8
    fVector3 006; // 0x01E4
    fVector3 007; // 0x01F0
    fVector3 008; // 0x01FC
    fVector3 009; // 0x0208
    fVector3 010; // 0x0214
    fVector3 011; // 0x0220
    fVector3 012; // 0x022C
    fVector3 013; // 0x0238
    fVector3 014; // 0x0244
    fVector3 015; // 0x0250
    uint32_t 017; // 0x097C
    uint32_t 018; // 0x0980
    uint32_t 019; // 0x0984
    uint32_t 020; // 0x0988
    uint32_t 021; // 0x098C
    uint32_t 023; // 0x0994
    uint32_t 024; // 0x0998
    uint32_t 025; // 0x099C
    uint32_t 026; // 0x09A0
    uint32_t 027; // 0x09A4
    uint32_t 028; // 0x09A8
    uint32_t 029; // 0x09AC
    uint32_t 030; // 0x09B0
    uint32_t 031; // 0x09B4
    uint32_t 032; // 0x09B8
    uint32_t 033; // 0x09BC
    uint32_t 034; // 0x09C0
    uint32_t 035; // 0x09C4
    uint32_t 036; // 0x09C8
    uint32_t 037; // 0x09CC
    uint32_t 038; // 0x09D0
    uint32_t 039; // 0x09D4
    uint32_t 040; // 0x09D8
    uint32_t 041; // 0x09DC
    uint32_t 042; // 0x09E0
    uint32_t 043; // 0x09E4
    uint32_t 044; // 0x09E8
    uint32_t 047; // 0x09F4
    uint32_t 048; // 0x09F8
    uint32_t 049; // 0x09FC
    uint32_t 050; // 0x0A00
    uint32_t 052; // 0x0A08
    uint32_t 053; // 0x0A0C
    uint32_t 054; // 0x0A10
    uint32_t 055; // 0x0A14
    uint32_t 056; // 0x0A18
    uint32_t 057; // 0x0A1C
    uint32_t 058; // 0x0A20
    uint32_t 059; // 0x0A24
    uint32_t 060; // 0x0A28
    uint32_t 061; // 0x0A2C
    uint32_t 062; // 0x0A30
    uint32_t m_highlightServerContextID; // 0x032C
    uint32_t m_highlightTeamBits; // 0x0338
    uint32_t m_PredictableID; // 0x06F4
    fVector3 m_vecMins; // 0x0408
    fVector3 m_vecMaxs; // 0x0414
    uint32_t m_nSolidType; // 0x0424
    uint32_t m_usSolidFlags; // 0x0420
    uint32_t m_nSurroundType; // 0x0436
    uint32_t m_triggerBloat; // 0x0425
    fVector3 m_vecSpecifiedSurroundingMins; // 0x043C
    fVector3 m_vecSpecifiedSurroundingMaxs; // 0x0448
};

class CBaseAnimatingOverlay {
public:
    fVector3 000; // 0x019C
    uint32_t 052; // 0x0A08
    uint32_t m_nResetEventsParity; // 0x0F90
    fVector3 001; // 0x01A8
    uint32_t m_predictedAnimEventCount; // 0x0CA8
    fVector3 m_attachmentLerpStartOrigin; // 0x076C
    uint32_t m_animSequence; // 0x001C
    fVector3 002; // 0x01B4
    fVector3 003; // 0x01C0
    uint32_t m_predictedAnimEventModel; // 0x0CB4
    fVector3 004; // 0x01CC
    uint32_t 056; // 0x0A18
    fVector3 m_animInitialCorrectPos; // 0x0B94
    fVector3 005; // 0x01D8
    uint32_t m_bossPlayer; // 0x0104
    uint32_t m_nBody; // 0x0F84
    fVector3 006; // 0x01E4
    fVector3 007; // 0x01F0
    float m_flSkyScaleStartTime; // 0x0CD8
    uint32_t m_AnimOverlayCount; // 0x12F8
    uint32_t m_animModelIndex; // 0x0018
    uint32_t m_sequenceTransitionerLayerModelIndex; // 0x0D64
    uint32_t m_bSequenceFinished; // 0x1020
    uint32_t 061; // 0x0A2C
    uint32_t m_nForceBone; // 0x0FB8
    fVector3 010; // 0x0214
    uint32_t m_useLockedAnimDeltaYaw; // 0x1021
    uint32_t m_sequenceTransitionerLayerActive; // 0x0D60
    float m_lockedAnimDeltaYaw; // 0x1024
    fVector3 m_animInitialPos; // 0x0B6C
    uint32_t m_bCanUseFastPathFromServer; // 0x1019
    fVector3 m_vecForce; // 0x0088
    fVector3 m_animEntityToRefOffset; // 0x0BB0
    uint32_t 045; // 0x09EC
    uint32_t m_nSkin; // 0x0F80
    float m_sequenceTransitionerLayerStartTime; // 0x0D78
    float m_flModelScale; // 0x102C
    float m_animPlaybackRate; // 0x0010
    uint32_t m_animActive; // 0x0B64
    uint32_t m_animFrozen; // 0x0014
    float m_flSkyScaleEndValue; // 0x0CD4
    uint32_t m_bClientSideRagdoll; // 0x0084
    uint32_t m_passThroughThickness; // 0x03AC
    uint32_t m_syncingWithEntity; // 0x0C5C
    uint32_t m_nRagdollImpactFXTableId; // 0x0CCC
    float m_usableRadius; // 0x086C
    float m_flSkyScaleStartValue; // 0x0CD0
    float m_flSkyScaleEndTime; // 0x0CDC
    uint32_t m_nNewSequenceParity; // 0x0020
    uint32_t m_passDamageToParent; // 0x06EC
    float m_flEstIkOffset; // 0x0094
    uint32_t m_animMotionMode; // 0x0BE0
    fVector4 m_animInitialRot; // 0x0B84
    uint32_t m_animCollisionEnabled; // 0x0B67
    uint32_t m_animNetworkFlags; // 0x0B60
    const char* m_iName; // 0x04B9
    fVector3 m_animInitialVel; // 0x0B78
    uint32_t m_predictedAnimEventSequence; // 0x0CB0
    uint32_t m_predictedAnimEventTarget; // 0x0CAC
    float m_sequenceTransitionerLayerPlaybackRate; // 0x0D74
    uint32_t m_CollisionGroup; // 0x0838
    float m_predictedAnimEventsReadyToFireTime; // 0x0CB8
    uint32_t m_spottedByTeams; // 0x0880
    float m_usePromptSize; // 0x0874
    fVector4 m_animInitialCorrectRot; // 0x0BA0
    fVector4 m_animEntityToRefRotation; // 0x0BBC
    float m_animEndTime; // 0x0BD0
    float m_animBeginTime; // 0x0BCC
    uint32_t m_animScriptSequence; // 0x0BD4
    uint32_t m_animScriptModel; // 0x0BD8
    uint32_t m_animIgnoreParentRot; // 0x0BDC
    uint32_t m_sequenceTransitionerLayerCount; // 0x0E98
    float m_sequenceTransitionerLayerStartCycle; // 0x0D68
    uint32_t 034; // 0x09C0
    uint32_t m_sequenceTransitionerLayerSequence; // 0x0D6C
    float m_sequenceTransitionerLayerFadeOutDuration; // 0x0D7C
    float m_animStartTime; // 0x0008
    float m_animStartCycle; // 0x000C
    fVector3 008; // 0x01FC
    fVector3 009; // 0x0208
    fVector3 011; // 0x0220
    fVector3 012; // 0x022C
    fVector3 013; // 0x0238
    fVector3 014; // 0x0244
    fVector3 015; // 0x0250
    uint32_t 016; // 0x0978
    uint32_t 017; // 0x097C
    uint32_t 018; // 0x0980
    uint32_t 019; // 0x0984
    uint32_t 020; // 0x0988
    uint32_t 021; // 0x098C
    uint32_t m_instanceNameIndex; // 0x05C4
    uint32_t 022; // 0x0990
    uint32_t 023; // 0x0994
    uint32_t m_cellX; // 0x0034
    uint32_t m_cellY; // 0x0038
    uint32_t m_parentAttachmentModel; // 0x0790
    uint32_t m_cellZ; // 0x003C
    fVector3 m_localOrigin; // 0x0040
    fVector3 m_localAngles; // 0x03CC
    uint32_t m_nModelIndex; // 0x004C
    uint32_t m_fEffects; // 0x0030
    uint32_t m_nRenderMode; // 0x03F1
    uint32_t m_nRenderFX; // 0x03E5
    uint32_t m_forceVisibleInPhaseShift; // 0x06E4
    uint32_t m_clrRender; // 0x0048
    uint32_t m_bRenderWithViewModels; // 0x03E4
    uint32_t m_iTeamNum; // 0x03A4
    uint32_t 063; // 0x0A34
    uint32_t m_passThroughFlags; // 0x03A8
    float m_passThroughDirection; // 0x03B0
    uint32_t m_contents; // 0x083C
    uint32_t m_hOwnerEntity; // 0x03E0
    uint32_t m_shieldHealth; // 0x0150
    uint32_t m_dissolveEffectEntityHandle; // 0x0858
    uint32_t movetype; // 0x0000
    uint32_t moveparent; // 0x001C
    uint32_t m_parentAttachmentIndex; // 0x0788
    float m_attachmentLerpStartTime; // 0x0764
    float m_attachmentLerpEndTime; // 0x0768
    fVector3 m_attachmentLerpStartAngles; // 0x0778
    uint32_t m_scriptNameIndex; // 0x05C0
    const char* m_holdUsePrompt; // 0x0648
    uint32_t 046; // 0x09F0
    const char* m_pressUsePrompt; // 0x0650
    const char* m_iSignifierName; // 0x04B0
    uint32_t movecollide; // 0x0000
    float m_fadeDist; // 0x0798
    uint32_t m_visibilityFlags; // 0x0398
    uint32_t m_scriptVisible; // 0x039C
    uint32_t m_usableType; // 0x0864
    uint32_t 051; // 0x0A04
    uint32_t m_usablePriority; // 0x0868
    float m_usableFOV; // 0x0870
    uint32_t m_baseTakeDamage; // 0x06E5
    uint32_t m_invulnerableToDamageCount; // 0x06E8
    uint32_t m_shieldHealthMax; // 0x0154
    uint32_t m_highlightIsNetworked; // 0x0198
    uint32_t m_areEntityLinksNetworked; // 0x092F
    uint32_t m_networkedFlags; // 0x0350
    uint32_t m_debugBrokenInterpolation; // 0x092C
    uint32_t m_entitiesLinkedFromMeCount; // 0x0930
    uint32_t m_entitiesLinkedToMeCount; // 0x0934
    uint32_t 024; // 0x0998
    uint32_t 025; // 0x099C
    uint32_t 026; // 0x09A0
    uint32_t 027; // 0x09A4
    uint32_t 028; // 0x09A8
    uint32_t 029; // 0x09AC
    uint32_t 030; // 0x09B0
    uint32_t 031; // 0x09B4
    uint32_t 032; // 0x09B8
    uint32_t 033; // 0x09BC
    uint32_t 035; // 0x09C4
    uint32_t 036; // 0x09C8
    uint32_t 037; // 0x09CC
    uint32_t 038; // 0x09D0
    uint32_t 039; // 0x09D4
    uint32_t 040; // 0x09D8
    uint32_t 041; // 0x09DC
    uint32_t 042; // 0x09E0
    uint32_t 043; // 0x09E4
    uint32_t 044; // 0x09E8
    uint32_t 047; // 0x09F4
    uint32_t 048; // 0x09F8
    uint32_t 049; // 0x09FC
    uint32_t 050; // 0x0A00
    uint32_t 053; // 0x0A0C
    uint32_t 054; // 0x0A10
    uint32_t 055; // 0x0A14
    uint32_t 057; // 0x0A1C
    uint32_t 058; // 0x0A20
    uint32_t 059; // 0x0A24
    uint32_t 060; // 0x0A28
    uint32_t 062; // 0x0A30
    uint32_t m_highlightServerContextID; // 0x032C
    uint32_t m_highlightTeamBits; // 0x0338
    uint32_t m_PredictableID; // 0x06F4
    fVector3 m_vecMins; // 0x0408
    fVector3 m_vecMaxs; // 0x0414
    uint32_t m_nSolidType; // 0x0424
    uint32_t m_usSolidFlags; // 0x0420
    uint32_t m_nSurroundType; // 0x0436
    uint32_t m_triggerBloat; // 0x0425
    fVector3 m_vecSpecifiedSurroundingMins; // 0x043C
    fVector3 m_vecSpecifiedSurroundingMaxs; // 0x0448
};

class CTeam {
public:
    uint32_t m_iTeamTeamNum; // 0x0B4C
    uint32_t m_score2; // 0x0B3C
    uint32_t m_connectingPlayerCount; // 0x0C74
    uint32_t m_score; // 0x0B38
    uint32_t m_kills; // 0x0B40
    const char* m_szTeamname; // 0x0B70
    uint32_t m_deaths; // 0x0B44
    uint32_t m_reservedPlayerCount; // 0x0C70
    uint32_t m_iRoundsWon; // 0x0B48
    uint32_t m_loadingPlayerCount; // 0x0C78
    uint32_t player_array_element; // 0x0000
    void* "player_array"; // 0x0000
};

class Titan_Cockpit {
public:
    uint32_t m_physDummyMotionEnabled; // 0x092D
    fVector3 003; // 0x01C0
    uint32_t 050; // 0x0A00
    uint32_t m_bUseHitboxesForRenderBox; // 0x1239
    float m_flSkyScaleEndValue; // 0x0CD4
    uint32_t m_bClientSideRagdoll; // 0x0084
    uint32_t m_lifeState; // 0x06C8
    uint32_t m_animModelIndex; // 0x0018
    uint32_t m_iTeamNum; // 0x03A4
    uint32_t m_bPhysicsMotionEnabled; // 0x1230
    fVector3 002; // 0x01B4
    uint32_t m_predictedAnimEventCount; // 0x0CA8
    fVector3 m_attachmentLerpStartOrigin; // 0x076C
    uint32_t m_animSequence; // 0x001C
    uint32_t m_sequenceTransitionerLayerModelIndex; // 0x0D64
    uint32_t m_bSequenceFinished; // 0x1020
    uint32_t 061; // 0x0A2C
    uint32_t m_nForceBone; // 0x0FB8
    fVector3 010; // 0x0214
    uint32_t m_useLockedAnimDeltaYaw; // 0x1021
    uint32_t m_sequenceTransitionerLayerActive; // 0x0D60
    float m_lockedAnimDeltaYaw; // 0x1024
    fVector3 m_animInitialPos; // 0x0B6C
    uint32_t m_bCanUseFastPathFromServer; // 0x1019
    fVector3 m_vecForce; // 0x0088
    fVector3 m_animEntityToRefOffset; // 0x0BB0
    uint32_t 045; // 0x09EC
    uint32_t m_nSkin; // 0x0F80
    fVector3 006; // 0x01E4
    uint32_t m_bossPlayer; // 0x0104
    uint32_t m_nBody; // 0x0F84
    float m_sequenceTransitionerLayerStartTime; // 0x0D78
    float m_flModelScale; // 0x102C
    float m_animPlaybackRate; // 0x0010
    uint32_t m_animActive; // 0x0B64
    uint32_t m_animFrozen; // 0x0014
    uint32_t m_passThroughThickness; // 0x03AC
    uint32_t m_syncingWithEntity; // 0x0C5C
    uint32_t m_nRagdollImpactFXTableId; // 0x0CCC
    float m_usableRadius; // 0x086C
    float m_flSkyScaleStartValue; // 0x0CD0
    float m_flSkyScaleStartTime; // 0x0CD8
    float m_flSkyScaleEndTime; // 0x0CDC
    uint32_t m_nNewSequenceParity; // 0x0020
    uint32_t m_passDamageToParent; // 0x06EC
    float m_flEstIkOffset; // 0x0094
    uint32_t m_animMotionMode; // 0x0BE0
    fVector4 m_animInitialRot; // 0x0B84
    uint32_t m_animCollisionEnabled; // 0x0B67
    uint32_t m_animNetworkFlags; // 0x0B60
    const char* m_iName; // 0x04B9
    fVector3 m_animInitialVel; // 0x0B78
    uint32_t m_predictedAnimEventSequence; // 0x0CB0
    uint32_t m_predictedAnimEventTarget; // 0x0CAC
    fVector3 004; // 0x01CC
    uint32_t m_predictedAnimEventModel; // 0x0CB4
    float m_sequenceTransitionerLayerPlaybackRate; // 0x0D74
    uint32_t m_CollisionGroup; // 0x0838
    float m_predictedAnimEventsReadyToFireTime; // 0x0CB8
    fVector3 000; // 0x019C
    fVector3 001; // 0x01A8
    uint32_t 056; // 0x0A18
    fVector3 m_animInitialCorrectPos; // 0x0B94
    fVector3 005; // 0x01D8
    fVector3 007; // 0x01F0
    uint32_t m_spottedByTeams; // 0x0880
    float m_usePromptSize; // 0x0874
    fVector4 m_animInitialCorrectRot; // 0x0BA0
    fVector4 m_animEntityToRefRotation; // 0x0BBC
    float m_animEndTime; // 0x0BD0
    float m_animBeginTime; // 0x0BCC
    uint32_t m_animScriptSequence; // 0x0BD4
    uint32_t m_animScriptModel; // 0x0BD8
    uint32_t m_animIgnoreParentRot; // 0x0BDC
    uint32_t m_sequenceTransitionerLayerCount; // 0x0E98
    float m_sequenceTransitionerLayerStartCycle; // 0x0D68
    uint32_t 034; // 0x09C0
    uint32_t m_sequenceTransitionerLayerSequence; // 0x0D6C
    float m_sequenceTransitionerLayerFadeOutDuration; // 0x0D7C
    float m_animStartTime; // 0x0008
    float m_animStartCycle; // 0x000C
    uint32_t 052; // 0x0A08
    uint32_t m_nResetEventsParity; // 0x0F90
    fVector3 008; // 0x01FC
    fVector3 009; // 0x0208
    fVector3 011; // 0x0220
    fVector3 012; // 0x022C
    fVector3 013; // 0x0238
    fVector3 014; // 0x0244
    fVector3 015; // 0x0250
    uint32_t 016; // 0x0978
    uint32_t 017; // 0x097C
    uint32_t 018; // 0x0980
    uint32_t 019; // 0x0984
    uint32_t 020; // 0x0988
    uint32_t 021; // 0x098C
    uint32_t m_instanceNameIndex; // 0x05C4
    uint32_t 022; // 0x0990
    uint32_t 023; // 0x0994
    uint32_t m_cellX; // 0x0034
    uint32_t m_cellY; // 0x0038
    uint32_t m_parentAttachmentModel; // 0x0790
    uint32_t m_cellZ; // 0x003C
    fVector3 m_localOrigin; // 0x0040
    fVector3 m_localAngles; // 0x03CC
    uint32_t m_nModelIndex; // 0x004C
    uint32_t m_fEffects; // 0x0030
    uint32_t m_nRenderMode; // 0x03F1
    uint32_t m_nRenderFX; // 0x03E5
    uint32_t m_forceVisibleInPhaseShift; // 0x06E4
    uint32_t m_clrRender; // 0x0048
    uint32_t m_bRenderWithViewModels; // 0x03E4
    uint32_t 063; // 0x0A34
    uint32_t m_passThroughFlags; // 0x03A8
    float m_passThroughDirection; // 0x03B0
    uint32_t m_contents; // 0x083C
    uint32_t m_hOwnerEntity; // 0x03E0
    uint32_t m_shieldHealth; // 0x0150
    uint32_t m_dissolveEffectEntityHandle; // 0x0858
    uint32_t movetype; // 0x0000
    uint32_t moveparent; // 0x001C
    uint32_t m_parentAttachmentIndex; // 0x0788
    float m_attachmentLerpStartTime; // 0x0764
    float m_attachmentLerpEndTime; // 0x0768
    fVector3 m_attachmentLerpStartAngles; // 0x0778
    uint32_t m_scriptNameIndex; // 0x05C0
    const char* m_holdUsePrompt; // 0x0648
    uint32_t 046; // 0x09F0
    const char* m_pressUsePrompt; // 0x0650
    const char* m_iSignifierName; // 0x04B0
    uint32_t movecollide; // 0x0000
    float m_fadeDist; // 0x0798
    uint32_t m_visibilityFlags; // 0x0398
    uint32_t m_scriptVisible; // 0x039C
    uint32_t m_usableType; // 0x0864
    uint32_t 051; // 0x0A04
    uint32_t m_usablePriority; // 0x0868
    float m_usableFOV; // 0x0870
    uint32_t m_baseTakeDamage; // 0x06E5
    uint32_t m_invulnerableToDamageCount; // 0x06E8
    uint32_t m_shieldHealthMax; // 0x0154
    uint32_t m_highlightIsNetworked; // 0x0198
    uint32_t m_areEntityLinksNetworked; // 0x092F
    uint32_t m_networkedFlags; // 0x0350
    uint32_t m_debugBrokenInterpolation; // 0x092C
    uint32_t m_entitiesLinkedFromMeCount; // 0x0930
    uint32_t m_entitiesLinkedToMeCount; // 0x0934
    uint32_t 024; // 0x0998
    uint32_t 025; // 0x099C
    uint32_t 026; // 0x09A0
    uint32_t 027; // 0x09A4
    uint32_t 028; // 0x09A8
    uint32_t 029; // 0x09AC
    uint32_t 030; // 0x09B0
    uint32_t 031; // 0x09B4
    uint32_t 032; // 0x09B8
    uint32_t 033; // 0x09BC
    uint32_t 035; // 0x09C4
    uint32_t 036; // 0x09C8
    uint32_t 037; // 0x09CC
    uint32_t 038; // 0x09D0
    uint32_t 039; // 0x09D4
    uint32_t 040; // 0x09D8
    uint32_t 041; // 0x09DC
    uint32_t 042; // 0x09E0
    uint32_t 043; // 0x09E4
    uint32_t 044; // 0x09E8
    uint32_t 047; // 0x09F4
    uint32_t 048; // 0x09F8
    uint32_t 049; // 0x09FC
    uint32_t 053; // 0x0A0C
    uint32_t 054; // 0x0A10
    uint32_t 055; // 0x0A14
    uint32_t 057; // 0x0A1C
    uint32_t 058; // 0x0A20
    uint32_t 059; // 0x0A24
    uint32_t 060; // 0x0A28
    uint32_t 062; // 0x0A30
    uint32_t m_highlightServerContextID; // 0x032C
    uint32_t m_highlightTeamBits; // 0x0338
    uint32_t m_PredictableID; // 0x06F4
    fVector3 m_vecMins; // 0x0408
    fVector3 m_vecMaxs; // 0x0414
    uint32_t m_nSolidType; // 0x0424
    uint32_t m_usSolidFlags; // 0x0420
    uint32_t m_nSurroundType; // 0x0436
    uint32_t m_triggerBloat; // 0x0425
    fVector3 m_vecSpecifiedSurroundingMins; // 0x043C
    fVector3 m_vecSpecifiedSurroundingMaxs; // 0x0448
};

class CEntityBlocker {
public:
    float m_usableRadius; // 0x086C
    uint32_t m_cellX; // 0x0034
    uint32_t m_cellY; // 0x0038
    uint32_t m_cellZ; // 0x003C
    uint32_t m_parentAttachmentModel; // 0x0790
    uint32_t m_nModelIndex; // 0x004C
    fVector3 m_localOrigin; // 0x0040
    uint32_t m_shieldHealthMax; // 0x0154
    fVector3 m_localAngles; // 0x03CC
    uint32_t m_fEffects; // 0x0030
    uint32_t m_nRenderMode; // 0x03F1
    const char* m_iName; // 0x04B9
    uint32_t m_nRenderFX; // 0x03E5
    uint32_t m_clrRender; // 0x0048
    uint32_t m_forceVisibleInPhaseShift; // 0x06E4
    uint32_t 063; // 0x0A34
    uint32_t m_passThroughFlags; // 0x03A8
    uint32_t m_bRenderWithViewModels; // 0x03E4
    uint32_t m_iTeamNum; // 0x03A4
    uint32_t m_passThroughThickness; // 0x03AC
    uint32_t m_CollisionGroup; // 0x0838
    float m_passThroughDirection; // 0x03B0
    float m_fadeDist; // 0x0798
    fVector3 m_attachmentLerpStartAngles; // 0x0778
    uint32_t m_contents; // 0x083C
    uint32_t m_hOwnerEntity; // 0x03E0
    uint32_t m_dissolveEffectEntityHandle; // 0x0858
    uint32_t m_shieldHealth; // 0x0150
    uint32_t moveparent; // 0x001C
    uint32_t movetype; // 0x0000
    uint32_t m_visibilityFlags; // 0x0398
    uint32_t m_parentAttachmentIndex; // 0x0788
    fVector3 003; // 0x01C0
    float m_attachmentLerpStartTime; // 0x0764
    fVector3 008; // 0x01FC
    float m_attachmentLerpEndTime; // 0x0768
    fVector3 002; // 0x01B4
    uint32_t 051; // 0x0A04
    uint32_t m_usablePriority; // 0x0868
    fVector3 m_attachmentLerpStartOrigin; // 0x076C
    fVector3 000; // 0x019C
    uint32_t m_scriptNameIndex; // 0x05C0
    uint32_t 022; // 0x0990
    uint32_t m_instanceNameIndex; // 0x05C4
    const char* m_holdUsePrompt; // 0x0648
    uint32_t m_debugBrokenInterpolation; // 0x092C
    uint32_t 046; // 0x09F0
    const char* m_pressUsePrompt; // 0x0650
    const char* m_iSignifierName; // 0x04B0
    uint32_t movecollide; // 0x0000
    uint32_t m_scriptVisible; // 0x039C
    fVector3 006; // 0x01E4
    uint32_t m_usableType; // 0x0864
    uint32_t m_bossPlayer; // 0x0104
    uint32_t m_entitiesLinkedFromMeCount; // 0x0930
    float m_usableFOV; // 0x0870
    float m_usePromptSize; // 0x0874
    uint32_t m_spottedByTeams; // 0x0880
    uint32_t m_baseTakeDamage; // 0x06E5
    uint32_t m_invulnerableToDamageCount; // 0x06E8
    uint32_t m_areEntityLinksNetworked; // 0x092F
    uint32_t m_highlightIsNetworked; // 0x0198
    uint32_t m_networkedFlags; // 0x0350
    uint32_t m_entitiesLinkedToMeCount; // 0x0934
    fVector3 001; // 0x01A8
    fVector3 004; // 0x01CC
    fVector3 005; // 0x01D8
    fVector3 007; // 0x01F0
    fVector3 009; // 0x0208
    fVector3 010; // 0x0214
    fVector3 011; // 0x0220
    fVector3 012; // 0x022C
    fVector3 013; // 0x0238
    fVector3 014; // 0x0244
    fVector3 015; // 0x0250
    uint32_t 016; // 0x0978
    uint32_t 017; // 0x097C
    uint32_t 018; // 0x0980
    uint32_t 019; // 0x0984
    uint32_t 020; // 0x0988
    uint32_t 021; // 0x098C
    uint32_t 023; // 0x0994
    uint32_t 024; // 0x0998
    uint32_t 025; // 0x099C
    uint32_t 026; // 0x09A0
    uint32_t 027; // 0x09A4
    uint32_t 028; // 0x09A8
    uint32_t 029; // 0x09AC
    uint32_t 030; // 0x09B0
    uint32_t 031; // 0x09B4
    uint32_t 032; // 0x09B8
    uint32_t 033; // 0x09BC
    uint32_t 034; // 0x09C0
    uint32_t 035; // 0x09C4
    uint32_t 036; // 0x09C8
    uint32_t 037; // 0x09CC
    uint32_t 038; // 0x09D0
    uint32_t 039; // 0x09D4
    uint32_t 040; // 0x09D8
    uint32_t 041; // 0x09DC
    uint32_t 042; // 0x09E0
    uint32_t 043; // 0x09E4
    uint32_t 044; // 0x09E8
    uint32_t 045; // 0x09EC
    uint32_t 047; // 0x09F4
    uint32_t 048; // 0x09F8
    uint32_t 049; // 0x09FC
    uint32_t 050; // 0x0A00
    uint32_t 052; // 0x0A08
    uint32_t 053; // 0x0A0C
    uint32_t 054; // 0x0A10
    uint32_t 055; // 0x0A14
    uint32_t 056; // 0x0A18
    uint32_t 057; // 0x0A1C
    uint32_t 058; // 0x0A20
    uint32_t 059; // 0x0A24
    uint32_t 060; // 0x0A28
    uint32_t 061; // 0x0A2C
    uint32_t 062; // 0x0A30
    uint32_t m_highlightServerContextID; // 0x032C
    uint32_t m_highlightTeamBits; // 0x0338
    uint32_t m_PredictableID; // 0x06F4
    fVector3 m_vecMins; // 0x0408
    fVector3 m_vecMaxs; // 0x0414
    uint32_t m_nSolidType; // 0x0424
    uint32_t m_usSolidFlags; // 0x0420
    uint32_t m_nSurroundType; // 0x0436
    uint32_t m_triggerBloat; // 0x0425
    fVector3 m_vecSpecifiedSurroundingMins; // 0x043C
    fVector3 m_vecSpecifiedSurroundingMaxs; // 0x0448
};

class CPortal_PointPush {
public:
    uint32_t m_bRenderWithViewModels; // 0x03E4
    uint32_t m_bEnabled; // 0x0B38
    float m_usePromptSize; // 0x0874
    uint32_t m_spottedByTeams; // 0x0880
    uint32_t 062; // 0x0A30
    float m_flMagnitude; // 0x0B3C
    uint32_t m_cellZ; // 0x003C
    uint32_t m_parentAttachmentModel; // 0x0790
    fVector3 002; // 0x01B4
    uint32_t 051; // 0x0A04
    uint32_t m_usablePriority; // 0x0868
    fVector3 m_attachmentLerpStartOrigin; // 0x076C
    float m_flRadius; // 0x0B40
    float m_usableRadius; // 0x086C
    uint32_t m_cellX; // 0x0034
    float m_flInnerRadius; // 0x0B44
    uint32_t m_cellY; // 0x0038
    uint32_t moveparent; // 0x001C
    uint32_t movetype; // 0x0000
    float m_flConeOfInfluence; // 0x0B48
    fVector3 m_localOrigin; // 0x0040
    uint32_t m_shieldHealthMax; // 0x0154
    fVector3 m_localAngles; // 0x03CC
    uint32_t m_nModelIndex; // 0x004C
    uint32_t m_fEffects; // 0x0030
    uint32_t m_nRenderMode; // 0x03F1
    const char* m_iName; // 0x04B9
    uint32_t m_nRenderFX; // 0x03E5
    uint32_t m_clrRender; // 0x0048
    uint32_t m_forceVisibleInPhaseShift; // 0x06E4
    uint32_t 063; // 0x0A34
    uint32_t m_passThroughFlags; // 0x03A8
    uint32_t m_iTeamNum; // 0x03A4
    uint32_t m_passThroughThickness; // 0x03AC
    uint32_t m_CollisionGroup; // 0x0838
    float m_passThroughDirection; // 0x03B0
    float m_fadeDist; // 0x0798
    fVector3 m_attachmentLerpStartAngles; // 0x0778
    uint32_t m_contents; // 0x083C
    uint32_t m_hOwnerEntity; // 0x03E0
    uint32_t m_dissolveEffectEntityHandle; // 0x0858
    uint32_t m_shieldHealth; // 0x0150
    uint32_t m_visibilityFlags; // 0x0398
    uint32_t m_parentAttachmentIndex; // 0x0788
    fVector3 003; // 0x01C0
    float m_attachmentLerpStartTime; // 0x0764
    float m_attachmentLerpEndTime; // 0x0768
    fVector3 000; // 0x019C
    uint32_t m_scriptNameIndex; // 0x05C0
    uint32_t 022; // 0x0990
    uint32_t m_instanceNameIndex; // 0x05C4
    const char* m_holdUsePrompt; // 0x0648
    uint32_t m_debugBrokenInterpolation; // 0x092C
    uint32_t 046; // 0x09F0
    const char* m_pressUsePrompt; // 0x0650
    const char* m_iSignifierName; // 0x04B0
    uint32_t movecollide; // 0x0000
    uint32_t m_scriptVisible; // 0x039C
    uint32_t m_usableType; // 0x0864
    uint32_t m_bossPlayer; // 0x0104
    uint32_t m_entitiesLinkedFromMeCount; // 0x0930
    float m_usableFOV; // 0x0870
    uint32_t m_baseTakeDamage; // 0x06E5
    uint32_t m_invulnerableToDamageCount; // 0x06E8
    uint32_t m_areEntityLinksNetworked; // 0x092F
    uint32_t m_highlightIsNetworked; // 0x0198
    uint32_t m_networkedFlags; // 0x0350
    uint32_t m_entitiesLinkedToMeCount; // 0x0934
    fVector3 001; // 0x01A8
    fVector3 004; // 0x01CC
    fVector3 005; // 0x01D8
    fVector3 006; // 0x01E4
    fVector3 007; // 0x01F0
    fVector3 008; // 0x01FC
    fVector3 009; // 0x0208
    fVector3 010; // 0x0214
    fVector3 011; // 0x0220
    fVector3 012; // 0x022C
    fVector3 013; // 0x0238
    fVector3 014; // 0x0244
    fVector3 015; // 0x0250
    uint32_t 016; // 0x0978
    uint32_t 017; // 0x097C
    uint32_t 018; // 0x0980
    uint32_t 019; // 0x0984
    uint32_t 020; // 0x0988
    uint32_t 021; // 0x098C
    uint32_t 023; // 0x0994
    uint32_t 024; // 0x0998
    uint32_t 025; // 0x099C
    uint32_t 026; // 0x09A0
    uint32_t 027; // 0x09A4
    uint32_t 028; // 0x09A8
    uint32_t 029; // 0x09AC
    uint32_t 030; // 0x09B0
    uint32_t 031; // 0x09B4
    uint32_t 032; // 0x09B8
    uint32_t 033; // 0x09BC
    uint32_t 034; // 0x09C0
    uint32_t 035; // 0x09C4
    uint32_t 036; // 0x09C8
    uint32_t 037; // 0x09CC
    uint32_t 038; // 0x09D0
    uint32_t 039; // 0x09D4
    uint32_t 040; // 0x09D8
    uint32_t 041; // 0x09DC
    uint32_t 042; // 0x09E0
    uint32_t 043; // 0x09E4
    uint32_t 044; // 0x09E8
    uint32_t 045; // 0x09EC
    uint32_t 047; // 0x09F4
    uint32_t 048; // 0x09F8
    uint32_t 049; // 0x09FC
    uint32_t 050; // 0x0A00
    uint32_t 052; // 0x0A08
    uint32_t 053; // 0x0A0C
    uint32_t 054; // 0x0A10
    uint32_t 055; // 0x0A14
    uint32_t 056; // 0x0A18
    uint32_t 057; // 0x0A1C
    uint32_t 058; // 0x0A20
    uint32_t 059; // 0x0A24
    uint32_t 060; // 0x0A28
    uint32_t 061; // 0x0A2C
    uint32_t m_highlightServerContextID; // 0x032C
    uint32_t m_highlightTeamBits; // 0x0338
    uint32_t m_PredictableID; // 0x06F4
    fVector3 m_vecMins; // 0x0408
    fVector3 m_vecMaxs; // 0x0414
    uint32_t m_nSolidType; // 0x0424
    uint32_t m_usSolidFlags; // 0x0420
    uint32_t m_nSurroundType; // 0x0436
    uint32_t m_triggerBloat; // 0x0425
    fVector3 m_vecSpecifiedSurroundingMins; // 0x043C
    fVector3 m_vecSpecifiedSurroundingMaxs; // 0x0448
};

class CWaterLODControl {
public:
    uint32_t m_shieldHealthMax; // 0x0154
    fVector3 m_localAngles; // 0x03CC
    float m_flCheapWaterStartDistance; // 0x0B38
    float m_flCheapWaterEndDistance; // 0x0B3C
    float m_usableRadius; // 0x086C
    uint32_t m_cellX; // 0x0034
    uint32_t m_cellY; // 0x0038
    uint32_t m_cellZ; // 0x003C
    uint32_t m_parentAttachmentModel; // 0x0790
    uint32_t m_nModelIndex; // 0x004C
    fVector3 m_localOrigin; // 0x0040
    uint32_t m_fEffects; // 0x0030
    uint32_t m_nRenderMode; // 0x03F1
    const char* m_iName; // 0x04B9
    uint32_t m_nRenderFX; // 0x03E5
    uint32_t m_clrRender; // 0x0048
    uint32_t m_forceVisibleInPhaseShift; // 0x06E4
    uint32_t 063; // 0x0A34
    uint32_t m_passThroughFlags; // 0x03A8
    uint32_t m_bRenderWithViewModels; // 0x03E4
    uint32_t m_iTeamNum; // 0x03A4
    uint32_t m_passThroughThickness; // 0x03AC
    uint32_t m_CollisionGroup; // 0x0838
    float m_passThroughDirection; // 0x03B0
    float m_fadeDist; // 0x0798
    fVector3 m_attachmentLerpStartAngles; // 0x0778
    uint32_t m_contents; // 0x083C
    uint32_t m_hOwnerEntity; // 0x03E0
    uint32_t m_dissolveEffectEntityHandle; // 0x0858
    uint32_t m_shieldHealth; // 0x0150
    uint32_t moveparent; // 0x001C
    uint32_t movetype; // 0x0000
    uint32_t m_visibilityFlags; // 0x0398
    uint32_t m_parentAttachmentIndex; // 0x0788
    fVector3 003; // 0x01C0
    float m_attachmentLerpStartTime; // 0x0764
    float m_attachmentLerpEndTime; // 0x0768
    fVector3 002; // 0x01B4
    uint32_t 051; // 0x0A04
    uint32_t m_usablePriority; // 0x0868
    fVector3 m_attachmentLerpStartOrigin; // 0x076C
    fVector3 000; // 0x019C
    uint32_t m_scriptNameIndex; // 0x05C0
    uint32_t 022; // 0x0990
    uint32_t m_instanceNameIndex; // 0x05C4
    const char* m_holdUsePrompt; // 0x0648
    uint32_t m_debugBrokenInterpolation; // 0x092C
    uint32_t 046; // 0x09F0
    const char* m_pressUsePrompt; // 0x0650
    const char* m_iSignifierName; // 0x04B0
    uint32_t movecollide; // 0x0000
    uint32_t m_scriptVisible; // 0x039C
    fVector3 006; // 0x01E4
    uint32_t m_usableType; // 0x0864
    uint32_t m_bossPlayer; // 0x0104
    uint32_t m_entitiesLinkedFromMeCount; // 0x0930
    float m_usableFOV; // 0x0870
    float m_usePromptSize; // 0x0874
    uint32_t m_spottedByTeams; // 0x0880
    uint32_t m_baseTakeDamage; // 0x06E5
    uint32_t m_invulnerableToDamageCount; // 0x06E8
    uint32_t m_areEntityLinksNetworked; // 0x092F
    uint32_t m_highlightIsNetworked; // 0x0198
    uint32_t m_networkedFlags; // 0x0350
    uint32_t m_entitiesLinkedToMeCount; // 0x0934
    fVector3 001; // 0x01A8
    fVector3 004; // 0x01CC
    fVector3 005; // 0x01D8
    fVector3 007; // 0x01F0
    fVector3 008; // 0x01FC
    fVector3 009; // 0x0208
    fVector3 010; // 0x0214
    fVector3 011; // 0x0220
    fVector3 012; // 0x022C
    fVector3 013; // 0x0238
    fVector3 014; // 0x0244
    fVector3 015; // 0x0250
    uint32_t 016; // 0x0978
    uint32_t 017; // 0x097C
    uint32_t 018; // 0x0980
    uint32_t 019; // 0x0984
    uint32_t 020; // 0x0988
    uint32_t 021; // 0x098C
    uint32_t 023; // 0x0994
    uint32_t 024; // 0x0998
    uint32_t 025; // 0x099C
    uint32_t 026; // 0x09A0
    uint32_t 027; // 0x09A4
    uint32_t 028; // 0x09A8
    uint32_t 029; // 0x09AC
    uint32_t 030; // 0x09B0
    uint32_t 031; // 0x09B4
    uint32_t 032; // 0x09B8
    uint32_t 033; // 0x09BC
    uint32_t 034; // 0x09C0
    uint32_t 035; // 0x09C4
    uint32_t 036; // 0x09C8
    uint32_t 037; // 0x09CC
    uint32_t 038; // 0x09D0
    uint32_t 039; // 0x09D4
    uint32_t 040; // 0x09D8
    uint32_t 041; // 0x09DC
    uint32_t 042; // 0x09E0
    uint32_t 043; // 0x09E4
    uint32_t 044; // 0x09E8
    uint32_t 045; // 0x09EC
    uint32_t 047; // 0x09F4
    uint32_t 048; // 0x09F8
    uint32_t 049; // 0x09FC
    uint32_t 050; // 0x0A00
    uint32_t 052; // 0x0A08
    uint32_t 053; // 0x0A0C
    uint32_t 054; // 0x0A10
    uint32_t 055; // 0x0A14
    uint32_t 056; // 0x0A18
    uint32_t 057; // 0x0A1C
    uint32_t 058; // 0x0A20
    uint32_t 059; // 0x0A24
    uint32_t 060; // 0x0A28
    uint32_t 061; // 0x0A2C
    uint32_t 062; // 0x0A30
    uint32_t m_highlightServerContextID; // 0x032C
    uint32_t m_highlightTeamBits; // 0x0338
    uint32_t m_PredictableID; // 0x06F4
    fVector3 m_vecMins; // 0x0408
    fVector3 m_vecMaxs; // 0x0414
    uint32_t m_nSolidType; // 0x0424
    uint32_t m_usSolidFlags; // 0x0420
    uint32_t m_nSurroundType; // 0x0436
    uint32_t m_triggerBloat; // 0x0425
    fVector3 m_vecSpecifiedSurroundingMins; // 0x043C
    fVector3 m_vecSpecifiedSurroundingMaxs; // 0x0448
};

class CInfoPlacementHelper {
public:
    uint32_t m_parentAttachmentHitbox; // 0x078C
    fVector3 m_localOrigin; // 0x0004
    uint32_t m_parentAttachmentType; // 0x0784
    fVector3 m_localAngles; // 0x03CC
    uint32_t m_parentAttachmentIndex; // 0x0788
    uint32_t moveparent; // 0x001C
    uint32_t m_parentAttachmentModel; // 0x0790
};

class CBaseEntity {
public:
    float m_usableRadius; // 0x086C
    uint32_t m_cellX; // 0x0034
    uint32_t m_cellY; // 0x0038
    uint32_t m_cellZ; // 0x003C
    uint32_t m_parentAttachmentModel; // 0x0790
    uint32_t m_nModelIndex; // 0x004C
    fVector3 m_localOrigin; // 0x0040
    uint32_t m_shieldHealthMax; // 0x0154
    fVector3 m_localAngles; // 0x03CC
    uint32_t m_fEffects; // 0x0030
    uint32_t m_nRenderMode; // 0x03F1
    const char* m_iName; // 0x04B9
    uint32_t m_nRenderFX; // 0x03E5
    uint32_t m_clrRender; // 0x0048
    uint32_t m_forceVisibleInPhaseShift; // 0x06E4
    uint32_t 063; // 0x0A34
    uint32_t m_passThroughFlags; // 0x03A8
    uint32_t m_bRenderWithViewModels; // 0x03E4
    uint32_t m_iTeamNum; // 0x03A4
    uint32_t m_passThroughThickness; // 0x03AC
    uint32_t m_CollisionGroup; // 0x0838
    float m_passThroughDirection; // 0x03B0
    float m_fadeDist; // 0x0798
    fVector3 m_attachmentLerpStartAngles; // 0x0778
    uint32_t m_contents; // 0x083C
    uint32_t m_hOwnerEntity; // 0x03E0
    uint32_t m_dissolveEffectEntityHandle; // 0x0858
    uint32_t m_shieldHealth; // 0x0150
    uint32_t moveparent; // 0x001C
    uint32_t movetype; // 0x0000
    uint32_t m_visibilityFlags; // 0x0398
    uint32_t m_parentAttachmentIndex; // 0x0788
    fVector3 003; // 0x01C0
    float m_attachmentLerpStartTime; // 0x0764
    fVector3 008; // 0x01FC
    float m_attachmentLerpEndTime; // 0x0768
    fVector3 002; // 0x01B4
    uint32_t 051; // 0x0A04
    uint32_t m_usablePriority; // 0x0868
    fVector3 m_attachmentLerpStartOrigin; // 0x076C
    fVector3 000; // 0x019C
    uint32_t m_scriptNameIndex; // 0x05C0
    uint32_t 022; // 0x0990
    uint32_t m_instanceNameIndex; // 0x05C4
    const char* m_holdUsePrompt; // 0x0648
    uint32_t m_debugBrokenInterpolation; // 0x092C
    uint32_t 046; // 0x09F0
    const char* m_pressUsePrompt; // 0x0650
    const char* m_iSignifierName; // 0x04B0
    uint32_t movecollide; // 0x0000
    uint32_t m_scriptVisible; // 0x039C
    fVector3 006; // 0x01E4
    uint32_t m_usableType; // 0x0864
    uint32_t m_bossPlayer; // 0x0104
    uint32_t m_entitiesLinkedFromMeCount; // 0x0930
    float m_usableFOV; // 0x0870
    float m_usePromptSize; // 0x0874
    uint32_t m_spottedByTeams; // 0x0880
    uint32_t m_baseTakeDamage; // 0x06E5
    uint32_t m_invulnerableToDamageCount; // 0x06E8
    uint32_t m_areEntityLinksNetworked; // 0x092F
    uint32_t m_highlightIsNetworked; // 0x0198
    uint32_t m_networkedFlags; // 0x0350
    uint32_t m_entitiesLinkedToMeCount; // 0x0934
    fVector3 001; // 0x01A8
    fVector3 004; // 0x01CC
    fVector3 005; // 0x01D8
    fVector3 007; // 0x01F0
    fVector3 009; // 0x0208
    fVector3 010; // 0x0214
    fVector3 011; // 0x0220
    fVector3 012; // 0x022C
    fVector3 013; // 0x0238
    fVector3 014; // 0x0244
    fVector3 015; // 0x0250
    uint32_t 016; // 0x0978
    uint32_t 017; // 0x097C
    uint32_t 018; // 0x0980
    uint32_t 019; // 0x0984
    uint32_t 020; // 0x0988
    uint32_t 021; // 0x098C
    uint32_t 023; // 0x0994
    uint32_t 024; // 0x0998
    uint32_t 025; // 0x099C
    uint32_t 026; // 0x09A0
    uint32_t 027; // 0x09A4
    uint32_t 028; // 0x09A8
    uint32_t 029; // 0x09AC
    uint32_t 030; // 0x09B0
    uint32_t 031; // 0x09B4
    uint32_t 032; // 0x09B8
    uint32_t 033; // 0x09BC
    uint32_t 034; // 0x09C0
    uint32_t 035; // 0x09C4
    uint32_t 036; // 0x09C8
    uint32_t 037; // 0x09CC
    uint32_t 038; // 0x09D0
    uint32_t 039; // 0x09D4
    uint32_t 040; // 0x09D8
    uint32_t 041; // 0x09DC
    uint32_t 042; // 0x09E0
    uint32_t 043; // 0x09E4
    uint32_t 044; // 0x09E8
    uint32_t 045; // 0x09EC
    uint32_t 047; // 0x09F4
    uint32_t 048; // 0x09F8
    uint32_t 049; // 0x09FC
    uint32_t 050; // 0x0A00
    uint32_t 052; // 0x0A08
    uint32_t 053; // 0x0A0C
    uint32_t 054; // 0x0A10
    uint32_t 055; // 0x0A14
    uint32_t 056; // 0x0A18
    uint32_t 057; // 0x0A1C
    uint32_t 058; // 0x0A20
    uint32_t 059; // 0x0A24
    uint32_t 060; // 0x0A28
    uint32_t 061; // 0x0A2C
    uint32_t 062; // 0x0A30
    uint32_t m_highlightServerContextID; // 0x032C
    uint32_t m_highlightTeamBits; // 0x0338
    uint32_t m_PredictableID; // 0x06F4
    fVector3 m_vecMins; // 0x0408
    fVector3 m_vecMaxs; // 0x0414
    uint32_t m_nSolidType; // 0x0424
    uint32_t m_usSolidFlags; // 0x0420
    uint32_t m_nSurroundType; // 0x0436
    uint32_t m_triggerBloat; // 0x0425
    fVector3 m_vecSpecifiedSurroundingMins; // 0x043C
    fVector3 m_vecSpecifiedSurroundingMaxs; // 0x0448
};

class CStatusEffectPlugin {
public:
    float seEaseOut; // 0x0B48
    float seTimeEnd; // 0x0B44
    uint32_t m_hOwnerEntity; // 0x03E0
    uint32_t seComboVars; // 0x0B40
};

class CSpriteOriented {
public:
    float m_flSpriteFramerate; // 0x0B58
    uint32_t m_cellZ; // 0x003C
    uint32_t m_parentAttachmentModel; // 0x0790
    uint32_t 051; // 0x0A04
    uint32_t m_usablePriority; // 0x0868
    fVector3 m_attachmentLerpStartOrigin; // 0x076C
    uint32_t m_hAttachedToEntity; // 0x0B50
    float m_flFrame; // 0x0B5C
    uint32_t 016; // 0x0978
    float m_flSpriteScale; // 0x0B70
    uint32_t m_cellY; // 0x0038
    uint32_t m_nAttachment; // 0x0B54
    float m_flScaleDuration; // 0x0B74
    float m_usableRadius; // 0x086C
    uint32_t m_cellX; // 0x0034
    float m_flGlowProxySize; // 0x0B7C
    uint32_t m_clrRenderFriendly; // 0x0B64
    float m_flHDRColorScale; // 0x0B80
    uint32_t m_shieldHealthMax; // 0x0154
    fVector3 m_localAngles; // 0x03CC
    uint32_t 045; // 0x09EC
    float m_flBrightnessDuration; // 0x0B6C
    uint32_t m_nBrightness; // 0x0B68
    uint32_t m_nRenderMode; // 0x03F1
    uint32_t m_iTeamNum; // 0x03A4
    uint32_t m_networkedFlags; // 0x0350
    uint32_t m_bWorldSpaceScale; // 0x0B78
    fVector3 m_localOrigin; // 0x0040
    uint32_t m_nModelIndex; // 0x004C
    uint32_t m_fEffects; // 0x0030
    const char* m_iName; // 0x04B9
    uint32_t m_nRenderFX; // 0x03E5
    uint32_t m_clrRender; // 0x0048
    uint32_t m_forceVisibleInPhaseShift; // 0x06E4
    uint32_t 063; // 0x0A34
    uint32_t m_passThroughFlags; // 0x03A8
    uint32_t m_bRenderWithViewModels; // 0x03E4
    uint32_t m_passThroughThickness; // 0x03AC
    uint32_t m_CollisionGroup; // 0x0838
    float m_passThroughDirection; // 0x03B0
    float m_fadeDist; // 0x0798
    fVector3 m_attachmentLerpStartAngles; // 0x0778
    uint32_t m_contents; // 0x083C
    uint32_t m_hOwnerEntity; // 0x03E0
    uint32_t m_dissolveEffectEntityHandle; // 0x0858
    uint32_t m_shieldHealth; // 0x0150
    uint32_t moveparent; // 0x001C
    uint32_t movetype; // 0x0000
    uint32_t m_visibilityFlags; // 0x0398
    uint32_t m_parentAttachmentIndex; // 0x0788
    float m_attachmentLerpStartTime; // 0x0764
    float m_attachmentLerpEndTime; // 0x0768
    uint32_t m_scriptNameIndex; // 0x05C0
    uint32_t 022; // 0x0990
    uint32_t m_instanceNameIndex; // 0x05C4
    const char* m_holdUsePrompt; // 0x0648
    uint32_t 046; // 0x09F0
    const char* m_pressUsePrompt; // 0x0650
    const char* m_iSignifierName; // 0x04B0
    uint32_t movecollide; // 0x0000
    uint32_t m_scriptVisible; // 0x039C
    uint32_t m_usableType; // 0x0864
    uint32_t m_bossPlayer; // 0x0104
    float m_usableFOV; // 0x0870
    float m_usePromptSize; // 0x0874
    uint32_t m_spottedByTeams; // 0x0880
    uint32_t m_baseTakeDamage; // 0x06E5
    uint32_t m_invulnerableToDamageCount; // 0x06E8
    uint32_t m_areEntityLinksNetworked; // 0x092F
    uint32_t m_highlightIsNetworked; // 0x0198
    uint32_t m_debugBrokenInterpolation; // 0x092C
    uint32_t m_entitiesLinkedFromMeCount; // 0x0930
    uint32_t m_entitiesLinkedToMeCount; // 0x0934
    fVector3 000; // 0x019C
    fVector3 001; // 0x01A8
    fVector3 002; // 0x01B4
    fVector3 003; // 0x01C0
    fVector3 004; // 0x01CC
    fVector3 005; // 0x01D8
    fVector3 006; // 0x01E4
    fVector3 007; // 0x01F0
    fVector3 008; // 0x01FC
    fVector3 009; // 0x0208
    fVector3 010; // 0x0214
    fVector3 011; // 0x0220
    fVector3 012; // 0x022C
    fVector3 013; // 0x0238
    fVector3 014; // 0x0244
    fVector3 015; // 0x0250
    uint32_t 017; // 0x097C
    uint32_t 018; // 0x0980
    uint32_t 019; // 0x0984
    uint32_t 020; // 0x0988
    uint32_t 021; // 0x098C
    uint32_t 023; // 0x0994
    uint32_t 024; // 0x0998
    uint32_t 025; // 0x099C
    uint32_t 026; // 0x09A0
    uint32_t 027; // 0x09A4
    uint32_t 028; // 0x09A8
    uint32_t 029; // 0x09AC
    uint32_t 030; // 0x09B0
    uint32_t 031; // 0x09B4
    uint32_t 032; // 0x09B8
    uint32_t 033; // 0x09BC
    uint32_t 034; // 0x09C0
    uint32_t 035; // 0x09C4
    uint32_t 036; // 0x09C8
    uint32_t 037; // 0x09CC
    uint32_t 038; // 0x09D0
    uint32_t 039; // 0x09D4
    uint32_t 040; // 0x09D8
    uint32_t 041; // 0x09DC
    uint32_t 042; // 0x09E0
    uint32_t 043; // 0x09E4
    uint32_t 044; // 0x09E8
    uint32_t 047; // 0x09F4
    uint32_t 048; // 0x09F8
    uint32_t 049; // 0x09FC
    uint32_t 050; // 0x0A00
    uint32_t 052; // 0x0A08
    uint32_t 053; // 0x0A0C
    uint32_t 054; // 0x0A10
    uint32_t 055; // 0x0A14
    uint32_t 056; // 0x0A18
    uint32_t 057; // 0x0A1C
    uint32_t 058; // 0x0A20
    uint32_t 059; // 0x0A24
    uint32_t 060; // 0x0A28
    uint32_t 061; // 0x0A2C
    uint32_t 062; // 0x0A30
    uint32_t m_highlightServerContextID; // 0x032C
    uint32_t m_highlightTeamBits; // 0x0338
    uint32_t m_PredictableID; // 0x06F4
    fVector3 m_vecMins; // 0x0408
    fVector3 m_vecMaxs; // 0x0414
    uint32_t m_nSolidType; // 0x0424
    uint32_t m_usSolidFlags; // 0x0420
    uint32_t m_nSurroundType; // 0x0436
    uint32_t m_triggerBloat; // 0x0425
    fVector3 m_vecSpecifiedSurroundingMins; // 0x043C
    fVector3 m_vecSpecifiedSurroundingMaxs; // 0x0448
};

class CSnapshotCanaryB {
public:
    uint32_t a; // 0x0B40
    uint32_t tick; // 0x0B38
    uint32_t d; // 0x0B4C
    uint32_t l; // 0x0B6C
    uint32_t index; // 0x0B3C
    uint32_t b; // 0x0B44
    uint32_t c; // 0x0B48
    uint32_t e; // 0x0B50
    uint32_t f; // 0x0B54
    uint32_t g; // 0x0B58
    uint32_t h; // 0x0B5C
    uint32_t i; // 0x0B60
    uint32_t j; // 0x0B64
    uint32_t k; // 0x0B68
    uint32_t m; // 0x0B70
    uint32_t n; // 0x0B74
    uint32_t o; // 0x0B78
    uint32_t p; // 0x0B7C
    uint32_t q; // 0x0B80
    uint32_t r; // 0x0B84
    uint32_t s; // 0x0B88
    uint32_t t; // 0x0B8C
    uint32_t u; // 0x0B90
    uint32_t v; // 0x0B94
    uint32_t w; // 0x0B98
    uint32_t x; // 0x0B9C
    uint32_t y; // 0x0BA0
    uint32_t z; // 0x0BA4
};

class CSnapshotCanaryA {
public:
    uint32_t a; // 0x0B40
    uint32_t tick; // 0x0B38
    uint32_t d; // 0x0B4C
    uint32_t l; // 0x0B6C
    uint32_t index; // 0x0B3C
    uint32_t b; // 0x0B44
    uint32_t c; // 0x0B48
    uint32_t e; // 0x0B50
    uint32_t f; // 0x0B54
    uint32_t g; // 0x0B58
    uint32_t h; // 0x0B5C
    uint32_t i; // 0x0B60
    uint32_t j; // 0x0B64
    uint32_t k; // 0x0B68
    uint32_t m; // 0x0B70
    uint32_t n; // 0x0B74
    uint32_t o; // 0x0B78
    uint32_t p; // 0x0B7C
    uint32_t q; // 0x0B80
    uint32_t r; // 0x0B84
    uint32_t s; // 0x0B88
    uint32_t t; // 0x0B8C
    uint32_t u; // 0x0B90
    uint32_t v; // 0x0B94
    uint32_t w; // 0x0B98
    uint32_t x; // 0x0B9C
    uint32_t y; // 0x0BA0
    uint32_t z; // 0x0BA4
};

class CSnapshotCanary {
public:
    uint32_t a; // 0x0B40
    uint32_t tick; // 0x0B38
    uint32_t d; // 0x0B4C
    uint32_t l; // 0x0B6C
    uint32_t index; // 0x0B3C
    uint32_t b; // 0x0B44
    uint32_t c; // 0x0B48
    uint32_t e; // 0x0B50
    uint32_t f; // 0x0B54
    uint32_t g; // 0x0B58
    uint32_t h; // 0x0B5C
    uint32_t i; // 0x0B60
    uint32_t j; // 0x0B64
    uint32_t k; // 0x0B68
    uint32_t m; // 0x0B70
    uint32_t n; // 0x0B74
    uint32_t o; // 0x0B78
    uint32_t p; // 0x0B7C
    uint32_t q; // 0x0B80
    uint32_t r; // 0x0B84
    uint32_t s; // 0x0B88
    uint32_t t; // 0x0B8C
    uint32_t u; // 0x0B90
    uint32_t v; // 0x0B94
    uint32_t w; // 0x0B98
    uint32_t x; // 0x0B9C
    uint32_t y; // 0x0BA0
    uint32_t z; // 0x0BA4
};

class CScriptNetDataGlobal {
public:
    uint32_t m_entities[0]; // 0x0C50
    uint32_t m_bools[0]; // 0x0BC0
    void* m_entities; // 0x0000
    void* m_bools; // 0x0000
    uint32_t m_ranges[0]; // 0x0BD0
    void* m_ranges; // 0x0000
    float m_times[0]; // 0x0C10
    void* m_times; // 0x0000
    uint32_t m_hOwnerEntity; // 0x03E0
};

class CScriptNetData_SNDC_PLAYER_GLOBAL {
public:
    uint32_t m_entities[0]; // 0x0C08
    uint32_t m_bools[0]; // 0x0BC0
    void* m_entities; // 0x0000
    void* m_bools; // 0x0000
    uint32_t m_ranges[0]; // 0x0BC8
    void* m_ranges; // 0x0000
    float m_times[0]; // 0x0BE8
    void* m_times; // 0x0000
    uint32_t m_hOwnerEntity; // 0x03E0
};

class CDynamicLight {
public:
    uint32_t m_visibilityFlags; // 0x0398
    uint32_t m_parentAttachmentIndex; // 0x0788
    fVector3 m_vecMins; // 0x0408
    uint32_t m_Flags; // 0x0B38
    uint32_t m_LightStyle; // 0x0B39
    uint32_t m_entitiesLinkedToMeCount; // 0x0934
    float m_SpotRadius; // 0x0B4C
    float m_Radius; // 0x0B3C
    float m_InnerAngle; // 0x0B44
    uint32_t m_Exponent; // 0x0B40
    float m_usableRadius; // 0x086C
    uint32_t m_cellX; // 0x0034
    uint32_t 022; // 0x0990
    uint32_t m_instanceNameIndex; // 0x05C4
    float m_OuterAngle; // 0x0B48
    uint32_t m_cellY; // 0x0038
    uint32_t m_cellZ; // 0x003C
    uint32_t m_parentAttachmentModel; // 0x0790
    fVector3 m_localOrigin; // 0x0040
    uint32_t m_shieldHealthMax; // 0x0154
    fVector3 m_localAngles; // 0x03CC
    uint32_t m_nModelIndex; // 0x004C
    uint32_t m_fEffects; // 0x0030
    uint32_t m_nRenderMode; // 0x03F1
    const char* m_iName; // 0x04B9
    uint32_t m_nRenderFX; // 0x03E5
    uint32_t m_clrRender; // 0x0048
    uint32_t m_forceVisibleInPhaseShift; // 0x06E4
    uint32_t 063; // 0x0A34
    uint32_t m_passThroughFlags; // 0x03A8
    uint32_t m_bRenderWithViewModels; // 0x03E4
    uint32_t m_iTeamNum; // 0x03A4
    uint32_t m_passThroughThickness; // 0x03AC
    uint32_t m_CollisionGroup; // 0x0838
    float m_passThroughDirection; // 0x03B0
    float m_fadeDist; // 0x0798
    fVector3 m_attachmentLerpStartAngles; // 0x0778
    uint32_t m_contents; // 0x083C
    uint32_t m_hOwnerEntity; // 0x03E0
    uint32_t m_dissolveEffectEntityHandle; // 0x0858
    uint32_t m_shieldHealth; // 0x0150
    uint32_t moveparent; // 0x001C
    uint32_t movetype; // 0x0000
    float m_attachmentLerpStartTime; // 0x0764
    float m_attachmentLerpEndTime; // 0x0768
    uint32_t 051; // 0x0A04
    uint32_t m_usablePriority; // 0x0868
    fVector3 m_attachmentLerpStartOrigin; // 0x076C
    fVector3 000; // 0x019C
    uint32_t m_scriptNameIndex; // 0x05C0
    const char* m_holdUsePrompt; // 0x0648
    uint32_t m_debugBrokenInterpolation; // 0x092C
    uint32_t 046; // 0x09F0
    const char* m_pressUsePrompt; // 0x0650
    const char* m_iSignifierName; // 0x04B0
    uint32_t movecollide; // 0x0000
    uint32_t m_scriptVisible; // 0x039C
    uint32_t m_usableType; // 0x0864
    uint32_t m_bossPlayer; // 0x0104
    uint32_t m_entitiesLinkedFromMeCount; // 0x0930
    float m_usableFOV; // 0x0870
    float m_usePromptSize; // 0x0874
    uint32_t m_spottedByTeams; // 0x0880
    uint32_t m_baseTakeDamage; // 0x06E5
    uint32_t m_invulnerableToDamageCount; // 0x06E8
    uint32_t m_areEntityLinksNetworked; // 0x092F
    uint32_t m_highlightIsNetworked; // 0x0198
    uint32_t m_networkedFlags; // 0x0350
    fVector3 001; // 0x01A8
    fVector3 002; // 0x01B4
    fVector3 003; // 0x01C0
    fVector3 004; // 0x01CC
    fVector3 005; // 0x01D8
    fVector3 006; // 0x01E4
    fVector3 007; // 0x01F0
    fVector3 008; // 0x01FC
    fVector3 009; // 0x0208
    fVector3 010; // 0x0214
    fVector3 011; // 0x0220
    fVector3 012; // 0x022C
    fVector3 013; // 0x0238
    fVector3 014; // 0x0244
    fVector3 015; // 0x0250
    uint32_t 016; // 0x0978
    uint32_t 017; // 0x097C
    uint32_t 018; // 0x0980
    uint32_t 019; // 0x0984
    uint32_t 020; // 0x0988
    uint32_t 021; // 0x098C
    uint32_t 023; // 0x0994
    uint32_t 024; // 0x0998
    uint32_t 025; // 0x099C
    uint32_t 026; // 0x09A0
    uint32_t 027; // 0x09A4
    uint32_t 028; // 0x09A8
    uint32_t 029; // 0x09AC
    uint32_t 030; // 0x09B0
    uint32_t 031; // 0x09B4
    uint32_t 032; // 0x09B8
    uint32_t 033; // 0x09BC
    uint32_t 034; // 0x09C0
    uint32_t 035; // 0x09C4
    uint32_t 036; // 0x09C8
    uint32_t 037; // 0x09CC
    uint32_t 038; // 0x09D0
    uint32_t 039; // 0x09D4
    uint32_t 040; // 0x09D8
    uint32_t 041; // 0x09DC
    uint32_t 042; // 0x09E0
    uint32_t 043; // 0x09E4
    uint32_t 044; // 0x09E8
    uint32_t 045; // 0x09EC
    uint32_t 047; // 0x09F4
    uint32_t 048; // 0x09F8
    uint32_t 049; // 0x09FC
    uint32_t 050; // 0x0A00
    uint32_t 052; // 0x0A08
    uint32_t 053; // 0x0A0C
    uint32_t 054; // 0x0A10
    uint32_t 055; // 0x0A14
    uint32_t 056; // 0x0A18
    uint32_t 057; // 0x0A1C
    uint32_t 058; // 0x0A20
    uint32_t 059; // 0x0A24
    uint32_t 060; // 0x0A28
    uint32_t 061; // 0x0A2C
    uint32_t 062; // 0x0A30
    uint32_t m_highlightServerContextID; // 0x032C
    uint32_t m_highlightTeamBits; // 0x0338
    uint32_t m_PredictableID; // 0x06F4
    fVector3 m_vecMaxs; // 0x0414
    uint32_t m_nSolidType; // 0x0424
    uint32_t m_usSolidFlags; // 0x0420
    uint32_t m_nSurroundType; // 0x0436
    uint32_t m_triggerBloat; // 0x0425
    fVector3 m_vecSpecifiedSurroundingMins; // 0x043C
    fVector3 m_vecSpecifiedSurroundingMaxs; // 0x0448
};

class CHardPointFrontierEntity {
public:
    fVector3 m_localOrigin; // 0x0004
    uint32_t m_iTeamNum; // 0x03A4
    int64_t visibilityShowFlag; // 0x0890
    uint32_t m_teamMilitiaAICount; // 0x0B48
    uint32_t m_state; // 0x0B3C
    float m_estimatedCaptureTime; // 0x0B40
    uint32_t m_teamMilitiaPlayerCount; // 0x0B50
    uint32_t zOrder; // 0x089C
    float m_progressRefPoint; // 0x0B44
    uint32_t m_teamIMCAICount; // 0x0B4C
    uint32_t m_teamIMCPlayerCount; // 0x0B54
    uint32_t m_teamMilitiaPlayerTitanCount; // 0x0B58
    uint32_t m_teamIMCPlayerTitanCount; // 0x0B5C
    uint32_t m_hardpointID; // 0x0B60
    uint32_t m_terminal; // 0x0B68
    int64_t visibilityDefaultFlag; // 0x0888
    uint32_t flags; // 0x0898
    uint32_t customState; // 0x08A0
    float objectScale; // 0x08A4
};

class CScriptNetData_SNDC_GLOBAL {
public:
    uint32_t m_entities[0]; // 0x0C50
    uint32_t m_bools[0]; // 0x0BC0
    void* m_entities; // 0x0000
    void* m_bools; // 0x0000
    uint32_t m_ranges[0]; // 0x0BD0
    void* m_ranges; // 0x0000
    float m_times[0]; // 0x0C10
    void* m_times; // 0x0000
    uint32_t m_hOwnerEntity; // 0x03E0
};

class CScriptNetData {
public:
    uint32_t m_hOwnerEntity; // 0x03E0
};

class CBaseTrigger {
public:
    fVector3 m_vecFinalDest; // 0x0B4C
    float m_usePromptSize; // 0x0874
    uint32_t m_spottedByTeams; // 0x0880
    uint32_t m_spawnflags; // 0x0744
    float m_fadeDist; // 0x0798
    fVector3 m_attachmentLerpStartAngles; // 0x0778
    uint32_t m_contents; // 0x083C
    uint32_t m_bClientSidePredicted; // 0x0B68
    uint32_t m_movementType; // 0x0B58
    uint32_t m_nRenderMode; // 0x03F1
    float m_flMoveTargetTime; // 0x0B5C
    float m_usableRadius; // 0x086C
    uint32_t m_cellX; // 0x0034
    uint32_t m_cellY; // 0x0038
    uint32_t m_cellZ; // 0x003C
    uint32_t m_parentAttachmentModel; // 0x0790
    fVector3 m_localOrigin; // 0x0040
    uint32_t m_shieldHealthMax; // 0x0154
    fVector3 m_localAngles; // 0x03CC
    uint32_t m_nModelIndex; // 0x004C
    uint32_t m_fEffects; // 0x0030
    const char* m_iName; // 0x04B9
    uint32_t m_nRenderFX; // 0x03E5
    uint32_t m_clrRender; // 0x0048
    uint32_t m_forceVisibleInPhaseShift; // 0x06E4
    uint32_t 063; // 0x0A34
    uint32_t m_passThroughFlags; // 0x03A8
    uint32_t m_bRenderWithViewModels; // 0x03E4
    uint32_t m_iTeamNum; // 0x03A4
    uint32_t m_passThroughThickness; // 0x03AC
    uint32_t m_CollisionGroup; // 0x0838
    float m_passThroughDirection; // 0x03B0
    uint32_t m_hOwnerEntity; // 0x03E0
    uint32_t m_dissolveEffectEntityHandle; // 0x0858
    uint32_t m_shieldHealth; // 0x0150
    uint32_t moveparent; // 0x001C
    uint32_t movetype; // 0x0000
    uint32_t m_visibilityFlags; // 0x0398
    uint32_t m_parentAttachmentIndex; // 0x0788
    fVector3 003; // 0x01C0
    float m_attachmentLerpStartTime; // 0x0764
    float m_attachmentLerpEndTime; // 0x0768
    fVector3 002; // 0x01B4
    uint32_t 051; // 0x0A04
    uint32_t m_usablePriority; // 0x0868
    fVector3 m_attachmentLerpStartOrigin; // 0x076C
    fVector3 000; // 0x019C
    uint32_t m_scriptNameIndex; // 0x05C0
    uint32_t 022; // 0x0990
    uint32_t m_instanceNameIndex; // 0x05C4
    const char* m_holdUsePrompt; // 0x0648
    uint32_t m_debugBrokenInterpolation; // 0x092C
    uint32_t 046; // 0x09F0
    const char* m_pressUsePrompt; // 0x0650
    const char* m_iSignifierName; // 0x04B0
    uint32_t movecollide; // 0x0000
    uint32_t m_scriptVisible; // 0x039C
    uint32_t m_usableType; // 0x0864
    uint32_t m_bossPlayer; // 0x0104
    uint32_t m_entitiesLinkedFromMeCount; // 0x0930
    float m_usableFOV; // 0x0870
    uint32_t m_baseTakeDamage; // 0x06E5
    uint32_t m_invulnerableToDamageCount; // 0x06E8
    uint32_t m_areEntityLinksNetworked; // 0x092F
    uint32_t m_highlightIsNetworked; // 0x0198
    uint32_t m_networkedFlags; // 0x0350
    uint32_t m_entitiesLinkedToMeCount; // 0x0934
    fVector3 001; // 0x01A8
    fVector3 004; // 0x01CC
    fVector3 005; // 0x01D8
    fVector3 006; // 0x01E4
    fVector3 007; // 0x01F0
    fVector3 008; // 0x01FC
    fVector3 009; // 0x0208
    fVector3 010; // 0x0214
    fVector3 011; // 0x0220
    fVector3 012; // 0x022C
    fVector3 013; // 0x0238
    fVector3 014; // 0x0244
    fVector3 015; // 0x0250
    uint32_t 016; // 0x0978
    uint32_t 017; // 0x097C
    uint32_t 018; // 0x0980
    uint32_t 019; // 0x0984
    uint32_t 020; // 0x0988
    uint32_t 021; // 0x098C
    uint32_t 023; // 0x0994
    uint32_t 024; // 0x0998
    uint32_t 025; // 0x099C
    uint32_t 026; // 0x09A0
    uint32_t 027; // 0x09A4
    uint32_t 028; // 0x09A8
    uint32_t 029; // 0x09AC
    uint32_t 030; // 0x09B0
    uint32_t 031; // 0x09B4
    uint32_t 032; // 0x09B8
    uint32_t 033; // 0x09BC
    uint32_t 034; // 0x09C0
    uint32_t 035; // 0x09C4
    uint32_t 036; // 0x09C8
    uint32_t 037; // 0x09CC
    uint32_t 038; // 0x09D0
    uint32_t 039; // 0x09D4
    uint32_t 040; // 0x09D8
    uint32_t 041; // 0x09DC
    uint32_t 042; // 0x09E0
    uint32_t 043; // 0x09E4
    uint32_t 044; // 0x09E8
    uint32_t 045; // 0x09EC
    uint32_t 047; // 0x09F4
    uint32_t 048; // 0x09F8
    uint32_t 049; // 0x09FC
    uint32_t 050; // 0x0A00
    uint32_t 052; // 0x0A08
    uint32_t 053; // 0x0A0C
    uint32_t 054; // 0x0A10
    uint32_t 055; // 0x0A14
    uint32_t 056; // 0x0A18
    uint32_t 057; // 0x0A1C
    uint32_t 058; // 0x0A20
    uint32_t 059; // 0x0A24
    uint32_t 060; // 0x0A28
    uint32_t 061; // 0x0A2C
    uint32_t 062; // 0x0A30
    uint32_t m_highlightServerContextID; // 0x032C
    uint32_t m_highlightTeamBits; // 0x0338
    uint32_t m_PredictableID; // 0x06F4
    fVector3 m_vecMins; // 0x0408
    fVector3 m_vecMaxs; // 0x0414
    uint32_t m_nSolidType; // 0x0424
    uint32_t m_usSolidFlags; // 0x0420
    uint32_t m_nSurroundType; // 0x0436
    uint32_t m_triggerBloat; // 0x0425
    fVector3 m_vecSpecifiedSurroundingMins; // 0x043C
    fVector3 m_vecSpecifiedSurroundingMaxs; // 0x0448
};

class CNPC_Dropship {
public:
    uint32_t m_isHologram; // 0x17E0
    uint32_t m_iHealth; // 0x0390
    fVector3 014; // 0x0244
    float m_vecViewOffset[1]; // 0x0028
    float m_cloakFadeInEndTime; // 0x0180
    float m_flSkyScaleEndTime; // 0x0CDC
    uint32_t m_titanSoul; // 0x15D0
    fVector3 000; // 0x019C
    uint32_t m_bJetWakeFXEnabled; // 0x1828
    uint32_t m_lifeState; // 0x06C8
    float m_flSkyScaleEndValue; // 0x0CD4
    uint32_t m_fireteamSlotIndex; // 0x1698
    uint32_t m_iMaxHealth; // 0x04A8
    uint32_t m_lastCycleSlot; // 0x157C
    uint32_t 024; // 0x0998
    const char* m_title; // 0x17E1
    int64_t visibilityShowFlag; // 0x0890
    uint32_t m_aiSettingsIndex; // 0x1804
    float m_cloakFlickerEndTime; // 0x0190
    uint32_t m_subclass; // 0x1808
    uint32_t m_aiSprinting; // 0x17BA
    fVector3 007; // 0x01F0
    uint32_t m_aiNetworkFlags; // 0x17DC
    fVector3 m_localOrigin; // 0x0040
    fVector3 m_localAngles; // 0x03CC
    uint32_t 035; // 0x09C4
    uint32_t customState; // 0x08A0
    fVector3 m_meleeExecutionUnstuckPosition; // 0x15D4
    uint32_t m_hGroundEntity; // 0x038C
    fVector3 004; // 0x01CC
    uint32_t m_latestNonOffhandWeapon; // 0x1578
    uint32_t seComboVars; // 0x16A8
    uint32_t m_fEffects; // 0x0030
    float m_cloakEndTime; // 0x017C
    float seTimeEnd; // 0x16AC
    uint32_t m_nameVisibilityFlags; // 0x08A8
    float seEaseOut; // 0x16B0
    uint32_t activeWeapon; // 0x1588
    float m_raiseFromMeleeEndTime; // 0x1518
    uint32_t m_selectedWeapon; // 0x1570
    uint32_t flags; // 0x0898
    float m_lastSharedEnergyRegenTime; // 0x1524
    uint32_t 030; // 0x09B0
    uint32_t m_latestPrimaryWeapon; // 0x1574
    uint32_t 061; // 0x0A2C
    uint32_t m_nForceBone; // 0x0FB8
    uint32_t m_weaponGettingSwitchedOut; // 0x0008
    uint32_t 055; // 0x0A14
    float m_vecViewOffset[2]; // 0x002C
    uint32_t m_weaponDisabled; // 0x15A5
    uint32_t m_showNewWeapon3p; // 0x000C
    fVector3 m_animInitialPos; // 0x0B6C
    uint32_t m_weaponPermission; // 0x1580
    uint32_t m_contextAction; // 0x15B4
    uint32_t m_hudInfo_visibilityTestAlwaysPasses; // 0x15A6
    uint32_t zOrder; // 0x089C
    uint32_t m_networkedFlags; // 0x0350
    uint32_t 058; // 0x0A20
    uint32_t m_sharedEnergyTotal; // 0x1520
    float m_lastFiredTime; // 0x1514
    float m_phaseShiftTimeStart; // 0x15E4
    uint32_t m_nSurroundType; // 0x0436
    uint32_t m_sharedEnergyCount; // 0x151C
    float m_sharedEnergyRegenRate; // 0x1528
    fVector3 001; // 0x01A8
    float m_sharedEnergyRegenDelay; // 0x152C
    float m_lastSharedEnergyTakeTime; // 0x1530
    float m_phaseShiftTimeEnd; // 0x15E8
    fVector3 009; // 0x0208
    float m_cloakFadeOutStartTime; // 0x0184
    float m_cloakFadeInDuration; // 0x0188
    fVector3 003; // 0x01C0
    float m_cloakFlickerAmount; // 0x018C
    uint32_t m_baseTakeDamage; // 0x06E5
    fVector3 m_deathVelocity; // 0x03B4
    float m_vecViewOffset[0]; // 0x0024
    float m_sequenceTransitionerLayerPlaybackRate; // 0x0D74
    const char* m_targetInfoIconName; // 0x1634
    uint32_t m_numRodeoSlots; // 0x0024
    fVector3 002; // 0x01B4
    int64_t visibilityDefaultFlag; // 0x0888
    float objectScale; // 0x08A4
    float m_flNextAttack; // 0x1510
    fVector3 005; // 0x01D8
    fVector3 006; // 0x01E4
    uint32_t m_AnimOverlayCount; // 0x12F8
    fVector3 m_attachmentLerpStartOrigin; // 0x076C
    uint32_t m_animSequence; // 0x001C
    uint32_t m_animModelIndex; // 0x0018
    uint32_t m_bSequenceFinished; // 0x1020
    fVector3 010; // 0x0214
    uint32_t m_useLockedAnimDeltaYaw; // 0x1021
    float m_lockedAnimDeltaYaw; // 0x1024
    uint32_t m_bCanUseFastPathFromServer; // 0x1019
    fVector3 m_vecForce; // 0x0088
    uint32_t 045; // 0x09EC
    uint32_t m_nSkin; // 0x0F80
    uint32_t m_bossPlayer; // 0x0104
    uint32_t m_nBody; // 0x0F84
    float m_flModelScale; // 0x102C
    float m_animPlaybackRate; // 0x0010
    uint32_t m_animFrozen; // 0x0014
    uint32_t m_bClientSideRagdoll; // 0x0084
    uint32_t m_nRagdollImpactFXTableId; // 0x0CCC
    float m_usableRadius; // 0x086C
    float m_flSkyScaleStartValue; // 0x0CD0
    float m_flSkyScaleStartTime; // 0x0CD8
    uint32_t m_nNewSequenceParity; // 0x0020
    uint32_t m_passDamageToParent; // 0x06EC
    float m_flEstIkOffset; // 0x0094
    uint32_t m_animActive; // 0x0B64
    uint32_t m_animCollisionEnabled; // 0x0B67
    uint32_t m_animNetworkFlags; // 0x0B60
    uint32_t m_passThroughThickness; // 0x03AC
    uint32_t m_syncingWithEntity; // 0x0C5C
    uint32_t m_predictedAnimEventCount; // 0x0CA8
    uint32_t m_predictedAnimEventTarget; // 0x0CAC
    uint32_t m_predictedAnimEventSequence; // 0x0CB0
    uint32_t m_predictedAnimEventModel; // 0x0CB4
    uint32_t m_CollisionGroup; // 0x0838
    float m_predictedAnimEventsReadyToFireTime; // 0x0CB8
    const char* m_iName; // 0x04B9
    fVector3 m_animInitialVel; // 0x0B78
    fVector4 m_animInitialRot; // 0x0B84
    uint32_t 056; // 0x0A18
    fVector3 m_animInitialCorrectPos; // 0x0B94
    uint32_t m_spottedByTeams; // 0x0880
    float m_usePromptSize; // 0x0874
    fVector4 m_animInitialCorrectRot; // 0x0BA0
    fVector3 m_animEntityToRefOffset; // 0x0BB0
    fVector4 m_animEntityToRefRotation; // 0x0BBC
    float m_animBeginTime; // 0x0BCC
    float m_animEndTime; // 0x0BD0
    uint32_t m_animScriptSequence; // 0x0BD4
    uint32_t m_animScriptModel; // 0x0BD8
    uint32_t m_animIgnoreParentRot; // 0x0BDC
    uint32_t m_animMotionMode; // 0x0BE0
    uint32_t m_sequenceTransitionerLayerCount; // 0x0E98
    uint32_t m_sequenceTransitionerLayerActive; // 0x0D60
    uint32_t m_sequenceTransitionerLayerModelIndex; // 0x0D64
    float m_sequenceTransitionerLayerStartCycle; // 0x0D68
    uint32_t 034; // 0x09C0
    uint32_t m_sequenceTransitionerLayerSequence; // 0x0D6C
    float m_sequenceTransitionerLayerStartTime; // 0x0D78
    float m_sequenceTransitionerLayerFadeOutDuration; // 0x0D7C
    float m_animStartTime; // 0x0008
    float m_animStartCycle; // 0x000C
    uint32_t 052; // 0x0A08
    uint32_t m_nResetEventsParity; // 0x0F90
    fVector3 008; // 0x01FC
    fVector3 011; // 0x0220
    fVector3 012; // 0x022C
    fVector3 013; // 0x0238
    fVector3 015; // 0x0250
    uint32_t 016; // 0x0978
    uint32_t 017; // 0x097C
    uint32_t 018; // 0x0980
    uint32_t 019; // 0x0984
    uint32_t 020; // 0x0988
    uint32_t 021; // 0x098C
    uint32_t m_instanceNameIndex; // 0x05C4
    uint32_t 022; // 0x0990
    uint32_t 023; // 0x0994
    uint32_t m_cellX; // 0x0034
    uint32_t m_cellY; // 0x0038
    uint32_t m_parentAttachmentModel; // 0x0790
    uint32_t m_cellZ; // 0x003C
    uint32_t m_nModelIndex; // 0x004C
    uint32_t m_nRenderMode; // 0x03F1
    uint32_t m_nRenderFX; // 0x03E5
    uint32_t m_forceVisibleInPhaseShift; // 0x06E4
    uint32_t m_clrRender; // 0x0048
    uint32_t m_bRenderWithViewModels; // 0x03E4
    uint32_t m_iTeamNum; // 0x03A4
    uint32_t 063; // 0x0A34
    uint32_t m_passThroughFlags; // 0x03A8
    float m_passThroughDirection; // 0x03B0
    uint32_t m_contents; // 0x083C
    uint32_t m_hOwnerEntity; // 0x03E0
    uint32_t m_shieldHealth; // 0x0150
    uint32_t m_dissolveEffectEntityHandle; // 0x0858
    uint32_t movetype; // 0x0000
    uint32_t moveparent; // 0x001C
    uint32_t m_parentAttachmentIndex; // 0x0788
    float m_attachmentLerpStartTime; // 0x0764
    float m_attachmentLerpEndTime; // 0x0768
    fVector3 m_attachmentLerpStartAngles; // 0x0778
    uint32_t m_scriptNameIndex; // 0x05C0
    const char* m_holdUsePrompt; // 0x0648
    uint32_t 046; // 0x09F0
    const char* m_pressUsePrompt; // 0x0650
    const char* m_iSignifierName; // 0x04B0
    uint32_t movecollide; // 0x0000
    float m_fadeDist; // 0x0798
    uint32_t m_visibilityFlags; // 0x0398
    uint32_t m_scriptVisible; // 0x039C
    uint32_t m_usableType; // 0x0864
    uint32_t 051; // 0x0A04
    uint32_t m_usablePriority; // 0x0868
    float m_usableFOV; // 0x0870
    uint32_t m_invulnerableToDamageCount; // 0x06E8
    uint32_t m_shieldHealthMax; // 0x0154
    uint32_t m_highlightIsNetworked; // 0x0198
    uint32_t m_areEntityLinksNetworked; // 0x092F
    uint32_t m_debugBrokenInterpolation; // 0x092C
    uint32_t m_entitiesLinkedFromMeCount; // 0x0930
    uint32_t m_entitiesLinkedToMeCount; // 0x0934
    uint32_t 025; // 0x099C
    uint32_t 026; // 0x09A0
    uint32_t 027; // 0x09A4
    uint32_t 028; // 0x09A8
    uint32_t 029; // 0x09AC
    uint32_t 031; // 0x09B4
    uint32_t 032; // 0x09B8
    uint32_t 033; // 0x09BC
    uint32_t 036; // 0x09C8
    uint32_t 037; // 0x09CC
    uint32_t 038; // 0x09D0
    uint32_t 039; // 0x09D4
    uint32_t 040; // 0x09D8
    uint32_t 041; // 0x09DC
    uint32_t 042; // 0x09E0
    uint32_t 043; // 0x09E4
    uint32_t 044; // 0x09E8
    uint32_t 047; // 0x09F4
    uint32_t 048; // 0x09F8
    uint32_t 049; // 0x09FC
    uint32_t 050; // 0x0A00
    uint32_t 053; // 0x0A0C
    uint32_t 054; // 0x0A10
    uint32_t 057; // 0x0A1C
    uint32_t 059; // 0x0A24
    uint32_t 060; // 0x0A28
    uint32_t 062; // 0x0A30
    uint32_t m_highlightServerContextID; // 0x032C
    uint32_t m_highlightTeamBits; // 0x0338
    uint32_t m_PredictableID; // 0x06F4
    fVector3 m_vecMins; // 0x0408
    fVector3 m_vecMaxs; // 0x0414
    uint32_t m_nSolidType; // 0x0424
    uint32_t m_usSolidFlags; // 0x0420
    uint32_t m_triggerBloat; // 0x0425
    fVector3 m_vecSpecifiedSurroundingMins; // 0x043C
    fVector3 m_vecSpecifiedSurroundingMaxs; // 0x0448
};

class CGlobalNonRewinding {
public:
    uint32_t m_observerMode; // 0x0B38
    uint32_t m_observerTarget; // 0x0B3C
};

class CTEScriptParticleSystem {
public:
    uint32_t m_effectIndex; // 0x0028
    fVector3 m_origin; // 0x002C
    fVector3 m_controlPoint1; // 0x0044
    fVector3 m_angles; // 0x0038
};

class CTriggerPlayerMovement {
public:
    fVector3 m_vecFinalDest; // 0x0B4C
    float m_usePromptSize; // 0x0874
    uint32_t m_spottedByTeams; // 0x0880
    uint32_t m_spawnflags; // 0x0744
    float m_fadeDist; // 0x0798
    fVector3 m_attachmentLerpStartAngles; // 0x0778
    uint32_t m_contents; // 0x083C
    uint32_t m_bClientSidePredicted; // 0x0B68
    uint32_t m_movementType; // 0x0B58
    uint32_t m_nRenderMode; // 0x03F1
    float m_flMoveTargetTime; // 0x0B5C
    float m_usableRadius; // 0x086C
    uint32_t m_cellX; // 0x0034
    uint32_t m_cellY; // 0x0038
    uint32_t m_cellZ; // 0x003C
    uint32_t m_parentAttachmentModel; // 0x0790
    fVector3 m_localOrigin; // 0x0040
    uint32_t m_shieldHealthMax; // 0x0154
    fVector3 m_localAngles; // 0x03CC
    uint32_t m_nModelIndex; // 0x004C
    uint32_t m_fEffects; // 0x0030
    const char* m_iName; // 0x04B9
    uint32_t m_nRenderFX; // 0x03E5
    uint32_t m_clrRender; // 0x0048
    uint32_t m_forceVisibleInPhaseShift; // 0x06E4
    uint32_t 063; // 0x0A34
    uint32_t m_passThroughFlags; // 0x03A8
    uint32_t m_bRenderWithViewModels; // 0x03E4
    uint32_t m_iTeamNum; // 0x03A4
    uint32_t m_passThroughThickness; // 0x03AC
    uint32_t m_CollisionGroup; // 0x0838
    float m_passThroughDirection; // 0x03B0
    uint32_t m_hOwnerEntity; // 0x03E0
    uint32_t m_dissolveEffectEntityHandle; // 0x0858
    uint32_t m_shieldHealth; // 0x0150
    uint32_t moveparent; // 0x001C
    uint32_t movetype; // 0x0000
    uint32_t m_visibilityFlags; // 0x0398
    uint32_t m_parentAttachmentIndex; // 0x0788
    fVector3 003; // 0x01C0
    float m_attachmentLerpStartTime; // 0x0764
    float m_attachmentLerpEndTime; // 0x0768
    fVector3 002; // 0x01B4
    uint32_t 051; // 0x0A04
    uint32_t m_usablePriority; // 0x0868
    fVector3 m_attachmentLerpStartOrigin; // 0x076C
    fVector3 000; // 0x019C
    uint32_t m_scriptNameIndex; // 0x05C0
    uint32_t 022; // 0x0990
    uint32_t m_instanceNameIndex; // 0x05C4
    const char* m_holdUsePrompt; // 0x0648
    uint32_t m_debugBrokenInterpolation; // 0x092C
    uint32_t 046; // 0x09F0
    const char* m_pressUsePrompt; // 0x0650
    const char* m_iSignifierName; // 0x04B0
    uint32_t movecollide; // 0x0000
    uint32_t m_scriptVisible; // 0x039C
    uint32_t m_usableType; // 0x0864
    uint32_t m_bossPlayer; // 0x0104
    uint32_t m_entitiesLinkedFromMeCount; // 0x0930
    float m_usableFOV; // 0x0870
    uint32_t m_baseTakeDamage; // 0x06E5
    uint32_t m_invulnerableToDamageCount; // 0x06E8
    uint32_t m_areEntityLinksNetworked; // 0x092F
    uint32_t m_highlightIsNetworked; // 0x0198
    uint32_t m_networkedFlags; // 0x0350
    uint32_t m_entitiesLinkedToMeCount; // 0x0934
    fVector3 001; // 0x01A8
    fVector3 004; // 0x01CC
    fVector3 005; // 0x01D8
    fVector3 006; // 0x01E4
    fVector3 007; // 0x01F0
    fVector3 008; // 0x01FC
    fVector3 009; // 0x0208
    fVector3 010; // 0x0214
    fVector3 011; // 0x0220
    fVector3 012; // 0x022C
    fVector3 013; // 0x0238
    fVector3 014; // 0x0244
    fVector3 015; // 0x0250
    uint32_t 016; // 0x0978
    uint32_t 017; // 0x097C
    uint32_t 018; // 0x0980
    uint32_t 019; // 0x0984
    uint32_t 020; // 0x0988
    uint32_t 021; // 0x098C
    uint32_t 023; // 0x0994
    uint32_t 024; // 0x0998
    uint32_t 025; // 0x099C
    uint32_t 026; // 0x09A0
    uint32_t 027; // 0x09A4
    uint32_t 028; // 0x09A8
    uint32_t 029; // 0x09AC
    uint32_t 030; // 0x09B0
    uint32_t 031; // 0x09B4
    uint32_t 032; // 0x09B8
    uint32_t 033; // 0x09BC
    uint32_t 034; // 0x09C0
    uint32_t 035; // 0x09C4
    uint32_t 036; // 0x09C8
    uint32_t 037; // 0x09CC
    uint32_t 038; // 0x09D0
    uint32_t 039; // 0x09D4
    uint32_t 040; // 0x09D8
    uint32_t 041; // 0x09DC
    uint32_t 042; // 0x09E0
    uint32_t 043; // 0x09E4
    uint32_t 044; // 0x09E8
    uint32_t 045; // 0x09EC
    uint32_t 047; // 0x09F4
    uint32_t 048; // 0x09F8
    uint32_t 049; // 0x09FC
    uint32_t 050; // 0x0A00
    uint32_t 052; // 0x0A08
    uint32_t 053; // 0x0A0C
    uint32_t 054; // 0x0A10
    uint32_t 055; // 0x0A14
    uint32_t 056; // 0x0A18
    uint32_t 057; // 0x0A1C
    uint32_t 058; // 0x0A20
    uint32_t 059; // 0x0A24
    uint32_t 060; // 0x0A28
    uint32_t 061; // 0x0A2C
    uint32_t 062; // 0x0A30
    uint32_t m_highlightServerContextID; // 0x032C
    uint32_t m_highlightTeamBits; // 0x0338
    uint32_t m_PredictableID; // 0x06F4
    fVector3 m_vecMins; // 0x0408
    fVector3 m_vecMaxs; // 0x0414
    uint32_t m_nSolidType; // 0x0424
    uint32_t m_usSolidFlags; // 0x0420
    uint32_t m_nSurroundType; // 0x0436
    uint32_t m_triggerBloat; // 0x0425
    fVector3 m_vecSpecifiedSurroundingMins; // 0x043C
    fVector3 m_vecSpecifiedSurroundingMaxs; // 0x0448
};

class CTriggerPointGravity {
public:
    float m_usePromptSize; // 0x0874
    uint32_t m_spottedByTeams; // 0x0880
    uint32_t m_spawnflags; // 0x0744
    float m_fadeDist; // 0x0798
    fVector3 m_attachmentLerpStartAngles; // 0x0778
    uint32_t m_contents; // 0x083C
    float m_pullOuterRadius; // 0x0B70
    uint32_t m_bClientSidePredicted; // 0x0B68
    uint32_t moveparent; // 0x001C
    uint32_t movetype; // 0x0000
    float m_pullInnerRadius; // 0x0B74
    uint32_t 022; // 0x0990
    uint32_t m_instanceNameIndex; // 0x05C4
    float m_reduceSpeedOuterRadius; // 0x0B78
    uint32_t m_movementType; // 0x0B58
    float m_reduceSpeedInnerRadius; // 0x0B7C
    float m_pullAccel; // 0x0B80
    uint32_t movecollide; // 0x0000
    uint32_t m_passThroughThickness; // 0x03AC
    float m_pullSpeed; // 0x0B84
    fVector3 m_vecFinalDest; // 0x0B4C
    uint32_t m_nRenderMode; // 0x03F1
    float m_flMoveTargetTime; // 0x0B5C
    float m_usableRadius; // 0x086C
    uint32_t m_cellX; // 0x0034
    uint32_t m_cellY; // 0x0038
    uint32_t m_cellZ; // 0x003C
    uint32_t m_parentAttachmentModel; // 0x0790
    fVector3 m_localOrigin; // 0x0040
    uint32_t m_shieldHealthMax; // 0x0154
    fVector3 m_localAngles; // 0x03CC
    uint32_t m_nModelIndex; // 0x004C
    uint32_t m_fEffects; // 0x0030
    const char* m_iName; // 0x04B9
    uint32_t m_nRenderFX; // 0x03E5
    uint32_t m_clrRender; // 0x0048
    uint32_t m_forceVisibleInPhaseShift; // 0x06E4
    uint32_t 063; // 0x0A34
    uint32_t m_passThroughFlags; // 0x03A8
    uint32_t m_bRenderWithViewModels; // 0x03E4
    uint32_t m_iTeamNum; // 0x03A4
    uint32_t m_CollisionGroup; // 0x0838
    float m_passThroughDirection; // 0x03B0
    uint32_t m_hOwnerEntity; // 0x03E0
    uint32_t m_dissolveEffectEntityHandle; // 0x0858
    uint32_t m_shieldHealth; // 0x0150
    uint32_t m_visibilityFlags; // 0x0398
    uint32_t m_parentAttachmentIndex; // 0x0788
    float m_attachmentLerpStartTime; // 0x0764
    float m_attachmentLerpEndTime; // 0x0768
    uint32_t 051; // 0x0A04
    uint32_t m_usablePriority; // 0x0868
    fVector3 m_attachmentLerpStartOrigin; // 0x076C
    uint32_t m_scriptNameIndex; // 0x05C0
    const char* m_holdUsePrompt; // 0x0648
    uint32_t m_debugBrokenInterpolation; // 0x092C
    uint32_t 046; // 0x09F0
    const char* m_pressUsePrompt; // 0x0650
    const char* m_iSignifierName; // 0x04B0
    uint32_t m_scriptVisible; // 0x039C
    uint32_t m_usableType; // 0x0864
    uint32_t m_bossPlayer; // 0x0104
    float m_usableFOV; // 0x0870
    uint32_t m_baseTakeDamage; // 0x06E5
    uint32_t m_invulnerableToDamageCount; // 0x06E8
    uint32_t m_areEntityLinksNetworked; // 0x092F
    uint32_t m_highlightIsNetworked; // 0x0198
    uint32_t m_networkedFlags; // 0x0350
    uint32_t m_entitiesLinkedFromMeCount; // 0x0930
    uint32_t m_entitiesLinkedToMeCount; // 0x0934
    fVector3 000; // 0x019C
    fVector3 001; // 0x01A8
    fVector3 002; // 0x01B4
    fVector3 003; // 0x01C0
    fVector3 004; // 0x01CC
    fVector3 005; // 0x01D8
    fVector3 006; // 0x01E4
    fVector3 007; // 0x01F0
    fVector3 008; // 0x01FC
    fVector3 009; // 0x0208
    fVector3 010; // 0x0214
    fVector3 011; // 0x0220
    fVector3 012; // 0x022C
    fVector3 013; // 0x0238
    fVector3 014; // 0x0244
    fVector3 015; // 0x0250
    uint32_t 016; // 0x0978
    uint32_t 017; // 0x097C
    uint32_t 018; // 0x0980
    uint32_t 019; // 0x0984
    uint32_t 020; // 0x0988
    uint32_t 021; // 0x098C
    uint32_t 023; // 0x0994
    uint32_t 024; // 0x0998
    uint32_t 025; // 0x099C
    uint32_t 026; // 0x09A0
    uint32_t 027; // 0x09A4
    uint32_t 028; // 0x09A8
    uint32_t 029; // 0x09AC
    uint32_t 030; // 0x09B0
    uint32_t 031; // 0x09B4
    uint32_t 032; // 0x09B8
    uint32_t 033; // 0x09BC
    uint32_t 034; // 0x09C0
    uint32_t 035; // 0x09C4
    uint32_t 036; // 0x09C8
    uint32_t 037; // 0x09CC
    uint32_t 038; // 0x09D0
    uint32_t 039; // 0x09D4
    uint32_t 040; // 0x09D8
    uint32_t 041; // 0x09DC
    uint32_t 042; // 0x09E0
    uint32_t 043; // 0x09E4
    uint32_t 044; // 0x09E8
    uint32_t 045; // 0x09EC
    uint32_t 047; // 0x09F4
    uint32_t 048; // 0x09F8
    uint32_t 049; // 0x09FC
    uint32_t 050; // 0x0A00
    uint32_t 052; // 0x0A08
    uint32_t 053; // 0x0A0C
    uint32_t 054; // 0x0A10
    uint32_t 055; // 0x0A14
    uint32_t 056; // 0x0A18
    uint32_t 057; // 0x0A1C
    uint32_t 058; // 0x0A20
    uint32_t 059; // 0x0A24
    uint32_t 060; // 0x0A28
    uint32_t 061; // 0x0A2C
    uint32_t 062; // 0x0A30
    uint32_t m_highlightServerContextID; // 0x032C
    uint32_t m_highlightTeamBits; // 0x0338
    uint32_t m_PredictableID; // 0x06F4
    fVector3 m_vecMins; // 0x0408
    fVector3 m_vecMaxs; // 0x0414
    uint32_t m_nSolidType; // 0x0424
    uint32_t m_usSolidFlags; // 0x0420
    uint32_t m_nSurroundType; // 0x0436
    uint32_t m_triggerBloat; // 0x0425
    fVector3 m_vecSpecifiedSurroundingMins; // 0x043C
    fVector3 m_vecSpecifiedSurroundingMaxs; // 0x0448
};

class CBaseVPhysicsTrigger {
public:
    float m_usableRadius; // 0x086C
    uint32_t m_cellX; // 0x0034
    uint32_t m_cellY; // 0x0038
    uint32_t m_cellZ; // 0x003C
    uint32_t m_parentAttachmentModel; // 0x0790
    uint32_t m_nModelIndex; // 0x004C
    fVector3 m_localOrigin; // 0x0040
    uint32_t m_shieldHealthMax; // 0x0154
    fVector3 m_localAngles; // 0x03CC
    uint32_t m_fEffects; // 0x0030
    uint32_t m_nRenderMode; // 0x03F1
    const char* m_iName; // 0x04B9
    uint32_t m_nRenderFX; // 0x03E5
    uint32_t m_clrRender; // 0x0048
    uint32_t m_forceVisibleInPhaseShift; // 0x06E4
    uint32_t 063; // 0x0A34
    uint32_t m_passThroughFlags; // 0x03A8
    uint32_t m_bRenderWithViewModels; // 0x03E4
    uint32_t m_iTeamNum; // 0x03A4
    uint32_t m_passThroughThickness; // 0x03AC
    uint32_t m_CollisionGroup; // 0x0838
    float m_passThroughDirection; // 0x03B0
    float m_fadeDist; // 0x0798
    fVector3 m_attachmentLerpStartAngles; // 0x0778
    uint32_t m_contents; // 0x083C
    uint32_t m_hOwnerEntity; // 0x03E0
    uint32_t m_dissolveEffectEntityHandle; // 0x0858
    uint32_t m_shieldHealth; // 0x0150
    uint32_t moveparent; // 0x001C
    uint32_t movetype; // 0x0000
    uint32_t m_visibilityFlags; // 0x0398
    uint32_t m_parentAttachmentIndex; // 0x0788
    fVector3 003; // 0x01C0
    float m_attachmentLerpStartTime; // 0x0764
    fVector3 008; // 0x01FC
    float m_attachmentLerpEndTime; // 0x0768
    fVector3 002; // 0x01B4
    uint32_t 051; // 0x0A04
    uint32_t m_usablePriority; // 0x0868
    fVector3 m_attachmentLerpStartOrigin; // 0x076C
    fVector3 000; // 0x019C
    uint32_t m_scriptNameIndex; // 0x05C0
    uint32_t 022; // 0x0990
    uint32_t m_instanceNameIndex; // 0x05C4
    const char* m_holdUsePrompt; // 0x0648
    uint32_t m_debugBrokenInterpolation; // 0x092C
    uint32_t 046; // 0x09F0
    const char* m_pressUsePrompt; // 0x0650
    const char* m_iSignifierName; // 0x04B0
    uint32_t movecollide; // 0x0000
    uint32_t m_scriptVisible; // 0x039C
    fVector3 006; // 0x01E4
    uint32_t m_usableType; // 0x0864
    uint32_t m_bossPlayer; // 0x0104
    uint32_t m_entitiesLinkedFromMeCount; // 0x0930
    float m_usableFOV; // 0x0870
    float m_usePromptSize; // 0x0874
    uint32_t m_spottedByTeams; // 0x0880
    uint32_t m_baseTakeDamage; // 0x06E5
    uint32_t m_invulnerableToDamageCount; // 0x06E8
    uint32_t m_areEntityLinksNetworked; // 0x092F
    uint32_t m_highlightIsNetworked; // 0x0198
    uint32_t m_networkedFlags; // 0x0350
    uint32_t m_entitiesLinkedToMeCount; // 0x0934
    fVector3 001; // 0x01A8
    fVector3 004; // 0x01CC
    fVector3 005; // 0x01D8
    fVector3 007; // 0x01F0
    fVector3 009; // 0x0208
    fVector3 010; // 0x0214
    fVector3 011; // 0x0220
    fVector3 012; // 0x022C
    fVector3 013; // 0x0238
    fVector3 014; // 0x0244
    fVector3 015; // 0x0250
    uint32_t 016; // 0x0978
    uint32_t 017; // 0x097C
    uint32_t 018; // 0x0980
    uint32_t 019; // 0x0984
    uint32_t 020; // 0x0988
    uint32_t 021; // 0x098C
    uint32_t 023; // 0x0994
    uint32_t 024; // 0x0998
    uint32_t 025; // 0x099C
    uint32_t 026; // 0x09A0
    uint32_t 027; // 0x09A4
    uint32_t 028; // 0x09A8
    uint32_t 029; // 0x09AC
    uint32_t 030; // 0x09B0
    uint32_t 031; // 0x09B4
    uint32_t 032; // 0x09B8
    uint32_t 033; // 0x09BC
    uint32_t 034; // 0x09C0
    uint32_t 035; // 0x09C4
    uint32_t 036; // 0x09C8
    uint32_t 037; // 0x09CC
    uint32_t 038; // 0x09D0
    uint32_t 039; // 0x09D4
    uint32_t 040; // 0x09D8
    uint32_t 041; // 0x09DC
    uint32_t 042; // 0x09E0
    uint32_t 043; // 0x09E4
    uint32_t 044; // 0x09E8
    uint32_t 045; // 0x09EC
    uint32_t 047; // 0x09F4
    uint32_t 048; // 0x09F8
    uint32_t 049; // 0x09FC
    uint32_t 050; // 0x0A00
    uint32_t 052; // 0x0A08
    uint32_t 053; // 0x0A0C
    uint32_t 054; // 0x0A10
    uint32_t 055; // 0x0A14
    uint32_t 056; // 0x0A18
    uint32_t 057; // 0x0A1C
    uint32_t 058; // 0x0A20
    uint32_t 059; // 0x0A24
    uint32_t 060; // 0x0A28
    uint32_t 061; // 0x0A2C
    uint32_t 062; // 0x0A30
    uint32_t m_highlightServerContextID; // 0x032C
    uint32_t m_highlightTeamBits; // 0x0338
    uint32_t m_PredictableID; // 0x06F4
    fVector3 m_vecMins; // 0x0408
    fVector3 m_vecMaxs; // 0x0414
    uint32_t m_nSolidType; // 0x0424
    uint32_t m_usSolidFlags; // 0x0420
    uint32_t m_nSurroundType; // 0x0436
    uint32_t m_triggerBloat; // 0x0425
    fVector3 m_vecSpecifiedSurroundingMins; // 0x043C
    fVector3 m_vecSpecifiedSurroundingMaxs; // 0x0448
};

class CSpotlightEnd {
public:
    uint32_t m_cellZ; // 0x003C
    uint32_t m_parentAttachmentModel; // 0x0790
    float m_flLightScale; // 0x0B38
    float m_Radius; // 0x0B3C
    float m_usableRadius; // 0x086C
    uint32_t m_cellX; // 0x0034
    uint32_t m_cellY; // 0x0038
    uint32_t m_nModelIndex; // 0x004C
    fVector3 m_localOrigin; // 0x0040
    uint32_t m_shieldHealthMax; // 0x0154
    fVector3 m_localAngles; // 0x03CC
    uint32_t m_fEffects; // 0x0030
    uint32_t m_nRenderMode; // 0x03F1
    const char* m_iName; // 0x04B9
    uint32_t m_nRenderFX; // 0x03E5
    uint32_t m_clrRender; // 0x0048
    uint32_t m_forceVisibleInPhaseShift; // 0x06E4
    uint32_t 063; // 0x0A34
    uint32_t m_passThroughFlags; // 0x03A8
    uint32_t m_bRenderWithViewModels; // 0x03E4
    uint32_t m_iTeamNum; // 0x03A4
    uint32_t m_passThroughThickness; // 0x03AC
    uint32_t m_CollisionGroup; // 0x0838
    float m_passThroughDirection; // 0x03B0
    float m_fadeDist; // 0x0798
    fVector3 m_attachmentLerpStartAngles; // 0x0778
    uint32_t m_contents; // 0x083C
    uint32_t m_hOwnerEntity; // 0x03E0
    uint32_t m_dissolveEffectEntityHandle; // 0x0858
    uint32_t m_shieldHealth; // 0x0150
    uint32_t moveparent; // 0x001C
    uint32_t movetype; // 0x0000
    uint32_t m_visibilityFlags; // 0x0398
    uint32_t m_parentAttachmentIndex; // 0x0788
    fVector3 003; // 0x01C0
    float m_attachmentLerpStartTime; // 0x0764
    float m_attachmentLerpEndTime; // 0x0768
    fVector3 002; // 0x01B4
    uint32_t 051; // 0x0A04
    uint32_t m_usablePriority; // 0x0868
    fVector3 m_attachmentLerpStartOrigin; // 0x076C
    fVector3 000; // 0x019C
    uint32_t m_scriptNameIndex; // 0x05C0
    uint32_t 022; // 0x0990
    uint32_t m_instanceNameIndex; // 0x05C4
    const char* m_holdUsePrompt; // 0x0648
    uint32_t m_debugBrokenInterpolation; // 0x092C
    uint32_t 046; // 0x09F0
    const char* m_pressUsePrompt; // 0x0650
    const char* m_iSignifierName; // 0x04B0
    uint32_t movecollide; // 0x0000
    uint32_t m_scriptVisible; // 0x039C
    fVector3 006; // 0x01E4
    uint32_t m_usableType; // 0x0864
    uint32_t m_bossPlayer; // 0x0104
    uint32_t m_entitiesLinkedFromMeCount; // 0x0930
    float m_usableFOV; // 0x0870
    float m_usePromptSize; // 0x0874
    uint32_t m_spottedByTeams; // 0x0880
    uint32_t m_baseTakeDamage; // 0x06E5
    uint32_t m_invulnerableToDamageCount; // 0x06E8
    uint32_t m_areEntityLinksNetworked; // 0x092F
    uint32_t m_highlightIsNetworked; // 0x0198
    uint32_t m_networkedFlags; // 0x0350
    uint32_t m_entitiesLinkedToMeCount; // 0x0934
    fVector3 001; // 0x01A8
    fVector3 004; // 0x01CC
    fVector3 005; // 0x01D8
    fVector3 007; // 0x01F0
    fVector3 008; // 0x01FC
    fVector3 009; // 0x0208
    fVector3 010; // 0x0214
    fVector3 011; // 0x0220
    fVector3 012; // 0x022C
    fVector3 013; // 0x0238
    fVector3 014; // 0x0244
    fVector3 015; // 0x0250
    uint32_t 016; // 0x0978
    uint32_t 017; // 0x097C
    uint32_t 018; // 0x0980
    uint32_t 019; // 0x0984
    uint32_t 020; // 0x0988
    uint32_t 021; // 0x098C
    uint32_t 023; // 0x0994
    uint32_t 024; // 0x0998
    uint32_t 025; // 0x099C
    uint32_t 026; // 0x09A0
    uint32_t 027; // 0x09A4
    uint32_t 028; // 0x09A8
    uint32_t 029; // 0x09AC
    uint32_t 030; // 0x09B0
    uint32_t 031; // 0x09B4
    uint32_t 032; // 0x09B8
    uint32_t 033; // 0x09BC
    uint32_t 034; // 0x09C0
    uint32_t 035; // 0x09C4
    uint32_t 036; // 0x09C8
    uint32_t 037; // 0x09CC
    uint32_t 038; // 0x09D0
    uint32_t 039; // 0x09D4
    uint32_t 040; // 0x09D8
    uint32_t 041; // 0x09DC
    uint32_t 042; // 0x09E0
    uint32_t 043; // 0x09E4
    uint32_t 044; // 0x09E8
    uint32_t 045; // 0x09EC
    uint32_t 047; // 0x09F4
    uint32_t 048; // 0x09F8
    uint32_t 049; // 0x09FC
    uint32_t 050; // 0x0A00
    uint32_t 052; // 0x0A08
    uint32_t 053; // 0x0A0C
    uint32_t 054; // 0x0A10
    uint32_t 055; // 0x0A14
    uint32_t 056; // 0x0A18
    uint32_t 057; // 0x0A1C
    uint32_t 058; // 0x0A20
    uint32_t 059; // 0x0A24
    uint32_t 060; // 0x0A28
    uint32_t 061; // 0x0A2C
    uint32_t 062; // 0x0A30
    uint32_t m_highlightServerContextID; // 0x032C
    uint32_t m_highlightTeamBits; // 0x0338
    uint32_t m_PredictableID; // 0x06F4
    fVector3 m_vecMins; // 0x0408
    fVector3 m_vecMaxs; // 0x0414
    uint32_t m_nSolidType; // 0x0424
    uint32_t m_usSolidFlags; // 0x0420
    uint32_t m_nSurroundType; // 0x0436
    uint32_t m_triggerBloat; // 0x0425
    fVector3 m_vecSpecifiedSurroundingMins; // 0x043C
    fVector3 m_vecSpecifiedSurroundingMaxs; // 0x0448
};

class CScriptProp {
public:
    uint32_t m_nameVisibilityFlags; // 0x08A8
    uint32_t 024; // 0x0998
    const char* m_title; // 0x1280
    const char* m_footstepType; // 0x12A0
    uint32_t zOrder; // 0x089C
    uint32_t m_networkedFlags; // 0x0350
    uint32_t 031; // 0x09B4
    uint32_t m_renderColorFriendly; // 0x12E1
    const char* m_iName; // 0x04B9
    fVector3 m_animInitialVel; // 0x0B78
    uint32_t m_renderColorFriendlyIsValid; // 0x12E0
    uint32_t m_predictedAnimEventSequence; // 0x0CB0
    uint32_t m_predictedAnimEventTarget; // 0x0CAC
    uint32_t m_iHealth; // 0x0390
    uint32_t m_passDamageToParent; // 0x06EC
    uint32_t m_iMaxHealth; // 0x04A8
    uint32_t m_armorType; // 0x12E8
    fVector3 003; // 0x01C0
    uint32_t 050; // 0x0A00
    uint32_t m_bUseHitboxesForRenderBox; // 0x1239
    uint32_t m_scriptPropFlags; // 0x12EC
    uint32_t m_scriptPropSmartAmmoLockType; // 0x12F0
    int64_t visibilityDefaultFlag; // 0x0888
    float m_flModelScale; // 0x102C
    int64_t visibilityShowFlag; // 0x0890
    uint32_t flags; // 0x0898
    uint32_t 035; // 0x09C4
    uint32_t customState; // 0x08A0
    float m_flSkyScaleEndValue; // 0x0CD4
    uint32_t m_bClientSideRagdoll; // 0x0084
    uint32_t m_lifeState; // 0x06C8
    float objectScale; // 0x08A4
    uint32_t m_iTeamNum; // 0x03A4
    uint32_t m_physDummyMotionEnabled; // 0x092D
    uint32_t m_bPhysicsMotionEnabled; // 0x1230
    fVector3 002; // 0x01B4
    uint32_t m_predictedAnimEventCount; // 0x0CA8
    fVector3 m_attachmentLerpStartOrigin; // 0x076C
    uint32_t m_animSequence; // 0x001C
    uint32_t m_animModelIndex; // 0x0018
    uint32_t m_bSequenceFinished; // 0x1020
    uint32_t 061; // 0x0A2C
    uint32_t m_nForceBone; // 0x0FB8
    fVector3 010; // 0x0214
    uint32_t m_useLockedAnimDeltaYaw; // 0x1021
    float m_lockedAnimDeltaYaw; // 0x1024
    fVector3 m_animInitialPos; // 0x0B6C
    uint32_t m_bCanUseFastPathFromServer; // 0x1019
    fVector3 m_vecForce; // 0x0088
    uint32_t 045; // 0x09EC
    uint32_t m_nSkin; // 0x0F80
    fVector3 006; // 0x01E4
    uint32_t m_bossPlayer; // 0x0104
    uint32_t m_nBody; // 0x0F84
    float m_animPlaybackRate; // 0x0010
    uint32_t m_animActive; // 0x0B64
    uint32_t m_animFrozen; // 0x0014
    uint32_t m_passThroughThickness; // 0x03AC
    uint32_t m_syncingWithEntity; // 0x0C5C
    uint32_t m_nRagdollImpactFXTableId; // 0x0CCC
    float m_usableRadius; // 0x086C
    float m_flSkyScaleStartValue; // 0x0CD0
    float m_flSkyScaleStartTime; // 0x0CD8
    float m_flSkyScaleEndTime; // 0x0CDC
    uint32_t m_nNewSequenceParity; // 0x0020
    float m_flEstIkOffset; // 0x0094
    fVector4 m_animInitialRot; // 0x0B84
    uint32_t m_animCollisionEnabled; // 0x0B67
    uint32_t m_animNetworkFlags; // 0x0B60
    fVector3 004; // 0x01CC
    uint32_t m_predictedAnimEventModel; // 0x0CB4
    uint32_t m_CollisionGroup; // 0x0838
    float m_predictedAnimEventsReadyToFireTime; // 0x0CB8
    fVector3 000; // 0x019C
    fVector3 001; // 0x01A8
    fVector3 005; // 0x01D8
    fVector3 007; // 0x01F0
    uint32_t 056; // 0x0A18
    fVector3 m_animInitialCorrectPos; // 0x0B94
    uint32_t m_spottedByTeams; // 0x0880
    float m_usePromptSize; // 0x0874
    fVector4 m_animInitialCorrectRot; // 0x0BA0
    fVector3 m_animEntityToRefOffset; // 0x0BB0
    fVector4 m_animEntityToRefRotation; // 0x0BBC
    float m_animBeginTime; // 0x0BCC
    float m_animEndTime; // 0x0BD0
    uint32_t m_animScriptSequence; // 0x0BD4
    uint32_t m_animScriptModel; // 0x0BD8
    uint32_t m_animIgnoreParentRot; // 0x0BDC
    uint32_t m_animMotionMode; // 0x0BE0
    uint32_t m_sequenceTransitionerLayerCount; // 0x0E98
    uint32_t m_sequenceTransitionerLayerActive; // 0x0D60
    uint32_t m_sequenceTransitionerLayerModelIndex; // 0x0D64
    float m_sequenceTransitionerLayerStartCycle; // 0x0D68
    uint32_t 034; // 0x09C0
    uint32_t m_sequenceTransitionerLayerSequence; // 0x0D6C
    float m_sequenceTransitionerLayerPlaybackRate; // 0x0D74
    float m_sequenceTransitionerLayerStartTime; // 0x0D78
    float m_sequenceTransitionerLayerFadeOutDuration; // 0x0D7C
    float m_animStartTime; // 0x0008
    float m_animStartCycle; // 0x000C
    uint32_t 052; // 0x0A08
    uint32_t m_nResetEventsParity; // 0x0F90
    fVector3 008; // 0x01FC
    fVector3 009; // 0x0208
    fVector3 011; // 0x0220
    fVector3 012; // 0x022C
    fVector3 013; // 0x0238
    fVector3 014; // 0x0244
    fVector3 015; // 0x0250
    uint32_t 016; // 0x0978
    uint32_t 017; // 0x097C
    uint32_t 018; // 0x0980
    uint32_t 019; // 0x0984
    uint32_t 020; // 0x0988
    uint32_t 021; // 0x098C
    uint32_t m_instanceNameIndex; // 0x05C4
    uint32_t 022; // 0x0990
    uint32_t 023; // 0x0994
    uint32_t m_cellX; // 0x0034
    uint32_t m_cellY; // 0x0038
    uint32_t m_parentAttachmentModel; // 0x0790
    uint32_t m_cellZ; // 0x003C
    fVector3 m_localOrigin; // 0x0040
    fVector3 m_localAngles; // 0x03CC
    uint32_t m_nModelIndex; // 0x004C
    uint32_t m_fEffects; // 0x0030
    uint32_t m_nRenderMode; // 0x03F1
    uint32_t m_nRenderFX; // 0x03E5
    uint32_t m_forceVisibleInPhaseShift; // 0x06E4
    uint32_t m_clrRender; // 0x0048
    uint32_t m_bRenderWithViewModels; // 0x03E4
    uint32_t 063; // 0x0A34
    uint32_t m_passThroughFlags; // 0x03A8
    float m_passThroughDirection; // 0x03B0
    uint32_t m_contents; // 0x083C
    uint32_t m_hOwnerEntity; // 0x03E0
    uint32_t m_shieldHealth; // 0x0150
    uint32_t m_dissolveEffectEntityHandle; // 0x0858
    uint32_t movetype; // 0x0000
    uint32_t moveparent; // 0x001C
    uint32_t m_parentAttachmentIndex; // 0x0788
    float m_attachmentLerpStartTime; // 0x0764
    float m_attachmentLerpEndTime; // 0x0768
    fVector3 m_attachmentLerpStartAngles; // 0x0778
    uint32_t m_scriptNameIndex; // 0x05C0
    const char* m_holdUsePrompt; // 0x0648
    uint32_t 046; // 0x09F0
    const char* m_pressUsePrompt; // 0x0650
    const char* m_iSignifierName; // 0x04B0
    uint32_t movecollide; // 0x0000
    float m_fadeDist; // 0x0798
    uint32_t m_visibilityFlags; // 0x0398
    uint32_t m_scriptVisible; // 0x039C
    uint32_t m_usableType; // 0x0864
    uint32_t 051; // 0x0A04
    uint32_t m_usablePriority; // 0x0868
    float m_usableFOV; // 0x0870
    uint32_t m_baseTakeDamage; // 0x06E5
    uint32_t m_invulnerableToDamageCount; // 0x06E8
    uint32_t m_shieldHealthMax; // 0x0154
    uint32_t m_highlightIsNetworked; // 0x0198
    uint32_t m_areEntityLinksNetworked; // 0x092F
    uint32_t m_debugBrokenInterpolation; // 0x092C
    uint32_t m_entitiesLinkedFromMeCount; // 0x0930
    uint32_t m_entitiesLinkedToMeCount; // 0x0934
    uint32_t 025; // 0x099C
    uint32_t 026; // 0x09A0
    uint32_t 027; // 0x09A4
    uint32_t 028; // 0x09A8
    uint32_t 029; // 0x09AC
    uint32_t 030; // 0x09B0
    uint32_t 032; // 0x09B8
    uint32_t 033; // 0x09BC
    uint32_t 036; // 0x09C8
    uint32_t 037; // 0x09CC
    uint32_t 038; // 0x09D0
    uint32_t 039; // 0x09D4
    uint32_t 040; // 0x09D8
    uint32_t 041; // 0x09DC
    uint32_t 042; // 0x09E0
    uint32_t 043; // 0x09E4
    uint32_t 044; // 0x09E8
    uint32_t 047; // 0x09F4
    uint32_t 048; // 0x09F8
    uint32_t 049; // 0x09FC
    uint32_t 053; // 0x0A0C
    uint32_t 054; // 0x0A10
    uint32_t 055; // 0x0A14
    uint32_t 057; // 0x0A1C
    uint32_t 058; // 0x0A20
    uint32_t 059; // 0x0A24
    uint32_t 060; // 0x0A28
    uint32_t 062; // 0x0A30
    uint32_t m_highlightServerContextID; // 0x032C
    uint32_t m_highlightTeamBits; // 0x0338
    uint32_t m_PredictableID; // 0x06F4
    fVector3 m_vecMins; // 0x0408
    fVector3 m_vecMaxs; // 0x0414
    uint32_t m_nSolidType; // 0x0424
    uint32_t m_usSolidFlags; // 0x0420
    uint32_t m_nSurroundType; // 0x0436
    uint32_t m_triggerBloat; // 0x0425
    fVector3 m_vecSpecifiedSurroundingMins; // 0x043C
    fVector3 m_vecSpecifiedSurroundingMaxs; // 0x0448
};

class CDynamicPropLightweight {
public:
    uint32_t m_cellX; // 0x0034
    fVector3 m_vecMins; // 0x0408
    uint32_t m_visibilityFlags; // 0x0398
    uint32_t m_parentAttachmentIndex; // 0x0788
    uint32_t moveparent; // 0x001C
    uint32_t m_cellY; // 0x0038
    uint32_t m_parentAttachmentModel; // 0x0790
    uint32_t m_cellZ; // 0x003C
    fVector3 m_localOrigin; // 0x0040
    uint32_t m_parentAttachmentType; // 0x0020
    fVector3 m_localAngles; // 0x03CC
    uint32_t m_nModelIndex; // 0x004C
    uint32_t m_nSkin; // 0x0F80
    uint32_t m_scriptVisible; // 0x039C
    uint32_t m_fEffects; // 0x0030
    float m_fadeDist; // 0x0798
    uint32_t m_CollisionGroup; // 0x0838
    uint32_t m_physDummyMotionEnabled; // 0x092D
    fVector3 m_vecMaxs; // 0x0414
    uint32_t m_nSolidType; // 0x0424
    uint32_t m_usSolidFlags; // 0x0420
    uint32_t m_nSurroundType; // 0x0436
    uint32_t m_triggerBloat; // 0x0425
    fVector3 m_vecSpecifiedSurroundingMins; // 0x043C
    fVector3 m_vecSpecifiedSurroundingMaxs; // 0x0448
};

class CDynamicProp {
public:
    uint32_t m_physDummyMotionEnabled; // 0x092D
    fVector3 003; // 0x01C0
    uint32_t 050; // 0x0A00
    uint32_t m_bUseHitboxesForRenderBox; // 0x1239
    float m_flSkyScaleEndValue; // 0x0CD4
    uint32_t m_bClientSideRagdoll; // 0x0084
    uint32_t m_lifeState; // 0x06C8
    uint32_t m_animModelIndex; // 0x0018
    uint32_t m_iTeamNum; // 0x03A4
    uint32_t m_bPhysicsMotionEnabled; // 0x1230
    fVector3 002; // 0x01B4
    uint32_t m_predictedAnimEventCount; // 0x0CA8
    fVector3 m_attachmentLerpStartOrigin; // 0x076C
    uint32_t m_animSequence; // 0x001C
    uint32_t m_sequenceTransitionerLayerModelIndex; // 0x0D64
    uint32_t m_bSequenceFinished; // 0x1020
    uint32_t 061; // 0x0A2C
    uint32_t m_nForceBone; // 0x0FB8
    fVector3 010; // 0x0214
    uint32_t m_useLockedAnimDeltaYaw; // 0x1021
    uint32_t m_sequenceTransitionerLayerActive; // 0x0D60
    float m_lockedAnimDeltaYaw; // 0x1024
    fVector3 m_animInitialPos; // 0x0B6C
    uint32_t m_bCanUseFastPathFromServer; // 0x1019
    fVector3 m_vecForce; // 0x0088
    fVector3 m_animEntityToRefOffset; // 0x0BB0
    uint32_t 045; // 0x09EC
    uint32_t m_nSkin; // 0x0F80
    fVector3 006; // 0x01E4
    uint32_t m_bossPlayer; // 0x0104
    uint32_t m_nBody; // 0x0F84
    float m_sequenceTransitionerLayerStartTime; // 0x0D78
    float m_flModelScale; // 0x102C
    float m_animPlaybackRate; // 0x0010
    uint32_t m_animActive; // 0x0B64
    uint32_t m_animFrozen; // 0x0014
    uint32_t m_passThroughThickness; // 0x03AC
    uint32_t m_syncingWithEntity; // 0x0C5C
    uint32_t m_nRagdollImpactFXTableId; // 0x0CCC
    float m_usableRadius; // 0x086C
    float m_flSkyScaleStartValue; // 0x0CD0
    float m_flSkyScaleStartTime; // 0x0CD8
    float m_flSkyScaleEndTime; // 0x0CDC
    uint32_t m_nNewSequenceParity; // 0x0020
    uint32_t m_passDamageToParent; // 0x06EC
    float m_flEstIkOffset; // 0x0094
    uint32_t m_animMotionMode; // 0x0BE0
    fVector4 m_animInitialRot; // 0x0B84
    uint32_t m_animCollisionEnabled; // 0x0B67
    uint32_t m_animNetworkFlags; // 0x0B60
    const char* m_iName; // 0x04B9
    fVector3 m_animInitialVel; // 0x0B78
    uint32_t m_predictedAnimEventSequence; // 0x0CB0
    uint32_t m_predictedAnimEventTarget; // 0x0CAC
    fVector3 004; // 0x01CC
    uint32_t m_predictedAnimEventModel; // 0x0CB4
    float m_sequenceTransitionerLayerPlaybackRate; // 0x0D74
    uint32_t m_CollisionGroup; // 0x0838
    float m_predictedAnimEventsReadyToFireTime; // 0x0CB8
    fVector3 000; // 0x019C
    fVector3 001; // 0x01A8
    uint32_t 056; // 0x0A18
    fVector3 m_animInitialCorrectPos; // 0x0B94
    fVector3 005; // 0x01D8
    fVector3 007; // 0x01F0
    uint32_t m_spottedByTeams; // 0x0880
    float m_usePromptSize; // 0x0874
    fVector4 m_animInitialCorrectRot; // 0x0BA0
    fVector4 m_animEntityToRefRotation; // 0x0BBC
    float m_animEndTime; // 0x0BD0
    float m_animBeginTime; // 0x0BCC
    uint32_t m_animScriptSequence; // 0x0BD4
    uint32_t m_animScriptModel; // 0x0BD8
    uint32_t m_animIgnoreParentRot; // 0x0BDC
    uint32_t m_sequenceTransitionerLayerCount; // 0x0E98
    float m_sequenceTransitionerLayerStartCycle; // 0x0D68
    uint32_t 034; // 0x09C0
    uint32_t m_sequenceTransitionerLayerSequence; // 0x0D6C
    float m_sequenceTransitionerLayerFadeOutDuration; // 0x0D7C
    float m_animStartTime; // 0x0008
    float m_animStartCycle; // 0x000C
    uint32_t 052; // 0x0A08
    uint32_t m_nResetEventsParity; // 0x0F90
    fVector3 008; // 0x01FC
    fVector3 009; // 0x0208
    fVector3 011; // 0x0220
    fVector3 012; // 0x022C
    fVector3 013; // 0x0238
    fVector3 014; // 0x0244
    fVector3 015; // 0x0250
    uint32_t 016; // 0x0978
    uint32_t 017; // 0x097C
    uint32_t 018; // 0x0980
    uint32_t 019; // 0x0984
    uint32_t 020; // 0x0988
    uint32_t 021; // 0x098C
    uint32_t m_instanceNameIndex; // 0x05C4
    uint32_t 022; // 0x0990
    uint32_t 023; // 0x0994
    uint32_t m_cellX; // 0x0034
    uint32_t m_cellY; // 0x0038
    uint32_t m_parentAttachmentModel; // 0x0790
    uint32_t m_cellZ; // 0x003C
    fVector3 m_localOrigin; // 0x0040
    fVector3 m_localAngles; // 0x03CC
    uint32_t m_nModelIndex; // 0x004C
    uint32_t m_fEffects; // 0x0030
    uint32_t m_nRenderMode; // 0x03F1
    uint32_t m_nRenderFX; // 0x03E5
    uint32_t m_forceVisibleInPhaseShift; // 0x06E4
    uint32_t m_clrRender; // 0x0048
    uint32_t m_bRenderWithViewModels; // 0x03E4
    uint32_t 063; // 0x0A34
    uint32_t m_passThroughFlags; // 0x03A8
    float m_passThroughDirection; // 0x03B0
    uint32_t m_contents; // 0x083C
    uint32_t m_hOwnerEntity; // 0x03E0
    uint32_t m_shieldHealth; // 0x0150
    uint32_t m_dissolveEffectEntityHandle; // 0x0858
    uint32_t movetype; // 0x0000
    uint32_t moveparent; // 0x001C
    uint32_t m_parentAttachmentIndex; // 0x0788
    float m_attachmentLerpStartTime; // 0x0764
    float m_attachmentLerpEndTime; // 0x0768
    fVector3 m_attachmentLerpStartAngles; // 0x0778
    uint32_t m_scriptNameIndex; // 0x05C0
    const char* m_holdUsePrompt; // 0x0648
    uint32_t 046; // 0x09F0
    const char* m_pressUsePrompt; // 0x0650
    const char* m_iSignifierName; // 0x04B0
    uint32_t movecollide; // 0x0000
    float m_fadeDist; // 0x0798
    uint32_t m_visibilityFlags; // 0x0398
    uint32_t m_scriptVisible; // 0x039C
    uint32_t m_usableType; // 0x0864
    uint32_t 051; // 0x0A04
    uint32_t m_usablePriority; // 0x0868
    float m_usableFOV; // 0x0870
    uint32_t m_baseTakeDamage; // 0x06E5
    uint32_t m_invulnerableToDamageCount; // 0x06E8
    uint32_t m_shieldHealthMax; // 0x0154
    uint32_t m_highlightIsNetworked; // 0x0198
    uint32_t m_areEntityLinksNetworked; // 0x092F
    uint32_t m_networkedFlags; // 0x0350
    uint32_t m_debugBrokenInterpolation; // 0x092C
    uint32_t m_entitiesLinkedFromMeCount; // 0x0930
    uint32_t m_entitiesLinkedToMeCount; // 0x0934
    uint32_t 024; // 0x0998
    uint32_t 025; // 0x099C
    uint32_t 026; // 0x09A0
    uint32_t 027; // 0x09A4
    uint32_t 028; // 0x09A8
    uint32_t 029; // 0x09AC
    uint32_t 030; // 0x09B0
    uint32_t 031; // 0x09B4
    uint32_t 032; // 0x09B8
    uint32_t 033; // 0x09BC
    uint32_t 035; // 0x09C4
    uint32_t 036; // 0x09C8
    uint32_t 037; // 0x09CC
    uint32_t 038; // 0x09D0
    uint32_t 039; // 0x09D4
    uint32_t 040; // 0x09D8
    uint32_t 041; // 0x09DC
    uint32_t 042; // 0x09E0
    uint32_t 043; // 0x09E4
    uint32_t 044; // 0x09E8
    uint32_t 047; // 0x09F4
    uint32_t 048; // 0x09F8
    uint32_t 049; // 0x09FC
    uint32_t 053; // 0x0A0C
    uint32_t 054; // 0x0A10
    uint32_t 055; // 0x0A14
    uint32_t 057; // 0x0A1C
    uint32_t 058; // 0x0A20
    uint32_t 059; // 0x0A24
    uint32_t 060; // 0x0A28
    uint32_t 062; // 0x0A30
    uint32_t m_highlightServerContextID; // 0x032C
    uint32_t m_highlightTeamBits; // 0x0338
    uint32_t m_PredictableID; // 0x06F4
    fVector3 m_vecMins; // 0x0408
    fVector3 m_vecMaxs; // 0x0414
    uint32_t m_nSolidType; // 0x0424
    uint32_t m_usSolidFlags; // 0x0420
    uint32_t m_nSurroundType; // 0x0436
    uint32_t m_triggerBloat; // 0x0425
    fVector3 m_vecSpecifiedSurroundingMins; // 0x043C
    fVector3 m_vecSpecifiedSurroundingMaxs; // 0x0448
};

class CPostProcessController {
public:
    fVector3 004; // 0x01CC
    uint32_t 035; // 0x09C4
    uint32_t m_bMaster; // 0x0B50
    float m_usableRadius; // 0x086C
    uint32_t m_cellX; // 0x0034
    uint32_t m_scriptNameIndex; // 0x05C0
    fVector3 000; // 0x019C
    fVector3 001; // 0x01A8
    uint32_t 051; // 0x0A04
    uint32_t m_usablePriority; // 0x0868
    fVector3 m_attachmentLerpStartOrigin; // 0x076C
    fVector3 002; // 0x01B4
    float m_attachmentLerpStartTime; // 0x0764
    fVector3 003; // 0x01C0
    fVector3 005; // 0x01D8
    uint32_t m_cellY; // 0x0038
    uint32_t m_cellZ; // 0x003C
    uint32_t m_parentAttachmentModel; // 0x0790
    fVector3 m_localOrigin; // 0x0040
    uint32_t m_shieldHealthMax; // 0x0154
    fVector3 m_localAngles; // 0x03CC
    uint32_t m_nModelIndex; // 0x004C
    uint32_t m_fEffects; // 0x0030
    uint32_t m_nRenderMode; // 0x03F1
    const char* m_iName; // 0x04B9
    uint32_t m_nRenderFX; // 0x03E5
    uint32_t m_clrRender; // 0x0048
    uint32_t m_forceVisibleInPhaseShift; // 0x06E4
    uint32_t 063; // 0x0A34
    uint32_t m_passThroughFlags; // 0x03A8
    uint32_t m_bRenderWithViewModels; // 0x03E4
    uint32_t m_iTeamNum; // 0x03A4
    uint32_t m_passThroughThickness; // 0x03AC
    uint32_t m_CollisionGroup; // 0x0838
    float m_passThroughDirection; // 0x03B0
    float m_fadeDist; // 0x0798
    fVector3 m_attachmentLerpStartAngles; // 0x0778
    uint32_t m_contents; // 0x083C
    uint32_t m_hOwnerEntity; // 0x03E0
    uint32_t m_dissolveEffectEntityHandle; // 0x0858
    uint32_t m_shieldHealth; // 0x0150
    uint32_t moveparent; // 0x001C
    uint32_t movetype; // 0x0000
    uint32_t m_visibilityFlags; // 0x0398
    uint32_t m_parentAttachmentIndex; // 0x0788
    float m_attachmentLerpEndTime; // 0x0768
    uint32_t 022; // 0x0990
    uint32_t m_instanceNameIndex; // 0x05C4
    const char* m_holdUsePrompt; // 0x0648
    uint32_t m_debugBrokenInterpolation; // 0x092C
    uint32_t 046; // 0x09F0
    const char* m_pressUsePrompt; // 0x0650
    const char* m_iSignifierName; // 0x04B0
    uint32_t movecollide; // 0x0000
    uint32_t m_scriptVisible; // 0x039C
    fVector3 006; // 0x01E4
    uint32_t m_usableType; // 0x0864
    uint32_t m_bossPlayer; // 0x0104
    uint32_t m_entitiesLinkedFromMeCount; // 0x0930
    float m_usableFOV; // 0x0870
    float m_usePromptSize; // 0x0874
    uint32_t m_spottedByTeams; // 0x0880
    uint32_t m_baseTakeDamage; // 0x06E5
    uint32_t m_invulnerableToDamageCount; // 0x06E8
    uint32_t m_areEntityLinksNetworked; // 0x092F
    uint32_t m_highlightIsNetworked; // 0x0198
    uint32_t m_networkedFlags; // 0x0350
    uint32_t m_entitiesLinkedToMeCount; // 0x0934
    fVector3 007; // 0x01F0
    fVector3 008; // 0x01FC
    fVector3 009; // 0x0208
    fVector3 010; // 0x0214
    fVector3 011; // 0x0220
    fVector3 012; // 0x022C
    fVector3 013; // 0x0238
    fVector3 014; // 0x0244
    fVector3 015; // 0x0250
    uint32_t 016; // 0x0978
    uint32_t 017; // 0x097C
    uint32_t 018; // 0x0980
    uint32_t 019; // 0x0984
    uint32_t 020; // 0x0988
    uint32_t 021; // 0x098C
    uint32_t 023; // 0x0994
    uint32_t 024; // 0x0998
    uint32_t 025; // 0x099C
    uint32_t 026; // 0x09A0
    uint32_t 027; // 0x09A4
    uint32_t 028; // 0x09A8
    uint32_t 029; // 0x09AC
    uint32_t 030; // 0x09B0
    uint32_t 031; // 0x09B4
    uint32_t 032; // 0x09B8
    uint32_t 033; // 0x09BC
    uint32_t 034; // 0x09C0
    uint32_t 036; // 0x09C8
    uint32_t 037; // 0x09CC
    uint32_t 038; // 0x09D0
    uint32_t 039; // 0x09D4
    uint32_t 040; // 0x09D8
    uint32_t 041; // 0x09DC
    uint32_t 042; // 0x09E0
    uint32_t 043; // 0x09E4
    uint32_t 044; // 0x09E8
    uint32_t 045; // 0x09EC
    uint32_t 047; // 0x09F4
    uint32_t 048; // 0x09F8
    uint32_t 049; // 0x09FC
    uint32_t 050; // 0x0A00
    uint32_t 052; // 0x0A08
    uint32_t 053; // 0x0A0C
    uint32_t 054; // 0x0A10
    uint32_t 055; // 0x0A14
    uint32_t 056; // 0x0A18
    uint32_t 057; // 0x0A1C
    uint32_t 058; // 0x0A20
    uint32_t 059; // 0x0A24
    uint32_t 060; // 0x0A28
    uint32_t 061; // 0x0A2C
    uint32_t 062; // 0x0A30
    uint32_t m_highlightServerContextID; // 0x032C
    uint32_t m_highlightTeamBits; // 0x0338
    uint32_t m_PredictableID; // 0x06F4
    fVector3 m_vecMins; // 0x0408
    fVector3 m_vecMaxs; // 0x0414
    uint32_t m_nSolidType; // 0x0424
    uint32_t m_usSolidFlags; // 0x0420
    uint32_t m_nSurroundType; // 0x0436
    uint32_t m_triggerBloat; // 0x0425
    fVector3 m_vecSpecifiedSurroundingMins; // 0x043C
    fVector3 m_vecSpecifiedSurroundingMaxs; // 0x0448
};

class CPointCamera {
public:
    uint32_t m_cellY; // 0x0038
    float m_FOV; // 0x0B98
    uint32_t m_shieldHealthMax; // 0x0154
    fVector3 m_localAngles; // 0x03CC
    fVector3 005; // 0x01D8
    uint32_t m_bFogEnable; // 0x0BC0
    float m_usableRadius; // 0x086C
    uint32_t m_cellX; // 0x0034
    uint32_t 022; // 0x0990
    uint32_t m_instanceNameIndex; // 0x05C4
    uint32_t m_bActive; // 0x0BC1
    uint32_t m_cellZ; // 0x003C
    uint32_t m_parentAttachmentModel; // 0x0790
    fVector3 m_localOrigin; // 0x0040
    uint32_t m_nModelIndex; // 0x004C
    uint32_t m_fEffects; // 0x0030
    uint32_t m_nRenderMode; // 0x03F1
    const char* m_iName; // 0x04B9
    uint32_t m_nRenderFX; // 0x03E5
    uint32_t m_clrRender; // 0x0048
    uint32_t m_forceVisibleInPhaseShift; // 0x06E4
    uint32_t 063; // 0x0A34
    uint32_t m_passThroughFlags; // 0x03A8
    uint32_t m_bRenderWithViewModels; // 0x03E4
    uint32_t m_iTeamNum; // 0x03A4
    uint32_t m_passThroughThickness; // 0x03AC
    uint32_t m_CollisionGroup; // 0x0838
    float m_passThroughDirection; // 0x03B0
    float m_fadeDist; // 0x0798
    fVector3 m_attachmentLerpStartAngles; // 0x0778
    uint32_t m_contents; // 0x083C
    uint32_t m_hOwnerEntity; // 0x03E0
    uint32_t m_dissolveEffectEntityHandle; // 0x0858
    uint32_t m_shieldHealth; // 0x0150
    uint32_t moveparent; // 0x001C
    uint32_t movetype; // 0x0000
    uint32_t m_visibilityFlags; // 0x0398
    uint32_t m_parentAttachmentIndex; // 0x0788
    fVector3 003; // 0x01C0
    float m_attachmentLerpStartTime; // 0x0764
    float m_attachmentLerpEndTime; // 0x0768
    fVector3 002; // 0x01B4
    uint32_t 051; // 0x0A04
    uint32_t m_usablePriority; // 0x0868
    fVector3 m_attachmentLerpStartOrigin; // 0x076C
    fVector3 000; // 0x019C
    uint32_t m_scriptNameIndex; // 0x05C0
    const char* m_holdUsePrompt; // 0x0648
    uint32_t m_debugBrokenInterpolation; // 0x092C
    uint32_t 046; // 0x09F0
    const char* m_pressUsePrompt; // 0x0650
    const char* m_iSignifierName; // 0x04B0
    uint32_t movecollide; // 0x0000
    uint32_t m_scriptVisible; // 0x039C
    uint32_t m_usableType; // 0x0864
    uint32_t m_bossPlayer; // 0x0104
    uint32_t m_entitiesLinkedFromMeCount; // 0x0930
    float m_usableFOV; // 0x0870
    float m_usePromptSize; // 0x0874
    uint32_t m_spottedByTeams; // 0x0880
    uint32_t m_baseTakeDamage; // 0x06E5
    uint32_t m_invulnerableToDamageCount; // 0x06E8
    uint32_t m_areEntityLinksNetworked; // 0x092F
    uint32_t m_highlightIsNetworked; // 0x0198
    uint32_t m_networkedFlags; // 0x0350
    uint32_t m_entitiesLinkedToMeCount; // 0x0934
    fVector3 001; // 0x01A8
    fVector3 004; // 0x01CC
    fVector3 006; // 0x01E4
    fVector3 007; // 0x01F0
    fVector3 008; // 0x01FC
    fVector3 009; // 0x0208
    fVector3 010; // 0x0214
    fVector3 011; // 0x0220
    fVector3 012; // 0x022C
    fVector3 013; // 0x0238
    fVector3 014; // 0x0244
    fVector3 015; // 0x0250
    uint32_t 016; // 0x0978
    uint32_t 017; // 0x097C
    uint32_t 018; // 0x0980
    uint32_t 019; // 0x0984
    uint32_t 020; // 0x0988
    uint32_t 021; // 0x098C
    uint32_t 023; // 0x0994
    uint32_t 024; // 0x0998
    uint32_t 025; // 0x099C
    uint32_t 026; // 0x09A0
    uint32_t 027; // 0x09A4
    uint32_t 028; // 0x09A8
    uint32_t 029; // 0x09AC
    uint32_t 030; // 0x09B0
    uint32_t 031; // 0x09B4
    uint32_t 032; // 0x09B8
    uint32_t 033; // 0x09BC
    uint32_t 034; // 0x09C0
    uint32_t 035; // 0x09C4
    uint32_t 036; // 0x09C8
    uint32_t 037; // 0x09CC
    uint32_t 038; // 0x09D0
    uint32_t 039; // 0x09D4
    uint32_t 040; // 0x09D8
    uint32_t 041; // 0x09DC
    uint32_t 042; // 0x09E0
    uint32_t 043; // 0x09E4
    uint32_t 044; // 0x09E8
    uint32_t 045; // 0x09EC
    uint32_t 047; // 0x09F4
    uint32_t 048; // 0x09F8
    uint32_t 049; // 0x09FC
    uint32_t 050; // 0x0A00
    uint32_t 052; // 0x0A08
    uint32_t 053; // 0x0A0C
    uint32_t 054; // 0x0A10
    uint32_t 055; // 0x0A14
    uint32_t 056; // 0x0A18
    uint32_t 057; // 0x0A1C
    uint32_t 058; // 0x0A20
    uint32_t 059; // 0x0A24
    uint32_t 060; // 0x0A28
    uint32_t 061; // 0x0A2C
    uint32_t 062; // 0x0A30
    uint32_t m_highlightServerContextID; // 0x032C
    uint32_t m_highlightTeamBits; // 0x0338
    uint32_t m_PredictableID; // 0x06F4
    fVector3 m_vecMins; // 0x0408
    fVector3 m_vecMaxs; // 0x0414
    uint32_t m_nSolidType; // 0x0424
    uint32_t m_usSolidFlags; // 0x0420
    uint32_t m_nSurroundType; // 0x0436
    uint32_t m_triggerBloat; // 0x0425
    fVector3 m_vecSpecifiedSurroundingMins; // 0x043C
    fVector3 m_vecSpecifiedSurroundingMaxs; // 0x0448
};

class CPlayerResource {
public:
    uint32_t 053; // 0x0F1C
    uint32_t 000; // 0x13F4
    uint32_t 052; // 0x0F18
    uint32_t 001; // 0x13F8
    uint32_t 051; // 0x0F14
    uint32_t 002; // 0x13FC
    uint32_t 050; // 0x0F10
    uint32_t 003; // 0x1400
    uint32_t 057; // 0x0F2C
    uint32_t 048; // 0x0F08
    uint32_t 004; // 0x1404
    uint32_t 056; // 0x0F28
    uint32_t 049; // 0x0F0C
    uint32_t 005; // 0x1408
    uint32_t 055; // 0x0F24
    uint32_t 006; // 0x140C
    uint32_t 054; // 0x0F20
    uint32_t 007; // 0x1410
    uint32_t 044; // 0x0EF8
    uint32_t 008; // 0x1414
    uint32_t 045; // 0x0EFC
    uint32_t 009; // 0x1418
    uint32_t 061; // 0x0F3C
    uint32_t 010; // 0x141C
    uint32_t 060; // 0x0F38
    uint32_t 011; // 0x1420
    uint32_t 063; // 0x0F44
    uint32_t 012; // 0x1424
    uint32_t 062; // 0x0F40
    uint32_t 013; // 0x1428
    uint32_t 014; // 0x142C
    uint32_t 015; // 0x1430
    uint32_t 016; // 0x1434
    uint32_t 017; // 0x1438
    uint32_t 018; // 0x143C
    uint32_t 019; // 0x1440
    uint32_t 020; // 0x1444
    uint32_t 021; // 0x1448
    uint32_t 022; // 0x144C
    uint32_t 023; // 0x1450
    uint32_t 024; // 0x1454
    uint32_t 025; // 0x1458
    uint32_t 026; // 0x145C
    uint32_t 027; // 0x1460
    uint32_t 028; // 0x1464
    uint32_t 029; // 0x1468
    uint32_t 030; // 0x146C
    uint32_t 031; // 0x1470
    uint32_t 032; // 0x1474
    uint32_t 033; // 0x0ECC
    uint32_t 034; // 0x0ED0
    uint32_t 035; // 0x0ED4
    uint32_t 036; // 0x0ED8
    uint32_t 037; // 0x0EDC
    uint32_t 038; // 0x0EE0
    uint32_t 039; // 0x0EE4
    uint32_t 040; // 0x0EE8
    uint32_t 041; // 0x0EEC
    uint32_t 042; // 0x0EF0
    uint32_t 043; // 0x0EF4
    uint32_t 059; // 0x0F34
    uint32_t 046; // 0x0F00
    uint32_t 058; // 0x0F30
    uint32_t 047; // 0x0F04
    uint32_t 064; // 0x0F48
    uint32_t 065; // 0x0F4C
    uint32_t 066; // 0x0F50
    uint32_t 067; // 0x0F54
    uint32_t 068; // 0x0F58
    uint32_t 069; // 0x0F5C
    uint32_t 070; // 0x0F60
    uint32_t 071; // 0x0F64
    uint32_t 072; // 0x0F68
    uint32_t 073; // 0x0F6C
    uint32_t 074; // 0x0F70
    uint32_t 075; // 0x0F74
    uint32_t 076; // 0x0F78
    uint32_t 077; // 0x0F7C
    uint32_t 078; // 0x0F80
    uint32_t 079; // 0x0F84
    uint32_t 080; // 0x0F88
    uint32_t 081; // 0x0F8C
    uint32_t 082; // 0x0F90
    uint32_t 083; // 0x0F94
    uint32_t 084; // 0x0F98
    uint32_t 085; // 0x0F9C
    uint32_t 086; // 0x0FA0
    uint32_t 087; // 0x0FA4
    uint32_t 088; // 0x0FA8
    uint32_t 089; // 0x0FAC
    uint32_t 090; // 0x0FB0
    uint32_t 091; // 0x0FB4
    uint32_t 092; // 0x0FB8
    uint32_t 093; // 0x0FBC
    uint32_t 094; // 0x0FC0
    uint32_t 095; // 0x0FC4
    uint32_t 096; // 0x0FC8
    uint32_t 097; // 0x0FCC
    uint32_t 098; // 0x0FD0
    uint32_t 099; // 0x0FD4
    uint32_t 100; // 0x0FD8
    uint32_t 101; // 0x0FDC
    uint32_t 102; // 0x0FE0
    uint32_t 103; // 0x0FE4
    uint32_t 104; // 0x0FE8
    uint32_t 105; // 0x0FEC
    uint32_t 106; // 0x0FF0
    uint32_t 107; // 0x0FF4
    uint32_t 108; // 0x0FF8
    uint32_t 109; // 0x0FFC
    uint32_t 110; // 0x1000
    uint32_t 111; // 0x1004
    uint32_t 112; // 0x1008
    uint32_t 113; // 0x100C
    uint32_t 114; // 0x1010
    uint32_t 115; // 0x1014
    uint32_t 116; // 0x1018
    uint32_t 117; // 0x101C
    uint32_t 118; // 0x1020
    uint32_t 119; // 0x1024
    uint32_t 120; // 0x1028
    uint32_t 121; // 0x102C
    uint32_t 122; // 0x1030
    uint32_t 123; // 0x1034
    uint32_t 124; // 0x1038
    uint32_t 125; // 0x103C
    uint32_t 126; // 0x1040
    uint32_t 127; // 0x1044
    uint32_t 128; // 0x1048
    uint32_t 129; // 0x104C
    uint32_t 130; // 0x1050
    uint32_t 131; // 0x1054
    uint32_t 132; // 0x1058
    uint32_t 133; // 0x105C
    uint32_t 134; // 0x1060
    uint32_t 135; // 0x1064
    uint32_t 136; // 0x1068
    uint32_t 137; // 0x106C
    uint32_t 138; // 0x1070
    uint32_t 139; // 0x1074
    uint32_t 140; // 0x1078
    uint32_t 141; // 0x107C
    uint32_t 142; // 0x1080
    uint32_t 143; // 0x1084
    uint32_t 144; // 0x1088
    uint32_t 145; // 0x108C
    uint32_t 146; // 0x1090
    uint32_t 147; // 0x1094
    uint32_t 148; // 0x1098
    uint32_t 149; // 0x109C
    uint32_t 150; // 0x10A0
    uint32_t 151; // 0x10A4
    uint32_t 152; // 0x10A8
    uint32_t 153; // 0x10AC
    uint32_t 154; // 0x10B0
    uint32_t 155; // 0x10B4
    uint32_t 156; // 0x10B8
    uint32_t 157; // 0x10BC
    uint32_t 158; // 0x10C0
    uint32_t 159; // 0x10C4
    uint32_t 160; // 0x10C8
    uint32_t 161; // 0x10CC
    uint32_t 162; // 0x10D0
    uint32_t 163; // 0x10D4
    uint32_t 164; // 0x10D8
    uint32_t 165; // 0x10DC
    uint32_t 166; // 0x10E0
    uint32_t 167; // 0x10E4
    uint32_t 168; // 0x10E8
    uint32_t 169; // 0x10EC
    uint32_t 170; // 0x10F0
    uint32_t 171; // 0x10F4
    uint32_t 172; // 0x10F8
    uint32_t 173; // 0x10FC
    uint32_t 174; // 0x1100
    uint32_t 175; // 0x1104
    uint32_t 176; // 0x1108
    uint32_t 177; // 0x110C
    uint32_t 178; // 0x1110
    uint32_t 179; // 0x1114
    uint32_t 180; // 0x1118
    uint32_t 181; // 0x111C
    uint32_t 182; // 0x1120
    uint32_t 183; // 0x1124
    uint32_t 184; // 0x1128
    uint32_t 185; // 0x112C
    uint32_t 186; // 0x1130
    uint32_t 187; // 0x1134
    uint32_t 188; // 0x1138
    uint32_t 189; // 0x113C
    uint32_t 190; // 0x1140
    uint32_t 191; // 0x1144
    uint32_t 192; // 0x1148
    uint32_t 193; // 0x114C
    uint32_t 194; // 0x1150
    uint32_t 195; // 0x1154
    uint32_t 196; // 0x1158
    uint32_t 197; // 0x115C
};

class CInfoTarget {
public:
    uint32_t 039; // 0x09D4
    uint32_t m_cellX; // 0x0034
    uint32_t m_parentAttachmentIndex; // 0x0788
    uint32_t 023; // 0x0994
    uint32_t moveparent; // 0x001C
    uint32_t 038; // 0x09D0
    uint32_t m_cellY; // 0x0038
    uint32_t m_cellZ; // 0x003C
    uint32_t m_parentAttachmentModel; // 0x0790
    fVector3 m_localOrigin; // 0x0040
    uint32_t m_parentAttachmentType; // 0x0784
    fVector3 m_localAngles; // 0x03CC
    uint32_t m_parentAttachmentHitbox; // 0x078C
    uint32_t 032; // 0x09B8
    uint32_t m_iTeamNum; // 0x03A4
    const char* m_iName; // 0x04B9
    uint32_t 000; // 0x0938
    uint32_t m_scriptNameIndex; // 0x05C0
    uint32_t m_instanceNameIndex; // 0x05C4
    uint32_t 022; // 0x0990
    uint32_t 028; // 0x09A8
    const char* m_iSignifierName; // 0x04B0
    uint32_t 021; // 0x098C
    uint32_t m_areEntityLinksNetworked; // 0x092F
    uint32_t m_hOwnerEntity; // 0x03E0
    uint32_t m_entitiesLinkedFromMeCount; // 0x0930
    uint32_t m_entitiesLinkedToMeCount; // 0x0934
    uint32_t 001; // 0x093C
    uint32_t 002; // 0x0940
    uint32_t 003; // 0x0944
    uint32_t 004; // 0x0948
    uint32_t 005; // 0x094C
    uint32_t 006; // 0x0950
    uint32_t 007; // 0x0954
    uint32_t 044; // 0x09E8
    uint32_t 008; // 0x0958
    uint32_t 009; // 0x095C
    uint32_t 010; // 0x0960
    uint32_t 011; // 0x0964
    uint32_t 012; // 0x0968
    uint32_t 013; // 0x096C
    uint32_t 014; // 0x0970
    uint32_t 015; // 0x0974
    uint32_t 016; // 0x0978
    uint32_t 017; // 0x097C
    uint32_t 018; // 0x0980
    uint32_t 019; // 0x0984
    uint32_t 020; // 0x0988
    uint32_t 024; // 0x0998
    uint32_t 025; // 0x099C
    uint32_t 026; // 0x09A0
    uint32_t 027; // 0x09A4
    uint32_t 029; // 0x09AC
    uint32_t 030; // 0x09B0
    uint32_t 031; // 0x09B4
    uint32_t 033; // 0x09BC
    uint32_t 034; // 0x09C0
    uint32_t 035; // 0x09C4
    uint32_t 036; // 0x09C8
    uint32_t 037; // 0x09CC
    uint32_t 040; // 0x09D8
    uint32_t 041; // 0x09DC
    uint32_t 042; // 0x09E0
    uint32_t 043; // 0x09E4
    uint32_t 045; // 0x09EC
    uint32_t 046; // 0x09F0
    uint32_t 047; // 0x09F4
    uint32_t 048; // 0x09F8
    uint32_t 049; // 0x09FC
    uint32_t 050; // 0x0A00
    uint32_t 051; // 0x0A04
    uint32_t 052; // 0x0A08
    uint32_t 053; // 0x0A0C
    uint32_t 054; // 0x0A10
    uint32_t 055; // 0x0A14
    uint32_t 056; // 0x0A18
    uint32_t 057; // 0x0A1C
    uint32_t 058; // 0x0A20
    uint32_t 059; // 0x0A24
    uint32_t 060; // 0x0A28
    uint32_t 061; // 0x0A2C
    uint32_t 062; // 0x0A30
    uint32_t 063; // 0x0A34
};

class CPlayer {
public:
    uint32_t m_grappleActive; // 0x25F8
    fVector3 m_lungeStartPositionOffset; // 0x3118
    uint32_t m_audio.localBits; // 0x199C
    uint32_t m_lifeState; // 0x06C8
    void* m_posClassModsActive; // 0x0000
    float m_playerAnimLastAimTurnTime; // 0x1A68
    float smoothFollowHeightStartValue; // 0x2804
    int64_t visibilityDefaultFlag; // 0x0888
    uint32_t m_fFlags; // 0x008C
    int64_t m_platformUserId; // 0x2020
    uint32_t m_traversalYawPoseParameter; // 0x2570
    uint32_t m_selectedOffhand; // 0x159C
    uint32_t m_latestPrimaryWeapon; // 0x1574
    uint32_t 030; // 0x09B0
    uint32_t m_classModsActive; // 0x2030
    float m_flDeathTime; // 0x2B4C
    float m_cloakFadeInEndTime; // 0x0180
    float m_flSuitGrapplePower; // 0x18A0
    float m_grappleDetachTime; // 0x25E8
    float m_flSkyScaleEndTime; // 0x0CDC
    uint32_t m_titanSoul; // 0x15D0
    uint32_t m_nModelIndex; // 0x004C
    uint32_t m_posClassModsActive[0]; // 0x20AC
    uint32_t m_hGroundEntity; // 0x038C
    uint32_t 035; // 0x09C4
    uint32_t customState; // 0x08A0
    uint32_t m_passives[ 0 ]; // 0x20EC
    uint32_t m_nSurroundType; // 0x0436
    uint32_t m_sharedEnergyCount; // 0x151C
    uint32_t m_fIsSprinting; // 0x2434
    float m_thirdPersonEntMinYaw; // 0x2C90
    void* m_passives; // 0x0000
    uint32_t m_hConstraintEntity; // 0x2A64
    uint32_t ignoreWorldForFloorTrace; // 0x282D
    uint32_t m_scriptNameIndex; // 0x05C0
    float m_damageImpulseNoDecelEndTime; // 0x2450
    float m_lastUCmdSimulationRemainderTime; // 0x16E8
    uint32_t m_selectedOffhandPendingHybridAction; // 0x15A0
    uint32_t m_playerFlags; // 0x28F4
    float m_sharedEnergyRegenRate; // 0x1528
    uint32_t m_hudInfo_visibilityTestAlwaysPasses; // 0x15A6
    float m_sprintEndedFrac; // 0x2448
    float m_playerAnimMovementPlaybackRate; // 0x1AA8
    uint32_t m_lastUCmdSimulationTicks; // 0x16E4
    uint32_t m_remoteTurret; // 0x2634
    uint32_t m_petTitan; // 0x2BF8
    fVector3 m_StandHullMax; // 0x246C
    float m_traversalYawDelta; // 0x256C
    float m_grappleUsedPower; // 0x25DC
    fVector3 m_vecPunchWeapon_AngleVel; // 0x1CA8
    float m_playerAnimEstimateYaw; // 0x1A70
    uint32_t m_iHealth; // 0x0390
    fVector3 m_audio.localSound[3]; // 0x195C
    uint32_t m_iMaxHealth; // 0x04A8
    uint32_t m_isLungingToPosition; // 0x3108
    float m_boostMeter; // 0x2854
    uint32_t m_nNewSequenceParity; // 0x0020
    fVector3 m_traversalForwardDir; // 0x2534
    uint32_t m_iObserverMode; // 0x2ABC
    fVector3 m_vecPunchBase_AngleVel; // 0x1C90
    uint32_t m_activeZipline; // 0x2764
    float hoverMaxSpeed; // 0x2848
    uint32_t m_hObserverTarget; // 0x2AC0
    uint32_t m_hViewModel; // 0x2638
    uint32_t m_titanSoulBeingRodeoed; // 0x2454
    uint32_t m_entitySyncingWithMe; // 0x2490
    uint32_t m_animNetworkFlags; // 0x0B60
    uint32_t m_ubEFNoInterpParity; // 0x2F80
    uint32_t m_activeBurnCardIndex; // 0x2AC4
    float m_flConstraintWidth; // 0x2A78
    void* m_airMoveBlockPlanes; // 0x1878
    uint32_t m_hColorCorrectionCtrl; // 0x2F84
    uint32_t 057; // 0x0A1C
    uint32_t m_ziplineState; // 0x2774
    void* m_grapplePoints; // 0x2590
    uint32_t m_PlayerFog.m_hCtrl; // 0x2F88
    uint32_t 063; // 0x0A34
    uint32_t m_forcedDialogueOnly; // 0x1A50
    uint32_t m_passThroughFlags; // 0x03A8
    fVector3 m_StandHullMin; // 0x2460
    uint32_t m_bShouldDrawPlayerWhileUsingViewEntity; // 0x2A60
    uint32_t m_ziplineReverse; // 0x2770
    float m_flMaxspeed; // 0x0394
    fVector3 m_mountingZiplineSourceVelocity; // 0x27A0
    uint32_t 024; // 0x0998
    const char* m_title; // 0x30E0
    uint32_t m_useCredit; // 0x28F0
    fVector3 m_upDirPredicted; // 0x24A0
    uint32_t m_hasMic; // 0x28F8
    float m_animBeginTime; // 0x0BCC
    uint32_t m_inPartyChat; // 0x28F9
    float m_skybox3d.fog.halfDistTop; // 0x18FC
    fVector3 003; // 0x01C0
    uint32_t viewOffsetEntityHandle; // 0x2648
    float m_cloakFadeInDuration; // 0x0188
    float m_playerMoveSpeedScale; // 0x28FC
    uint32_t m_iSpawnParity; // 0x2AB4
    float m_skybox3d.fog.halfDistBot; // 0x18F8
    uint32_t m_wallHanging; // 0x2588
    uint32_t attackActive; // 0x28D0
    fVector3 m_upDir; // 0x2494
    float m_traversalMidFrac; // 0x2530
    float m_lastDodgeTime; // 0x2B80
    uint32_t m_traversalType; // 0x2508
    float m_nextTitanRespawnAvailable; // 0x2C3C
    uint32_t 021; // 0x098C
    float m_lungeMaxEndSpeed; // 0x3148
    float m_sprintEndedTime; // 0x2444
    uint32_t m_viewConeParented; // 0x28BE
    uint32_t m_traversalState; // 0x2504
    uint32_t m_playerAnimLanding; // 0x1A98
    fVector3 m_animEntityToRefOffset; // 0x0BB0
    fVector3 m_traversalRefPos; // 0x2540
    float m_airAcceleration; // 0x2BCC
    uint32_t m_grappleHook; // 0x2BF4
    uint32_t m_autoSprintForced; // 0x2430
    float defaultFloorHeight; // 0x2828
    float m_lungeMaxTime; // 0x3144
    float m_sprintStartedTime; // 0x243C
    fVector3 m_grapplePoints[0]; // 0x25A4
    uint32_t m_sprintFracPoseParameter; // 0x2620
    float m_sprintStartedFrac; // 0x2440
    float m_stickySprintStartTime; // 0x244C
    float m_meleePressTime; // 0x1A1C
    uint32_t m_objectiveEntity; // 0x1A44
    uint32_t m_animModelIndex; // 0x0018
    float m_flEstIkOffset; // 0x0094
    float m_smartAmmoPreviousHighestLockOnMeFractionValue; // 0x31A8
    uint32_t m_cellZ; // 0x003C
    uint32_t m_parentAttachmentModel; // 0x0790
    uint32_t m_duckState; // 0x245C
    fVector3 m_DuckHullMin; // 0x2478
    float m_cloakEndTime; // 0x017C
    uint32_t m_fEffects; // 0x0030
    float m_lungeStartTime; // 0x3130
    fVector3 m_DuckHullMax; // 0x2484
    uint32_t m_skybox3d.fog.distColor; // 0x1918
    float m_thirdPersonEntBlendEaseOutDuration; // 0x2C80
    uint32_t m_xp; // 0x2C20
    uint32_t m_happyHourActive; // 0x1FAD
    uint32_t m_generation; // 0x2C28
    uint32_t m_rank; // 0x2C2C
    float minPitch; // 0x27DC
    uint32_t m_serverForceIncreasePlayerListGenerationParity; // 0x2C30
    uint32_t m_isPlayingRanked; // 0x2C34
    float m_skill_mu; // 0x2C38
    uint32_t m_viewConeActive; // 0x28BD
    uint32_t m_hasBadReputation; // 0x1FAC
    const char* m_communityName; // 0x1FAF
    const char* m_communityClanTag; // 0x1FEF
    float m_vecVelocity[2]; // 0x03C8
    float m_thirdPersonEntMinPitch; // 0x2C98
    uint32_t animViewEntityHandle; // 0x2680
    const char* m_factionName; // 0x1FFF
    float m_flStepSize; // 0x18A8
    const char* m_hardwareIcon; // 0x200F
    uint32_t m_gestureAutoKillBitfield; // 0x23EC
    uint32_t m_playerAnimFirstJumpFrame; // 0x1A80
    uint32_t m_pilotClassIndex; // 0x3BC4
    fVector3 m_lungeEndPositionOffset; // 0x3124
    fVector3 m_vecAbsOrigin; // 0x0004
    uint32_t isLocalOriginLocal; // 0x0010
    float m_sequenceTransitionerLayerStartCycle; // 0x0D68
    uint32_t m_isPerformingBoostAction; // 0x2866
    uint32_t m_ziplineValid3pWeaponLayerAnim; // 0x2771
    float m_skybox3d.fog.HDRColorScale; // 0x1914
    uint32_t m_playerScriptNetDataGlobal; // 0x3D50
    uint32_t m_bZooming; // 0x1698
    uint32_t m_zoomToggleOn; // 0x1699
    float m_zoomBaseFrac; // 0x169C
    float m_zoomBaseTime; // 0x16A0
    float smoothMaxPitchStartValue; // 0x281C
    uint32_t forceDefaultFloorHeight; // 0x2824
    uint32_t m_voicePackIndex; // 0x1A60
    float m_zoomFullStartTime; // 0x16A4
    uint32_t m_camoIndex; // 0x0F88
    fVector3 m_vecConstraintCenter; // 0x2A68
    uint32_t m_decalIndex; // 0x0F8C
    uint32_t m_nPlayerCond; // 0x3B90
    float m_traversalAnimProgress; // 0x1AD4
    uint32_t m_hovering; // 0x2864
    float m_flHullHeight; // 0x1AC4
    uint32_t movecollide; // 0x0000
    float m_sprintTiltFrac; // 0x1AD8
    float m_flModelScale; // 0x102C
    float m_angEyeAngles[0]; // 0x1AC8
    uint32_t m_oneHandedWeaponUsage; // 0x1A28
    fVector3 m_attachmentLerpStartAngles; // 0x0778
    float m_angEyeAngles[1]; // 0x1ACC
    float animViewEntityAngleLerpInDuration; // 0x2684
    float animViewEntityOriginLerpInDuration; // 0x2688
    float hoverAcceleration; // 0x2844
    float animViewEntityLerpOutDuration; // 0x268C
    uint32_t 048; // 0x09F8
    uint32_t animViewEntityStabilizePlayerEyeAngles; // 0x2690
    fVector3 m_localAngles; // 0x03CC
    uint32_t animViewEntityThirdPersonCameraParity; // 0x2694
    float attackHitEntityTime; // 0x28DC
    uint32_t animViewEntityNumThirdPersonCameraAttachments; // 0x26B0
    uint32_t m_passDamageToParent; // 0x06EC
    uint32_t animViewEntityThirdPersonCameraVisibilityChecks; // 0x26B4
    float m_phaseShiftTimeStart; // 0x15E4
    uint32_t animViewEntityParity; // 0x26B8
    float m_thirdPersonEntSpringToCenterRate; // 0x2CA0
    fVector3 000; // 0x019C
    fVector3 001; // 0x01A8
    float m_vecVelocity[0]; // 0x03C0
    fVector3 m_audio.localSound[2]; // 0x1950
    fVector3 002; // 0x01B4
    fVector3 004; // 0x01CC
    uint32_t m_bConstraintPastRadius; // 0x2A80
    fVector3 005; // 0x01D8
    float lerpInDuration; // 0x264C
    float lerpOutDuration; // 0x2650
    uint32_t stabilizePlayerEyeAngles; // 0x2654
    uint32_t currentClass; // 0x1E60
    fVector3 m_localOrigin; // 0x0040
    uint32_t canRodeo; // 0x1EC4
    fVector3 m_lungeTargetPosition; // 0x310C
    float m_localOrigin[2]; // 0x000C
    uint32_t m_cellX; // 0x0034
    uint32_t m_cellY; // 0x0038
    uint32_t m_playerAnimJumpActivity; // 0x1A88
    uint32_t seComboVars; // 0x21F8
    float seTimeEnd; // 0x21FC
    float seEaseOut; // 0x2200
    fVector3 m_grappleVel; // 0x2598
    uint32_t m_lungeCanFly; // 0x3138
    uint32_t m_grapplePointCount; // 0x25D4
    float m_thirdPersonEntMaxYaw; // 0x2C94
    uint32_t m_grappleAttached; // 0x25D8
    uint32_t m_grapplePulling; // 0x25D9
    uint32_t stage; // 0x1EC0
    uint32_t m_grappleRetracting; // 0x25DA
    float m_flSkyScaleStartTime; // 0x0CD8
    float m_ejectStartTime; // 0x1A30
    float m_titanBuildTime; // 0x1A54
    uint32_t m_grappleForcedRetracting; // 0x25DB
    float m_grapplePullTime; // 0x25E0
    float m_prevMoveYaw; // 0x2614
    float m_grappleAttachTime; // 0x25E4
    uint32_t m_grappleMeleeTarget; // 0x25EC
    uint32_t m_grappleHasGoodVelocity; // 0x25F0
    fVector3 m_traversalBlendOutStartOffset; // 0x2560
    float m_flSkyScaleStartValue; // 0x0CD0
    float m_usableRadius; // 0x086C
    float m_grappleLastGoodVelocityTime; // 0x25F4
    uint32_t attackRecoveryShouldBeQuick; // 0x28D1
    uint32_t m_skybox3d.fog.dirColor; // 0x191C
    float attackStartTime; // 0x28D4
    uint32_t attackHitEntity; // 0x28D8
    fVector3 m_skybox3d.fog.direction; // 0x1920
    uint32_t m_trackedChildProjectileCount; // 0x1A24
    float attackLastHitNonWorldEntity; // 0x28E0
    uint32_t scriptedState; // 0x28E4
    uint32_t pendingMeleePress; // 0x28E8
    uint32_t m_lungeLockPitch; // 0x3139
    uint32_t m_thirdPersonEntDrawViewmodel; // 0x2C74
    uint32_t rodeoCountParity; // 0x1EC8
    uint32_t m_bCanUseFastPathFromServer; // 0x1019
    float startTime; // 0x1ECC
    float endTime; // 0x1ED0
    uint32_t targetEnt; // 0x1ED4
    uint32_t prevEnt; // 0x1ED8
    float prevEntCooldown; // 0x1EDC
    float m_animNearZ; // 0x19BC
    uint32_t pilot1pSequenceIndex; // 0x1EE0
    uint32_t pilot3pSequenceIndex; // 0x1EE4
    uint32_t m_wallDangleForceFallOff; // 0x257D
    uint32_t targetAttachmentIndex; // 0x1EE8
    float m_raiseFromMeleeEndTime; // 0x1518
    uint32_t activeWeapon; // 0x1588
    uint32_t deadflag; // 0x1E98
    uint32_t requestedClass; // 0x1E64
    uint32_t onDeathClass; // 0x1E68
    uint32_t m_usableType; // 0x0864
    float m_flFriction; // 0x03D8
    fVector3 006; // 0x01E4
    uint32_t m_nNextThinkTick; // 0x04A4
    float m_playerAnimGoalFeetYaw; // 0x1A74
    float m_vecVelocity[1]; // 0x03C4
    uint32_t m_spottedByTeams; // 0x0880
    float smoothDuration; // 0x27F0
    fVector4 m_animInitialCorrectRot; // 0x0BA0
    float m_usePromptSize; // 0x0874
    fVector3 m_vecBaseVelocity; // 0x0380
    float followDistance; // 0x27E4
    float m_wallRunStartTime; // 0x2B64
    uint32_t m_animFrozen; // 0x0014
    float m_wallRunClearTime; // 0x2B68
    fVector3 m_lastWallRunStartPos; // 0x24AC
    uint32_t m_dodging; // 0x2B7C
    float m_useLastZiplineCooldown; // 0x276C
    uint32_t m_dodgingInAir; // 0x2BAD
    uint32_t 029; // 0x09AC
    fVector3 m_traversalBegin; // 0x250C
    fVector3 m_observerModeStaticAngles; // 0x2AD8
    fVector3 m_traversalMid; // 0x2518
    uint32_t m_highlightTeamBits; // 0x0338
    fVector3 m_ziplineUsePosition; // 0x27C4
    fVector3 m_traversalEnd; // 0x2524
    float m_traversalStartTime; // 0x2550
    float m_traversalProgress; // 0x254C
    uint32_t lastAttacker; // 0x19C0
    float m_traversalHandAppearTime; // 0x2554
    float m_traversalReleaseTime; // 0x2558
    fVector3 m_attachmentLerpStartOrigin; // 0x076C
    float m_traversalBlendOutStartTime; // 0x255C
    uint32_t m_animSequence; // 0x001C
    uint32_t 018; // 0x0980
    float m_wallDangleJumpOffTime; // 0x2578
    uint32_t m_wallDangleMayHangHere; // 0x257C
    float m_lastSharedEnergyRegenTime; // 0x1524
    uint32_t m_wallDangleLastPushedForward; // 0x257E
    uint32_t m_wallDangleDisableWeapon; // 0x2580
    uint32_t m_animActive; // 0x0B64
    float m_sprintTiltVel; // 0x2618
    uint32_t m_sprintTiltPoseParameter; // 0x261C
    uint32_t m_sliding; // 0x2600
    float m_queuedGrappleMeleeTime; // 0x1A14
    uint32_t m_slideLongJumpAllowed; // 0x2601
    uint32_t m_lastZipline; // 0x2768
    uint32_t m_highSpeedViewmodelAnims; // 0x2850
    float m_flConstraintRadius; // 0x2A74
    float m_flConstraintSpeedFactor; // 0x2A7C
    uint32_t 053; // 0x0A0C
    float m_flLaggedMovementValue; // 0x2E9C
    float m_thirdPersonEntFixedYaw; // 0x2C88
    fVector3 m_playerAnimLastWallRunNormal; // 0x1A8C
    uint32_t m_numRodeoSlots; // 0x0024
    float m_lastMoveInputTime; // 0x2EA0
    uint32_t m_hTonemapController; // 0x1E50
    int64_t visibilityShowFlag; // 0x0890
    uint32_t m_viewConeParity; // 0x28C0
    fVector3 m_meleeExecutionUnstuckPosition; // 0x15D4
    float m_viewConeLerpTime; // 0x2D18
    uint32_t m_firstPersonProxy; // 0x2BEC
    uint32_t 054; // 0x0A10
    uint32_t m_predictedFirstPersonProxy; // 0x2BF0
    float m_thirdPersonEntViewOffset[2]; // 0x2C6C
    float m_thirdPersonEntFixedDist; // 0x2C8C
    uint32_t m_petTitanMode; // 0x2C50
    fVector3 angles; // 0x3BDC
    fVector3 011; // 0x0220
    uint32_t m_hardpointEntity; // 0x2C00
    uint32_t m_hThirdPersonEnt; // 0x2C58
    float m_flStepSoundTime; // 0x241C
    uint32_t cameraEnabled; // 0x27D9
    float m_accelScale; // 0x18C0
    float m_flStepSoundReduceTime; // 0x2420
    float m_airSpeed; // 0x2BC8
    fVector3 m_observerModeStaticPosition; // 0x2ACC
    uint32_t ignoreWorldForMovement; // 0x282C
    uint32_t m_lungeTargetEntity; // 0x3104
    float m_lungeEndTime; // 0x3134
    float m_lungeStartPitch; // 0x313C
    fVector3 m_audio.localSound[1]; // 0x1944
    float m_lungeSmoothTime; // 0x3140
    uint32_t m_scriptVisible; // 0x039C
    fVector3 m_viewConeAngleMax; // 0x1C6C
    uint32_t m_boosting; // 0x2851
    fVector3 m_vecAbsVelocity; // 0x0120
    uint32_t m_repeatedBoost; // 0x2852
    uint32_t m_jetpack; // 0x2858
    float m_playerAnimUpdateTime; // 0x1A64
    uint32_t m_gliding; // 0x2859
    uint32_t m_animIgnoreParentRot; // 0x0BDC
    uint32_t m_hSkyCamera; // 0x18E0
    uint32_t m_playerAnimShouldLand; // 0x1A99
    float m_glideMeter; // 0x285C
    float m_glideRechargeDelayAccumulator; // 0x2860
    float m_passThroughDirection; // 0x03B0
    uint32_t m_climbing; // 0x2865
    float m_lastJumpHeight; // 0x2868
    uint32_t m_numPingsUsed; // 0x286C
    uint32_t m_numPingsAvailable; // 0x2870
    float m_lastPingTime; // 0x2874
    float m_pingGroupStartTime; // 0x2878
    uint32_t m_pingGroupAccumulator; // 0x287C
    uint32_t m_nearbyPusherCount; // 0x3D1C
    uint32_t flags; // 0x0898
    fVector3 m_pushAwayFromTopAcceleration; // 0x3D44
    float m_ziplineEndTime; // 0x2790
    float m_wallrunFrictionScale; // 0x24C4
    uint32_t ent; // 0x3BCC
    float m_groundFrictionScale; // 0x24C8
    uint32_t m_playerScriptNetDataExclusive; // 0x3D54
    fVector3 origin; // 0x3BD0
    float m_thirdPersonEntViewOffset[0]; // 0x2C64
    float m_thirdPersonEntViewOffset[1]; // 0x2C68
    float jumpAcceleration; // 0x283C
    float m_playerAnimCurrentFeetYaw; // 0x1A6C
    uint32_t 043; // 0x09E4
    float m_thirdPersonEntBlendEaseInDuration; // 0x2C7C
    uint32_t 044; // 0x09E8
    float m_thirdPersonEntBlendTotalDuration; // 0x2C78
    uint32_t m_thirdPersonEntPitchIsFreelook; // 0x2C70
    uint32_t m_playerAnimJumping; // 0x1A78
    float m_skybox3d.fog.distColorStr; // 0x1900
    uint32_t m_thirdPersonEntYawIsFreelook; // 0x2C71
    uint32_t m_thirdPersonEntUseFixedDist; // 0x2C72
    uint32_t m_thirdPersonEntPushedInByGeo; // 0x2C73
    uint32_t 056; // 0x0A18
    fVector3 m_animInitialCorrectPos; // 0x0B94
    float m_thirdPersonEntFixedPitch; // 0x2C84
    float m_thirdPersonEntMaxPitch; // 0x2C9C
    float jumpMaxSpeed; // 0x2840
    float m_thirdPersonEntLookaheadLowerEntSpeed; // 0x2CA4
    float m_thirdPersonEntLookaheadUpperEntSpeed; // 0x2CA8
    float m_sequenceTransitionerLayerFadeOutDuration; // 0x0D7C
    uint32_t m_iHideHUD; // 0x1888
    float m_thirdPersonEntLookaheadMaxAngle; // 0x2CAC
    float m_thirdPersonEntLookaheadLerpAheadRate; // 0x2CB0
    float m_thirdPersonEntLookaheadLerpToCenterRate; // 0x2CB4
    fVector3 m_viewConeAngleMin; // 0x1C60
    fVector3 m_stepSmoothingOffset; // 0x1C78
    float m_flSkyScaleEndValue; // 0x0CD4
    fVector3 m_vecPunchBase_Angle; // 0x1C84
    fVector3 m_vecPunchWeapon_Angle; // 0x1C9C
    uint32_t m_networkedFlags; // 0x0350
    uint32_t diving; // 0x27D8
    float maxPitch; // 0x27E0
    float followHeight; // 0x27E8
    uint32_t shootFromPlayer; // 0x27EC
    uint32_t m_cinematicEventFlags; // 0x1A4C
    float smoothFollowDistanceStartTime; // 0x27F4
    float smoothFollowDistanceStartValue; // 0x27F8
    float smoothFollowDistanceEndValue; // 0x27FC
    float smoothFollowHeightStartTime; // 0x2800
    float smoothFollowHeightEndValue; // 0x2808
    float smoothMinPitchStartTime; // 0x280C
    float smoothMinPitchStartValue; // 0x2810
    uint32_t 040; // 0x09D8
    float smoothMinPitchEndValue; // 0x2814
    float smoothMaxPitchStartTime; // 0x2818
    float smoothMaxPitchEndValue; // 0x2820
    float moveGridSizeScale; // 0x2830
    float moveFloorHeightOffset; // 0x2834
    uint32_t jumpIsDodge; // 0x2838
    uint32_t m_ziplineReenableWeapons; // 0x2780
    uint32_t m_nRagdollImpactFXTableId; // 0x0CCC
    float m_animPlaybackRate; // 0x0010
    float m_mountingZiplineDuration; // 0x2784
    float m_mountingZiplineAlpha; // 0x2788
    uint32_t m_predictedAnimEventTarget; // 0x0CAC
    float m_ziplineStartTime; // 0x278C
    fVector3 m_mountingZiplineSourcePosition; // 0x2794
    fVector3 m_mountingZiplineTargetPosition; // 0x27AC
    fVector3 pos; // 0x1674
    float health; // 0x1680
    float m_cloakFlickerEndTime; // 0x0190
    uint32_t m_nSkin; // 0x0F80
    uint32_t 045; // 0x09EC
    uint32_t m_forceStance; // 0x18B8
    uint32_t m_nDuckTransitionTimeMsecs; // 0x188C
    uint32_t m_superJumpsUsed; // 0x1890
    uint32_t m_jumpedOffRodeo; // 0x1894
    uint32_t m_duckToggleOn; // 0x18BC
    float m_flSuitPower; // 0x1898
    uint32_t m_predictedAnimEventSequence; // 0x0CB0
    float m_flSuitJumpPower; // 0x189C
    float m_flFallVelocity; // 0x18A4
    uint32_t predictableFlags; // 0x18B0
    float m_powerRegenRateScale; // 0x18C4
    float m_dodgePowerDelayScale; // 0x18C8
    float m_titanBubbleShieldTime; // 0x1A58
    uint32_t m_bDrawViewmodel; // 0x18BD
    uint32_t m_bAllowAutoMovement; // 0x18BE
    float m_airSlowMoFrac; // 0x18AC
    uint32_t m_bitsActiveDevices; // 0x18B4
    uint32_t m_skybox3d.scale; // 0x18E4
    uint32_t m_skybox3d.cellNum; // 0x18E8
    uint32_t m_skybox3d.useWorldFog; // 0x18EC
    uint32_t m_skybox3d.fog.enable; // 0x1931
    float m_sharedEnergyRegenDelay; // 0x152C
    float m_skybox3d.fog.botAlt; // 0x18F0
    float m_skybox3d.fog.topAlt; // 0x18F4
    float m_skybox3d.fog.distOffset; // 0x1908
    float m_animStartCycle; // 0x000C
    float m_skybox3d.fog.densityScale; // 0x190C
    uint32_t m_airMoveBlockPlaneCount; // 0x1A0C
    uint32_t m_selectedWeapon; // 0x1570
    float m_skybox3d.fog.halfAngleDeg; // 0x1910
    uint32_t m_animCollisionEnabled; // 0x0B67
    float m_skybox3d.fog.dirColorStr; // 0x1904
    fVector3 m_audio.localSound[0]; // 0x1938
    fVector3 m_audio.localSound[4]; // 0x1968
    fVector3 m_audio.localSound[5]; // 0x1974
    float m_hotDropImpactTime; // 0x1A38
    fVector3 m_audio.localSound[6]; // 0x1980
    fVector3 m_audio.localSound[7]; // 0x198C
    fVector3 m_vecMaxs; // 0x0414
    uint32_t m_audio.soundscapeIndex; // 0x1998
    fVector3 010; // 0x0214
    uint32_t m_audio.entIndex; // 0x19A0
    uint32_t m_useLockedAnimDeltaYaw; // 0x1021
    fVector3 m_airMoveBlockPlanes[0]; // 0x19F0
    float m_airMoveBlockPlaneTime; // 0x1A08
    float m_queuedMeleePressTime; // 0x1A10
    uint32_t m_disableMeleeUntilRelease; // 0x1A19
    uint32_t m_objectiveIndex; // 0x1A40
    uint32_t m_usablePriority; // 0x0868
    uint32_t m_meleeDisabledCounter; // 0x1A20
    uint32_t m_entitiesLinkedToMeCount; // 0x0934
    uint32_t attackedCount; // 0x19C4
    float m_flCockpitEntryTime; // 0x1A2C
    float m_disembarkStartTime; // 0x1A34
    fVector3 m_vecForce; // 0x0088
    float m_outOfBoundsDeadTime; // 0x1A3C
    float m_objectiveEndTime; // 0x1A48
    uint32_t m_titanEmbarkEnabled; // 0x1A5C
    uint32_t m_titanDisembarkEnabled; // 0x1A5D
    float m_playerAnimJumpStartTime; // 0x1A7C
    fVector3 013; // 0x0238
    uint32_t m_playerAnimDodging; // 0x1A81
    fVector3 007; // 0x01F0
    float m_playerLandStartTime; // 0x1A84
    float m_playerAnimLandStartTime; // 0x1A9C
    fVector4 m_animEntityToRefRotation; // 0x0BBC
    uint32_t m_playerAnimInAirWalk; // 0x1AA0
    float m_playerAnimPrevFrameSequenceMotionYaw; // 0x1AA4
    uint32_t m_latestNonOffhandWeapon; // 0x1578
    uint32_t m_lastCycleSlot; // 0x157C
    uint32_t 061; // 0x0A2C
    uint32_t m_nForceBone; // 0x0FB8
    uint32_t m_weaponGettingSwitchedOut; // 0x0008
    uint32_t m_showNewWeapon3p; // 0x000C
    uint32_t m_contextAction; // 0x15B4
    uint32_t m_weaponPermission; // 0x1580
    fVector3 m_animInitialPos; // 0x0B6C
    uint32_t m_weaponDisabled; // 0x15A5
    uint32_t m_nameVisibilityFlags; // 0x08A8
    float m_lastFiredTime; // 0x1514
    uint32_t m_sharedEnergyTotal; // 0x1520
    float m_lastSharedEnergyTakeTime; // 0x1530
    float m_phaseShiftTimeEnd; // 0x15E8
    fVector3 009; // 0x0208
    float m_cloakFadeOutStartTime; // 0x0184
    float m_cloakFlickerAmount; // 0x018C
    fVector3 m_deathVelocity; // 0x03B4
    float m_vecViewOffset[0]; // 0x0024
    float m_vecViewOffset[1]; // 0x0028
    float m_vecViewOffset[2]; // 0x002C
    float m_sequenceTransitionerLayerPlaybackRate; // 0x0D74
    const char* m_targetInfoIconName; // 0x1634
    uint32_t zOrder; // 0x089C
    float objectScale; // 0x08A4
    float m_flNextAttack; // 0x1510
    uint32_t m_AnimOverlayCount; // 0x12F8
    uint32_t m_bSequenceFinished; // 0x1020
    float m_lockedAnimDeltaYaw; // 0x1024
    uint32_t m_nBody; // 0x0F84
    uint32_t m_bClientSideRagdoll; // 0x0084
    uint32_t m_passThroughThickness; // 0x03AC
    uint32_t m_syncingWithEntity; // 0x0C5C
    uint32_t m_predictedAnimEventCount; // 0x0CA8
    uint32_t m_predictedAnimEventModel; // 0x0CB4
    float m_predictedAnimEventsReadyToFireTime; // 0x0CB8
    fVector3 m_animInitialVel; // 0x0B78
    fVector4 m_animInitialRot; // 0x0B84
    float m_animEndTime; // 0x0BD0
    uint32_t m_animScriptSequence; // 0x0BD4
    uint32_t m_animScriptModel; // 0x0BD8
    uint32_t m_animMotionMode; // 0x0BE0
    uint32_t m_sequenceTransitionerLayerCount; // 0x0E98
    uint32_t m_sequenceTransitionerLayerActive; // 0x0D60
    uint32_t m_sequenceTransitionerLayerModelIndex; // 0x0D64
    uint32_t m_sequenceTransitionerLayerSequence; // 0x0D6C
    float m_sequenceTransitionerLayerStartTime; // 0x0D78
    float m_animStartTime; // 0x0008
    uint32_t 052; // 0x0A08
    uint32_t m_nResetEventsParity; // 0x0F90
    fVector3 008; // 0x01FC
    fVector3 012; // 0x022C
    fVector3 014; // 0x0244
    fVector3 015; // 0x0250
    uint32_t 016; // 0x0978
    uint32_t 017; // 0x097C
    uint32_t 019; // 0x0984
    uint32_t 020; // 0x0988
    uint32_t 022; // 0x0990
    uint32_t 023; // 0x0994
    uint32_t m_nRenderMode; // 0x03F1
    uint32_t m_nRenderFX; // 0x03E5
    uint32_t m_forceVisibleInPhaseShift; // 0x06E4
    uint32_t m_clrRender; // 0x0048
    uint32_t m_bRenderWithViewModels; // 0x03E4
    uint32_t m_iTeamNum; // 0x03A4
    uint32_t m_CollisionGroup; // 0x0838
    uint32_t m_contents; // 0x083C
    uint32_t m_hOwnerEntity; // 0x03E0
    uint32_t m_shieldHealth; // 0x0150
    uint32_t m_dissolveEffectEntityHandle; // 0x0858
    uint32_t moveparent; // 0x001C
    uint32_t m_parentAttachmentIndex; // 0x0788
    float m_attachmentLerpStartTime; // 0x0764
    float m_attachmentLerpEndTime; // 0x0768
    const char* m_iName; // 0x04B9
    uint32_t m_instanceNameIndex; // 0x05C4
    const char* m_holdUsePrompt; // 0x0648
    const char* m_pressUsePrompt; // 0x0650
    const char* m_iSignifierName; // 0x04B0
    uint32_t movetype; // 0x0000
    float m_fadeDist; // 0x0798
    uint32_t m_visibilityFlags; // 0x0398
    uint32_t m_bossPlayer; // 0x0104
    float m_usableFOV; // 0x0870
    uint32_t m_baseTakeDamage; // 0x06E5
    uint32_t m_invulnerableToDamageCount; // 0x06E8
    uint32_t m_shieldHealthMax; // 0x0154
    uint32_t m_highlightIsNetworked; // 0x0198
    uint32_t m_areEntityLinksNetworked; // 0x092F
    uint32_t m_debugBrokenInterpolation; // 0x092C
    uint32_t m_entitiesLinkedFromMeCount; // 0x0930
    uint32_t 025; // 0x099C
    uint32_t 026; // 0x09A0
    uint32_t 027; // 0x09A4
    uint32_t 028; // 0x09A8
    uint32_t 031; // 0x09B4
    uint32_t 032; // 0x09B8
    uint32_t 033; // 0x09BC
    uint32_t 034; // 0x09C0
    uint32_t 036; // 0x09C8
    uint32_t 037; // 0x09CC
    uint32_t 038; // 0x09D0
    uint32_t 039; // 0x09D4
    uint32_t 041; // 0x09DC
    uint32_t 042; // 0x09E0
    uint32_t 046; // 0x09F0
    uint32_t 047; // 0x09F4
    uint32_t 049; // 0x09FC
    uint32_t 050; // 0x0A00
    uint32_t 051; // 0x0A04
    uint32_t 055; // 0x0A14
    uint32_t 058; // 0x0A20
    uint32_t 059; // 0x0A24
    uint32_t 060; // 0x0A28
    uint32_t 062; // 0x0A30
    uint32_t m_highlightServerContextID; // 0x032C
    uint32_t m_PredictableID; // 0x06F4
    fVector3 m_vecMins; // 0x0408
    uint32_t m_nSolidType; // 0x0424
    uint32_t m_usSolidFlags; // 0x0420
    uint32_t m_triggerBloat; // 0x0425
    fVector3 m_vecSpecifiedSurroundingMins; // 0x043C
    fVector3 m_vecSpecifiedSurroundingMaxs; // 0x0448
};

class CPhysicsProp {
public:
    fVector3 m_animEntityToRefOffset; // 0x0BB0
    uint32_t 045; // 0x09EC
    uint32_t m_nSkin; // 0x0F80
    fVector3 m_collisionMaxs; // 0x1270
    uint32_t m_bAwake; // 0x1240
    uint32_t m_spottedByTeams; // 0x0880
    float m_usePromptSize; // 0x0874
    fVector4 m_animInitialCorrectRot; // 0x0BA0
    uint32_t m_spawnflags; // 0x0744
    float m_flSkyScaleEndTime; // 0x0CDC
    uint32_t m_iPhysicsMode; // 0x125C
    fVector3 002; // 0x01B4
    uint32_t m_predictedAnimEventCount; // 0x0CA8
    fVector3 m_attachmentLerpStartOrigin; // 0x076C
    uint32_t m_animSequence; // 0x001C
    float m_fMass; // 0x1260
    fVector3 007; // 0x01F0
    fVector3 m_collisionMins; // 0x1264
    uint32_t m_bPhysicsMotionEnabled; // 0x1230
    uint32_t m_animModelIndex; // 0x0018
    uint32_t m_sequenceTransitionerLayerModelIndex; // 0x0D64
    uint32_t m_bSequenceFinished; // 0x1020
    uint32_t 061; // 0x0A2C
    uint32_t m_nForceBone; // 0x0FB8
    fVector3 010; // 0x0214
    uint32_t m_useLockedAnimDeltaYaw; // 0x1021
    uint32_t m_sequenceTransitionerLayerActive; // 0x0D60
    float m_lockedAnimDeltaYaw; // 0x1024
    fVector3 m_animInitialPos; // 0x0B6C
    uint32_t m_bCanUseFastPathFromServer; // 0x1019
    fVector3 m_vecForce; // 0x0088
    fVector3 006; // 0x01E4
    uint32_t m_bossPlayer; // 0x0104
    uint32_t m_nBody; // 0x0F84
    float m_flModelScale; // 0x102C
    float m_animPlaybackRate; // 0x0010
    uint32_t m_animActive; // 0x0B64
    uint32_t m_animFrozen; // 0x0014
    float m_flSkyScaleEndValue; // 0x0CD4
    uint32_t m_bClientSideRagdoll; // 0x0084
    uint32_t m_passThroughThickness; // 0x03AC
    uint32_t m_syncingWithEntity; // 0x0C5C
    uint32_t m_nRagdollImpactFXTableId; // 0x0CCC
    float m_usableRadius; // 0x086C
    float m_flSkyScaleStartValue; // 0x0CD0
    float m_flSkyScaleStartTime; // 0x0CD8
    uint32_t m_nNewSequenceParity; // 0x0020
    uint32_t m_passDamageToParent; // 0x06EC
    float m_flEstIkOffset; // 0x0094
    uint32_t m_animMotionMode; // 0x0BE0
    fVector4 m_animInitialRot; // 0x0B84
    uint32_t m_animCollisionEnabled; // 0x0B67
    uint32_t m_animNetworkFlags; // 0x0B60
    const char* m_iName; // 0x04B9
    fVector3 m_animInitialVel; // 0x0B78
    uint32_t m_predictedAnimEventSequence; // 0x0CB0
    uint32_t m_predictedAnimEventTarget; // 0x0CAC
    fVector3 004; // 0x01CC
    uint32_t m_predictedAnimEventModel; // 0x0CB4
    uint32_t m_CollisionGroup; // 0x0838
    float m_predictedAnimEventsReadyToFireTime; // 0x0CB8
    fVector3 000; // 0x019C
    fVector3 001; // 0x01A8
    fVector3 003; // 0x01C0
    uint32_t 056; // 0x0A18
    fVector3 m_animInitialCorrectPos; // 0x0B94
    fVector3 005; // 0x01D8
    fVector4 m_animEntityToRefRotation; // 0x0BBC
    float m_animEndTime; // 0x0BD0
    float m_animBeginTime; // 0x0BCC
    uint32_t m_animScriptSequence; // 0x0BD4
    uint32_t m_animScriptModel; // 0x0BD8
    uint32_t m_animIgnoreParentRot; // 0x0BDC
    uint32_t m_sequenceTransitionerLayerCount; // 0x0E98
    float m_sequenceTransitionerLayerStartCycle; // 0x0D68
    uint32_t 034; // 0x09C0
    uint32_t m_sequenceTransitionerLayerSequence; // 0x0D6C
    float m_sequenceTransitionerLayerPlaybackRate; // 0x0D74
    float m_sequenceTransitionerLayerStartTime; // 0x0D78
    float m_sequenceTransitionerLayerFadeOutDuration; // 0x0D7C
    float m_animStartTime; // 0x0008
    float m_animStartCycle; // 0x000C
    uint32_t 052; // 0x0A08
    uint32_t m_nResetEventsParity; // 0x0F90
    fVector3 008; // 0x01FC
    fVector3 009; // 0x0208
    fVector3 011; // 0x0220
    fVector3 012; // 0x022C
    fVector3 013; // 0x0238
    fVector3 014; // 0x0244
    fVector3 015; // 0x0250
    uint32_t 016; // 0x0978
    uint32_t 017; // 0x097C
    uint32_t 018; // 0x0980
    uint32_t 019; // 0x0984
    uint32_t 020; // 0x0988
    uint32_t 021; // 0x098C
    uint32_t m_instanceNameIndex; // 0x05C4
    uint32_t 022; // 0x0990
    uint32_t 023; // 0x0994
    uint32_t m_cellX; // 0x0034
    uint32_t m_cellY; // 0x0038
    uint32_t m_parentAttachmentModel; // 0x0790
    uint32_t m_cellZ; // 0x003C
    fVector3 m_localOrigin; // 0x0040
    fVector3 m_localAngles; // 0x03CC
    uint32_t m_nModelIndex; // 0x004C
    uint32_t m_fEffects; // 0x0030
    uint32_t m_nRenderMode; // 0x03F1
    uint32_t m_nRenderFX; // 0x03E5
    uint32_t m_forceVisibleInPhaseShift; // 0x06E4
    uint32_t m_clrRender; // 0x0048
    uint32_t m_bRenderWithViewModels; // 0x03E4
    uint32_t m_iTeamNum; // 0x03A4
    uint32_t 063; // 0x0A34
    uint32_t m_passThroughFlags; // 0x03A8
    float m_passThroughDirection; // 0x03B0
    uint32_t m_contents; // 0x083C
    uint32_t m_hOwnerEntity; // 0x03E0
    uint32_t m_shieldHealth; // 0x0150
    uint32_t m_dissolveEffectEntityHandle; // 0x0858
    uint32_t movetype; // 0x0000
    uint32_t moveparent; // 0x001C
    uint32_t m_parentAttachmentIndex; // 0x0788
    float m_attachmentLerpStartTime; // 0x0764
    float m_attachmentLerpEndTime; // 0x0768
    fVector3 m_attachmentLerpStartAngles; // 0x0778
    uint32_t m_scriptNameIndex; // 0x05C0
    const char* m_holdUsePrompt; // 0x0648
    uint32_t 046; // 0x09F0
    const char* m_pressUsePrompt; // 0x0650
    const char* m_iSignifierName; // 0x04B0
    uint32_t movecollide; // 0x0000
    float m_fadeDist; // 0x0798
    uint32_t m_visibilityFlags; // 0x0398
    uint32_t m_scriptVisible; // 0x039C
    uint32_t m_usableType; // 0x0864
    uint32_t 051; // 0x0A04
    uint32_t m_usablePriority; // 0x0868
    float m_usableFOV; // 0x0870
    uint32_t m_baseTakeDamage; // 0x06E5
    uint32_t m_invulnerableToDamageCount; // 0x06E8
    uint32_t m_shieldHealthMax; // 0x0154
    uint32_t m_highlightIsNetworked; // 0x0198
    uint32_t m_areEntityLinksNetworked; // 0x092F
    uint32_t m_networkedFlags; // 0x0350
    uint32_t m_debugBrokenInterpolation; // 0x092C
    uint32_t m_entitiesLinkedFromMeCount; // 0x0930
    uint32_t m_entitiesLinkedToMeCount; // 0x0934
    uint32_t 024; // 0x0998
    uint32_t 025; // 0x099C
    uint32_t 026; // 0x09A0
    uint32_t 027; // 0x09A4
    uint32_t 028; // 0x09A8
    uint32_t 029; // 0x09AC
    uint32_t 030; // 0x09B0
    uint32_t 031; // 0x09B4
    uint32_t 032; // 0x09B8
    uint32_t 033; // 0x09BC
    uint32_t 035; // 0x09C4
    uint32_t 036; // 0x09C8
    uint32_t 037; // 0x09CC
    uint32_t 038; // 0x09D0
    uint32_t 039; // 0x09D4
    uint32_t 040; // 0x09D8
    uint32_t 041; // 0x09DC
    uint32_t 042; // 0x09E0
    uint32_t 043; // 0x09E4
    uint32_t 044; // 0x09E8
    uint32_t 047; // 0x09F4
    uint32_t 048; // 0x09F8
    uint32_t 049; // 0x09FC
    uint32_t 050; // 0x0A00
    uint32_t 053; // 0x0A0C
    uint32_t 054; // 0x0A10
    uint32_t 055; // 0x0A14
    uint32_t 057; // 0x0A1C
    uint32_t 058; // 0x0A20
    uint32_t 059; // 0x0A24
    uint32_t 060; // 0x0A28
    uint32_t 062; // 0x0A30
    uint32_t m_highlightServerContextID; // 0x032C
    uint32_t m_highlightTeamBits; // 0x0338
    uint32_t m_PredictableID; // 0x06F4
    fVector3 m_vecMins; // 0x0408
    fVector3 m_vecMaxs; // 0x0414
    uint32_t m_nSolidType; // 0x0424
    uint32_t m_usSolidFlags; // 0x0420
    uint32_t m_nSurroundType; // 0x0436
    uint32_t m_triggerBloat; // 0x0425
    fVector3 m_vecSpecifiedSurroundingMins; // 0x043C
    fVector3 m_vecSpecifiedSurroundingMaxs; // 0x0448
};

class CBeamSpotlight {
public:
    uint32_t m_passThroughThickness; // 0x03AC
    uint32_t m_nHaloIndex; // 0x0B38
    uint32_t m_bSpotlightOn; // 0x0B3C
    uint32_t m_scriptVisible; // 0x039C
    float m_flRotationSpeed; // 0x0B54
    uint32_t moveparent; // 0x001C
    uint32_t movetype; // 0x0000
    uint32_t m_bHasDynamicLight; // 0x0B3D
    uint32_t m_invulnerableToDamageCount; // 0x06E8
    float m_flSpotlightMaxLength; // 0x0B40
    uint32_t m_bRenderWithViewModels; // 0x03E4
    uint32_t m_nRotationAxis; // 0x0B50
    float m_flSpotlightGoalWidth; // 0x0B44
    uint32_t m_dissolveEffectEntityHandle; // 0x0858
    uint32_t m_shieldHealth; // 0x0150
    float m_flHDRColorScale; // 0x0B48
    uint32_t m_shieldHealthMax; // 0x0154
    fVector3 m_localAngles; // 0x03CC
    float m_usableRadius; // 0x086C
    uint32_t m_cellX; // 0x0034
    uint32_t m_cellY; // 0x0038
    uint32_t m_cellZ; // 0x003C
    uint32_t m_parentAttachmentModel; // 0x0790
    fVector3 m_localOrigin; // 0x0040
    uint32_t m_nModelIndex; // 0x004C
    uint32_t m_fEffects; // 0x0030
    uint32_t m_nRenderMode; // 0x03F1
    const char* m_iName; // 0x04B9
    uint32_t m_nRenderFX; // 0x03E5
    uint32_t m_clrRender; // 0x0048
    uint32_t m_forceVisibleInPhaseShift; // 0x06E4
    uint32_t 063; // 0x0A34
    uint32_t m_passThroughFlags; // 0x03A8
    uint32_t m_iTeamNum; // 0x03A4
    uint32_t m_CollisionGroup; // 0x0838
    float m_passThroughDirection; // 0x03B0
    float m_fadeDist; // 0x0798
    fVector3 m_attachmentLerpStartAngles; // 0x0778
    uint32_t m_contents; // 0x083C
    uint32_t m_hOwnerEntity; // 0x03E0
    uint32_t m_visibilityFlags; // 0x0398
    uint32_t m_parentAttachmentIndex; // 0x0788
    float m_attachmentLerpStartTime; // 0x0764
    float m_attachmentLerpEndTime; // 0x0768
    uint32_t 051; // 0x0A04
    uint32_t m_usablePriority; // 0x0868
    fVector3 m_attachmentLerpStartOrigin; // 0x076C
    fVector3 000; // 0x019C
    uint32_t m_scriptNameIndex; // 0x05C0
    uint32_t 022; // 0x0990
    uint32_t m_instanceNameIndex; // 0x05C4
    const char* m_holdUsePrompt; // 0x0648
    uint32_t m_debugBrokenInterpolation; // 0x092C
    uint32_t 046; // 0x09F0
    const char* m_pressUsePrompt; // 0x0650
    const char* m_iSignifierName; // 0x04B0
    uint32_t movecollide; // 0x0000
    uint32_t m_usableType; // 0x0864
    uint32_t m_bossPlayer; // 0x0104
    uint32_t m_entitiesLinkedFromMeCount; // 0x0930
    float m_usableFOV; // 0x0870
    float m_usePromptSize; // 0x0874
    uint32_t m_spottedByTeams; // 0x0880
    uint32_t m_baseTakeDamage; // 0x06E5
    uint32_t m_areEntityLinksNetworked; // 0x092F
    uint32_t m_highlightIsNetworked; // 0x0198
    uint32_t m_networkedFlags; // 0x0350
    uint32_t m_entitiesLinkedToMeCount; // 0x0934
    fVector3 001; // 0x01A8
    fVector3 002; // 0x01B4
    fVector3 003; // 0x01C0
    fVector3 004; // 0x01CC
    fVector3 005; // 0x01D8
    fVector3 006; // 0x01E4
    fVector3 007; // 0x01F0
    fVector3 008; // 0x01FC
    fVector3 009; // 0x0208
    fVector3 010; // 0x0214
    fVector3 011; // 0x0220
    fVector3 012; // 0x022C
    fVector3 013; // 0x0238
    fVector3 014; // 0x0244
    fVector3 015; // 0x0250
    uint32_t 016; // 0x0978
    uint32_t 017; // 0x097C
    uint32_t 018; // 0x0980
    uint32_t 019; // 0x0984
    uint32_t 020; // 0x0988
    uint32_t 021; // 0x098C
    uint32_t 023; // 0x0994
    uint32_t 024; // 0x0998
    uint32_t 025; // 0x099C
    uint32_t 026; // 0x09A0
    uint32_t 027; // 0x09A4
    uint32_t 028; // 0x09A8
    uint32_t 029; // 0x09AC
    uint32_t 030; // 0x09B0
    uint32_t 031; // 0x09B4
    uint32_t 032; // 0x09B8
    uint32_t 033; // 0x09BC
    uint32_t 034; // 0x09C0
    uint32_t 035; // 0x09C4
    uint32_t 036; // 0x09C8
    uint32_t 037; // 0x09CC
    uint32_t 038; // 0x09D0
    uint32_t 039; // 0x09D4
    uint32_t 040; // 0x09D8
    uint32_t 041; // 0x09DC
    uint32_t 042; // 0x09E0
    uint32_t 043; // 0x09E4
    uint32_t 044; // 0x09E8
    uint32_t 045; // 0x09EC
    uint32_t 047; // 0x09F4
    uint32_t 048; // 0x09F8
    uint32_t 049; // 0x09FC
    uint32_t 050; // 0x0A00
    uint32_t 052; // 0x0A08
    uint32_t 053; // 0x0A0C
    uint32_t 054; // 0x0A10
    uint32_t 055; // 0x0A14
    uint32_t 056; // 0x0A18
    uint32_t 057; // 0x0A1C
    uint32_t 058; // 0x0A20
    uint32_t 059; // 0x0A24
    uint32_t 060; // 0x0A28
    uint32_t 061; // 0x0A2C
    uint32_t 062; // 0x0A30
    uint32_t m_highlightServerContextID; // 0x032C
    uint32_t m_highlightTeamBits; // 0x0338
    uint32_t m_PredictableID; // 0x06F4
    fVector3 m_vecMins; // 0x0408
    fVector3 m_vecMaxs; // 0x0414
    uint32_t m_nSolidType; // 0x0424
    uint32_t m_usSolidFlags; // 0x0420
    uint32_t m_nSurroundType; // 0x0436
    uint32_t m_triggerBloat; // 0x0425
    fVector3 m_vecSpecifiedSurroundingMins; // 0x043C
    fVector3 m_vecSpecifiedSurroundingMaxs; // 0x0448
};

class CStatueProp {
public:
    uint32_t m_bAwake; // 0x1240
    fVector3 m_animEntityToRefOffset; // 0x0BB0
    uint32_t 045; // 0x09EC
    uint32_t m_nSkin; // 0x0F80
    fVector3 m_collisionMaxs; // 0x1270
    uint32_t m_hInitBaseAnimating; // 0x1280
    uint32_t m_bShatter; // 0x1284
    fVector3 007; // 0x01F0
    fVector3 m_collisionMins; // 0x1264
    fVector3 015; // 0x0250
    fVector3 m_vShatterPosition; // 0x128C
    uint32_t m_nShatterFlags; // 0x1288
    fVector4 m_animEntityToRefRotation; // 0x0BBC
    uint32_t 024; // 0x0998
    fVector3 m_vShatterForce; // 0x1298
    uint32_t m_spottedByTeams; // 0x0880
    float m_usePromptSize; // 0x0874
    fVector4 m_animInitialCorrectRot; // 0x0BA0
    uint32_t m_spawnflags; // 0x0744
    float m_flSkyScaleEndTime; // 0x0CDC
    uint32_t m_iPhysicsMode; // 0x125C
    float m_fMass; // 0x1260
    uint32_t m_bPhysicsMotionEnabled; // 0x1230
    fVector3 002; // 0x01B4
    uint32_t m_predictedAnimEventCount; // 0x0CA8
    fVector3 m_attachmentLerpStartOrigin; // 0x076C
    uint32_t m_animSequence; // 0x001C
    uint32_t m_animModelIndex; // 0x0018
    uint32_t m_bSequenceFinished; // 0x1020
    uint32_t 061; // 0x0A2C
    uint32_t m_nForceBone; // 0x0FB8
    fVector3 010; // 0x0214
    uint32_t m_useLockedAnimDeltaYaw; // 0x1021
    float m_lockedAnimDeltaYaw; // 0x1024
    fVector3 m_animInitialPos; // 0x0B6C
    uint32_t m_bCanUseFastPathFromServer; // 0x1019
    fVector3 m_vecForce; // 0x0088
    fVector3 006; // 0x01E4
    uint32_t m_bossPlayer; // 0x0104
    uint32_t m_nBody; // 0x0F84
    float m_flModelScale; // 0x102C
    float m_animPlaybackRate; // 0x0010
    uint32_t m_animActive; // 0x0B64
    uint32_t m_animFrozen; // 0x0014
    float m_flSkyScaleEndValue; // 0x0CD4
    uint32_t m_bClientSideRagdoll; // 0x0084
    uint32_t m_passThroughThickness; // 0x03AC
    uint32_t m_syncingWithEntity; // 0x0C5C
    uint32_t m_nRagdollImpactFXTableId; // 0x0CCC
    float m_usableRadius; // 0x086C
    float m_flSkyScaleStartValue; // 0x0CD0
    float m_flSkyScaleStartTime; // 0x0CD8
    uint32_t m_nNewSequenceParity; // 0x0020
    uint32_t m_passDamageToParent; // 0x06EC
    float m_flEstIkOffset; // 0x0094
    uint32_t m_animMotionMode; // 0x0BE0
    fVector4 m_animInitialRot; // 0x0B84
    uint32_t m_animCollisionEnabled; // 0x0B67
    uint32_t m_animNetworkFlags; // 0x0B60
    const char* m_iName; // 0x04B9
    fVector3 m_animInitialVel; // 0x0B78
    uint32_t m_predictedAnimEventSequence; // 0x0CB0
    uint32_t m_predictedAnimEventTarget; // 0x0CAC
    fVector3 004; // 0x01CC
    uint32_t m_predictedAnimEventModel; // 0x0CB4
    uint32_t m_CollisionGroup; // 0x0838
    float m_predictedAnimEventsReadyToFireTime; // 0x0CB8
    fVector3 000; // 0x019C
    fVector3 001; // 0x01A8
    fVector3 003; // 0x01C0
    uint32_t 056; // 0x0A18
    fVector3 m_animInitialCorrectPos; // 0x0B94
    fVector3 005; // 0x01D8
    float m_animEndTime; // 0x0BD0
    float m_animBeginTime; // 0x0BCC
    uint32_t m_animScriptSequence; // 0x0BD4
    uint32_t m_animScriptModel; // 0x0BD8
    uint32_t m_animIgnoreParentRot; // 0x0BDC
    uint32_t m_sequenceTransitionerLayerCount; // 0x0E98
    uint32_t m_sequenceTransitionerLayerActive; // 0x0D60
    uint32_t m_sequenceTransitionerLayerModelIndex; // 0x0D64
    float m_sequenceTransitionerLayerStartCycle; // 0x0D68
    uint32_t 034; // 0x09C0
    uint32_t m_sequenceTransitionerLayerSequence; // 0x0D6C
    float m_sequenceTransitionerLayerPlaybackRate; // 0x0D74
    float m_sequenceTransitionerLayerStartTime; // 0x0D78
    float m_sequenceTransitionerLayerFadeOutDuration; // 0x0D7C
    float m_animStartTime; // 0x0008
    float m_animStartCycle; // 0x000C
    uint32_t 052; // 0x0A08
    uint32_t m_nResetEventsParity; // 0x0F90
    fVector3 008; // 0x01FC
    fVector3 009; // 0x0208
    fVector3 011; // 0x0220
    fVector3 012; // 0x022C
    fVector3 013; // 0x0238
    fVector3 014; // 0x0244
    uint32_t 016; // 0x0978
    uint32_t 017; // 0x097C
    uint32_t 018; // 0x0980
    uint32_t 019; // 0x0984
    uint32_t 020; // 0x0988
    uint32_t 021; // 0x098C
    uint32_t m_instanceNameIndex; // 0x05C4
    uint32_t 022; // 0x0990
    uint32_t 023; // 0x0994
    uint32_t m_cellX; // 0x0034
    uint32_t m_cellY; // 0x0038
    uint32_t m_parentAttachmentModel; // 0x0790
    uint32_t m_cellZ; // 0x003C
    fVector3 m_localOrigin; // 0x0040
    fVector3 m_localAngles; // 0x03CC
    uint32_t m_nModelIndex; // 0x004C
    uint32_t m_fEffects; // 0x0030
    uint32_t m_nRenderMode; // 0x03F1
    uint32_t m_nRenderFX; // 0x03E5
    uint32_t m_forceVisibleInPhaseShift; // 0x06E4
    uint32_t m_clrRender; // 0x0048
    uint32_t m_bRenderWithViewModels; // 0x03E4
    uint32_t m_iTeamNum; // 0x03A4
    uint32_t 063; // 0x0A34
    uint32_t m_passThroughFlags; // 0x03A8
    float m_passThroughDirection; // 0x03B0
    uint32_t m_contents; // 0x083C
    uint32_t m_hOwnerEntity; // 0x03E0
    uint32_t m_shieldHealth; // 0x0150
    uint32_t m_dissolveEffectEntityHandle; // 0x0858
    uint32_t movetype; // 0x0000
    uint32_t moveparent; // 0x001C
    uint32_t m_parentAttachmentIndex; // 0x0788
    float m_attachmentLerpStartTime; // 0x0764
    float m_attachmentLerpEndTime; // 0x0768
    fVector3 m_attachmentLerpStartAngles; // 0x0778
    uint32_t m_scriptNameIndex; // 0x05C0
    const char* m_holdUsePrompt; // 0x0648
    uint32_t 046; // 0x09F0
    const char* m_pressUsePrompt; // 0x0650
    const char* m_iSignifierName; // 0x04B0
    uint32_t movecollide; // 0x0000
    float m_fadeDist; // 0x0798
    uint32_t m_visibilityFlags; // 0x0398
    uint32_t m_scriptVisible; // 0x039C
    uint32_t m_usableType; // 0x0864
    uint32_t 051; // 0x0A04
    uint32_t m_usablePriority; // 0x0868
    float m_usableFOV; // 0x0870
    uint32_t m_baseTakeDamage; // 0x06E5
    uint32_t m_invulnerableToDamageCount; // 0x06E8
    uint32_t m_shieldHealthMax; // 0x0154
    uint32_t m_highlightIsNetworked; // 0x0198
    uint32_t m_areEntityLinksNetworked; // 0x092F
    uint32_t m_networkedFlags; // 0x0350
    uint32_t m_debugBrokenInterpolation; // 0x092C
    uint32_t m_entitiesLinkedFromMeCount; // 0x0930
    uint32_t m_entitiesLinkedToMeCount; // 0x0934
    uint32_t 025; // 0x099C
    uint32_t 026; // 0x09A0
    uint32_t 027; // 0x09A4
    uint32_t 028; // 0x09A8
    uint32_t 029; // 0x09AC
    uint32_t 030; // 0x09B0
    uint32_t 031; // 0x09B4
    uint32_t 032; // 0x09B8
    uint32_t 033; // 0x09BC
    uint32_t 035; // 0x09C4
    uint32_t 036; // 0x09C8
    uint32_t 037; // 0x09CC
    uint32_t 038; // 0x09D0
    uint32_t 039; // 0x09D4
    uint32_t 040; // 0x09D8
    uint32_t 041; // 0x09DC
    uint32_t 042; // 0x09E0
    uint32_t 043; // 0x09E4
    uint32_t 044; // 0x09E8
    uint32_t 047; // 0x09F4
    uint32_t 048; // 0x09F8
    uint32_t 049; // 0x09FC
    uint32_t 050; // 0x0A00
    uint32_t 053; // 0x0A0C
    uint32_t 054; // 0x0A10
    uint32_t 055; // 0x0A14
    uint32_t 057; // 0x0A1C
    uint32_t 058; // 0x0A20
    uint32_t 059; // 0x0A24
    uint32_t 060; // 0x0A28
    uint32_t 062; // 0x0A30
    uint32_t m_highlightServerContextID; // 0x032C
    uint32_t m_highlightTeamBits; // 0x0338
    uint32_t m_PredictableID; // 0x06F4
    fVector3 m_vecMins; // 0x0408
    fVector3 m_vecMaxs; // 0x0414
    uint32_t m_nSolidType; // 0x0424
    uint32_t m_usSolidFlags; // 0x0420
    uint32_t m_nSurroundType; // 0x0436
    uint32_t m_triggerBloat; // 0x0425
    fVector3 m_vecSpecifiedSurroundingMins; // 0x043C
    fVector3 m_vecSpecifiedSurroundingMaxs; // 0x0448
};

class CPhysBox {
public:
    uint32_t m_fEffects; // 0x0030
    fVector3 011; // 0x0220
    float m_mass; // 0x0B38
    float m_usableRadius; // 0x086C
    uint32_t m_cellX; // 0x0034
    uint32_t m_cellY; // 0x0038
    uint32_t m_cellZ; // 0x003C
    uint32_t m_parentAttachmentModel; // 0x0790
    uint32_t m_nModelIndex; // 0x004C
    fVector3 m_localOrigin; // 0x0040
    uint32_t m_shieldHealthMax; // 0x0154
    fVector3 m_localAngles; // 0x03CC
    uint32_t m_nRenderMode; // 0x03F1
    const char* m_iName; // 0x04B9
    uint32_t m_nRenderFX; // 0x03E5
    uint32_t m_clrRender; // 0x0048
    uint32_t m_forceVisibleInPhaseShift; // 0x06E4
    uint32_t 063; // 0x0A34
    uint32_t m_passThroughFlags; // 0x03A8
    uint32_t m_bRenderWithViewModels; // 0x03E4
    uint32_t m_iTeamNum; // 0x03A4
    uint32_t m_passThroughThickness; // 0x03AC
    uint32_t m_CollisionGroup; // 0x0838
    float m_passThroughDirection; // 0x03B0
    float m_fadeDist; // 0x0798
    fVector3 m_attachmentLerpStartAngles; // 0x0778
    uint32_t m_contents; // 0x083C
    uint32_t m_hOwnerEntity; // 0x03E0
    uint32_t m_dissolveEffectEntityHandle; // 0x0858
    uint32_t m_shieldHealth; // 0x0150
    uint32_t moveparent; // 0x001C
    uint32_t movetype; // 0x0000
    uint32_t m_visibilityFlags; // 0x0398
    uint32_t m_parentAttachmentIndex; // 0x0788
    fVector3 003; // 0x01C0
    float m_attachmentLerpStartTime; // 0x0764
    float m_attachmentLerpEndTime; // 0x0768
    fVector3 002; // 0x01B4
    uint32_t 051; // 0x0A04
    uint32_t m_usablePriority; // 0x0868
    fVector3 m_attachmentLerpStartOrigin; // 0x076C
    fVector3 000; // 0x019C
    uint32_t m_scriptNameIndex; // 0x05C0
    uint32_t 022; // 0x0990
    uint32_t m_instanceNameIndex; // 0x05C4
    const char* m_holdUsePrompt; // 0x0648
    uint32_t m_debugBrokenInterpolation; // 0x092C
    uint32_t 046; // 0x09F0
    const char* m_pressUsePrompt; // 0x0650
    const char* m_iSignifierName; // 0x04B0
    uint32_t movecollide; // 0x0000
    uint32_t m_scriptVisible; // 0x039C
    fVector3 006; // 0x01E4
    uint32_t m_usableType; // 0x0864
    uint32_t m_bossPlayer; // 0x0104
    uint32_t m_entitiesLinkedFromMeCount; // 0x0930
    float m_usableFOV; // 0x0870
    float m_usePromptSize; // 0x0874
    uint32_t m_spottedByTeams; // 0x0880
    uint32_t m_baseTakeDamage; // 0x06E5
    uint32_t m_invulnerableToDamageCount; // 0x06E8
    uint32_t m_areEntityLinksNetworked; // 0x092F
    uint32_t m_highlightIsNetworked; // 0x0198
    uint32_t m_networkedFlags; // 0x0350
    uint32_t m_entitiesLinkedToMeCount; // 0x0934
    fVector3 001; // 0x01A8
    fVector3 004; // 0x01CC
    fVector3 005; // 0x01D8
    fVector3 007; // 0x01F0
    fVector3 008; // 0x01FC
    fVector3 009; // 0x0208
    fVector3 010; // 0x0214
    fVector3 012; // 0x022C
    fVector3 013; // 0x0238
    fVector3 014; // 0x0244
    fVector3 015; // 0x0250
    uint32_t 016; // 0x0978
    uint32_t 017; // 0x097C
    uint32_t 018; // 0x0980
    uint32_t 019; // 0x0984
    uint32_t 020; // 0x0988
    uint32_t 021; // 0x098C
    uint32_t 023; // 0x0994
    uint32_t 024; // 0x0998
    uint32_t 025; // 0x099C
    uint32_t 026; // 0x09A0
    uint32_t 027; // 0x09A4
    uint32_t 028; // 0x09A8
    uint32_t 029; // 0x09AC
    uint32_t 030; // 0x09B0
    uint32_t 031; // 0x09B4
    uint32_t 032; // 0x09B8
    uint32_t 033; // 0x09BC
    uint32_t 034; // 0x09C0
    uint32_t 035; // 0x09C4
    uint32_t 036; // 0x09C8
    uint32_t 037; // 0x09CC
    uint32_t 038; // 0x09D0
    uint32_t 039; // 0x09D4
    uint32_t 040; // 0x09D8
    uint32_t 041; // 0x09DC
    uint32_t 042; // 0x09E0
    uint32_t 043; // 0x09E4
    uint32_t 044; // 0x09E8
    uint32_t 045; // 0x09EC
    uint32_t 047; // 0x09F4
    uint32_t 048; // 0x09F8
    uint32_t 049; // 0x09FC
    uint32_t 050; // 0x0A00
    uint32_t 052; // 0x0A08
    uint32_t 053; // 0x0A0C
    uint32_t 054; // 0x0A10
    uint32_t 055; // 0x0A14
    uint32_t 056; // 0x0A18
    uint32_t 057; // 0x0A1C
    uint32_t 058; // 0x0A20
    uint32_t 059; // 0x0A24
    uint32_t 060; // 0x0A28
    uint32_t 061; // 0x0A2C
    uint32_t 062; // 0x0A30
    uint32_t m_highlightServerContextID; // 0x032C
    uint32_t m_highlightTeamBits; // 0x0338
    uint32_t m_PredictableID; // 0x06F4
    fVector3 m_vecMins; // 0x0408
    fVector3 m_vecMaxs; // 0x0414
    uint32_t m_nSolidType; // 0x0424
    uint32_t m_usSolidFlags; // 0x0420
    uint32_t m_nSurroundType; // 0x0436
    uint32_t m_triggerBloat; // 0x0425
    fVector3 m_vecSpecifiedSurroundingMins; // 0x043C
    fVector3 m_vecSpecifiedSurroundingMaxs; // 0x0448
};

class CParticleSystem {
public:
    uint32_t m_parentAttachmentHitbox; // 0x078C
    fVector3 m_localOrigin; // 0x0004
    uint32_t m_hOwnerEntity; // 0x03E0
    uint32_t m_fEffects; // 0x0030
    uint32_t m_visibilityFlags; // 0x0398
    uint32_t m_parentAttachmentIndex; // 0x0788
    uint32_t moveparent; // 0x001C
    uint32_t m_parentAttachmentType; // 0x0020
    uint32_t m_parentAttachmentModel; // 0x0790
    fVector3 m_localAngles; // 0x03CC
    uint32_t m_iEffectIndex; // 0x0B38
    uint32_t m_bActive; // 0x0B41
    uint32_t m_bForceRenderAlways; // 0x0B43
    uint32_t m_nStopType; // 0x0B3C
    uint32_t m_parentAttachType; // 0x0BCC
    float m_flStartTime; // 0x0B44
    uint32_t m_bInSkybox; // 0x0B4D
    fVector3 004; // 0x0B84
    uint32_t m_killForReplay; // 0x0B4E
    uint32_t m_iTeamNum; // 0x03A4
    uint32_t m_killIfOverLimit; // 0x0B4F
    uint32_t m_controlPoint1AttachmentIndex; // 0x0BBC
    fVector3 000; // 0x0B54
    fVector3 001; // 0x0B60
    fVector3 002; // 0x0B6C
    fVector3 003; // 0x0B78
};

class CNPC_SentryTurret {
public:
    float m_flSkyScaleEndValue; // 0x0CD4
    uint32_t m_fireteamSlotIndex; // 0x1698
    uint32_t m_lifeState; // 0x06C8
    uint32_t m_iMaxHealth; // 0x04A8
    uint32_t m_killCount; // 0x1814
    uint32_t m_selectedWeapon; // 0x1570
    uint32_t 063; // 0x0A34
    uint32_t m_passThroughFlags; // 0x03A8
    uint32_t m_turretState; // 0x1810
    uint32_t m_controlPanel; // 0x1820
    float m_lastSharedEnergyRegenTime; // 0x1524
    uint32_t 030; // 0x09B0
    uint32_t m_latestPrimaryWeapon; // 0x1574
    uint32_t flags; // 0x0898
    uint32_t m_titanKillCount; // 0x1818
    float m_animPlaybackRate; // 0x0010
    uint32_t m_eyeAttach; // 0x181C
    uint32_t m_isHologram; // 0x17E0
    uint32_t m_iHealth; // 0x0390
    uint32_t m_lastCycleSlot; // 0x157C
    uint32_t 024; // 0x0998
    const char* m_title; // 0x17E1
    int64_t visibilityShowFlag; // 0x0890
    uint32_t m_aiSettingsIndex; // 0x1804
    float m_cloakFlickerEndTime; // 0x0190
    uint32_t m_subclass; // 0x1808
    uint32_t m_aiSprinting; // 0x17BA
    fVector3 007; // 0x01F0
    uint32_t m_aiNetworkFlags; // 0x17DC
    fVector3 m_localOrigin; // 0x0040
    fVector3 m_localAngles; // 0x03CC
    fVector3 m_meleeExecutionUnstuckPosition; // 0x15D4
    uint32_t m_hGroundEntity; // 0x038C
    fVector3 004; // 0x01CC
    uint32_t m_latestNonOffhandWeapon; // 0x1578
    uint32_t seComboVars; // 0x16A8
    uint32_t m_fEffects; // 0x0030
    float m_cloakEndTime; // 0x017C
    float seTimeEnd; // 0x16AC
    uint32_t m_nameVisibilityFlags; // 0x08A8
    float seEaseOut; // 0x16B0
    uint32_t activeWeapon; // 0x1588
    float m_raiseFromMeleeEndTime; // 0x1518
    uint32_t 061; // 0x0A2C
    uint32_t m_nForceBone; // 0x0FB8
    uint32_t m_weaponGettingSwitchedOut; // 0x0008
    uint32_t 055; // 0x0A14
    float m_vecViewOffset[2]; // 0x002C
    uint32_t m_weaponDisabled; // 0x15A5
    uint32_t m_showNewWeapon3p; // 0x000C
    fVector3 m_animInitialPos; // 0x0B6C
    uint32_t m_weaponPermission; // 0x1580
    uint32_t m_contextAction; // 0x15B4
    uint32_t m_hudInfo_visibilityTestAlwaysPasses; // 0x15A6
    uint32_t m_networkedFlags; // 0x0350
    uint32_t 058; // 0x0A20
    uint32_t m_sharedEnergyTotal; // 0x1520
    float m_lastFiredTime; // 0x1514
    float m_phaseShiftTimeStart; // 0x15E4
    uint32_t m_nSurroundType; // 0x0436
    uint32_t m_sharedEnergyCount; // 0x151C
    float m_sharedEnergyRegenRate; // 0x1528
    fVector3 001; // 0x01A8
    float m_sharedEnergyRegenDelay; // 0x152C
    float m_lastSharedEnergyTakeTime; // 0x1530
    float m_phaseShiftTimeEnd; // 0x15E8
    fVector3 014; // 0x0244
    float m_vecViewOffset[1]; // 0x0028
    float m_cloakFadeInEndTime; // 0x0180
    fVector3 009; // 0x0208
    float m_cloakFadeOutStartTime; // 0x0184
    float m_cloakFadeInDuration; // 0x0188
    fVector3 003; // 0x01C0
    float m_cloakFlickerAmount; // 0x018C
    uint32_t m_baseTakeDamage; // 0x06E5
    fVector3 m_deathVelocity; // 0x03B4
    float m_vecViewOffset[0]; // 0x0024
    float m_sequenceTransitionerLayerPlaybackRate; // 0x0D74
    const char* m_targetInfoIconName; // 0x1634
    uint32_t m_numRodeoSlots; // 0x0024
    fVector3 000; // 0x019C
    fVector3 002; // 0x01B4
    int64_t visibilityDefaultFlag; // 0x0888
    uint32_t zOrder; // 0x089C
    uint32_t 035; // 0x09C4
    uint32_t customState; // 0x08A0
    float objectScale; // 0x08A4
    float m_flNextAttack; // 0x1510
    fVector3 005; // 0x01D8
    fVector3 006; // 0x01E4
    uint32_t m_AnimOverlayCount; // 0x12F8
    fVector3 m_attachmentLerpStartOrigin; // 0x076C
    uint32_t m_animSequence; // 0x001C
    uint32_t m_animModelIndex; // 0x0018
    uint32_t m_bSequenceFinished; // 0x1020
    fVector3 010; // 0x0214
    uint32_t m_useLockedAnimDeltaYaw; // 0x1021
    float m_lockedAnimDeltaYaw; // 0x1024
